{
  "paragraphs": [
    {
      "id": "pekudei_p0",
      "text": "אלה פקודי המשכן משכן העדת אשר פקד על פי משה עבודת הלוים וגו' יש לדקדק שחז\"ל דרשו בכל מקום שנאמר אלה שבא לפסול את הראשונים, ומה בא הכתוב לפסול כאן באמרו אלה פקודי המשכן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 0,
      "char_length": 168,
      "timestamp": "2025-02-06T19:18:17.769581"
    },
    {
      "id": "pekudei_p1",
      "text": "ב) דקדקו המפרשים ז\"ל דהאי קרא סיפיה לאו רישא ורישיה לאו סיפא, דמה שייכא עבודת הלוים לחשבון נדבת המשכן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 1,
      "char_length": 102,
      "timestamp": "2025-02-06T19:18:17.888328"
    },
    {
      "id": "pekudei_p2",
      "text": "ג) רש\"י ז\"ל פירש המשכן משכן ב\"פ רמז למקדש שנתמשכן בשני חורבנין על עונותיהן של ישראל. ומקורו ממדרש רבה ותנחומא כאן. עוד איתא בתנחומא משכן העדות שהעיד להם לישראל שאם יהיו כופרים בו ולא ישמרו מצוותיו וכו' שיתמשכן ב' פעמים. הקשו המפרשים למה רמז לנו הכתוב דרשות אלו בפרשה זו שענינה חשבון נדבת המשכן, ומן הראוי היה שירמוז הכתוב דרשות אלו בפרשיות הקודמות דמיירי מבנין המשכן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 2,
      "char_length": 367,
      "timestamp": "2025-02-06T19:18:17.984389"
    },
    {
      "id": "pekudei_p3",
      "text": "ד) רבינו בחיי ז\"ל כתב שנרמז בפסוק זה מספר השנים שעמדו בית הראשון והשני עד שנחרבו, וכן מספר השנים שעמד המשכן מיציאת מצרים עד שבנה שלמה את הבית, כי מלת משכן\" במספרו עולה תיו רמז לבית ראשון שעמד ת\"י שנה, והמשכן במספרו עם האותיות עולה ת\"כ רמז לבית שנו שעמד ת\"כ שנה, העדת חסר ואו רומז לימים שעמד המשכן שהם ארבע מאות ושמונים שנה משיצאו ממצרים עד שבנה שלמה את הבית, וחסר אחד מחשבון ת\"פ לפי שבשנה השנית לצאתם ממצרים הוקם המשכן. וכל אלו החשבונות ראה משה ברוח הקדש וזהו אלה פקודי המשכן משכן העדות, עכת\"ד רבינו בחיי ז\"ל. ולדבריו צ\"ב למה רמז לנו הכתוב מספר השנים שעמד בהם בית שני תחלה בתיבת אהמשכןץ, ואח\"כ רמז מספר שני בית ראשון בתיבת משכו\"ג איפכא הו\"ל לרמוז, מעיקרא שני בית ראשון, ואח\"כ מספר שני בית שנו. וגם צ\"ב שהמשכן שהיה קודם לשני הבתים נרמז באחרונה בתיבת העדת.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 3,
      "char_length": 754,
      "timestamp": "2025-02-06T19:18:18.166972"
    },
    {
      "id": "pekudei_p4",
      "text": "ונראה לבאר הענין בהקדם ליישב בכמה אנפי קושית הרמב\"ן והראב\"ע ז\"ל מדוע לא נתן משה חשבון מפורט מן הכלים שנעשו מן הזהב כאשר נתן חשבון מפורט מה נעשה בכסף ובנחשת. ונ\"ל דהנה מצינו כאשר נתנו ישראל כספם וזהבם לעגל לא ביקשו חשבון כלל, וצריך לומר שהטעם לפי שכל דבר שהאדם חפץ בו, ונותן נדבתו מרצונו הטוב, אינו מבקש עליו חשבון, ולכן לא בקשו הרשעים חשבון, לפי שהיו שמחים שנתמלא חפצם ותשוקתם, ויצא העגל. ולעומת זאת הכשרים שבישראל, שכל נתינתם היתה בעל כרחם ודאי לא ביקשו חשבון, כי לא נגע להם כלל מה נעשה בזהב, ולואי ונגנב כולו. מה שאין כן במעשה המשכן ביקשו חשבון, לפי שלא הושוו כולם במחשבת הנתינה, והיו ביניהם אנשים פחותים. אשר לא נתנו נדבתם מרצונם הטוב. אלא בכפיה, כדקיי\"ל ממשכנים על מחצית השקל (שקלים פ\"א) ואותם שנתנו נדבתם בכפייה המה בקשו חשבון הנדבה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 4,
      "char_length": 738,
      "timestamp": "2025-02-06T19:18:18.541527"
    },
    {
      "id": "pekudei_p5",
      "text": "והנה אמרו ז\"ל (מדרש תנחומא פ' תרומה) שהמשכן מכפר על מעשה העגל, ועיקר הכפרה הוא בנדבת הזהב כאמרם ז\"ל (מד\"ר פ' פקודי ירושלמי ריש מס' שקלים) יבא זהב של משכן ויכפר על זהב של עגל וכן בתרגום יונתן פ' דברים תרגם ודי זהב וז\"ל והוי חמי לכון למשתוציא (להשמידכם) מגו עלמא אילולי דדכר לכון זכות וכו' ומאנא קודשאדחמיתון דהבא סנונא (זהב מזוקק) וכפר לכון על חובת עגל דהבא, ע\"כ. וכיון שעיקר הכפרה היתה בנדבת הזהב לא משכנו עליה, כדקיי\"ל חייבי חטאות ואשמות און ממשכנין אותם (ערכין כ\"א ע\"א) דניחא ליה לאיניש דניהווי ליה כפרה, ונתון יתן ברצונו הטוב. נמצא כי כל הזהב הבא בנדבה, היה רק מאותם שנתנו ברצונם הטוב, כו מי האיש שלא חפץ להתכפר על חטא העגל. ואתי שפיר שלא ביקשו ממשה חשבון על הנעשה בזהב התנופה, כמו שהקדמנו, שכל דבר שהאדם נותן בחפץ לבו אינו מבקש עליו חשבון.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 5,
      "char_length": 743,
      "timestamp": "2025-02-06T19:18:18.895876"
    },
    {
      "id": "pekudei_p6",
      "text": "וי\"ל בדרך אחר קצת, דהנה איתא במדרש תנחומא פ' זו למה עשה משה רבינו חשבון וכו' אלא מפני ששמע ליצני הדור שהיו משיחין אחריו שנאמר והיה כצאת משה וגו' והביטו אחרי משה ומה היו אומרים וכו' אדם שנתמנה על מלאכת המשכן וכו' אי אתה רוצה שיהי' עשיר כששמע כן אמר חייכם משנגמרה מלאכת המשכן אני נותן לכם חשבון כיון שנגמרה אמר להם אלה פקודי המשכן. והנה ודאי שלא היו מרננים אחריו כי אם ליצני הדור ודלת העם קטני השכל, אבל כלל ישראל האמינו בצדקת משה וביושר כפיו, ולא דרשו ממנו חשבון המשכן. ועתה מובן למה נתן רק חשבון הכסף והנחשת, כי בכסף הנדבה היתה יד הכל שוה, שהרי כולם נצטוו לתת מחצית השקל בקע לגלגלת, שמהם נעשו האדנים, ובין הנותנים היו גם דלת העם וקעני השכל, על כן הוצרך משה לתת חשבון מפורט מן הכסף העשוי למלאכה, למען הסיר חשדם של ליצני הדור.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 6,
      "char_length": 724,
      "timestamp": "2025-02-06T19:18:19.333170"
    },
    {
      "id": "pekudei_p7",
      "text": "ומה שנתן חשבון הנחשת י\"ל כי גם בנדבת הנחשת נעלו חלק מדלת העם ואף שלא היתה נתינ נדבת הנחשת חובה, מ\"מ מצינו כי נדבת הנחשת היתה מרובה שבעים ככר, ואפשר שרוב ישראל נעלו חלק בנדבת הנחשת, ואף מי שלא השיגה ידו, או לא נדבה רוחו אותו להיות בון המתנדבים בעם שהביאו זהבם לבנין המשכן, נטל חלק בנדבת הנחשת שאין דמיו יקרים. וכיון שבין נותני נדבת הנחשת היו גם מדלת עם הארץ. הוצרך משה לתת חשבון מפורט מה נעשה בנחשת התנופה, להסיר ממנו כל שמץ חשד. משא\"כ בזהב שלא היתה נתינתו חובה, ולא הרימוהו כי אם נדיבי לב בעלי השגה, ואלו לא חשדו את משה רבינו ע\"ה ח\"ו, ולכן לא הוצרך לתת חשבון הזהב.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 7,
      "char_length": 564,
      "timestamp": "2025-02-06T19:18:19.687612"
    },
    {
      "id": "pekudei_p8",
      "text": "עוד י\"ל טעם שלא בקשו חשבון הזהב, דהנה הזהב בא לכפר על חטא העגל, והוצרכו לעשות תשובת המשקל על חטאם וכשם שהשליכו זהבם לעגל ולא בקשו חשבון. הוצרכו לתקן שיתנו זהבם למשכן המכפר על מעשה העגל בלא חשבון.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 8,
      "char_length": 195,
      "timestamp": "2025-02-06T19:18:19.981196"
    },
    {
      "id": "pekudei_p9",
      "text": "או י\"ל דהנה איתא במד\"ר ותנחומא פ' זו עה\"פ והביטו אחרי משה שחשדוהו שהעשיר מנדבת המשכן. וכתבנו לעיל שאין הדעת נותנת שחשדוהו ששלח ידו בכספי הנדבה, ומהם העשיר, שהרי משה עשיר גדול הוה מפסולת הלוחות כאמרם ז\"ל (נדרים ל\"ח ע\"א) ולא היה זקוק לכספם וזהבם. אלא י\"ל שהחשד היה, כי משה לגודל השתוקקותו להשיג מדרגות רמות בתורה, בנה את כל המשכן או רובו מחלק נדבתו בלבד, וע\"י כך עלה והעשיר במעלות רמות. וזהו שאמרו שהעשיר מנדבת המשכן, כו ע\"ו שבנה את המשכן מנדבתו בלבד, העשיר במעלות התורה. אבל לא חשדוהו שלקח את נדבתם לעצמו, אלא שסברו כי יעשה ממנה דברים שקדושתם פחותה מקדושת המשכן, כגון בהמ\"ד וכדומה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 9,
      "char_length": 580,
      "timestamp": "2025-02-06T19:18:20.108543"
    },
    {
      "id": "pekudei_p10",
      "text": "אמנם חשד זה לא עלה על לבם כו אם בנדבת הכסף והנחשת, משא\"כ בנדבת הזהב שבא לכפר על מעשה העגל לא חשדו את משה, אשר הותיר את זהב התנופה שנדבו. לפי שהיה לבבם סמוך ובטוח דניחא לוה למשה רעיא מהימנא שיתכפר להם על עוון העגל, וודאי נכנסה נדבת הזהב במשכן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 10,
      "char_length": 242,
      "timestamp": "2025-02-06T19:18:20.401474"
    },
    {
      "id": "pekudei_p11",
      "text": "ולכל הלין טעמים צריך לומר כי סבת החשד ודאי היתה טינא שהיתה בלב ליצני הדור על א או סבת קנאתם בגדולתו וברום ערכו, או לצד שו נגיעה שהיתה להם בענין. ונגיעה או קנאה זו עוירה את עיני שכלם, לעשות מעשים זרים, ולדבר דברי בלע, דברים שהם רחוקים מן השכל ומוקצים מן הדעת. כאשר בארנו בדברינו במקומות רבים כמה גדול כח הנגיעה לעוור מאור עיני השכל ונעלם ממנו והוא לא ידע.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 11,
      "char_length": 354,
      "timestamp": "2025-02-06T19:18:20.555071"
    },
    {
      "id": "pekudei_p12",
      "text": "ועתה נבא לישב כל הדקדוקים דהנה אמרו זאל ביומא (דף ט' ע\"ב) מקדש שנו שהיו עוסקים בתורה ומעשים טובים וגמ\"ח מפני מה חרב מפני שהיתה בו שנאת חנם. ואפשר שלכן רמז לנו הכתוב בפרשה זו, שענינה חשבון נדבת המשכן, את חרבן הבית, כמ\"ש ז\"ל המשכן משכן רמז למקדש שנתמשכן בשני חורבנין על עוונותיהם של ישראל. להורות כי הסבה שהוצרך משה לתת חשבון נדבת המשכן היתה שנאת חנם, כסבת חורבן בית שני.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 12,
      "char_length": 369,
      "timestamp": "2025-02-06T19:18:20.760426"
    },
    {
      "id": "pekudei_p13",
      "text": "ועפ\"י זה יש ליישב דברי רבינו בחיי, שרמז הכתוב תחלה על בית שני בתיבת המשכן. ואח\"כ רמז על בית ראשון ועל המשכן, כי עיקר הרמז הוא להורות לנו כי גם חשבון נדבת המשכן היה מטעם שנאת חנם, ושנאת חנם היתה הסבה לחרבן בית שני בלבד, כאמרם ז\"ל (שם) שבית ראשון נחרב בעון ע\"ז ג\"ע ושפיכות דמים. ועל כן נרמז תחלה בכתוב חרבן בית שנו, ואח\"כ חרבן המקדש הראשון והמשכן אגב גררא.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 13,
      "char_length": 354,
      "timestamp": "2025-02-06T19:18:20.960393"
    },
    {
      "id": "pekudei_p14",
      "text": "ומ\"ש הכתוב אלה פקודי המשכן ואמרו ז\"ל כל מקום שנאמר אלה פוסל את הראשונות (עי' באה\"ח הקדוש כאן) נראה לומר עפ\"י מה שאמרו ז\"ל כי אלולי בנה משה את ביהמ\"ק לא היה יכול להחרבק כי מעשה ידי משה קיימים לעד, ועל כן לא נחרב המשכן שעשה משה אלא נגנז ועתיד לחזור אלינו בעת הגאולה העתידה. וכדאיתא במדרש ילקוט פ' תרומה עה\"פ עצי שטים עומדים שמא תאמר אבד סברם ובעל סיכוים ת\"ל עומדים קיימים לעולם ולעולמי עולמים, וז\"ש הכתוב אלה פקודי המשכן משכן העדות, כי שני המקדשות שחרבו הרמוזים בתיבת המשכן משכן כמ\"ש רבינו בחיי ז\"ל הם לאות על קדושת המשכן הרמוז בתיבת העדות, ועל נקיון כפיו של משה, שהרי אילו היה ח\"ו נעשה עוול כל שהוא במלאכת המשכן, לא היתה שורה עליו קדושה גדולה זאת שלא יחרב נצח ועפי\"ז יתיישב נמי שייכות הנך דרשות דמיירי מחרבן בית ראשון ושני לחשבון נדבת המשכן, כו הם העדות שנתן משה חשבון מדוקדק מנדבת המשכן, ועל כן לא נחרב המשכן לעולם כאשר חרבו שני המקדשות. וגם יתבאר בזה מה שאמר הכתוב אלה\", כי מנין המשכן פוסל כל מניינים שבעולם, שקדושתו נצחיית ועומדת לעד כמבואר.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 14,
      "char_length": 943,
      "timestamp": "2025-02-06T19:18:21.174366"
    },
    {
      "id": "pekudei_p15",
      "text": "ועפ\"י דברנו י\"ל קשור סוף דברי הפסוק עבודת הלויים וגו' לתחלתו (עי' קושיא ב) דהנה ידוע מה שכתב האריז\"ל שלעתיד יהיו הלויים כהנים, וזה אפשר לרמוז בכתוב אלה פקודי המשכן משכן העדות, וכמו שנתבאר דרמוז כאן שהמשכן קיים לנצח, ועתיד לחזור אלינו בביאת המשיח. ואפשר שעל כן כתיב פקודי' המשכן לרמוז על פקודת הגאולה, ואזי תהיה עבודת הלויים\" וגו', כי ישמשו הלויים בכהונה ויעבדו עבודה בביהמ\"ק העתיד.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 15,
      "char_length": 381,
      "timestamp": "2025-02-06T19:18:21.652279"
    },
    {
      "id": "pekudei_p16",
      "text": "אלה פקודי המשכן משכן העדות אשר פקד על פי משה וגו' פירש\"י ז\"ל המשכן משכן, שנו פעמים רמז למקדש שנתמשכן בשני חורבנין על עונותיהן של ישראל. משכן העדות. עדות לישראל שויתר להם הקב\"ה על מעשה העגל שהרי השרה שכינתו ביניהם עכ\"ל. דקדקו המפרשים מדוע רמז הכתוב דרשות אלו בפרשה זו שענינה חשבון נדבת המשכן, ויותר היה מן הראוי אשר במקום שהכתוב מדבר בציווי עשיית המשכן או בהקמתו שם ירמוז לנו שעתיד המקדש להתמשכן, ושהוא עדות לישראל שנמחל להם מעשה העגל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 16,
      "char_length": 434,
      "timestamp": "2025-02-06T19:18:21.858256"
    },
    {
      "id": "pekudei_p17",
      "text": "ב) במדרש תנחומא ר\"פ זו איתא אלה פקודי המשכן זש\"ה כסא כבוד מרום מראשון מקום מקדשנו (ירמי' יז) שם מכוון מקדשנו וכו' וכן אתה מוצא שירושלים מכוונת למעלה כמו ירושלים של מטה מרוב אהבתה של מעה עשאה אחרת למעלה וכו' ע\"כ. וכן איתא בזה\"ק (פ' פקודי דף רכ\"א ע\"ב) אלה פקודי המשכן משכן העדות וכו' תרי זמני כתיב הכא משכן חד לעילא וחד לתתא ע\"כ. ומסיים שם במדרש תנחומא ולמה משכן משכן ב\"פ א\"ר שמואל שהקב\"ה עתיד להתמשכן ב\"פ חרבן ראשון וחרבן שני וכו' ע\"כ, וצ\"ב כי איך דרשו מכתוב אחד ב' דרשות שונות זו מזו מן הקצה אל הקצה, שהרי ממה שדרשו מדכתיב ב' פעמים משכן שביהמ\"ק שלמטה מכוון נגד ביהמ\"ק שלמעלה נשמע כו בא הכתוב לרמוז לנו עוצם מעלת ביהמ\"ק ותוקף קדושתו, וממה שדרשו המשכן משכן שנתמשכן בשני חורבנין נשמע כי בא הכתוב להודיענו כי סופו להחרב ותתחלל קדושתו, ואיך בחדא מחתא מחתינהו ב' דרשות אלו בחד קרא. ותו צ\"ב שייכות דרשות אלו לכאן. ומקומם ראוי להיות במקום ד דמיירי מציווי עשיית המשכן או בהקמתו.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 17,
      "char_length": 869,
      "timestamp": "2025-02-06T19:18:22.086655"
    },
    {
      "id": "pekudei_p18",
      "text": "ג) במדי\"ת (פנ\"א א') אלה פקודי המשכן כך פתח ר תנחומא בר אבא איש אמונות רב ברכות (משלי כ\"ח) אתה מוצא כל מי שהוא נאמן הקב\"ה מביא ברכות על ידיו מי שאינו נאמן ואץ להעשיר לא ינקה איש אמונות זה משה וכו' רב ברכות שכל הדברים שהיה גזבר עליהם היו מתברכים לפי שהוא נאמן ואץ להעשיר לא ינקה זה קרח שהיה לוי ובקש ליטול כהונה גדולה ומה היה סופו ותפתח הארץ את פיה וגו' (במדבר ט\"ז) עכ\"ל המדרש. והוא תמוה מאד כמו שהקשה ק\"ז הישמח משה זלל\"ה שאין זה דבר והפוכו נאמנות משה לעומת מה שאץ קרח ליטול כהונה גדולה, שהרי אינם בסוג אחד כלל, כי לא תאוות העשירות הטתה את לב קרח לבקש לעצמו עטרת כהונה גדולה, שהרי עשיר גדול היה, כאמרם ז\"ל (פסחים קי\"ט ע\"א) שנתגלו לקרח אוצרות כסף וזהב שהטמין יוסף במצרים. ותו יל\"ד מה שייכא הך דרשא שכל הדברים שהיה משה גזבר עליהם היו מתברכים לפרשה זו, ומקומה שייך בפ' ויקהל שהכתוב מדבר בהבאת כסף הנדבה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 18,
      "char_length": 798,
      "timestamp": "2025-02-06T19:18:22.510931"
    },
    {
      "id": "pekudei_p19",
      "text": "ד) עוד איתא במד\"ר כאן ד\"א איש אמונות זה משה שנעשה גזבר על מלאכת המשכן שנו רבותינו אין ממנין שררה על הצבור פחות משנים והרי אתה מוצא שהיה משה גזבר לעצמו וכו' אלא אעפ\"י שהיה משה גזבר לעצמו הוא קורא לאחרים ומחשב על ידיהם וכו' עליו נאמר ולא יחשבו את האנשים אשר יתנו את הכסף כי באמונה הם עושים (מלכים ב י\"ח) וכו' עכ\"ל. ולכאורה מ\"ש המדרש עליו נאמר' ולא יחשבו את האנשים וגו' אינו מובן. אדרבה משם ראיה לסתור, שהרי הם לא חשבו עם הגזברים, ולמה קרא משה לאחרים וחישב על ידיהם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 19,
      "char_length": 463,
      "timestamp": "2025-02-06T19:18:22.911985"
    },
    {
      "id": "pekudei_p20",
      "text": "ה) עוד איתא במד\"ר כאן ואות ד) משנגמרה מלאכת המשכן א\"ל בואו ואני עושה לפניכם חשבון א\"ל משה אלה פקודי המשכן כך וכך יצא על המשכן עד שהוא יושב ומחשב שכח באלף ושבע מאות ושבעים וחמשה שקל מה שעשה ווים לעמודים התחיל יושב ומתמיה אמר עכשיו ישראל מוצאים ידיהם לומר משה נטלן מה עשה האיר הקב\"ה עיניו וראה אותם עשוים ווים לעמודים אותה שעה נתפייסו כל ישראל על מלאכת המשכן מי גרם לו ע\"י שישב ופיוסן הוי אלה פקודי המשכן, עכ\"ל. והמדרש הזה אין לו ביאור לכאורה מדוע הוצרך משה לפייס את ישראל כשנתן להם חשבון המשכן, אדרבה הם חשדו אותו כי העשיר מכסף הנדבה, ולכן עשה לפניהם חשבון שכשם שחייב אדם לצאת ידי שמים כך חייב לצאת ידי הבריות משום והייתם נקיים מה' ומישראל (במדבר ל\"ב) כדאיתא במדרש תנחומא, ומה לו לפייסם עוד.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 20,
      "char_length": 690,
      "timestamp": "2025-02-06T19:18:23.160032"
    },
    {
      "id": "pekudei_p21",
      "text": "ו) עוד איתא במד\"ר ולמה עשה עמהם חשבון וכו' אלא ששמע משה ליצני ישראל מדברים מאחריו שנא' והיה כבוא משה האהלה וגו' והביטו אחרי משה (שמות ל\"ג) ומה היו אומרים ר' יוחנן אמר אשרי יולדתו של זה ומה הוא רואה בו כל ימיו הקב\"ה מדבר עמו וכו' רבי חמא אמר היו אומרים חמי קדל דבריה דעמרם ופי' במת\"כ אחד אומר לחבירו בא וראה צוארו של בן עמרם כמה הוא שמן כל זה הוא ממה שלקח משלנו) וחבירו אומר לו אדם ששלט על מלאכת המשכן אין אתה מבקש שיהי' עשיר (ויפה עושה שלוקח משלנו בין כך ובין כך האמינו שניהם שלקח משלהם) כששמע משה כך איל משה חייכם נגמר המשכן אתן לכם חשבון וכו' עכ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 21,
      "char_length": 550,
      "timestamp": "2025-02-06T19:18:23.491403"
    },
    {
      "id": "pekudei_p22",
      "text": "והמדרש הזה הוא הפלא ופלא, איך יתכן שנמצאו באותו הדור אנשים פחותים כ\"כ, שיחשדו את משה כו העשיר מממונם אשר נתנו נדבה למשכן. והרי אנשי דור המדבר היו קדושים וטהורים כדאיתא בפרדר\"א (פמ\"א) כל אותו הדור ששמעו קולו של הקב\"ה בהר סיני זכו להיות כמלאכי השרת לא ראו טפת קרי מימיהם ובמותם לא שלטה בהם רמה ותולעה ע\"כ, וכן איתא בכמה מדרשי חז\"ל ובזוה\"ק גודל מעלת הדור ההוא ותוקף רום ערך קדושתם. ואיך עלתה בלבם לחשוב מחשבה כזאת על משה רבינו ע\"ה, אשר הקב\"ה עבד נאמן קרא לו ונודע להם בעוצם מעלתו, אשר עלה שמים ועמד שם ארבעים יום וארבעים לילה לחם לא אכל ומים לא שתה, והוריד להם את התורה, והיתה השכינה מדברת עמו בכל עת, ומה מקום לחשדו בכך. ובפרע כו משה רבינו ע\"ה עשיר גדול היה כאמרם ז\"ל (ירושלמי שקלים פ\"ה ה\"ב ועי' נדרים ל\"ח ע\"א) מפסלתן של לוחות העשיר משה וכו' אמר ר' חנין מחצב של אבנים טובות ומרגליות ברא לו הקב\"ה מתוך אהלו וממנו העשיר משה, ע\"כ. וא\"כ מה בצע לו לשלוח וד בכסף נדבתם, והגם שכך דרכו של יצה\"ר לסמא עיני האדם ולהסותו לחשוד בכשרים, עם כל זאת צריך איזה סברא לתלות בה חשדם, דוגמת מה שכתב הרמב\"ן ז\"ל בפ' יתרו עה\"פ לא יהי' לך אלהים אחרים וגו' שאין לומר על עובדי ע\"ז בימים הקדמונים שהיו שועים גמורים לעבוד אלהי עץ ואבן מעשי ידי אדם, עיי\"ש שהאריך להסביר טעותם שעבדו לאמצעים. וכמו כן ה\"נ צריך טעם איך עלתה כזאת על דעתם לדבר במשה עבד ה', אשר היה מופשט מן הגשמיות, שלקח לעצמו נדבת המשכן. ועי' באה\"ח הק' כאן שכתב כי המשכן הוא יעיד על הדבר שלא היה אדם בישראל יכול להקימו רק משה, זה הוא עדות היותו נקי כפים שאין חמס בכפו, שאין הקב\"ה עושה נס לעושי עול ובפרט במקום עצמו שנעשה העול.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 22,
      "char_length": 1457,
      "timestamp": "2025-02-06T19:18:23.779899"
    },
    {
      "id": "pekudei_p23",
      "text": "ז) להלן בפרשה ובצלאל בן אורי בן חור למטה יהודה עשה את כל אשר צוה ה' את משה. פירש\"י ז\"ל אשר צוה אותו משה אין כתיב כאן אלא אשר צוה ה' את משה אפילו דברים שלא אמר לו רבו הסכימה דעתו למה שנאמר למשה בסיני כי משה צוה לבצלאל לעשות כלים תחלה ואח\"כ משכן אמר לו בצלאל מנהג עולם לעשות תחלה בית ואח\"כ משים כלים בתוכו אמר לו כך שמעתי מפי הקב\"ה א\"ל בצל ארל היית כי בודאי כך צוה לי הקב\"ה וכן עשה משכן תחלה ואח\"כ עשה כלים, עכ\"ל. והוא מדברי הירושלמי פאה וכיו\"ב איתא במס' ברכות (דף נ\"ה ע\"א עי' לקמן העתקנו לשון הגמרא) וכל הענין הוא הפלא ופלא חדא מדוע צוה משה לבצלאל הפך צווי הקב\"ה אליו, והתוס' שם הקשו היכן מצינו שצוה הקב\"ה לעשות משכן תחלה, והלא בפ' תרומה כתיב כלים תחלה, ותירצו כי בפ' תשא כתיב את אהל מועד ואת ארון העדות, ע\"כ.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 23,
      "char_length": 708,
      "timestamp": "2025-02-06T19:18:24.516945"
    },
    {
      "id": "pekudei_p24",
      "text": "ולדבריהם קשה שיסתרו ב' הפסוקים אהדדי, דבפ' תרומה כתיב כלים ואח\"כ משכן, ובפ' תשא כתיב להיפך. וגם צריך להבין סברת משרע\"ה אשר בתחלה צוה לבצלאל לעשות כלים תחלה, ואח\"כ חזר בו ואמר לבצלאל בודאי כך צוה לי הקב\"ה לעשות משכן ואח\"כ כלים, מעיקרא מאי קסבר ולבסוף מאי קסבר, ואיך אמר מתחלה שצוהו הקב\"ה לעשות כלים תחלה, ואח\"כ חזר בו ואמר כך צוה לי הקב\"ה לעשות משכן תחלה, הרי הוא ח\"ו כמכחיש דברי עצמו.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 24,
      "char_length": 384,
      "timestamp": "2025-02-06T19:18:24.940109"
    },
    {
      "id": "pekudei_p25",
      "text": "וגם צ\"ב שייכות פסוק זה שעשה בצלאל את אשר צוה ה', לפרשה זו שענינה חשבון נדבת המשכן שנתן משה ח) ויביאו את המשכן אל משה וגו' במד\"ר ופנ\"ב ג) הה\"ד עוז והדר לבושה ותשחק ליום אחרון (משלי ל\"א) וכו' עוז והדר לבושה זה משה וכו' ותשחק ליום אחרון אלו ליצני ישראל שמליצין אחריו ואומרים אלו לאלו אפשר שהשכינה שורה על ידיו של בן עמרם וכו' כיון שאמר לו האלקים להקים את המשכן התחיל שוחק עליהם שנא' ותשחק ליום אחרון וכו' כמה חכמים היו שם וכו' ולא היו יכולים להקימו וכו' וכיון שראה משה אותם שרתה עליו רוח הקדש והקימו עכ\"ל. ויל\"ד שהרי הקמת המשכן והשראת השכינה בו היה בר\"ח ניסן, ולמה קורא אותו המדרש יום אחרון, ואף שהיה שמיני למילואים, מ\"מ בדברי חז\"ל מכונה אותו היום ראשון כדאיתא במס' שבת (דף פ\"ז ע\"ב ובת\"כ ר\"פ שמיני) תנא אותו היום נטל עשר עטרות ראשון למעשה בראשית וכו' עיי\"ש שמונה והולך עשרה דברים שהיה אותו היום ראשון להם, ולמה מכנהו המדרש יום אחרון.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 25,
      "char_length": 830,
      "timestamp": "2025-02-06T19:18:25.145502"
    },
    {
      "id": "pekudei_p26",
      "text": "ט) להלן בפרשה ותכל כל עבודת משכן אהל מועד ויעשו בני ישראל ככל אשר צוה ה' את משה כן עשו. דקדקו המפרשים למה חזר הכתוב לומר פעם שנית כן עשו והרי כתיב לעיל מיניה ויעשו.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 26,
      "char_length": 164,
      "timestamp": "2025-02-06T19:18:25.541814"
    },
    {
      "id": "pekudei_p27",
      "text": "י) ככר אשר צוה ה' את משה כן עשו בני ישראל את כל העבודה וירא משה את כל המלאכה והנה עשו אותה וגו' ויברך אותם משה. הרמב\"ן ז\"ל דקדק למה שינה הכתוב לשונו, מעיקרא כתיב עשו בני ישראל את העבודה\", ואח\"כ כתיב וירא משה את כל והמלאכה\"ג הלא דבר הוא. ועוד יל\"ד מה מרבה הכתוב בתיבת 'כל'.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 27,
      "char_length": 272,
      "timestamp": "2025-02-06T19:18:25.654399"
    },
    {
      "id": "pekudei_p28",
      "text": "יא) במדרש ילקוט איתא והנה עשו אותה כאשר צוה ה' והיכן צוה ועשו לי מקדש וגו'. והוא פלאי מה כונת המדרש בשאלתו והיכן צוה, והלא בכמה פרשיות דבר הכתוב על ציווי המשכן וכליו וכל עבודתו, ותו למה הביא ראיה על ציווי המשכן מפסוק ועשו לו מקדש דייקא, ולא משאר מקראות שכתוב בהן ציווי המשכן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 28,
      "char_length": 275,
      "timestamp": "2025-02-06T19:18:25.826417"
    },
    {
      "id": "pekudei_p29",
      "text": "ונראה לבאר הענין, בהקדם לישב מה שצוה משה לבצלאל לעשות כלים תחלה ואח\"כ חזר והודה לדבריו שצוהו הקב\"ה לעשות משכן ואח\"כ כלים (קושיא ז'). ויתבאר על פי דברי הראב\"ד ז\"ל בפירושו לת\"כ על ברייתא (בריש תורת כהנים) דר' ישמעאל אומר בשלש עשרה מדות התורה נדרשת בהן: והמדה הי\"ג היא שנו כתובים המכחישים זה את זה עד שיבא הכתוב השלישי ויכריע ביניהם. וכתב הראב\"ד זאל, וז\"ל ומזו ההכרעה שהכריעה הכתוב השלישי ותיקן שני כתובים המכחישים זה את זה למדו רז\"ל למקומות אחרים שמכחישין זה את זה ולא בא הכתוב השלישי כדי להכריע כאותה ששנינו בסוטה (כ\"ז ע\"ב) כתוב אחד אומר ומדותם מחוץ לעיר את פאת קדמה אלפים באמה וגו' וכתוב אחד אומר מקיר העיר וחוצה אלף אמה סביב וכו' והכריעו ביניהם מדעתם ותירצום לפי ראיותם וכו' ומסיים זו מדה נוהגת בתורה שיש כתובים המכחישין זה את זה כלומר שנראין כמכחישין זא\"ז עד שיבא הכתוב השלישי ומתרץ אותם הלכך מכאן יש לנו ללמוד ולתרץ כל שנו כתובים שהם קשים זה על זה ולא שנדחה אחד מהם ולא שנחזיק את התורה בשבוש, עכ\"ד ז\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 29,
      "char_length": 905,
      "timestamp": "2025-02-06T19:18:25.982437"
    },
    {
      "id": "pekudei_p30",
      "text": "ומצינו בכמה מקומות בדברי חז\"ל שטרחו לישב הכתובים הנראים כסותרים, כגון הא דאיתא בזבחים (דף צ' ע\"א) דת\"ר והקריב את אשר לחטאת ראשונה (ויקרא ה) מה ת\"ל וכו' ללמד שתקרב ראשונה הרי כבר נאמר ואת השני יעשה עולה אלא זה בנה אב לכל חטאות שיקדמו לעולות הבאות עמהן, ופריך והרי מצינו בקרבן יולדת שעולתה קודמת לחטאתה ומשני אמר רבא למקראה הקדימה הכתוב (פירש\"י שתהא נקראת בענין תחלה אבל בעבודתן חטאת קודמת עכ\"ד. והתוס' שם נחלקו על פירש\"י ופירשו באופן אחר) הרי לנו כי במקום שהכתובים נראים כמכחישום זה את זה נמסר הדבר לחכמים להכריע ביניהם ולתרצם כפי דעתם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 30,
      "char_length": 535,
      "timestamp": "2025-02-06T19:18:26.397338"
    },
    {
      "id": "pekudei_p31",
      "text": "ונקדים עוד מה שכתב הריטב\"א ז\"ל על הא דאיתא במס' עירובין (דף י\"ג ע\"ב) שלש שנים נחלקו ב\"ש וב\"ה וכו' יצתה בת קול ואמרה אלו ואלו דברי אלקים חיים והלכה כב\"ה. וכתב הריטב\"א וז\"ל שאלו רבני צרפת ז\"ל היאך אפשר שיהיו שניהם דברי אלקים חיים זה אוסר וזה מתיר ותירצו כי כשעלה משה למרום לקבל התורה הראו לו על כל דבר ודבר מ\"ט פנים לאיסור ומ\"ט פנים להיתר ושאל להקב\"ה ע\"ז וא\"ל שיהא זה מסור לחכמי ישראל שבכל דור ודור ותהיה ההכרעה כמותן, עכ\"ל. מבואר בדבריו כי מ\"ט צדדי האיסור ומ\"ט צדדי ההיתר אשר ישנם בכל ענין בתורה כולם מפי הגבורה נאמרו, אלא שהקב\"ה מסר את כח ההכרעה ביד חכמי הדור להורות הלכה על פיהם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 31,
      "char_length": 580,
      "timestamp": "2025-02-06T19:18:26.655217"
    },
    {
      "id": "pekudei_p32",
      "text": "וגדולה מזו איתא בירושלמי מסכת סנהדרין (פ\"ד ה\"ב) כו הכרח הוא שידרשו כל המ\"ע טהור ומ\"ט פנים טמא ואילולא זאת לא היה העולם יכול להתקיים. וז\"ל הירושלמי, א\"ר ינאי אילו ניתנה התורה חתוכה (פירש בפ\"מ פסק הלכה בלא נטיית דעת לכאן ולכאן) לא היתה לרגל עמידה מה טעם וידבר ה' אל משה (ואמר לו כל הדינים התלויים בכל פרשה ופרשה והדרשות הנוטות לכאן ולכאן) אמר לפניו רבש\"ע הודיעני היאך היא ההלכה אמר לו אחרי רבים להטות (שמות כ\"ג) רבו המזכין זכו רבו המחייבין חייבו כדי שתהא התורה נדרשת מ\"ט פנים טהור ומ\"ט פנים טמא, ע\"כ. הרי מבואר מדברי הירושלמי כו הכרח הוא הדבר שיהיו מתירין ואוסרין מזכין ומחייבין, ויש בזה מן הצורך להשלמת כח התורה, ועל כן לא רצה הקב\"ה להודיע למשה הלכה פסוקה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 32,
      "char_length": 655,
      "timestamp": "2025-02-06T19:18:26.929018"
    },
    {
      "id": "pekudei_p33",
      "text": "אמנם מה דאיתא בירושלמי לא היתה לרגל עמידה, אכתי צריך ביאור, אמאי תלוי בזה כל קיום העולם, ונראה לפרש עפ\"י מה שבארנו ועי' בדברנו לעיל פ' משפטים) דברי המד\"ר (שמות פ\"ל י\"ט) עה\"פ ואלה המשפטים הה\"ד ועוז מלך משפט אהב (תהלים צ\"ט) א\"ל משה לישראל הרי נתן לכם הקב\"ה את תורתו, אם אין אתם עושין את הדינים נוטל תורתו מכם למה שלא נתן לכם הקב\"ה את התורה אלא ע\"מ שתעשו את הדינין וכו' ע\"כ. והקשו המפרשים ע\"ד המדרש שכתב נוטל תורתו מכם וכו עבור שאין ישראל משמרין את הדינים פטורים הם מכל מצות התורה, והלא אפי' מין וכופר בעיקר מלבד אשר יקבל ענשו על אשר כפר באלקי ישראל, ענוש יענש בעד כל מצוה קלה אשר לא קיים, ופירשנו עפ\"י מה דאיתא במדרש (דברים רבה פ\"ה ד) במקום שיש דין אין דין ובמקום שאין דין יש דין וכו' אם נעשה הדין למעה אין הדין נעשה למעלה ואם לא נעשה הדין למטה הדין נעשה למעלה, ע\"כ. וביאור הדברים הוא שהקב\"ה מסר לחכמי ישראל את הכח לחדש ולפלפל בתוה\"ק ולהכריע בדעתם להלכה, ובכח זה הם מבעלים את הדין הקשה של מעלה, שלא ישלוט בעולם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 33,
      "char_length": 909,
      "timestamp": "2025-02-06T19:18:27.308148"
    },
    {
      "id": "pekudei_p34",
      "text": "ובבחינה זו תירץ הרמ\"ע מפאנו ז\"ל בספר עשרה מאמרות (מאמר חקו\"ד ח\"א פ\"ב) מה שקשה לכאורה על מאמר הגמ' (קידושין דף מ' ע\"ב) ר' אלעזר בר' שמעון אומר לפי שהעולם נידון אחר רובו והיחיד נידון אחר רובו עשה מצוה אחת אשריו שהכריע את עצמו ואת כל העולם לכף זכות וכו' ע\"כ. וקשה איך שייך שיוותר הקב\"ה על מיעוט העוונות ויזכה בדין עבור שרובו זכיות, והלא אמרו ז\"ל (ב\"ק דף נ' ע\"א) כל האומר הקב\"ה ותרן הוא יותרו מעיו וכו'. ותירץ כי כיון שדין תורה כך היא ללכת אחר הרוב, כדכתיב (שמות כ\"ג) אחרי רבים להטות, אין זה נקרא ויתור מצד הקב\"ה, לפי שהקב\"ה מתנהג עם בנו ישראל על פו התורה, כשם שהם הולכים בדרך התורה, וכח התורה מסור בידם, ולכן בדין הוא שיצאו בדימוס ברוב זכיות.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 34,
      "char_length": 639,
      "timestamp": "2025-02-06T19:18:27.780767"
    },
    {
      "id": "pekudei_p35",
      "text": "ועפי\"ז נבין היטב כונת הירושלמי הנ\"ל, אילו נתנה תורה חתוכה לא היתה לרגל עמידה, דר\"ל שאם היתה התורה ניתנת הלכות פסוקות מן השמים, ולא היה מקום לחכמי הדורות לפלפל בה, לפרק סתירות, ולחדש הלכות בתוה\"ק כפו הכרעתם, א\"כ לא היה בידם כח הדין, שהרי יצאה כבר הוראה פסוקה מן השמים, ועליה אין להוסיף וממנה אין לגרוע, וכשאין דין למטה כלומר שאין לחכמי ישראל כח ההכרעה לדין ולהורות בתוה\"ק ע\"ו הכרעת דעתם להלכה, יש דין למעלה, ותוקף הדין העליון רב ועצום הוא ואין כל בריה יכולה לעמוד בו, כאמרם ז\"ל (ערכין דף י\"ז ע\"א) תניא ר\"א הגדול אומר אילמלי בא הקב\"ה עם אברהם יצחק ויעקב בדין אין יכולין לעמוד מפני תוכחה, ע\"כ.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 35,
      "char_length": 590,
      "timestamp": "2025-02-06T19:18:28.107274"
    },
    {
      "id": "pekudei_p36",
      "text": "וזאת כוונת הירושלמי לא היתה לרגל עמידה, ר\"ל שלא היתה יכולת ביד באי עולם לעמוד בתוקף דיני מעלה, כי גדול כח הדין, ומי יכילנו להצעדק בדין. ואך מגודל חסדי המקום עלינו נתן לנו את התורה במ\"ט פנים טהור ומ\"ט פנים טמא, ומסר ביד חכמי ישראל כח לדון ולהורות בתוה\"ק כפי הכרעתם, וע\"י כך הם מבטלין את הדין העליון שלא ישלוט, ולא זו בלבד אלא שכך גדול כח בית דין שלמטה ששולט גם בטבעיות העולם, וכדאיתא בירושלמי כתובות (פ\"א הלכה ב') א\"ר אבין אקרא לאלקים עליון לאהל גומר עלי בת שלש שנים ויום אחד ונמלכין ב\"ד לעבר השנה הבתולין חוזרין ואם לאו (שלא עיברו השנה) אין הבתולין חוזרין ע\"כ. וגם דיני הבי\"ד של מעלה מתנהגים על פיהם כי קימו למעלה אשר קבלו למטה, וכמ\"ש הרמ\"ע מפאנו ז\"ל הנ\"ל. ואף כי פשטות דברי המדרש דקאמר כשיש דין למטה אין דין למעלה, לא משמע דקאי על הכח שנמסר בידם לפסוק הלכות כהכרעתם, אלא קאי על מה שכופים הב\"ד את העם לשמור את הדינים, ומצילים עשוק מיד עושקו, ועונשים את הראוי להענש מ\"מ י\"ל כי בדבריהם ז\"ל שאמרו יש דין למטה וכו', נכלל גם כח הדין שנמסר לב\"ד לחדש ולפסוק הלכה כהכרעתם, וכח זה שנמסר בידם להכריע הלכה מדעתם, גדול הוא יותר מהכח שבידם לכפות על קיום הדין ולהעניש עוברי עברה, שהרי בכח זה שנמסר בידם לחדש בתוה\"ק ולהכריע בה להלכה, מסורה בידם הנהגת העולם, ועל פיהם תשתנה גם טבעיות העולם, ואפשר שלולא כח זה, לא היה די בכח מה שהם דנים בין איש לרעהו, לבעל הדין שלמעלה, ורק בצירוף כח התורה שנמסר להם לחדש בתוה\"ק ולפסוק בה כהכרעתם און שולט הדין של מעלה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 36,
      "char_length": 1335,
      "timestamp": "2025-02-06T19:18:28.408681"
    },
    {
      "id": "pekudei_p37",
      "text": "ברם מובן הדבר כי ענין זה היה שייך אך ורק גבי הראשונים כמלאכים, שלמדו תורה בקדושה ובטהרה, ורוח הקדש הופיעה בבית מדרשם, על כן היה בכח סברתם שיצאה מפיהם בקדושה ובטהרה להכריע ולחדש בדיני התורה. אך לא כן הדורות האחרונים, שנחלש מאור שכלם, ונטל מהם כח זה לחדש הלכות בהכרעת דעתם על פי סברתם, ואנו און לנו אלא לצאת בעקבי הראשונים, ולהבין ולפלפל בדבריהם הקדושים, ולהורות על פי הכרעתם, אבל ח\"ו און לזוז ולנטות ימין ושמאל מפסק ההלכה שהורו ודבריהם הקדושים הם לנו קילורין לעינים, וכל זה הוא מובן ופשוט למי שרוצה ללכת בדרך האמת.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 37,
      "char_length": 513,
      "timestamp": "2025-02-06T19:18:29.073041"
    },
    {
      "id": "pekudei_p38",
      "text": "ועפ\"י הקדמות אלו נתנה ראש ונשובה לישב הענין, שבתחלה צוה משה לבצלאל לעשות כלים תחלה ואח\"כ משכן ולבסוף חזר בו ואמר כי נצטוה מפי הקב\"ה לעשות משכן תחלה. דהנה דברי חז\"ל במדרש, הם לכאורה היפוך מדברי הגמרא ברכות הנ\"ל, דהכי איתא במד\"ר (שמות פ\"נ ב) אתה מוצא בשעה שאמר הקב\"ה למשה עשה המשכן בא ואמר לבצלאל וכו' א\"ל בצלאל והיכן התורה ניתנת א\"ל משאנו עושים את המשכן אנו עושים הארון א\"ל רבינו משה אין כבודה של תורה בכך אלא אנו עושים הארון ואח\"כ המשכן לפיכך זכה שיקרא הארון על שמו שנאמר ויעש בצלאל את הארון, עכ\"ל. וכן איתא בתנחומא פ' ויקהל (אות ו') הובא בילקוט ס\"פ ויקהל, וכתב בזית רענן שם שהוא נגד הגמרא, וכ\"כ היפה תואר דהנך מדרשים פליגי על הגמרא ברכות הנ\"ל, דבגמרא מבואר שעשה בצלאל משכן תחלה ואח\"כ כלים. אמנם דברים אלו קשים להולמם כו לא יתכן לעשות פלוגתא בדברי חז\"ל מהפוך להפוך.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 38,
      "char_length": 765,
      "timestamp": "2025-02-06T19:18:29.355312"
    },
    {
      "id": "pekudei_p39",
      "text": "וכתבנו להשוות דברי הגמרא עם דברי המדרשים הנ\"ל, ולא פליגי, כי מה דאיתא בגמרא ברכות שעשה בצלאל משכן תחלה ואח\"כ כלים, הכוונה על שאר הכלים חוץ מן הארון, שנשתנה מכל הכלים וקדם למשכן, לצד שמעלתו יתרה על כלם, שבו התורה נתונה, וכן איתא במד\"ר (שמות פל\"ד ב) עה\"פ ועשו לי מקדש, וז\"ל, מה כתיב למעלה ויקחו לי תרומה מיד ועשו ארון עצי שוטים מה התורה קדומה לכל כך במעשה המשכן הקדים את הארון לכל הכלים מה האור קדם לכל מעשה בראשית וכו' ואף במשכן התורה שנקראת אור דכתיב (משלי ו) כי נר מצוה ותורה אור קדמו מעשיה לכל הכלים, ע\"כ. מפורש יוצא מדברי המדרש כי צורך גדול היה להקדים את הארון שבו התורה לכל מעשה המשכן, כו התורה הוא יסוד ושרש הכלל ומבלעדי התורה אין שום חשיבות וערך למשכן ולמקדש.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 39,
      "char_length": 665,
      "timestamp": "2025-02-06T19:18:29.759085"
    },
    {
      "id": "pekudei_p40",
      "text": "וכתב הרמב\"ן ז\"ל פ' תרומה עה\"פ ועשו לי מקדש. וז\"ל, ויתכן שירמוז שיהיו כל ישראל משתתפין בעשיית הארון בעבור שהוא קדוש משכני עליון ושיזכו כולן לתורה כדאיתא במד\"ר (שמות פל\"ד ג) מפני מה בכל הכלים כתיב ועשית ובארון כתיב ועשו א\"ר יהודה ב\"ר שלום יבאו הכל ויעסקו בארון כדי שיזכו כולם לתורה עכ\"ד המדרש. והעסק הוא שותנדב כל אחד כלו זהב אחר לארון או שיעזור לבצלאל עזר מעט וכו'. עכ\"ד הרמב\"ן ז\"ל. הרי כי נצטוו כל ישראל לסייע בעשיית הארון שבו התורה, כי התורה היא תכלית ועיקר הכל, וכן הוא בענין הגאולה העתידה, שלא תתכן להיות שום אתחלתא דגאולה כל זמן שאין ישראל דבוקים בתה\"ק, וכמ\"ש הרמב\"ם ז\"ל בהלכות מלכים (פי\"א ה\"ד) שמלך המשיח יהיה הוגה בתורה ועוסק במצות כדוד אביו כפי תורה שבכתב ושבעל פה ויכוף כל ישראל לילך בה ולחזק בדקה וכו' ע\"כ. ובודאי שאין שום מציאות, ולא יעלה כזאת על הדעת, שתבא גאולה ע\"ו כופרים מפירי התורה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 40,
      "char_length": 797,
      "timestamp": "2025-02-06T19:18:30.093449"
    },
    {
      "id": "pekudei_p41",
      "text": "היוצא מדברנו כי הארון שבו התורה הוא תכלית כל המשכן, והוצרכו להקדימו לבנין המשכן, והשתא דברי הגמרא ודברי המדרש בקנה אחד עולים, ולאו סתראי נינהו, כי בדברי המדרש מפורש שהקדים בצלאל את הארון למעשה המשכן, ודברי הגמ' מוסבים על שאר הכלים, חוץ מן הארון, ובהם גם המדרש מודה שהמשכן קדם להם, (ועי' בדברנו להלן בדרוש לשבת שקלים ישבנו מה דמשמע מן הכתובים שנצטוו להקדים את המשכן ואח\"כ הארון). והא דלא הוקשה לבצלאל בעשיית הארון להיכן אכניסו, כמו שהקשה בשאר הכלים, נראה לומר כי גבי הארון לא שייכא טענה זו, לאשר הארון משפיע ברכה בכל מקום שהוא מונח, כמו שמצינו בימי דוד המלך ע\"ה שהארון היה ג' חדשים בבית עובד אדום הגיתי וכתיב (שמואל ב' ו) ויברך ה' את עובד אדום ואת כל ביתו וגו' בעבור ארון האלקים, ואמרו ז\"ל ברכות (ס\"ג ע\"ב) מאו ברכה שברכו א\"ר יהודה בר זבידא זו חמות (אשתו של עובד אדום) ושמנה כלותיה שילדו ששה בכרס אחד וכו' ע\"כ.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 41,
      "char_length": 808,
      "timestamp": "2025-02-06T19:18:30.483007"
    },
    {
      "id": "pekudei_p42",
      "text": "והנה בודאי היו כל ישראל חפצים להניח ברכה אל בתיהם, ולפנות מקום לארון, ובפרט שהיתה לאותו הדור תשוקה עזה אל התורה, וכמו שפירש\"י ז\"ל בסו\"פ כי תבא עה\"פ ולא נתן ה' לכם לב לדעת וגו' עד היום הזה. וז\"ל, שמעתי שאותו היום שנתן משה ספר התורה לבני לוי כמ\"ש לקמן (פל\"א) ויתנה אל הכהנים בני לוי באו כל ישראל לפני משה ואמרו לו משה רבינו אף אנו עמדנו בסיני וקבלנו את התורה ונתנה לנו ומה אתה משליט בני שבטך עליה ויאמרו לנו יום מחר לא לכם נתנה לנו נתנה ושמח משה על הדבר ועל זאת אמר להם היום הזה נהיית לעם וגו' (שם כ\"ז) היום הזה הבנתי שאתם דבקים וחפצים במקום, עכ\"ל. הרי שהיתה להם השתוקקות גדולה אל התורה, וא\"כ ודאי שהיו מפנים מקום בבתיהם לארון שבו מונחת התורה, ועל כן לא אמר בצלאל אלא כלים שבו להיכן אכניסם, ולא אמר כן על הארון.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 42,
      "char_length": 709,
      "timestamp": "2025-02-06T19:18:30.896737"
    },
    {
      "id": "pekudei_p43",
      "text": "ועל פי כל האמור יתישבו לנו דברי הגמרא ברכות הנ\"ל (קושיא ז'), כי הנה כיון שיש לנו בענין הקמת המשכן ב' כתובים המכחישים זה את זה, בפ' תרומה כתיב כלים תחלה ואח\"כ משכן, ובפ' תשא כתיב משכן תחלה והדר כלים, ותרוייהו מפי הגבורה נאמרו כי כמו שבכל ענין בתורה גלה לו הקב\"ה למשה מ\"ט פנים לכאן ומ\"ע לכאן כן בענין הקמת המשכן נתגלו לו צדדים לכאן ולכאן, ומכיון שההכרעה נמסרה בידי חכמי הדור, רצה משה להכריע הלכה כדברי הכתוב בפ' תרומה, ולעשות כלים תחלה ואח\"כ משכן, ואין זה מכחיש למה שנצטווה בפ' תשא לעשות משכן תחלה ואח\"כ כלים, כמו שביארנו לעיל (עי' בדברנו פ' ויקהל) דתרוייהו איתנייהו, והדבר תלוי במצב הדור באיזה בחינה הם עומדים, דבזמן שישראל בבחינה גבוהה היו יכולים לעשות כלים תחלה, ולא קשה להיכן יניחום, כי היו יכולים להניחם במחנה ישראל, כי היה מחניהם קדוש.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 43,
      "char_length": 739,
      "timestamp": "2025-02-06T19:18:31.260922"
    },
    {
      "id": "pekudei_p44",
      "text": "אמנם לאחר חטא העגל שכבר נפלו ממדרגתם נצטוו לעשות משכן תחלה, לבל יהיו הכלים מונחים בחוץ, כי נתחללה הקדושה, ולגודל השתוקקות משה שיחזרו ישראל לבחינה שהיו בה לפני החטא, הכריע להלכה כדברי הכתוב בפ' תרומה וצוה לעשות כלים תחלה, אמנם בצלאל שידע מעמד העם, וכי הם רחוקים ממדרגת הקדושה שהיו בה קודם החטא. על כן אמר כלים שאני עושה להיכן אכנוסם, כו אין ראוי להניחם בחוץ, והכריע בצלאל להלכה כדברי הכתוב בפ' תשא לעשות משכן תחלה ואח\"כ כלים, ואין זה כסותר ח\"ו למה שנצטוו בפ' תרומה לעשות כלים תחלה, כו אותו ציווי נאמר בעת היו קדושים וטהורים, משא\"כ לפי מעמדם ומצבם עכשיו אין להניח את הכלים בחוץ וכאשר ראה משה כו בצלאל הכריע כדברי הכתוב בפ' תשא לעשות משכן תחלה, חזר והודה לו ואמר בודאי כך צוה לי הקב\"ה, לצד כי כח ההכרעה בענין מעשה המשכן נמסר מן השמים לבצלאל, אשר מתחלת בריאת העולם היה הוא מוכן לבנות את המשכן, כדאיתא במד\"ר פ' תשא (פ\"מ ב) עה\"פ ראה קראתי בשם בצלאל כשעלה משה למרום וכו' הראה לו הקב\"ה ספרו של אדה\"ר והראה לו כל הדורות וכו' דור דור ומלכיו דור דור ומנהיגיו דור דור ונביאיו א\"ל כאו\"א התקנתיו מאותה שעה וכן בצלאל מאותה שעה התקנתיו עכ\"ד. וכיון שההכרעה בענין זה נמסרה לוד בצלאל והוא הכריע לעשות משכן תחלה, חזר משה והודה לו ואמר כך צוה לי הקב\"ה. שהרי תרוייהו מפי המקום נאמרו, והיה הכרח שיאמר משה ב' האופנים, כמו שהוא הכרח שתדרש התורה במ\"ט פנים טהור ומ\"ע פנים טמא, ואפ\"ל שזאת הכונה במה שאמר לו משה בצל ארל היית, דהנה איתא במדרש (הביאו השל\"ה הק' שער הגדול ל') עה\"פ ה' צלך (תהלים קכ\"א) מה צלך אם אתה משחק לו הוא משחק לך אם אתה בוכה לו הוא בוכה כנגדך כך הקב\"ה צלך כשם שאתה עמו כך הוא עמך, ע\"כ. (ובספרי תלמידי הבעש\"ט הקדוש זי\"ע מובא פירוש זה בשמו ונראה כי לפי שהיה מאמר זה שגור בפיו ולו רגל על לשונו על כן הזכירוהו תלמידיו בשמו דוגמת מה שמצינו במסכת אבות (פ\"ד) שמואל הקטן אומר בנפול אויבך אל תשמח וכתב הרמב\"ם ז\"ל בפיה\"מ אע\"פ ששלמה המלך אמר זאת (משלי כ\"ד) מ\"מ התנא הזה היה רגיל תמיד להוכיח על מדה זו על כן הזכירוה בשמו).",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 44,
      "char_length": 1800,
      "timestamp": "2025-02-06T19:18:31.619845"
    },
    {
      "id": "pekudei_p45",
      "text": "וז\"ש לו משה לבצלאל בצל א\"ל היית, כלומר כיון שאתה מכריע כפן זה לעשות משכן תחלה, א\"כ גם הקב\"ה מסכים עמך, שהרי ההכרעה מסורה ביד חכמי הדור, וכשם שפוסקים בב\"ד של מעה כך מסכימים בב\"ד של מעלה, והנהגה זו היא כהנהגת הצל, שכל תנועותיו הם כפו תנועות האדם, כך כביכול הקב\"ה מסכים להכרעתך.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 45,
      "char_length": 275,
      "timestamp": "2025-02-06T19:18:32.515688"
    },
    {
      "id": "pekudei_p46",
      "text": "וכדי לבא אל ביאור המדרשים הנ\"ל (אות ג' ד' ה' ו') נקדים מה שפרשנו (עי' בדברנו פ' ויקהל) הכתוב והמלאכה היתה דים לכל המלאכה לעשות אותה והותר. והקשו המפרשים כו הכתוב סותר עצמו מיניה וביה, שהרי דים אינו הותר והותר אינו דום. ובארנו עפ\"י מה דאיתא במדרש תנחומא פ' תרומה (אות ד) עה\"פ ויקחו לי תרומה כל מקום שנאמר לו יש בו ברכה וכו' א\"ר יוחנן ראה מה כתיב והם הביאו אליו עוד נדבה בבקר בבקר לשני בקרים הביאו כל נדבת המשכן שנשתלחה ברכה בנדבתם וכו', ע\"כ. ולכאורה למה נעשה נס שנשתלחה ברכה מרובה כ\"כ עד שהותיר, והרי לא עביד קב\"ה ניסא למגנא ודי אם היתה משתלחת הברכה שיהיה די צורך לבנין המשכן ותו לא.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 46,
      "char_length": 582,
      "timestamp": "2025-02-06T19:18:32.697339"
    },
    {
      "id": "pekudei_p47",
      "text": "ונ\"ל דהנה איתא בזה\"ק (תרומה דף קכ\"ח ע\"א) ויקחו לו תרומה מאת כל איש מההוא דאקרי איש דאתגבר על יצריה וכו' אשר ידבנו לבו דיתרעי ביה קב\"ה וכו' מיניה תקחו את תרומתי וכו' ומנא ידעינן דהא קב\"ה אתרעי ביה כד חמינן דרעותא דההוא ב\"נ למרדף ולאשתדלא בתר קב\"ה וכו' עכ\"ל. הרי כי לא זכו כל ישראל שיבנה המשכן מנדבתם, כי זעירין אינון אשר זכו להשיג מעלות רמות אלו המבוארים שם בזה\"ק, ולא נבנה המשכן אלא מנדבתם של בני עליה מועטים, וחלק שאר העם המתנדבים נותר מאליו, וא\"כ שפיר מובן מדוע הוצרך הקב\"ה לשלוח ברכה בנדבתם וגם נותר, ולא היה הנס בחנם כו צוה ה' את הברכה בחלק בני העליה אשר נפל חבלם בנעימים וזכו שיבנה המשכן מנדבתם, כי מעט היו, ולא היתה נדבתם מספיקה למשכן, ומה שנותר היה חלק העם אשר לא שפרה נחלתם, ולא זכו שיבנה המשכן מנדבתם, ומובנים בזה דברי הפסוק כו מה דכתיב והמלאכה היתה אדיס\"ג היינו אותם הנדבות שהיו ראויים לבנין המשכן היו דים בצמצום, ולא נותר מהם מאומה, ומה דכתיב אוהותר\"ע היינו נדבת העם שלא היו ראוים שיבנה המשכן מנדבתם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 47,
      "char_length": 911,
      "timestamp": "2025-02-06T19:18:33.017976"
    },
    {
      "id": "pekudei_p48",
      "text": "ועפ\"י זה נבא לביאור המדרש (אות ו') עה\"פ והביטו אחרי משה שהיו אומרים זה לזה כמה צוארו שמן כל זה הוא ממה שלקח משלנו. דאין הכונה כפשוטה שחשדוהו ששלח יד בכסף הנדבה כי לא יאומן כי יסופר שבני ישראל ולו גם הריקנום שבהם יחשדו את משה כו שלח ידו בממונם, אלא חשדם היה לצד שראו שנשתלחה ברכה בנדבה וגם הותיר, והבינו שעל חנם לא שלח ה' את הברכה שיותיר, ועל כרחך שמה שנותר הוא מפני שלא זכו שיבנה המשכן מממונם, ויתעצבו אל לבם ונפשם מרה עליהם, לפי שהשתוקקו בכל לבם שיתכפר להם מעשה העגל, ע\"ו שיבנה המשכן מנדבתם, ועתה ראו כו נותר, חשדו את משה אשר הוא עולל למו זאת שלא תכנס נדבתם במשכן, דהנה מאת כל אוש\" האמור בפרשת תרומה אפשר לפרשו לרבות כולם וגם העזר, כמו שמצינו בדברי הזה\"ק, ויש לפרשו דקאי רק על הצדיקים הנקראים איש כמ\"ש הזה\"ק הנ\"ל וחשדו שהכריע משה לפרש הכתוב ויקחו לו תרומה מאת כל איש שפירושו שיקחו רק מהצדיק הנקרא איש, וע\"י שהכריע משה כן הסכים הקב\"ה על ידוו ואמרו ליצני ישראל כי כונת משה היתה בהכריעו כן להלכה כדי שתשתלח ברכה במעשה המשכן, ודבר המתרבה ע\"ו ברכה מן השמים הוא הפקר, וזכה בו משה לעצמו וחזר ונתנו לנדבת המשכן כדי שכל המשכן יקרא רק על שמו, ואין להם חלק ונחלה בו, שהרי חלקם נותר וכל המשכן נבנה רק ממה שנתרבה ע\"י הברכה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 48,
      "char_length": 1111,
      "timestamp": "2025-02-06T19:18:33.469586"
    },
    {
      "id": "pekudei_p49",
      "text": "וזה שאמרו שהעשיר משה מנדבת המשכן, הכונה כי ע\"ו שנבנה המשכן כולו מחלקו זכה לעשירות התורה ולעלות מדרגות רמות, וגם עפ\"י מה שאמרו ז\"ל (אבות ה' כ\"א) משה זכה וזכה את הרבים זכות הרבים תלוי בו, ולכן אמרו כי הכל נקרא על שמו ואין להם חלק בתורה. והא דאיתא במדרש שאמרו חמו קדל בריה דעמרם וכו', פירוש ראו כמה שמן ועשיר הוא בתורה, ואל יפלא בעיניך שאין משמעות דברי המדרש כן, כי כך הוא דרכה של תורה שכתובים בה ענינים שעיקר כונתם היא פנימיות הדברים ולא פשטיותם, כמו שכתב השל\"ה הקדוש על מה שהקשו הראשונים ז\"ל (עי' רמב\"ן פ' בחקותי) למה נאמרו בתורה רק הבטחות ויעודים גשמיים ולא הזכירה התורה שכר קיום הנפשות בעולם הנשמות ובעולם הבא לאחר תחית המתים ורב טוב הצפון להם ותירץ כי עיקר המכוון ביעודים שהבטיחה התורה הוא על יעודים רוחניים אלא שלשון הכתוב מושאל גם לדברים גשמיים ומי שמבין אמיתת לשון הקדש רואה בכל הענינים יעודים רוחניים ואך מי שאינו מבין כ\"כ בפנימיות הלשון רואה את הדברים כפשוטן. את\"ד השלה\"ק ז\"ל. וכן צ\"ל כאן שאין כונת המדרש כפשוטו שחשדוהו שהעשיר מממונם, אלא שהעשיר בתורה ובמדרגות, כנ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 49,
      "char_length": 974,
      "timestamp": "2025-02-06T19:18:34.028833"
    },
    {
      "id": "pekudei_p50",
      "text": "ואף שלכאורה גם אם האמת היה כחשדם שנבנה המשכן רק מחלקו של משה רבינו ע\"ה, אין להם מקום להתרעם עליו כיון שהקב\"ה הסכים עמו, מ\"מ י\"ל שהתרעומות היה כי אילו לא היה הוא מכריע להלכה שאין הם ראוים לתת חלקם לבנין המשכן, לא היה הקב\"ה מסכים על כך, ורק לפי שהוא חפץ בכך שיבנה המשכן אך מנדבתו, למען ישיג ע\"י כך מעלות רמות הסכים הקב\"ה על ידו, והוא עפ\"י דברי התוספות במס' שבת ודף פ\"ז ע\"א ד\"ה ואתה פה עמוד עמדי) על הא דאמרו בגמרא שלשה דברים עשה משה מדעתו והסכים הקב\"ה על ידו וחד מינייהו שפירש מן האשה וכתבו התוס' דע\"כ לומר שלא צוה לו הקב\"ה לפרוש מן האשה שאם כן מה מקום לתרעומת אהרן ומרים אלא ע\"כ שהוא פירש מדעתו ואח\"כ הסכים הקב\"ה עמו ותרעומתם היתה לפי שאם לא היה פורש ממנה מדעתו לא היה הקב\"ה מסכים על ידו כי בדרך שאדם רוצה לילך מוליכין אותו, ע\"כ.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 50,
      "char_length": 728,
      "timestamp": "2025-02-06T19:18:34.514120"
    },
    {
      "id": "pekudei_p51",
      "text": "ובדרך זה פירש האה\"ח הקדוש מאמר משה רבינ ע\"ה לעדת קרח (במדבר ט\"ז כ\"ח) בזאת תדעון כו ה' שלחני לעשות את כל המעשים האלה כו לא מלבי וז\"ל צל\"ד איך יחשוב משה לעם ה' שעדיין לא האמינו בו לנביא אמת וכו' ואולי כי צד החשד היה עז\"ה לצד שמצא משה חן בעיני ה' כשהיה משה חפץ לתת גדולה לאחד מקרוביו וכו' היה עושה ונמלך בה' והיה ה' מסכים על ידו וכו' וה' נתן לו תאות לבו אבל לא לצד שיש עיכוב בדבר כי הוא זה הראוי לכהונה לזאת אמר בזאת תדעון כי ה' שלחני לעשות לא שהייתי עושה והוא מסכים על ידי למה שהייתי חפץ בדעתי וכו', עכ\"ד הקדושים. הרי כי אף בדבר שהקב\"ה הסכים על ידו, עדיין היה מקום לתרעומות כו הוא חפץ בדבר והקב\"ה נתן לו תאוות לבו, אמנם אפי' חשד זה לא חשדוהו אלא ליצני ישראל, אבל כלל ישראל לא עלתה על דעתם אף חשד קל זה, שמשה רבנו ע\"ה בנה מנדבתו את המשכן כדי שיוכל להשיג עשירות בתורה, כי הלא זה האיש משה רעיא מהימנא שהשליך נפשו מנגד בעד כלל ישראל, ותמיד היה לנגד עיניו טובת הכלל, ולא הביט על טובת עצמו כלל ואין מקום לחשדו, וכדי להסיר חשדם של ליצני הדור מעליו, נתן להם משה חשבון מכל הכסף העשוי למלאכה, להראותם כי כל אחד מישראל יש לו חלק בבנין המשכן, על ידי נדבת מחצית השקל שנתנו, ובהם לא נשתלחה הברכה, כמפורש בפרשה שעלה חשבון חצאי השקלים כמספר בני ישראל, וגם נתן להם חשבון מה נעשה מן חצאי השקלים, ואף את האלף ושבע מאות וחמשה ושבעים ששכח בתחלה מה נעשה מהם, וחשדוהו כי אלו הם השקלים שנותרו מנדבתם של העם שלא זכו שיבנה המשכן על ידם, האיר הקב\"ה את עיניו וראה שהם עשויים ווים לעמודים. וכראות בנו ישראל כי לכלם יש חלק בבנין המשכן, נחה דעתם ונתפייסו ועפ\"י דברנו הונח לנו מקושית הרמב\"ן והראב\"ע ז\"ל שהקשו למה לא נתן משה חשבון מה נעשה בזהב. והשתא אתו שפיר כי כל חשדם היה כי אין להם חלק בבנין המשכן המכפר על מעשה העגל, וכיון שנתן להם משה חשבון הכסף, ועיניהם לנוכח הביעו כי כל אחד יש לו חלק בבנין המשכן, סרה תלונתם מעליו ולא הוצרך לתת להם חשבון הזהב, שהרי לא חשדוהו מעולם ששלח ידו בכסף הנדבה, ואף שידעו שנשתלחה ברכה בנדבתם ונותר חלק מנדבתם, מ\"מ כיון שזכו שמחצית השקל שנתנו לא נשתייר, נחה דעתם כו הוא להם לכפרה על חטא העגל, ולא היתה להם תרעומת על חלק הנדבה הנותר, כי ידעו שלאו כל אדם זוכה שכל חלקו בנדבה יעשה למלאכת המשכן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 51,
      "char_length": 1988,
      "timestamp": "2025-02-06T19:18:34.902405"
    },
    {
      "id": "pekudei_p52",
      "text": "ועתה יובנו היטב דברי המדרש הנ\"ל (אות ג) איש אמונות זה משה וכו' שכל הדברים שהיה גזבר עליהם היו מתברכים וכו' ואץ להעשיר זה קרת שהיה לוי ובקש ליטול כהונה גדולה ע\"כ. ושפיר הוי דבר והפוכו, נאמנות משה לעומת מה שאץ קרח להעשיר כי מה שאץ קרח להעשיר אין הכונה על עשירות הממון, שהרי עשיר גדול היה כנ\"ל, אלא הכונה שרצה ליטול כהונה גדולה לעצמו כדו שיעשיר בתורה, כן מה שחשדו בנו ישראל את משה שהעשיר מנדבת המשכן לא על עושר ממון חשדוהו, אלא על עשירות בתורה, וע\"כ מביא המדרש להכא שכל הדברים שהיה גזבר עליהם היו מתברכים, כי ממה שנכנסה ברכה בנדבתם ונשתיירה מצאו מקום לחשוד בו שהכריע להלכה שאין הם ראוים שיבנה המקדש מנדבתם, כדו שיבנה המשכן רק מחלקו כנ\"ל. ויזכה ע\"י כך לעשירות בתורה, ועל כן הוצרך לתת להם חשבון כדי שיראו שכ\"א יש לו חלק במשכן ואף אחד מהם לא נותר מחצית השקל שנתן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 52,
      "char_length": 757,
      "timestamp": "2025-02-06T19:18:35.974604"
    },
    {
      "id": "pekudei_p53",
      "text": "ומיושבים גם דברי המדרש ואות ד) שהיה משה קורא לאחרים ומחשב על ידיהם עליו הכתוב אומר ולא יחשבו את האנשים אשר יתנו את הכסף כו באמונה הם עושים. דלכאורה קשה אדרבה משם ראיה לסתור שלא חשבו עם הגזברים, ולמה הוצרך משה לחשב עמהם. ולפי דברנו ובא על נכון כי מה שחשב משה עמהם חשבון הכסף לא משום שחשדוהו שאינו עושה באמונה, אלא שחשדוהו שרוצה לבנות המשכן מנדבתו, וראיה שהרי לא נתן להם חשבון הזהב, ועל כן שפיר מביא המדרש ראיה מדברי הכתוב ולא יחשבו את האנשים וגו', שהרי גם משה לא חשב עמהם את הזהב, כי באמונה הוא עושה, ומה שנתן להם חשבון הכסף טעם אחר ק ולא משום חשד שאינו עושה באמונה כנ\"ל. א\"ש מה שהוצרך משה לפייסם ואות ה) שהרי לא לבם על שנותר מנדבתם ולא זכו שיבנה המשכן מחלקם והפיוס היה כו כל אחד יש לו חלק במשכן ע\"י מחצית השקל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 53,
      "char_length": 710,
      "timestamp": "2025-02-06T19:18:36.351053"
    },
    {
      "id": "pekudei_p54",
      "text": "ובדברנו מיושב גם מה שדקדקנו דמה שייך להכא הפסוק ובצלאל וגו' עשה את כל אשר צוה ד' את משה. דלכאורה מקומו ראוי להיות במקום שהכתוב מדבר בהקמת המשכן, ולא בנתינת חשבון הנדבה. אמנם לפי דרכנו כי טעם שהוצרך משה לתת חשבון על נדבת המשכן הוא משום שחשדוהו כו הוא הגורם לכך שנשתוורה נדבתם, ע\"י שהכריע להלכה שאין הם ראוים לתת לנדבת המשכן, והקב\"ה הסכים עמו. ומנין להם זאת כי יש כח ביד חכמי ישראל להכריע הלכה כפו דעתם, על כן מודיענו הכתוב ובצלאל וכו' עשה את כל אשר צוה ה' את משה, ודרשו ז\"ל אשר צוה משה אין כתיב כאן וכו' כי ניתן לו משמים כח ההכרעה בענין זה, וע\"י כך נודע לישראל כי משמיא קא זכו לחכמים להכריע הלכה, ומזה נולד בלבם החשד שמשה רבינו ע\"ה הכריע הלכה כי אין הם ראויים לתת נדבה, והוכרח משה לתת להם חשבון הנדבה, להראותם כי כ\"א יש לו חלק במשכן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 54,
      "char_length": 732,
      "timestamp": "2025-02-06T19:18:36.706551"
    },
    {
      "id": "pekudei_p55",
      "text": "וגם מובנים היטב דברי רש\"י ז\"ל משכן העדות עדות הוא לישראל שויתר להם הקב\"ה על מעשה העגל וכו'. ושפיר שייך לפרשה זו שענינה חשבון נדבת המשכן, כי ממה שנתן להם משה חשבון הכסף, נודע להם כי כל אחד יש לו חלק במשכן, וזאת להם לעדות כו ויתר להם הקב\"ה על מעשה העגל, שהרי השרה שכינתו על המשכן שנבנה מנדבתם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 55,
      "char_length": 291,
      "timestamp": "2025-02-06T19:18:37.075200"
    },
    {
      "id": "pekudei_p56",
      "text": "וכדי לישב דברי המדרשים המוצגים בפתח דברנו שדרשו מתיבות המשכן משכן רמז למקדש שנתמשכן ב\"פ וכו' וגם רמז שביהמ\"ק שלמעלה מכוון נגד ביהמ\"ק שלמטה ואות ב) נראה לומר, דהנה איתא במד\"ר (במדבר פי\"ב ט\"ו) עה\"פ ויהי ביום כלות משה להקים את המשכן וז\"ל אר\"ס בשעה שאמר הקב\"ה לישראל להקים את המשכן רמז למלאכי השרת שיעשו אף הם משכן ובעת שהוקם למטן הוקם למעלן והוא משכן הנער ששמו מט\"ט שבו מקריב נפשותיהם של צדיקים לכפר על ישראל בימי גלותם ולכך כתיב את\" המשכן שמשכן אחר הוקם עמו וכה\"א מכון לשבתך פעלת ה' מקדש ה' כוננו ידיך (שמות ט\"ו) ע\"כ.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 56,
      "char_length": 515,
      "timestamp": "2025-02-06T19:18:37.245261"
    },
    {
      "id": "pekudei_p57",
      "text": "והנה כללא הוא כי דבר הנגרם ע\"י מעשה האדם אף שהוא לא עשהו בידים נחשב לו כמעשהו וע\"ד שפי' ק\"ז זללה\"ה בישמח משה ופ' חיו שרה דף נ\"ו ע\"ג) הכתוב (תהלים ס\"ב) אחת דבר אלקים שתים זו שמעתי וגו' ולך ה' חסד כי אתה תשלם לאיש כמעשהו כי בכל הדברים יש ג' חלקים ראש תוך וסוף והנה המתחיל הוא עיקר גדול דכבר אמרו התחלה יותר מן הכל והמסוים עיקר גדול דאינה נקראת אלא ע\"ש גומרה אבל האמצעי הוא רק מסייע וקיי\"ל (שבת צ\"ג ע\"ב) מסייע און בו ממש, והנה בכל מצוה הוא יתברך שמו המתחיל כדאי' במדרש (ויק\"ר פכ\"ז ב) מי הקדימני ואשלם (איוב מ\"א) וכו' מו עשה לו מעקה עד שלא נתתי לו גג מי עשה לו מזוזה עד שלא נתתי לו בית וכו' ואין בנו כח להתחיל המצוה זולתו יתברך וגם המסיים וגומר הוא הקב\"ה כמ\"ש (תהלים ל\"ז) צופה רשע לצדיק וגו' ואמרו ז\"ל (סוכה נ\"ב ע\"ב) יצרו של אדם מתגבר עליו וכו' ואלמלי הקב\"ה עוזרו לא היה יכול לו וא\"כ אדם עושה רק את החלק האמצעי במצוה, והוא רק כמסייע ואין בו ממש, ועל דבר זה און מגיע לו שכר, רק על צד החסד משלם השי\"ת לאדם כאלו הוא היה העושה כולה, והן הן דברי הפסוק אחת דבר אלקים ר\"ל כל מה שדבר אלקים לנו בתה\"ק רק על חלק אחת דבר, דהיינו חלק האמצעי, שתים, ר\"ל שתו החלקים האחרים, דהיינו ראש וסוף, זו שמענו ר\"ל זה אנו מבינים וכו שמיעה הוא מלשון הבנה כמו ולא ידעו כי שומע יוסף) כי עוז לאלקים ר\"ל כי אין יכלת ביד האדם לעשותם, אלא הקב\"ה עושה אותם ושמא תאמר מפני מה יקבל שכר, לזה אמר ולך ה' החסד כי אתה תשלם לאיש כמעשהו ר\"ל כאילו הוא עשה המעשה מראש ועד סוף, עכ\"ד.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 57,
      "char_length": 1333,
      "timestamp": "2025-02-06T19:18:37.501966"
    },
    {
      "id": "pekudei_p58",
      "text": "היוצא מזה כי המשכן הנבנה למעלה אף שלא היה ביכולת של ישראל לבנותו אלא מלאכי השרת בנאוהו, אעפי\"כ נקרא ע\"ש ישראל, כי ע\"ו שעשו הם את המשכן למטה, עוררו עובדא דלעילא שיבנה המשכן למעלה כנגדו.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 58,
      "char_length": 184,
      "timestamp": "2025-02-06T19:18:38.199747"
    },
    {
      "id": "pekudei_p59",
      "text": "ועפ\"י זה י\"ל שייכות הנו תרתי דרשות להדדי כי הא דדרשו במדרש המשכן משכן ב\"פ שנתמשכן ב\"פ בעוונותיהן של ישראל שייך שפיר לפ' זו, שהרי מאחר שנתן להם משה רבינו ע\"ה חשבון הנדבה וראו כי נבנה המשכן מנדבתם שייך לומר כי המשכן ותמשכן על עוונותיהם, אבל טרם נודע שהמשכן נבנה מנדבתם אין שייך לקחת אותו למשכון, אמנם ע\"ז קשה הלא איתא במדרש ילקוט פ' תרומה כל מקום שנאמר אלי' הרי זה קיים לעולם ולעולמי עולמים וכו' בתרומה ויקחו לי' תרומה וקשה איך נתקיים ויקחו לי תרומה לעד והלא נגנז המשכן והמקדשות נתמשכנו על עוונותיהם של ישראל, וע\"ז מביא המדרש הדרשא המשכן משכן ב\"פ רמז שביהמ\"ק שלמעלה מכוון כנגד ביהמ\"ק שלמטה, וכיון שביהמ\"ק של מעלה נבנה ע\"ו איתערותא דלתתא שעשו בנ\"י בהקמת המשכן, נמצא כו המשכן קיים לעד ולעולמי עולמים, כי אף עתה שאין לנו משכן ונחרבו המקדשות, מקריבים קרבנות בביהמ\"ק שלמעלה לכפר על ישראל. ושפיר נתקיים מאמר הכתוב ויקחו לי תרומה לעד ולעולמי עולמים, שהרי ע\"ו עשיית המשכן נעשה גם המקדש שלמעלה שהוא קיים לעד.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 59,
      "char_length": 897,
      "timestamp": "2025-02-06T19:18:38.331030"
    },
    {
      "id": "pekudei_p60",
      "text": "ועפ\"י דברנו יתישבו גם יתר הדקדוקים בפרשה, ודברי הילקוט הנ\"ל ואות י\"א) כי מה שדקדקו המפורשים על כפל הלשון דכתיב ויעשו בני ישראל והדר כתיב כן עשו ואות ט') מיושב שפיר, שהרי היו כאן שתו עשיות חדא משכן שלמטה שעשו אותו בטורח ובוגיעה רבה, וגם הביהמ\"ק שלמעלה אשר נעשה ע\"ו מלאכי השרת ואעפי\"כ נקרא על שמם של ישראל. וז\"פ הכתוב ויעשו בני ישראל כאשר צוה ה' את משה, היינו המשכן, וע\"י עשייתם נעשה ביהמ\"ק למעלה, וזהו \"כן עשו\" שהכתוב מעיד שגם עשייה זו נקראת על שמם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 60,
      "char_length": 448,
      "timestamp": "2025-02-06T19:18:38.770036"
    },
    {
      "id": "pekudei_p61",
      "text": "והנה בארנו לעיל (עי' פ' ויקהל) כו עבודה ומלאכה שהם שמות נרדפים הם ב' ענינים, כו עבודה פירושה דבר הנעשה ביגיעה רבה, ומלאכה הוא אף דבר קל שאין בו יגיעה כגון הוצאת מחט קרוי מלאכה, ועפי\"ז מיושב מה שדקדק הרמב\"ן ז\"ל ששינה הכתוב לשונו מעיקרא כתיב ותכל כל עבודת וגו' ואח\"כ כתיב וירא משה את כל המלאכה ואות י'), וה\"פ ותכל כל עבודת משכן אוהל מועד, היא עבודת המשכן שעשו ביגיעה רבה, וירא משה את כל המלאכה, כאן כלול גם בנין ביהמ\"ק שלמעלה שהוא מכונה מלאכה, כו נעשה ע\"ו מלאכי השרת בלא יגיעה, וגם י\"ל כי לכן נכתב שכל\" המלאכה לרבות מלאכת ביהמ\"ק שלמעלה. ועפי\"ז מובנים היטב דברי הילקוט הנ\"ל עה\"פ (אות י\"א) וירא משה את כל המלאכה וגו' כאשר צוה ה' והיכן צוהו שהרי מ משכל המלאכהאא מרבינן שנבנה ביהמ\"ק של מעלה, ועליו מכוונת שאלתו והיכן צוהו, כי לא מצינו שצוה ה' על בנין ביהמ\"ק של מעלה, וע\"ז קאמר שנאמר ועשו לי' מקדש. והכונה כו כל מקום שנאמר לו הוא לעולמי עולמים, והיאך קיים המקדש לעד והרי נחרב, וע\"כ הכונה כנ\"ל, כי צוה ה' שיעשו ביהמ\"ק שלמטה בקדושה גדולה כ\"כ, שע\"י מעשיהם יהיה איתערותא דלעילא ויבנה ביהמ\"ק שלמעלה שהוא קיים לעד ולעולמי עולמים. וא\"כ שפיר מרומז הציווי לבנות ביהמ\"ק שלמעלה במאמר ועשו לי מקדש.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 61,
      "char_length": 1079,
      "timestamp": "2025-02-06T19:18:39.011017"
    },
    {
      "id": "pekudei_p62",
      "text": "ובדרך זה יתבאר גם המדרש הנ\"ל (אות ח) ויביאו את המשכן אל משה וגו' הה\"ד עוז והדר לבושה ותשחק ליום אחרון, שדקדקנו למה נקרא יום הקמת המשכן ואחרון'. ועפ\"י דברנו אפ\"ל כי ע\"ו שהקים משה את המשכן בקדושה גדולה, נבנה ביהמ\"ק של מעלה אשר עתיד הוא לרדת בנוי ומשוכלל מן השמים, נמצא כי בכח הקדושה שהיה בהקמת המשכן יבנה הבית השלישי הנקרא בית האחרון, כדכתיב (חגי ב ט) גדול יהיה כבוד הבית הזה האחרון מן הראשון (עי' מצודות שם), ועל כן נקרא אחרון כי יעמוד לעד ולנצח נצחים. וזה אפ\"ל בכונת המדרש עוז והדר לבושה ותשחק ליום אחרון, כי כח הקמת המשכן הוא הגורם להקמת הבית השלישי המקוה, ובמהרה נזכה לראותו, בהתגלות כבוד שמים עלינו בב\"א.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 62,
      "char_length": 607,
      "timestamp": "2025-02-06T19:18:39.527567"
    },
    {
      "id": "pekudei_p63",
      "text": "באופן אחר נ\"ל מה שפירש\"י המשכן משכן ב\"פ רמז למקדש שנתמשכן ב\"פ בעוונותיהם של ישראל. משכן העדות עדות לישראל שויתר להם הקב\"ה על מעשה העגל. וקשה מה שייכו הני דרשות לפרשה זו דמיירי רק מחשבון נדבת המשכן, ומן הראוי היה לרמוז דרשות אלו בפרשיות הקודמות דמיירי בהקמת המשכן. ונ\"ל בהקדם מה דאיתא במדרש רבה ר\"פ זו, לכמה ימים הביאו כל הנדבה א\"ר יוחנן לשני בקרים הביאו והותר שנאמר והמלאכה היתה דים וגו' נכנס משה אצל בצלאל ראה שהותיר מן המשכן אמר לפני הקב\"ה רבון העולמים עשינו את מלאכת המשכן והותרנו מה נעשה בנותר א\"ל לך ועשה בהם משכן לעדות הלך משה ועשה בהן כיון שבא ליתן חשבון א\"ל כך וכך יצא למשכן וביתר עשיתי משכן לעדות הוי אלה פקודי המשכן משכן העדות, עכ\"ד המדרש. ובילקוט איתא שעשה מן הנותר משכן לדברות. ונדחקו המפרשים בביאור דבר זה. וז\"ל היפה תואר, לאו הבינותי מהו המשכן הזה המיוחד לעדות שנתחדש לו עכשיו, כו לא מצינו בשום מקום רק המשכן הנזכר עד עכשיו חלק בחלק, ומ\"כ שאפשר שעשה בית ועד לתלמוד ומדרש הגדול, עכ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 63,
      "char_length": 897,
      "timestamp": "2025-02-06T19:18:39.912828"
    },
    {
      "id": "pekudei_p64",
      "text": "ובספר בנין אריאל הקשה עליו וז\"ל לכאורה כיון שהיה גזבר איך הותר להוריד את המותר מן המשכן לקדושה קלה, דקיי\"ל באורח חיים סי' קנ\"ג דלאחר שבא ליד גזבר אין מורידין את המותר וכו' עיי\"ש. וצריך לומר דמה שנותר ממלאכת המשכן לא היה בצד הטבע אלא ע\"ו הברכה ניתותר, וזה אפשר דמותר להוריד לקדושה קלה שלא תהא הברכה על חנם, עכ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 64,
      "char_length": 311,
      "timestamp": "2025-02-06T19:18:40.328618"
    },
    {
      "id": "pekudei_p65",
      "text": "ולי נראה ליישב קושית הבנין אריאל בכמה אנפי, חדא עפ\"י המבואר בשו\"ע או\"ח סי' קנ\"ג ס\"ה וז\"ל, אם גבו מעות לבנות בית הכנסת או בית המדרש ורצו לשנותם מלצורך מה שגבו אותם אין משנין אלא מקדושה קלה לחמורה אבל אם עשו בהם הדבר שגבו אותם בשבילם משנים המותר לכל מה שירצו. ע\"כ. א\"כ א\"ש שהרי אחר שנגמרה כל מלאכת המשכן וכליו שלצורך כך גבו את המעות מותר לעשות מן הנותר ביהמ\"ד.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 65,
      "char_length": 358,
      "timestamp": "2025-02-06T19:18:40.497404"
    },
    {
      "id": "pekudei_p66",
      "text": "או אפשר לומר דהנה מבואר שם ס\"ו דבית הכנסת של כפרים מותרין למכרו ע\"י ז' טובי העיר ואם היה גם במעמד אנשי העיר רשאין להוציא המעות לכל מה שירצו ורק בכרכים מפני שבאים שם ממקומות אחרים ובנאוהו אדעתא דכו\"ע וזכו בו כל העולם אין למכרו, עיי\"ש. וא\"כ י\"ל כי המעות שנתנו לצורך המשכן י\"ל דין ביה\"כ של כפרים, כיון שהיו שם כל ישראל, ולא שייך טעמא שבנאוהו ע\"ד שבאים ממקומות אחרים, וע\"כ מותר לשנותו ע\"י זט\"ה כדין ביה\"כ של כפרים.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 66,
      "char_length": 410,
      "timestamp": "2025-02-06T19:18:40.698311"
    },
    {
      "id": "pekudei_p67",
      "text": "או י\"ל באופן אחר דהנה מצינו בגמרא בכמה דוכתי (עי' מנחות ע\"ט ע\"ב שבועות י\"א ע\"א) לב ב\"ד מתנה עליהם (על הקדשים) אם הוצרכו הוצרכו, ואם לאו יהו למה שצריכים, והטעם כי ישראל מקדישין קדשיהם על דעת הבית דין. וב\"ד נותנין לב להתנות לכל צרכיהם, וא\"כ י\"ל כו משה רבינו ע\"ה התנה מעיקרא כי אם יותיר מן הנדבה יוכלו לשנותה לשאר דברים.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 67,
      "char_length": 317,
      "timestamp": "2025-02-06T19:18:40.915609"
    },
    {
      "id": "pekudei_p68",
      "text": "או\"י עפ\"י מה שפירשנו ובפ' ויקהל) הפסוק והמלאכה היתה דים וגו' והותר. דלכאורה צ\"ב וכמו שהקשה האוה\"ח הקדוש, אם דים אינו הותר ואם הותר אינו דים. וביארנו עפ\"י דאיתא במדרש תנחומא פ' תרומה לשני בקרים הביאו כל נדבת המשכן שנשתלחה ברכה בנדבותם. ולכאורה קשה א\"כ מדוע נעשה נס ונשתלחה הברכה בנדבותם כדי שיותירו. וכי עביד קב\"ה ניסא למגנא. ונ\"ל עפ\"י דאיתא בזוה\"ק פ' תרומה (דף קכ\"ח ע\"א) ויקחו לי תרומה מאת כל איש מהאי דאיקרי איש דאתגבר על יצריה וכו' מאו אשר ידבנו לבו אלא דיתרעי ביה קב\"ה וכו' ומנא ידעינן דהא קב\"ה אתרעי ביה ושוי מדורא ביה כד חמינן דרעותא דההוא ב\"נ למרדף ולאשתדלא אבתריה דקב\"ה בלביה ובנפשיה וברעותיה ודאי תמן ידעינן דשריא ביה שכינתא, עכ\"ל עיי\"ש באריכות.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 68,
      "char_length": 653,
      "timestamp": "2025-02-06T19:18:41.099614"
    },
    {
      "id": "pekudei_p69",
      "text": "היוצא מדבריו כי לאו כל אדם זכה אשר מחלק נדבתו נבנה המשכן, כי זעירין אינון אשר שלמים הם בכל המעלות שמונה הזה\"קר כאמרם ז\"ל (סוכה מ\"ה ע\"ב) ראיתי בני עליה והן מועטין. ועפי\"ז יובן הכתוב שפיר והמלאכה היתה דום ר\"ל שהספוקה הנדבה לבנין המשכן, ואעפ\"י שהיה חוהותר\", כלומר שנותר חלק אותם שלא היו ראוים שתכנס נדבתם במשכן, אפ\"ה היתה המלאכה דים, כי נשתלחה הברכה בנדבתם, כדי שיספיק חלקם של בני העליה לבנין המשכן, ומיושב שפיר דלא עביד קב\"ה ניסא למגנא, כו הנותר היה חלקם של אלה שלא זכו לבנות המשכן מנדבתם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 69,
      "char_length": 487,
      "timestamp": "2025-02-06T19:18:41.430092"
    },
    {
      "id": "pekudei_p70",
      "text": "ועפי\"ז תתישב קושית הבנין אריאל הנ\"ל שהרי בנו את בית המדרש מן חלק הנדבה שנותר, שהוא חלק האנשים שלא היו ראוין שיבנה המשכן מנדבתם. וא\"כ לא היה שום שינוי והורדה בקדושה, שהרי מתחלת הנתינה לא היה ממונם ראוי שיבנו ממנו את המשכן, ולא חלה עליו קדושת המשכן, כיון שצוה הקב\"ה שיקחו רק מן בני העליה, כדאיתא בזה\"ק, אלא כיון שלא רצו לבייש אותם שאינם ראוים, נעלו מכולם ומאליו נותר.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 70,
      "char_length": 365,
      "timestamp": "2025-02-06T19:18:41.696099"
    },
    {
      "id": "pekudei_p71",
      "text": "ולכאורה עדיין דברי המדרש הנ\"ל צ\"ב דקאמר שעשה מן הנותר משכן לעדות ופירשו שהכונה על ביהמ\"ד, וקשה למה הוצרכו אחרי הקמת המשכן לביהמ\"ד, והלא גם קודם לכן היה משה רבינו ע\"ה לומד עם בני ישראל, כדאיתא בגמרא (עירובין נ\"ד ע\"ב) כיצד סדר משנה משה למד מפי הגבורה נכנס אהרן ושנה לו פרקו וכו' נכנסו כל העם ושנה להם משה פרקן, ע\"כ. הרי שכבר היה להם מקום ללימוד התורה הקדושה, ולמה הוצרכו אחרי הקמת המשכן לבנות ביהמ\"ד. אך הענין דהנה ידוע שבכל דבר עשו הדורות הראשונים פועל דמיוני לדורות העתידים, וכמו שכ' הרמב\"ן ז\"ל ריש פ' לך כי כל מעשי האבות באו ללמד על העתיד. כי מעשה אבות סימן לבנים, ודע כי כל גזירת עירין כאשר תצא מכח גזירה אל פועל דמיון, תהיה הגזרה מתקיימת על כל פנים, ע\"ש באורך.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 71,
      "char_length": 663,
      "timestamp": "2025-02-06T19:18:41.892836"
    },
    {
      "id": "pekudei_p72",
      "text": "וכמו\"כ י\"ל כי לאשר צפה הקב\"ה שעתיד ביהמ\"ק להחרבל והקרבנות יהיו בעלים, ויהי' צורך בבתי כנסיות ובבתי מדרשות, כי זה קיומם של ישראל כאשר באים לביהכנ\"ס ולבהמ\"ד ולומד ים שם הברכות והנחמות שהובטחו בתורה וע\"י הנביאים, המה מתחזקין ומתנחמין, כדאיתא בזוה\"ק (שמות דף קפ\"ח ע\"ב) וזלה\"ק וישראל סבלון עליהון כמה בישין בגלותהון ואלמלא כל אינון טבאן דקא מחכאן וחמאן כתיבי באורייתא לא הוו יכלין למיקם ולמסבל גלותא וכו' אבל מאן עביד דיסבלון ישראל גלותא דא כל אינון הבטחות דאבטח לון קב\"ה והא אתמר דעאלין לבתי כנסיות ולבתי מדרשות וחמאן כל אינון נחמות וחדאן בלבייהו למסבל כל מה דייתי עלייהו ואלמלא דא לא יכלין למסבל, עכלה\"ק. וע\"כ היה מן הצורך לעשות פועל דמיוני לדורות העתידין כאשר לא יהיה להם משכן ומקדש שיבנו בתי כנסיות ובתי מדרשות.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 72,
      "char_length": 710,
      "timestamp": "2025-02-06T19:18:42.219596"
    },
    {
      "id": "pekudei_p73",
      "text": "ועפ\"י זה תתבאר שייכות האי דרשה המשכן משכן רמז למקדש שנתמשכן ב\"פ בעוונותיהם של ישראל לפרשה זו, דהנה לפי שנרמז כאן שבנה משה בית המדרש מן הנותר מכסף הנדבה, כמו שדרשו ז\"ל מדכתיב משכן העדות, ולכאורה למה הוצרכו להקים ביהמ\"ד אלא כדפירשנו לעשות פועל דמיוני לדורות העתידים שיהיו בגולה ויבנו להם בתי מדרשות, ולכן רמז הכתוב שעתיד המקדש להתמשכן ב\"פ, ומשום כך הקימו משכן לעדות ללמוד תורה לעשות הכנה אל העתיד.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 73,
      "char_length": 395,
      "timestamp": "2025-02-06T19:18:42.565237"
    },
    {
      "id": "pekudei_p74",
      "text": "ובדרך זה יבואר גם שייכות המדרש משכן העדות עדות לישראל שויתר להם הקב\"ה על מעשה העגל שהרי השרה שכינתו ביניהם. דהנה מה שעשו משכן העדות שהוא ביהמ\"ד כדי לעשות פועל דמיוני לדורות העתידים, הרי זה עדות שמחל להם הקב\"ה על מעשה העגל, שהרי גם בבתי כנסיות ובתי מדרשות שעשו ישראל בגולה שרתה השכינה בתוכם וכדאיתא בגמרא (מגילה דף כ\"ט) שהם עתידים להקבע בא\"י וכבר כחנו בדברנו לעיל פ' תרומה שהם עתידים להקבע במקום המקדש ודבר זה בא עדות שמחל להם הקב\"ה על מעשה העגל, שהרי אפילו בזמן החורבן שכינתו שרויה עמנו בגולה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 74,
      "char_length": 493,
      "timestamp": "2025-02-06T19:18:42.759685"
    },
    {
      "id": "pekudei_p75",
      "text": "אלה פקודי המשכן משכן העדות וגו' פירש\"י ז\"ל שכן משכן שני פעמים רמז למקדש שנתמשכן בשני ש נון על עוונותיהן של ישראל הקשו המפורשים מאי שייכא הך דרשא לפרשה זו, דמיירי מחשבון לבן המשכן, ומקומה ראוי להיות בפ' שענינה ציווי עשיית המשכן או בהקמתו.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 75,
      "char_length": 237,
      "timestamp": "2025-02-06T19:18:42.993411"
    },
    {
      "id": "pekudei_p76",
      "text": "ב) במד\"ר ר\"פ זו כך פתח ר' תנחומא בר אבא (משלי כ\"ח) איש אמונות רב ברכות אתה מוצא כל מי שהוא נאמן הקב\"ה מביא ברכות על ידיו מי שאינו נאמן ואץ להעשיר לא ינקה איש אמונות זה משה שהוא נאמנו של הקב\"ה וכו' שכל הדברים שהיה גזבר עליהם היו מתברכים לפי שהוא נאמן ואץ להעשיר לא ינקה זה קרח שהיה לוי ובקש ליטול כהונה גדולה ומה היה סופו (במדבר ט\"ז) ותפתח הארץ את פיה ע\"כ. הקשו המפרשים הלא אין זה דבר והיפוכו, נאמנותו של משה לעומת מה שביקש קרח ליטול כהונה גדולה, כי אינם בסוג אחד כלל, שהרי מה שהתאוה קרח לכהונה גדולה לא למען הרבות לו עושר ונכסים, כי עשיר גדול היה כאמרם ז\"ל (פסחים קי\"ט ע\"א) שנתגלו לו אוצרות שהטמין יוסף במצרים.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 76,
      "char_length": 610,
      "timestamp": "2025-02-06T19:18:43.135931"
    },
    {
      "id": "pekudei_p77",
      "text": "ג) להלן בפרשה וירא משה את כל המלאכה והנה עשו אותה כאשר צוה ה' כן עשו ויברך אותם משה. יל\"ד מה מרבה הכתוב באמרו ,כלי' המלאכה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 77,
      "char_length": 123,
      "timestamp": "2025-02-06T19:18:43.450570"
    },
    {
      "id": "pekudei_p78",
      "text": "ד) בילקוט איתא והנה עשו אותה כאשר צוה ה\"ק והיכן צוה ועשו לי מקדש וגו' ע\"כ. והוא פלא שהרי בכמה פרשיות מבוארים באר היטב כל פרעי מעשי המשכן אשר צוה ה', ומה זו שאלה והיכן צוהו. גם יל\"ד למה מביא ראיה מקרא ועשו לו מקדש דוקא, ולא נקט שאר מקראות המדברות בציווי המשכן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 78,
      "char_length": 259,
      "timestamp": "2025-02-06T19:18:43.554066"
    },
    {
      "id": "pekudei_p79",
      "text": "ה) בילקוט עה\"פ ויברך אותם משה איתא, אמר להם כדרך שזכותם במעשה המשכן תזכו לבנות לכם את בית עולמים שבתוכו עתידה שכינה לשרות שנאמר ועשו לי מקדש ושכנתי בתוכם עכ\"ל. הקשה בזית רענן דהא גם במשכן שרתה השכינה, ותירץ דלא שרתה בקביעות במקום אחד, עכ\"ד. ועדיין קשה שהרי ממה שאמר שבתוכו עתידה שכינה לשרות משמע כי במשכן לא שרתה כלל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 79,
      "char_length": 317,
      "timestamp": "2025-02-06T19:18:43.726316"
    },
    {
      "id": "pekudei_p80",
      "text": "ונראה לבאר הענין עפ\"י מה שכתבנו בפ' ויקהל לפרש הפ' והמלאכה היתה דים וגו' והותר. שהכונה כי לא זכו כל ישראל שיבנה משכן ה' מנדבתם כדאיתא בזה\"ק שצוה הקב\"ה לקחת תרומת המשכן רק מן הצדיקים עובדי ה' בכל לבבם ובכל נפשם. אמנם כיון שלא רצו לבייש את מי שאינו בר הכי, לקחו את כסף התרומה מכל ישראל, ונעשה נס שהספיק לבנין המשכן חלק הצדיקים בני העליה, כו נשתלחה בו ברכה, וחלק שאר המתנדבים בעם נותר, וא\"כ בנו ישראל אשר נשתייר חלקם, ולא נבנה ממנו משכן ה', ודאי חלשה דעתם ונפלה רוחם בקרבם, בראותם כי אין חפץ לה' בתרומתם, ויתעצבו אל לבם לאמר כי און להם חלק במשכן. וכדי להפיס דעתם, צוה הקב\"ה למשה עבדו לעשות מחלק הנדבה שנותר בית המדרש, כדאיתא בילקוט שאמר לו הקב\"ה שיעשה מן הנותר משכן לדברות, וכתבו המפרשים שהכונה שיבנה ביהמ\"ד ללמוד תורה ותהי זאת נחמתם כי גם בית המדרש נקרא מקדש מעט, וכמו שדרשו חז\"ל במס' מגילה ודף כ\"ט ע\"א) עה\"פ ואהי להם למקדש מעט (יחזקאל י\"א) אמר ר' יצחק אלו בתו כנסיות ובתי מדרשות שבבבל. ובתרגום יונתן שם עה\"פ הנ\"ל מתרגם ויהבית להון בתו כנישתא תנין לבית מקדשי. הרי שביהמ\"ד שנו במעלה לביהמ\"ק.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 80,
      "char_length": 988,
      "timestamp": "2025-02-06T19:18:43.908515"
    },
    {
      "id": "pekudei_p81",
      "text": "והנה איתא בגמ' (שם) תניא ר\"א הקפר אומר עתידין בתו כנסיות ובתי מדרשות שבבבל שיקבעו בארץ ישראל שנא' (ירמי' מ\"ו) כו כתבור בהרים וככרמל בים יבא והלא דברים ק\"ו ומה תבור וכרמל שלא באו אלא לפי שעה ללמוד תורה נקבעין בא\"י בתי כנסיות ובתי מדרשות שקורין ומרביצין בהם תורה על אחת כמה וכמה, עכ\"ל. ועי' לעיל בפ' תרומה שהוכחנו שם כו מה שאמרו בגמרא שהבתו כנסיות ובתי מדרשות יקבעו בא\"י היינו שיקבעו בירושלים במקום המקדש. וכן מפורש במהרש\"א על הגמ' הנ\"ל שפירש מאמר דוד המלך ע\"ה (תהלים קכ\"ב) שמחתי באומרים לי בית ה' נלך עומדות היו רגלינו בשעריך ירושלים ירושלים הבנויה כעיר שחוברה לה יחדיו. עפ\"י מה שאמרו במדרש לעתיד יהיה ביהמ\"ק גדול כירושלים שבעולם הזה וכו'. וע\"ז אמר מה טעם יהיה ביהמ\"ק לעתיד כ\"כ גדול, לפי שבירושלים הבנויה לעתיד יהיה חוברה לה למקדש יחדיו כל מקומות של בתו כנסיות שהיו בעוה\"ז, ונמצא עתה בגלות שאני עומד בביהכנ\"ס הרי הוא מקום המקדש גופיה דלעתיד, עכ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 81,
      "char_length": 846,
      "timestamp": "2025-02-06T19:18:44.400109"
    },
    {
      "id": "pekudei_p82",
      "text": "חרי מפורש יוצא מדבריו כי בתי הכנסיות ובתי המדרשות שבגלות עתידין להקבע במקום המקדש גופיה, וא\"כ זאת נחמתם של המתנדבים אשר לא זכו שיבנה המשכן מנדבתם, שנבנה מנדבתם משכן העדות שהוא ביהמ\"ד, אשר לעתיד יקבע במקום המקדש בירושלים, כי מי לנו גדול מבית מדרשו של משה אשר ודאי יקבע לעתיד בביהמ\"ק, והיה זאת להם למשיב נפש ונחה דעתם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 82,
      "char_length": 316,
      "timestamp": "2025-02-06T19:18:44.807721"
    },
    {
      "id": "pekudei_p83",
      "text": "ועפ\"י זה שפיר מיושב מה שהקשו דמה שייך להכא הרמז למקדש שעתיד להתמשכן ב\"פ בעונותיהם של ישראל, כו ע\"י שנתן משה חשבון נדבת המשכן, נתגלה לישראל שנותר מן הנדבה, ונפלה רוחם בקרבם שלא זכו שיבנה המשכן מנדבתם, והוצרך משה לנחמם במה שנבנה בית המדרש מחלקם, והנחמה הוא שעתיד ביהמ\"ד להקבע בביהמ\"ק לעתיד, וא\"כ גם להם חלק במקדש ה'. ולכן הוצרך להודיעם כי עתידים ב' המקדשות להחרב ובבית השלישי שיעמוד לעד יזכו שיקבע גם הביהמ\"ד אשר נבנה מנדבותיהם. ויתיישב שפיר גם מה שהקשה בזית רענן על הילקוט (אות ה) שבירך אותם משה תזכו לבנות בית עולמים שבתוכו עתידה שכינה לשרות. והקשה דהא גם במשכן שרתה השכינה, ולדברינו י\"ל כי נתכוין בברכתו כלפי אותם שלא זכו שיבנה המשכן מחלקם, אלא שבנו מנדבתם ביהמ\"ד, ושם לא היתה השראת השכינה בבחינה כזו שהיתה במשכן, ע\"כ בירך אותם כשם שזכותם במעשה המשכן, וכונתו על משכן העדות שהוא ביהמ\"ד אשר נבנה ממותר הנדבה, כן תזכו לבנות ביהמ\"ק שבתוכו עתידה שכינה לשרות, כי עתיד בית המדרש שנבנה מנדבתם להקבע בבית המקדש, ושם תהיה השראת השכינה בבחינתה הגבוהה ביותר.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 83,
      "char_length": 947,
      "timestamp": "2025-02-06T19:18:45.001363"
    },
    {
      "id": "pekudei_p84",
      "text": "וכדי לישב שאר הקושיות (אות ג ד) נקדים דברי הרמב\"ם ז\"ל בהלכות בית הבחירה (פ\"א ה\"א) וז\"ל מצות עשה לעשות בית לה' מוכן להיות מקריבים בו הקרבנות וחוגגין אליו שלש פעמים בשנה שנא' ועשו לי מקדש עכ\"ל. וכתב הכסף משנה אע\"ג דההיא פרשה במשכן שבמדבר מיירי משמע דהאי קרא כלל הוא לכל מקום בין למשכן שבמדבר בין לשילה ונוב וגבעון ובית עולמים ודייקא נמי דקאמר ועשו לי מקדש ולא קאמר ועשו לי משכן עכ\"ל. (ועי' באוה\"ח הקדוש פ' תרומה עה\"פ ככל אשר אני מראה אותך מ\"ש בזה). ועפ\"י זה י\"ל מה שדקדקנו ואות ג') דמה מרבה קרא בתיבת כל\" המלאכה, כי אתו לרבות גם את ביהמ\"ד אשר בנו ממה שנשתייר מנדבותיהם וע\"ז שפיר מתמה המדרש ועי' אות ד') והיכן נצטוו כונתו היכן נצטוו על בנין ביהמ\"ד הנרמז בתיבת כלא המלאכה אשר צוה ה' כו לא נמצא ע\"ז ציווי מפורש כמ\"ש היפ\"ת. וע\"ז משיב שפיר דכתיב ועשו לי מקדש, שהיא מ\"ע כוללת כל הזמנים, ונכלל בה גם ביהמ\"ק העתיד הנצחי אשר בו יקבע גם ביהמ\"ד שנבנה ממה שנשתייר מנדבת המשכן, וא\"כ שפיר מצינו שצוה ה' על בנית בית המדרש, שהרי בכלל ציווי ועשו לי מקדש הוא. וא\"ש דלא יכול להביא ראיה מכל הפרשיות המדברות בבנין המשכן, שהרי הוה קשה ליה היכן מצינו שנצטוו על בנין ביהמ\"ד וזאת לא נכלל אלא במצות ועשו לי מקדש.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 84,
      "char_length": 1084,
      "timestamp": "2025-02-06T19:18:45.512618"
    },
    {
      "id": "pekudei_p85",
      "text": "וארשת שפתינו תערב לישב מה שקשה ע\"ד הזוהר הקדוש פ' ויקהל שכתב כי פ' תרומה נאמרה קודם חטא העגל ע\"כ כתיב בה ויקחו לי תרומה מאת כל איש לרבות הע\"ר, משא\"כ פ' ויקהל נאמרה אחר חטא העגל לכן כתיב בה קחו מאתכם תרומה לה' למעט הערב רב מנתינה על אשר עשו את העגל. וקשה שא\"כ ח\"ו לא נתקיים דבור הקב\"ה הכתוב בפ' תרומה, שהרי שם כתיב מאת כל איש לרבות הע\"ר, ובסופו של דבר לא לקחו מאתם, וא\"כ למה אמר הקב\"ה דבר אשר לא יתקיים, והלא הוא המביט מראשית אחרית וגלוי לפניו שעתידין לקלקל בעגל וביותר קשה שנכתב בתוה\"ק דבר אשר לא היה לעולמים (עי' בפ' תרומה הארכנו בכמה פנים בישוב דברי הזוה\"ק). אמנם לדברנו י\"ל כי אף שלא נטלו מן הערב רב נדבה למשכן על אשר עשו את העגל, אבל לבנין משכן העדות שהוא בית המדרש גם הערב רב נתנו חלקם, שהרי סוף סוף גם הם היו שומרי תורה ומצות, ועמדו רגליהם במעמד הנבחר וענו ואמרו נעשה ונשמע, אלא שטעו בעגל, אבל עתידים הם להתברר לעתיד, וחלק הטוב שבהם יהיה לו תיקון.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 85,
      "char_length": 853,
      "timestamp": "2025-02-06T19:18:46.050697"
    },
    {
      "id": "pekudei_p86",
      "text": "ועפ\"י הנחה זו שגם הם נתנו חלקם לבנין בית המדרש, יעלה ארוכה למה שקשה על דברי הזוה\"ק הנ\"ל, כי ח\"ו לא שב דברו יתברך ריקם, שהרי מה שצוה הקב\"ה ויקחו לי תרומה מאת שכל איש' הנאמר בפ' תרומה, קאי גם אדסמיך ליה שהיא מצות ועשו לי מקדש, שהוא ציווי כולל כל הזמנים כמ\"ש הרמב\"ם ז\"ל, ועלי' קאי ציווי השי\"ת שיקחו מאת כל איש והערב רב בכלל, ואמנם נתקיים ציווי זה במה שנתנו גם הע\"ר נדבתם, ונבנה ממנו משכן העדות שהוא ביהמ\"ד, אשר הוא עתיד לעלות ולהקבע בבית המקדש העתיד, ונתקיימה בכך מצות ועשו לו מקדש שנכלל בו גם בנין העתיד. אמנם בפרשת ויקהל שהיא מצוה פרטית לקחת נדבה למשכן שעשו ישראל במדבר, אמר הכתוב קחו מאתכם דייקא למעט את הערב רב, שאינם בכלל נתינה למשכן, לפי שחטאו והחטיאו את ישראל במעשה העגל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 86,
      "char_length": 675,
      "timestamp": "2025-02-06T19:18:46.471355"
    },
    {
      "id": "pekudei_p87",
      "text": "נחזור על הראשונות לישב המדרש הנ\"ל (עיין קושיא ב) איש אמונות זה משה וכו' ורב ברכות שכל הדברים שהיה גזבר עליהם היו מתברכים לפי שהוא נאמן ואץ להעשיר זה קרח וכו' שביקש ליטול כהונה לעצמו. וקשה שאין נאמנות של משה היפך ממה שאץ קרח להעשיר ואינם בסוג אחד כלל. אמנם הדבר מובן היטב, עפ\"י מה שביארנו כי משרע\"ה הוצרך לנחם את בני ישראל אשר לא זכו שיבנה המשכן מחלקם, ודבר על לבם כי בבא הגאולה העתידה ויבנה הבית השלישי יזכו גם המה לקחת חלק בו, שהרי משכן העדות שהוא ביהמ\"ד שנבנה מנדבתם עתיד להקבע במקדש ה' ועד שיגיע אותו זמן עליהם להתאזר עוזו ולקבל על עצמם עול מלכות שמים ועול הגלות באהבה, ולא ידחקו את הקץ בפעולות שונות, רק ישבו ויצפו לישועת ה\"נ עדי ירא ה' בעני עמו ויגאלנו גאולת עולמים, וזה היה היפך דרכו של קרח כידוע מ\"ש האר\"י ז\"ל שקרח צפה שלעתיד יהיו הלויים כהנים וישמש הוא בכהונה גדולה, על כן רצה לדחוק את הקץ כדי שיהי' הוא כה\"ג כאשר יהי' לעתיד.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 87,
      "char_length": 833,
      "timestamp": "2025-02-06T19:18:46.805206"
    },
    {
      "id": "pekudei_p88",
      "text": "וזאת אפ\"ל בכוונת המדרש איש אמונות רב ברכות זה משה שכל הדברים שהיה גזבר עליהם היו מתברכים. פירוש שנתברכה נדבת המשכן ונותר חלק העם שלא זכו שיבנה המשכן מחלקם, והיתה נפשם מרה עליהם על אשר לא זכו לתת נדבה למשכן, והוצרך משה לפייסם, והשריש בלבם כח האמונה, להאמין ולצפות לישועת ה\"נ ואזי יזכו גם הם לקחת חלק בבנין משכן העתיד, כי יקבע ביהמ\"ד אשר נבנה מנדבתם בביהמ\"ק. וז\"ש המדרש איש אמונות זה משה, שהורה דרך האמונה לבני ישראל, ואץ להעשיר זה קרח שאץ ברגליו לדחוק את הקץ, ומה היה סופו וכו'. ומיושב שפיר דהוי דבר והיפוכו כי שועת קרח היתה לדחוק את הקץ, ומשרע\"ה השריש אמונה בלבות בני ישראל לחכות לקץ אחרית הימים.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 88,
      "char_length": 596,
      "timestamp": "2025-02-06T19:18:47.212884"
    },
    {
      "id": "pekudei_p89",
      "text": "אלה פקודי המשכן משכן העדות וגו' פרש\"י המשכן משכן שני פעמים רמז למקדש שנתמשכן בשני חורבנין על עוונותיהן של ישראל, משכן העדות, עדות לישראל שויתר להם הקב\"ה על מעשה העגל שהרי השרה שכינתו ביניהם. ובילקוט כאן איתא אייר ישמעאל זה סימן לכל באי עולם שאין סליחה אלא לישראל בלבד שנא' משכן העדות עדות הוא לכל באי עולם שהקב\"ה נתרצה לישראל, ע\"כ. הקשו המפרשים למה רמז הכתוב דרשות אלו בפ' זו דמיירי מחשבון נדבת המשכן, ומקומם ראוי להיות במקום שהכתוב מדבר בציווי עשיית המשכן או בהקמתו.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 89,
      "char_length": 467,
      "timestamp": "2025-02-06T19:18:47.512278"
    },
    {
      "id": "pekudei_p90",
      "text": "ב) בזוה\"ק (פקודי דף ר\"כ ע\"א) אלה פקודי המשכן וגו' ר' יוסי פתח (תהלים לא) מה רב טובך אשר צפנת לוריאך פעלת לחוסים בך נגד בני אדם. וצ\"ב להבין שייכות האי קרא להכא.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 90,
      "char_length": 159,
      "timestamp": "2025-02-06T19:18:47.735669"
    },
    {
      "id": "pekudei_p91",
      "text": "ג) בספר חוט המשולש הביא מדרש אלה פקודי המשכן משכן העדות זה שאמר דוד מלך ישראל (תהלים פ\"ו) עשה עמיו אות לטובה ויראו שונאי ויבושו כמד\"א וישם ה' לקין אות (בראשית ד'). והוא פלא מה שייכות כל זה לכאן. וגם מה ענין אות קון לתפלת דוד המלך ע\"ה עשה עמי אות לטובה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 91,
      "char_length": 252,
      "timestamp": "2025-02-06T19:18:47.866803"
    },
    {
      "id": "pekudei_p92",
      "text": "ונראה לפרש עפ\"י מה דאיתא בגמרא (שבת ל' ע\"א) אר\"י א\"ר מאי דכתיב עשה עמו אות לטובה וגו' אמר דוד לפני הקב\"ה רבש\"ע מחול לו על אותו עון (פירש\"י דבת שבע) א\"ל מחול לך א\"ל עשה עמי אות בחיי א\"ל בחייך איני מודיע בחיי שלמה בנך אני מודיע כשבנה שלמה את ביהמ\"ק ביקש להכניס ארון לבית קה\"ק דבקו שערים זה בזה וכו' כיון שאמר (דה\"י ב' ו') ה' אלקים אל תשב פני משיחך זכרה לחסדי דוד עבדך מיד נענה באותה שעה נהפכו פני כל שונאי דוד כשולי קדירה וידעו כל העם וכל ישראל שמחל לו הקב\"ה על אותו עון, עכ\"ל הגמרא. והנה יש להפליא על מה שביקש דוד שיתן לו הקב\"ה אות שידעו כל העם שמחל לו על אותו עון, והלא דוד המלך ע\"ה ודאי קיים בעצמו והצנע לכת עם ה' אלקיך, וא\"כ מה לו לבקש שיתן הקב\"ה אות כדי שידעו כולם, ולמה לא הספיק לו מה שהקב\"ה אמר לו מחול לך.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 92,
      "char_length": 711,
      "timestamp": "2025-02-06T19:18:48.023672"
    },
    {
      "id": "pekudei_p93",
      "text": "אמנם נ\"ל עפ\"י מה שאמרו ז\"ל (ע\"ז ד' ע\"ב) לא היה דוד ראוי לאותו מעשה אלא להורות תשובה ליחיד, ע\"כ. והנה דוד המלך ע\"ה היה לבו מר עליו ורוחו נשברה על אשר בא לידי חטא נגד השי\"ת, אמנם נחמה היתה לו כו ע\"ו חטאו הורה דרך התשובה לכלל ישראל, וא\"כ התינח אם יעשה עמו הקב\"ה לטובה אות, ויודע לכל ישראל שמחל לו הקב\"ה, הוי שפיר אות לבעלי תשובה, כו יראו שתשובת דוד המלך ע\"ה נתקבלה לפני כסא כבודו יתברך, וזה לך האות, וממנו ילמדו וכן יעשו לחזור בתשובה, כי ידעו שתשובה מועלת לכפר עון ולמחות פשע, אבל אם לא יעשה עמו הקדוש ברוך הוא אות לטובה, כי תשובתו נתקבלה, א\"כ במה יתנחם על אשר חטא, והרי לא יצא ממעשהו תועלת להורות תשובה ליחיד, כי יאמרו מנא ידעינן שתשובתו לפני כסא הכבוד נתקבלה, ע\"כ התפלל דוד לפני הקב\"ה עשה עמי אות לטובה וגו', וידעו הכל שמחל לי הקב\"ה, ויורה דרך לבעלי תשובה, ומה שלא נתן הקב\"ה אות בחייו, אפ\"ל ע\"ד שאמרו חז\"ל (תנחומא פ' תולדות ז) אין הקב\"ה מיחד שמו על הצדיקים בחייהם משום שנאמר (איוב ד) הן בעבדיו לא יאמין ובמלאכיו ישים תהלה, וכמו כן לא רצה הקב\"ה לתת אות לדוד בחייו כל זמן שהוא בעל בחירה עדיין, הגם שהקב\"ה יש לו ידיעה מתחלה ועד סוף אם יעמוד האדם בצדקו, אעפי\"כ הבחירה הוא ביד האדם כידוע מדברי הרמב\"ם ז\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 93,
      "char_length": 1099,
      "timestamp": "2025-02-06T19:18:48.386386"
    },
    {
      "id": "pekudei_p94",
      "text": "והנה איתא במד\"ר (בראשית פכ\"ב כ\"ז) וישם ה' לקין אות ר' חנין אמר עשאו אות לבעלי תשובה וכו' ושם (אות כ\"ח) ויצא קין מלפני ה' מהיכן יצא וכו' ר' חמא בשם רבו חנינא בר רב יצחק אמר וצא שמח וכו' פגע בו אדם הראשון א\"ל מה נעשה בדינך א\"ל עשיתי תשובה ונתפשרתי התחיל אדה\"ר מטפח על פניו אמר כך היא כחה של תשובה וכו' עכ\"ל. ועפי\"ז יובן מה שמדמה המדרש הנ\"ל (אות ג') אות קון למה שהתפלל המלך דוד ע\"ה עשה עמי אות לטובה כי גם קין היה אות לבעלי תשובה, הגם דלא דמיא לגמרי כי תשובת קין לא היתה שלמה, וגם לא נמחל לו לגמרי, אלא נתלה לו עד שבעה דורות, ותשובת דוד המלך ע\"ה היתה שלמה, וע\"י התשובה עלה מעלות רמות יותר, מ\"מ בזה הם דומים ששניהם נעשו אות לבעלי תשובה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 94,
      "char_length": 632,
      "timestamp": "2025-02-06T19:18:48.925396"
    },
    {
      "id": "pekudei_p95",
      "text": "והנה אמרו ז\"ל בעבודה זרה (שם) לא היו ישראל ראוים לאותו מעשה (חטא העגל) אלא להורות תשובה לרבים. נמצא כי גם לישראל הוצרך הקב\"ה לתת אות לטובה שמחל להם, כדי שמהם ילמדו כי מועילה תשובה לחטא הרבים, וכמבואר במד\"ר פ' זו פנ\"ב ג') שאמרו הגוים באותה שעה שעשו ישראל העגל אין הקב\"ה מתרצה להם עוד כיון שהלך משה לבקש רחמים עליהם מיד סלח להם הקב\"ה וכו' אמר משה רבון העולמים הריני מפוייס שסלחת לישראל אלא הודיע לעיני האומות שאין בלבך עליהם א\"ל הקב\"ה חייך הריני משרה שכינתי בתוכם שנאמר (שמות כ\"ה) ועשו לי מקדש וגו' ומכירים שמחלתי להם וכו' ע\"כ.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 95,
      "char_length": 525,
      "timestamp": "2025-02-06T19:18:49.276554"
    },
    {
      "id": "pekudei_p96",
      "text": "ועפי\"ז מובן היטב המדרש (קושיא ג') המובא בחוט המשולש אלה פקודי המשכן משכן העדות ז\"ש דוד המלך ישראל עשה עמי אות לטובה וגו' כמד\"א וישם ה' לקין אות, שהרי דרשו חז\"ל משכן העדות, עדות לישראל שויתר להם הקב\"ה על עון העגל שהרי השרה שכינתו ביניהם, ואות הוא לכל העולם שתשובת הרבים מועלת, וזהו שאמר דוד מלך ישראל עשה עמו אות לטובה, כי גם בקשת דוד שיתן לו השי\"ת לטובה אות למען ילמדו ממנו בעלי תשובה, ע\"י שיראו שנתקבלה תשובתו, ומסיים המדרש כמד\"א וישם ה' לקין אות, כי גם הוא היה אות לבעלי תשובה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 96,
      "char_length": 479,
      "timestamp": "2025-02-06T19:18:49.551040"
    },
    {
      "id": "pekudei_p97",
      "text": "וכדי לבא לביאור המדרשים והזה\"ק הנ\"ל נקדים מה דאיתא במדרש הובא בבעהיתוס רוש פ' דברים. זש\"ה מוכיח אדם אחרי חן ימצא ממחליק לשון (משלי כ\"ח) מוכיח אדם זה משה שהוכיח את ישראל וכו' ומפני שהוכיחן מצא חן וכו' ממחליק לשון זה בלעם שדבר להם חלקלקות ואמר מה טובו הליך יעקב משל דמשה ובלעם למה הדבר דומה א מלך שיש לו שני שרים אחד אוהבו ואחד שונאו האוהב אומר לו בנו הזהר שלא תעשה עבירה שאביך מלך ודיין ואם ישמע לא יחוס עליך אלא יהרגך, והשונא אומר עשה כל תאות לבך כי המלך אביך ואינך ירא משום דבר כך משה האוהב אמר לישראל (דברים י\"א) השמרו לכם פן יפתה לבבכם וכתיב וחרה אף ה' בכם, אבל בלעם השונא אמר להם (במדבר כ\"ד) מה טובו אוהליך יעקב עשו כל תאות לבבכם כי לאומות עושה כל הרעה שגזר עליהם וכו' אבל בכם שאתם בניו אם גזר רעה ההוא אמר ולא יעשה ודבר ולא יקימנה וכו' עכ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 97,
      "char_length": 746,
      "timestamp": "2025-02-06T19:18:49.789638"
    },
    {
      "id": "pekudei_p98",
      "text": "והנה לפי דעת אומות העולם שאף אם ישראל חוטאים לפני הקב\"ה אינו מענישם, כמו שאמר בלעם, א\"כ אין ראיה ממה שהשרה הקב\"ה שכינתו במשכן, שמחל להם הקב\"ה על מעשה העגל ע\"י שעשו תשובה, שהרי אפשר שלא חזרו בתשובה ולא נמחל להם חטאם, ואעפ\"כ משרה שכינתו בתוכם דכיון שישראל בנים למקום אינו מענישם על חטאיהם. אמנם ממה שנחרב ביהמ\"ק זה פעמיים בעוונות ישראל, נראה בעליל כי אף בישראל כך היא המדה, שאם הם חוטאים ח\"ו הוא מסלק שכינתו מהם, וא\"כ חורבן ביהמ\"ק הוא תשובה ניצחת לדברי אוה\"ע שלא מחל הקב\"ה לישראל על מעשה העגל, שהרי ק\"ו הוא ומה אם סילק שכינתו מביניהם ונחרב הבית בעונותיהם, כ\"ש שלא היה משרה שכינתו עליהם במשכן אילולא נמחל עון העגל. ועפי\"ז יובן שפיר פי' הפ' אלה פקודי המשכן וגו' ושייכות ב' הדרשות שהביא רשיז\"ל להדדי, וה\"פ אלה פקודי המשכן משכן וגו' כמ\"ש רש\"י ז\"ל שנתמשכן ב\"פ בעוונות ישראל. וא\"כ זאת היא העדות לישראל אשר מחל להם הקב\"ה על מעשה העגל, שהרי השרה שכינתו ביניהם: וזה לך האות, שהרי חרב ביהמ\"ק ב' פעמים בעוונותיהס.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 98,
      "char_length": 900,
      "timestamp": "2025-02-06T19:18:50.237857"
    },
    {
      "id": "pekudei_p99",
      "text": "אמנם ישראל עדיין לא נחה דעתם, ופחדו פחד פן ואולי לא נמחל להם עדיין עון העגל, ולא שקטה רוחם עד שנתן להם משרע\"ה חשבון נדבת המשכן, דהנה איתא במד\"ר (פנ\"א ד') ולמה אמר להם משה בואו ונעסוק במשכן ונחשוב לפנים אלא ששמע משה ליצני ישראל מדברים מאחריו ש רבי חמא אמר היו אומרים חמי קדל דבריה דעמרם (פי' אחד אמר לחבירו בא וראה צוארו של בן עמרם כמה הוא שמן כל זה הוא ממה שלקח משלנו) וחבירו אמר לו אדם ששלט על מלאכת המשכן אין אתה מבקש שיהיה עשיר (ויפה עושה שלוקח משלנו, בין כך ובין כך האמינו שניהם שלקח משלהם), כששמע משה כך א\"ל משה חייכם נגמר המשכן אתן לכם חשבון א\"ל בואו ונעשה חשבון הוי אלה פקודי המשכן משכן העדות. והמדרש הזה הוא פלאי איך עלתה על דעתם לחשוד את משרע\"ה איש האלקים, אשר היה מופשט לגמרי מגשמיות, ששלח ידו בכספי נדבת המשכן למעול בהם מעלו ומה גם כי משרע\"ה עשיר גדול היהי ולא הוצרך לכספם, כאומרם ז\"ל (ירושלמי שקלים פ\"ה ה\"ב) א\"ר חנין מחצב של אבנים טובות ומרגליות ברא לו הקב\"ה מתוך אהלו וממנו העשיר משה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 99,
      "char_length": 897,
      "timestamp": "2025-02-06T19:18:50.655224"
    },
    {
      "id": "pekudei_p100",
      "text": "אמנם נראה להסביר ענין חשדם דהנה ידוע מה שהקשה בישמח משה ופ' תרומה) למה צוה ה' שיתנו ישראל נדבתם למשכן הלא לי הכסף ולי הזהב אמר ה' (חגי ב'), וכמו שגילה הקב\"ה למשה מחצב אבנים טובות ומרגליות בתוך אהלו לצורך הלוחות כמו כן היה יכול לגלות לו לצורך המשכן. ונ\"ל כי רצה הקב\"ה שיהי' לישראל חלק בבנין המשכן כדי שיתכפר להם עון העגל, ועדות לישראל שמחל להם הקב\"ה הוא שהשרה שכינתו במשכן, שנבנה מנדבת ישראל ואילו היה המשכן נבנה מדבר הבא מן השמים, לא היה בנינו כפרה לישראל על חטאם, ואף אם היתה עליו השראת השכינה, און בכך ראיה שנמחל להם עון העגל, שהרי י\"ל שמשום שנבנה מממון גבוה שורה בו השכינה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 100,
      "char_length": 576,
      "timestamp": "2025-02-06T19:18:51.100003"
    },
    {
      "id": "pekudei_p101",
      "text": "ובזה יונח לנו מה דאיתא במדרש הנ\"ל שחשדו ישראל את משרע\"ה שהעשיר מכספי נדבתם דהנה בנו ישראל היו נשברי לב ודכאי רוח על אשר עשו את העגל, ומורא עלה על ראשם פן לא מחל להם הקב\"ה על אותו עון. ואף גם כאשר ראו כו שרתה השכינה במשכן לא נחה דעתם, וחרדה גדולה היתה בעם פן נבנה המשכן מממון גבוה שנתגלה למשה בדרך נס, ועל כן שורה עליו השכינה, ומה שלקח מהם משה את כסף נדבתם הוא רק כדי שיחשבו כי נבנה המשכן מנדבתם, ולקח הממון לעצמו, למען לא ירגישו בכך שלא נבנה המשכן מנדבתם, ולהפיס דעתם הוא עושה. וכדי להוציא מלבם חשד זה נתן להם משרע\"ה חשבון מדוקדק מכל פרט ופרט, ונגלה למו כי אמת הדבר שנבנה המשכן מנדבתם, ובזה שקעה רוחם, שהרי ראיה ברורה יש שמחל להם הקב\"ה על אותו עון. שהשרה שכינתו על המשכן אשר נבנה מנדבותיהם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 101,
      "char_length": 690,
      "timestamp": "2025-02-06T19:18:51.392841"
    },
    {
      "id": "pekudei_p102",
      "text": "ועפי\"ז מיושב מה שדקדקנו בפתח דברינו, דמה שייכי הני דרשות שהביא רש\"י ז\"ל משכן שנתמשכן ב\"פ, ושהוא עדות לישראל שמחל להם הקב\"ה על עון העגל להאי פרשה שענינה חשבון נדבת המשכן, דשפיר שייכי להכא, שהרי ממה שנתן להם משה חשבון מדוקדק האמינו שנעשה המשכן מנדבתם, וע\"י כך נודע לישראל שמחל להם הקב\"ה על אותו עון, וזה להם לאות שהרי השרה שכינתו על המשכן הנבנה מנדבותיהם, ואילו לא נמחל להם ח\"ו על אותו עון לא היה הקב\"ה משרה שכינתו בתוכם מק\"ו ומה שסילק שכינתו מביניהם מחמת חטאם, ונחרב הבית פעמיים בעונם, כ\"ש שלא היה משרה שכינתו בתוכם אילולא נמחל להם על אותו עון.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 102,
      "char_length": 543,
      "timestamp": "2025-02-06T19:18:51.749521"
    },
    {
      "id": "pekudei_p103",
      "text": "וז\"פ הפסוק אלה פקודי המשכן וגו', פי' כי ע\"י שנתן להם משה חשבון מדוקדק על מלאכת המשכן, ונודע להם כי נבנה המשכן מנדבותיהם, משכן העדות זאת היא עדות לישראל שמחל להם הקב\"ה על עון העגל, שהרי השרה שכינתו על המשכן שנבנה מנדבותיהם, ואילולא שמחל להם על אותו עון לא היה משרה שכינתו בתוכם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 103,
      "char_length": 277,
      "timestamp": "2025-02-06T19:18:52.028245"
    },
    {
      "id": "pekudei_p104",
      "text": "ועתה נבא לבאר דברי הזה\"ק הנ\"ל ואות ג') ר' יוסי פתח מה רב טובך וגו', דהנה בספר אבן יחיא בפירושו לדניאל ופרק ח') איתא וז\"ל, כי בסוף החמשת אלפים ושבע מאות שנה לבריאת העולם אם מעט קודם או מעט אח\"כ יבא קיצנו בעזרת ה' למען יוכלו לשבת בנ\"י בטח על אדמתם כשלש מאות שנה מהאלף הששי למען יתראה לעין כל היות האמת אתם וכו' ואותו הטוב הגופני מהעוה\"ז אשר ינתן להם בסוף אלף הששי, הוא לאות ומופת שהם בני עליה, ויראו כל העולם ויושבי תבל סכלותם מקדם ומעלת ישראל וישערו מטובם הגופני הטוב הרוחני אשר ירשו בני הגלות אחר המות ולנצח נצחים וכו' ע\"כ. עיי\"ש שעושה חשבון על פי סוד.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 104,
      "char_length": 552,
      "timestamp": "2025-02-06T19:18:52.195330"
    },
    {
      "id": "pekudei_p105",
      "text": "ועפ\"י דבריו פירשתי הכתוב הנ\"ל מה רב טובך אשר צפנת ליראיך וגו', דקאי על העולם הנצחי אשר הוא צפון ועמון מעין חי, ומוכן הוא ועומד ליראי ה' לעת\"ל, ומסיים קרא פעלת לחוסים בך ר\"ל מה שפעלת לתת הטוב לבני ישראל החוסים בך בסוף האלף הששי בעוה\"ז הוא נגד בני אדס\"צג דהיינו העכו\"ם המכונים בני אדם, ולא אדם, כמו שכתבו התוס' (ביבמות ס\"א ע\"א) ועל כן הועיד ה' את העוב ההוא באחרית הימים לכל החוסים בו, למען יכירו העכו\"ם סכלותם וגודל מעלת ישראל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 105,
      "char_length": 425,
      "timestamp": "2025-02-06T19:18:52.485417"
    },
    {
      "id": "pekudei_p106",
      "text": "ועפ\"י דברינו יל\"פ שייכות הכתוב מה רב טובך אשר צפנת ליראיך וגו' לפרשת פקודי המשכן כדאיתא בזה\"ק, דהנה איתא במדרש רבה פ' זו שבקש משה שיודיע ה' לעיני כל האומות שמחל לישראל, א\"ל הקב\"ה חייך הריני משרה שכינתי בתוכם ומכירין שמחלתו להם שנאמר משכן העדות וכו', עכ\"ד המדרש ולכאורה מה צורך יש בדבר שיכירו האומות שנמחל לישראל על מעשי העגל, וצ\"ל שהטעם כו ע\"י שיראו האומות גודל מעלת ישראל שנתרצה להם המקום יתרבה כבוד שמים בעולם. והשתא מובן שפיר שייכות הפסוק מה רב טובך וגו' דקאי על הטוב שיטיב ה' לעמו באחרית הימים לפרשת פקודי המשכן, שהרי תרווייהו בחד ענינא מיירי, וכשם שבהקמת המשכן השרה הקב\"ה שכינתו בתוכו כדי שיכירו וידעו כל יושבי תבל כי נתרצה הקב\"ה לישראל ונתרבה כבוד שמים בעולם, כן יתן ה' באחרית הימים רב טוב לבית ישראל למען יכירו וידעו הגוים הטוב הצפון לנו לעוה\"ב, ויתגדל ויתקדש שמו הגדול בעולם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 106,
      "char_length": 783,
      "timestamp": "2025-02-06T19:18:52.712250"
    },
    {
      "id": "pekudei_p107",
      "text": "ואגב דאיירינן לעיל במאמר הילקוט אמר ר' ישמעאל זה סימן לכל באו עולם שאין סליחה אלא לישראל בלבד וכו' ע\"כ. נראה לפרש עפ\"י דבריו את המדרש פליאה הים ראה וינוס מה ראה ברייתא דר' ישמעאל ראה, בהקדם מ\"ש הפרשת דרכים (דרך מצרים דרוש ד') על מה דאיתא במדרש (שמות רבה פ\"ג ה') ששאל משה מהקב\"ה מה זכות יש בידי להוציאם, א\"ל הקב\"ה מה שאמרת באיזה זכות אוציאם ממצרים הוי יודע שבזכות התורה שהם עתידים לקבל וכו', והקשה שדברי המדרש סותרים עצמם מיניה וביה דלהלן כתב המדרש ושם פ\"ג ג') כשהיו ישראל במצרים ראה הקדוש ברוך הוא מה שעתידין ישראל לעשות הה\"ד ויאמר ה' ראה ראיתי וכו' אני רואה אותן מקבלין תורתי זהו ראה, ראיתי זו ראיית מעשה העגל וכו' אעפ\"כ איני דנם לפי המעשים העתידים לעשות אלא לפי הענין דהשתא וכו' ע\"כ, ותירץ כי לטובה הקב\"ה דן את האדם ע\"ש העתיד וע\"כ נחשב להם זכות שעתידין לקבל את התורה אבל לרעה אינו דן ע\"ש העתיד כי אם באשר הוא שם, וע\"כ לא דנם הקב\"ה על העגל שעתידים לעשות.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 107,
      "char_length": 855,
      "timestamp": "2025-02-06T19:18:53.057142"
    },
    {
      "id": "pekudei_p108",
      "text": "ולי נראה לומר שאין מדברי המדרש ראיה כלל לומר שאין הקב\"ה דן את האדם לרעה ע\"ש העתיד, ומה שלא חשב להם הקב\"ה את מעשה העגל שעתידין לעשות הוא משום שחטא העגל נמחל להם בעשיית המשכן, וא\"כ כשהוא. מביע על העתיד שעתידין לחטוא מסתכל גם שעתידין לחזור בתשובה שלימה על עוונותיהם ויתהפכו להם הזדונות לזכיות אבל התורה שקבלו ישראל במדבר היא נצחית וקיימת לעד, על כן הביט הקב\"ה על זכות התורה שהם עתידין לקבל, וגאל אותם מעבדות לחרות. והנה איתא במדרש ילקוט פ' בשלח עה\"פ והמים להם חומה, כי כשעמדו ישראל על הים ירד ס\"מ ואמר לפניו רבש\"ע לא עבדו ישראל ע\"ז במצרים ואתה עושה להם נסים והיה משמיע קולו לשר של ים ונתמלא עליהם חמה וביקש לטבען מיד השיב לו הקב\"ה שועה שבעולם וכו לדעתם עבדוה והלא לא עבדוה אלא מתוך שיעבוד ומתוך טירוף הדעת ואתה דן שוגג כמזיד ואונס כרצון וכו' ולכאורה אם דנים גם לרעה ע\"ש העתיד א\"כ עדיין טענה בפי שר של ים שהרי עתידין ישראל לעבוד את העגל ושם לא היה באונס שהרי היו ברום המעלות וא\"כ למה נקרע הים לפניהם, ולפי דברינו יובן כיון שחטא העגל אינו נצחי שהרי נתכפר להם לבסוף אין הקב\"ה דן את האדם ע\"ש העתיד, וז\"פ המדרש הים ראה וינוס מה ראה כלומר דהרי הם עתידים לעשות העגל בזמן שלא היו שוגגים או אנוסים ולמה נקרע הים לפניהם ומתרץ המדרש ברייתא דר' ישמעאל ראה הם דברי ר' ישמעאל הנ\"ל שאמר כי המשכן הוא אות לבאי עולם שהקב\"ה מחל לישראל על מעשה העגל, וא\"כ כיון שהחטא אינו נצחי אין הקב\"ה דן בו את האדם ע\"ש העתיד, וע\"כ נקרע הים לפניהם והבן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 108,
      "char_length": 1315,
      "timestamp": "2025-02-06T19:18:53.451521"
    },
    {
      "id": "pekudei_p109",
      "text": "אלה פקודי המשכן וגו', במד\"ר (ר\"פ זו) הה\"ד איש אמונות רב ברכות (משלי כ\"ח) אתה מוצא כל מי שהוא נאמן הקב\"ה מביא ברכות על ידו וכו' איש אמונות זה משה שהוא נאמנו של הקב\"ה שנאמר וכו' הוי איש אמונות רב ברכות שכל הדברים שהיה גזבר עליהם היו מתברכים לפי שהוא נאמן וכו' ע\"כ. וצ\"ב היכן מרומז זאת בפסוק שנתברכו מעשה ידיו של משה, דלכאורה לא מצינו בקרא שום רמז לכך, ותו יל\"ד למה משמיענו הכתוב שנתברכו מעשה ידיו של משה בפרשה זו דמיירי מחשבון המשכן, יותר הוה מקום להשמיענו זאת בפרשיות הקודמות המדברות מעבודת המשכן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 109,
      "char_length": 496,
      "timestamp": "2025-02-06T19:18:54.047213"
    },
    {
      "id": "pekudei_p110",
      "text": "ב) עוד איתא במדרש רבה ר\"פ זו (ב') בשעה שא\"ל הקב\"ה למשה שיעשה המשכן מיד ויבאו כל איש וגו' לכמה ימים הביאו כל הנדבה א\"ר יוחנן לשני בקרים הביאו והותר שנאמר והמלאכה היתה דים וגו' וכו' עיי\"ש. גם זה צ\"ב מה מקום להשמיענו בפרשה זו לכמה ימים הביאו את הנדבה, ומקומו לעיל במקום שהכתוב מדבר בהבאת הנדבה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 110,
      "char_length": 291,
      "timestamp": "2025-02-06T19:18:54.298611"
    },
    {
      "id": "pekudei_p111",
      "text": "ג) עוד במד\"ר ד\"א איש אמונות וגו' זה משה שנעשה גזבר על מלאכת המשכן וכו' אלא אע\"פ שהיה משה גזבר לעצמו הוא קורא לאחרים ומחשב על ידיהם שנאמר אלה פקודי המשכן, אשר פקד משה אין כתיב כאן אלא אשר פקד על פי משה ע\"ו משה ביד איתמר עליו נאמר ולא יחשבו את האנשים אשר יתנו את הכסף (מלכים ב' י\"ב) וכו' ודברי המדרש תמוהים, כו מן הכתוב שמביא הוא ראיה לסתור, שהרי כתיב ולא יחשבו וגו', ולמה הוצרך משה לתת חשבון נדבת המשכן, ועי' במת\"כ שנדחק.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 111,
      "char_length": 420,
      "timestamp": "2025-02-06T19:18:54.464873"
    },
    {
      "id": "pekudei_p112",
      "text": "ד) ובצלאל בן אורי בן חור וגו' עשה את כל אשר צוה ה' את משה. פירש\"י ז\"ל אשר צוה אותו משה אין כתיב כאן אלא אשר צוה ה' את משה אפילו דברים שלא אמר לו רבו הסכימה דעתו למה שנאמר למשה בסיני כו משה צוה לבצלאל לעשות תחלה כלים וכו' אמר לו בצלאל מנהג עולם לעשות בית תחלה ואח\"כ משים כלים לתוכו וכו' עכ\"ד רש\"י ז\"ל. וגם הכא קשה כדלעיל למה השמיענו הכתוב שעשה בצלאל משכן תחלה ואח\"כ כלים בפרשה זו שמדברת מענין חשבון הנדבה, ומקומה שייך בפרשיות הקודמות המדברות בעשיית המשכן וכליו ה) להלן בפרשה (פסוק ל\"ב) ותכל כל עבודת משכן אהל מועד ויעשו בני ישראל ככל אשר צוה ה' את משה כן עשו. דקדקו המפרשים למה כפל הכתוב לומר שכן עשו\", והרי כבר נאמר ויעשו בני ישראל וגו'.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 112,
      "char_length": 637,
      "timestamp": "2025-02-06T19:18:54.707526"
    },
    {
      "id": "pekudei_p113",
      "text": "ו) ככל אשר צוה ה' את משה כן עשו בני ישראל את העבודה וירא משה את כל המלאכה והנה עשו אותה וגו' ויברך אותם משה. דקדק הרמב\"ן ז\"ל למה שנה הכתוב לשונו, מעיקרא כתיב עשו בנו ישראל את מהעבודה\", והדר כתיב וירא משה את כל אהמלאכה\", ע\"ש בדבריו מה שפירש בזה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 113,
      "char_length": 244,
      "timestamp": "2025-02-06T19:18:55.051046"
    },
    {
      "id": "pekudei_p114",
      "text": "ונראה לבאר הענין, בהקדם ליישב מה שנתקשו הראשונים ז\"ל, למה לא נתן משה חשבון מפורט מה נעשה מן הזהב העשוי למלאכה, כאשר נתן להם חשבון מפורט מן הכסף והנחשת העשוי למלאכה. ונ\"ל עפ\"י מה שפירשנו דברי רש\"י ז\"ל בפ' תרומה עה\"פ ויקחו לי תרומה, לי, לשמי. בהקדם מ\"ש קז זלה\"ה בישמח משה פ' תולדות ודף ס\"ג ע\"ג) על הפסוק ויזרע יצחק בארץ ההיא וימצא בשנה ההיא מאה שערים ויברכהו ד' ותרגם אונקלוס מאה בדשערוהי, וביאר דהנה אמרו ז\"ל אין הברכה מצויה לא בדבר המדוד וכו' אלא בדבר הסמוי מן העין וב\"מ מ\"ב ע\"א), ולפי זה אפילו בדבר שאים מדוד ומנוי יכולה הברכה לשרות אך בשיעור שהדעת טועה בו ולא יותר, כו כלפי יותר מכדי שהדעת טועה בו הוי כדבר המנוי ומדוד, והנה טעם שאין הברכה שורה בדבר המדוד, הוא, לפי שההנהגה הסתמית היא השגחה מסותרת בטבע, והטבע הוא השליח להניח ברכה, וא\"כ בדבר המדוד שלא יכול להיות נסתר אין בו ברכה, ולפי\"ז מובן דאם יתן השי\"ת בעצמו ברכה, שלא עמו שליח היינו הטבע, ודאי שאין שום דבר יכול לעכב חלות הברכה, ושורה בכל אף ביותר מכדי שהדעת טועה. ועפי\"ז יבואר הכתוב ויזרע יצחק וגו' וימצא מאה שערים כתרגומו מאה בדשערוהי, וקשה איך יתכן זה, הא הוו בזה כדבר המדוד דזהו יותר מכדי שהדעת טועה, לזה אמר ויברכהו ה' ולא ע\"י שליח, עכת\"ד ז\"ל .",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 114,
      "char_length": 1106,
      "timestamp": "2025-02-06T19:18:55.236618"
    },
    {
      "id": "pekudei_p115",
      "text": "ובזה יובנו דברי רש\"י ז\"ל לי לשמי, עפ\"י הא דאיתא במדרש תנחומא פרשת תרומה (וד') כל מקום שנאמר לי יש בה ברכה והתרומה יש בה ברכה א\"ר יוחנן לשני בקרים הביאו נדבת המשכן, ולכאורה הוה קשה לוה לרש\"י איך יתכן שנכנסה ברכה מרובה כ\"כ במלאכת המשכן, עד שבשני בקרים הביאו את הכל, והרי זה ודאי יותר מכדי שהדעת טועה, לזה בא כמתרץ לי לשמי\", שנשתלחה בנדבתם ברכה משמו יתברך, שלא ע\"ו שליח. וכיון שהברכה היתה ממנו יתברך בעצמו, חלה הברכה גם ביותר מכדי שהדעת טועה. והנה לכאורה לפי זה קשה אחר שראו ישראל שנשתלחה ברכה מרובה כ\"כ בנדבתם, ולשני בקרים הביאו כל הנדבה, מה מקום היה להם לחשוד את משה שהעשיר מכסף נדבתם הלא עיניהם חזו כו לא רק שלא שלח יד בנדבתם, אלא שעל ידו נתברכה הנדבה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 115,
      "char_length": 652,
      "timestamp": "2025-02-06T19:18:55.871391"
    },
    {
      "id": "pekudei_p116",
      "text": "אמנם י\"ל כו החשד היה בכסף הנדבה, ולא בשאר דברים, דהנה בכסף לא מצינו שנשתלחה ברכה, שהרי עלה חשבון הכסף מכוון מאת הככר למאת האדנים ככר לאדן, ומן הנותר עשה ווים לעמודים, ומה דאיתא במדרש שנשתלחה ברכה ע\"כ לומר דקאי על זהב או שאר דברים נחשת וכו' והנה הסברא נותנת יותר שנשתלחה ברכה בזהב, משנאמר שנשתלחה בנחשת או בשאר הדברים שאינם חשובים כ\"כ כזהב, הנה אמרו ז\"ל במסכת ר\"ה (דף י\"ז ע\"א) עתים לטובה ועתים לרעה עתים לטובה כיצד הרי שהיו ישראל רשעים גמורים בר\"ה ופסקו להם גשמים מועטים לסוף חזרו בהם, להוסיף עליהם אי אפשר שכבר נגזרה גזרה אלא הקב\"ה מורידן בזמנן על הארץ הצריכה להם הכל לפי הארץ, מכאן ראיה כי אם הקב\"ה שולח ברכתו משמים, שולחה אל המקום הראוי לו ביותר, כדי שתהיה הברכה באופן המעולה ביותר, וא\"כ אף אנן נאמר כי אילו נשתלחה ברכה בנחשת שאין דמיו יקרים, אין הברכה חשובה כ\"כ, וע\"כ מסתבר שנכנסה הברכה בזהב שדמיו יקרים ביותר, והברכה המשתלחת בו מעולה ביותר.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 116,
      "char_length": 844,
      "timestamp": "2025-02-06T19:18:56.221732"
    },
    {
      "id": "pekudei_p117",
      "text": "ועפ\"י הנחה זו מצאנו ישוב נכון לקושית המפרשים ז\"ל שלא נתן להם משה חשבון מפורט מה נעשה בזהב, כי על הזהב לא היה להם חשד כלל, שהרי ראו שנשתלחה בו הברכה ונתרבה יותר ממה שנתנו, ולא בקשו חשבון אלא על הכסף והנחשת שבהם לא נשתלחה ברכה. ועפ\"י זה יתיישב המדרש הנ\"ל, הה\"ד איש אמונות רב ברכות וכו' זה משה שכל הדברים היה גזבר עליהם היו מתברכים, דהוקשה לו למה לא מצינו בפרשה זו חשבון מפורט מה שנעשה מן הזהב. ולא נתן משה אלא חשבון הכסף והנחשת, וע\"ז בא כמתרץ שכל הדברים שהיה גזבר עליהם היו מתברכים, וכמו שכתבנו שנשתלחה ברכה בזהב, ולא היה בו מקום לחשד כלל, ועל כן לא הוצרך לתת חשבון אלא בכסף ובנחשת שלא נשתלחה בהם ברכה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 117,
      "char_length": 600,
      "timestamp": "2025-02-06T19:18:56.624728"
    },
    {
      "id": "pekudei_p118",
      "text": "וכן מה דאיתא במדרש נאות ג') עליו הכתוב אומר ולא יחשבו את האנשים אשר יתנו את הכסף וגו' אתו שפיר, דקאי על מה שמצינו בכתוב שלא נתן משה חשבון הזהב העשוי למלאכה, וע\"כ מייתי קרא ולא יחשבו וגו'. וכן א\"ש שייכות המדרש הנ\"ל לשני בקרים הביאו כל נדבת המשכן לפרשה זו, כי בא ליישב טעם שלא נתן משה חשבון הזהב העשוי למלאכה, לפי שנשתלחה בו ברכה מרובה כ\"כ ולא היה מקום לחשד כלל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 118,
      "char_length": 360,
      "timestamp": "2025-02-06T19:18:56.931049"
    },
    {
      "id": "pekudei_p119",
      "text": "עוד י\"ל טעם שלא נתן משה חשבון מפורט על הכלים שנעשו מהזהב, עפ\"י מה שכתב האה\"ח הקדוש ר\"פ פקודי וז\"ל, אלה פקודי המשכן ומי יצדיק שכן הוא ולא יותר ע\"ז אמר משכן העדות פי' המשכן הוא יעיד על הדבר ע\"ד אומרם ז\"ל (ילקוט רמז תי\"ז) בפסוק ויקם משה את המשכן וז\"ל, כמה חכמים היו שם ולא היו יכולים להקים את המשכן ולא היו יודעים לישב אותו כל אחד נטל מלאכתו והלך אצל משה ושרתה רוח הקדש על משה והקים את המשכן ע\"כ. זה הוא עדותו היותו נקי כפים שאין חמס בכפיו שאין הקב\"ה עושה נם לעושי עול ובפרט במקום עצמו שנעשה העול ח\"ו וכו' עכ\"ל האה\"ח הקדוש. ולכאורה פירושו סותר מה שמבואר בפסוקים שנתן משה חשבון על מלאכת המשכן, שהרי לדבריו לא הוצרך משה לתת חשבון כלל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 119,
      "char_length": 629,
      "timestamp": "2025-02-06T19:18:57.125751"
    },
    {
      "id": "pekudei_p120",
      "text": "ונראה בהקדם מה שכתב החת\"ס ז\"ל בספרו תורת משה (וכ\"ה בתשובות חת\"ס חאו\"ח סי' קפ\"ח) בשם רבו חסיד שבכהונה הגאון מו\"ה נתן אדלער זצ\"ל שהקשה מה תועלת היה במה שעשה בצלאל משכן תחלה ואח\"כ כלים והלא מלאכת המשכן וכליו נשלמה בכ\"ה כסליו והקמת המשכן לא היתה אלא בר\"ח ניסן וא\"כ היכן נתנו את הכלים מכ\"ה כסליו עד ר\"ח ניסן וכקושית בצלאל כלים שאני עושה להיכן אכניסם, ותירץ דעיקר הקפידה היתה על הכלים לאחר משיחתן, שאז נתקדשו ולא היה כבוד הכלים המקודשים להיות מונחים בחוץ. ואמנם לא נתקדשו הכלים עד ר\"ח ניסן ושפיר היו מונחים בחוץ, אבל בצלאל ופה הקשה כלים שאני עושה להיכן אכנוסם, כי אם היה עושה את הכלים תחלה, והיה ראוי שגם המשיחה תקדם בהם, כי המוקדם לעשיה היא מוקדם למשיחה, וע\"כ הקשה כלים שאני עושה להיכן אכניסם לאחר המשיחה, עכ\"ד ז\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 120,
      "char_length": 710,
      "timestamp": "2025-02-06T19:18:57.443700"
    },
    {
      "id": "pekudei_p121",
      "text": "ויש לגמגם בתירוצו דמאן יימר שהמוקדם לעשייה צריך להיות גם מוקדם למשיחה, ולמה לא עשו את הכלים תחלה ולמשיחה יוקדם המשכן. ונראה לישב קושית מוה\"ר נתן אדלער זצ\"ל בדרך אחר, דהנה זה ברור שכל זמן שלא נגמרה מלאכת הכלים לגמרי במלאכת מכה בפטיש שהיא גמר מלאכת כל דבר, ודאי שלא חלה עליהם קדושת כלי שרת, וא\"כ י\"ל כוי הקדים בצלאל את הכלים למשכן, אלא ששייר בהם מלאכת דבר מועט, כגון מלאכת מכה בפטיש, ומלאכה מועטת זו לא גמר אלא אחר שהוקם המשכן. ולפי\"ז י\"ל כו כל טענת בצלאל למשה להקדים משכן לכלים, הכוונה רק שגמר מלאכת המשכן תקדם לגמר מלאכת הכלים ודו\"ק. ומיושבת שפיר קושית הגאון נ\"א זצ\"ל שהקשה מה נעשה בכלים מכ\"ה בכסליו עד ר\"ח ניסן, ולדברנו א\"ש, כי כיון ששייר בהו מידי ולא גמר מלאכתם לגמרי לא חלה קדושה עלייהו והיו מונחים בחוץ.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 121,
      "char_length": 707,
      "timestamp": "2025-02-06T19:18:57.777412"
    },
    {
      "id": "pekudei_p122",
      "text": "היוצא מדברנו כי במלאכת המשכן היו שני עשיות, חדא עשיית המשכן וכליו: ואח\"כ גמר מלאכת הכלים שנעשתה אחר שהוקם המשכן. ועפי\"ז מיושב שפיר מה שדקדקו המפרשים בכפל לשון הכתוב (קושיא ה') ויעשו בני ישראל והדר כתיב כן עשו, כו שנו עשיות היו, אחת קודם הקמת המשכן, שעשה מלאכת הכלים, אולם נותרה בהו עשייה מועטת, שלא נגמרה אלא אחר הקמת המשכן. ו בזה מיושב גם מה שדקדק הרמב\"ן ז\"ל (אות ו') דשנה הכתוב לשונו בתחלה כתיב עשו בני ישראל את ש העבודה\", ואח\"כ וירא משה את כל המלאכה\", כי עבודה היינו עבודה קשה בעמל ובוגיעה, ומלאכה משמע אפילו מלאכה כל דהו שאין בה יגיעה, כגון הוצאת מחט לרה\"ר דאף שאין בה טורח קרויה מלאכה, ועל כן כתיב מעיקרא עשו בני ישראל את כל העבודה, דקאי על עשיית המשכן וכליו, שהיא עיקר העבודה בעמל וביגיעה, ועל המלאכה המועטת שנותרה עדיין לעשות בכלי המשכן, שהיא מלאכה שאין בה יגיעה, אמר קרא וירא משה את כל המלאכה ודו\"ק.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 122,
      "char_length": 807,
      "timestamp": "2025-02-06T19:18:58.121580"
    },
    {
      "id": "pekudei_p123",
      "text": "ועפ\"י דברנו נבא לישב למה לא נתן משה חשבון מפורט מן הכלים שנעשו מהזהב העשוי למלאכה, דהנה חשבון שייך לתת אחר גמר המלאכה, או רובה, משא\"כ קודם הגמר לא שייך עדיין לתת חשבון. והנה רוב הכסף והנחשת נכנס במשכן עצמו, כי מן הכסף עשו את מאת האדנים, ומן הנותר עשו ווים לעמודים: וגם הנחשת נכנסה רובה בבנין המשכן, כמבואר בפסוק שנעשו ממנה אדני פתח אהל מועד ואדני החצר וכל יתדות המשכן והחצר משא\"כ הזהב נכנס ברובו במלאכת הכלים, ורק מעט נכנס בבנין המשכן עצמו, ועל כן נתן משה חשבון על הכסף והנחשת מיד כאשר נגמרה מלאכת המשכן, כי המשכן עצמו נגמר בשלמות בכ\"ה בכסליו, משא\"כ הכלים שלא נגמרו אלא אחר ר\"ח ניסן. כמ\"ש, לפי שאילו נגמרו מיד לא הוה מקום להכניסם, וע\"כ שיירו בהם מלאכת דבר מועט כנ\"ל, ולכן לא נתן משה חשבון הזהב, כו עדיין לא נשלמה מלאכת הכלים שרוב הזהב נכנס בהם ולא היה יכול לתת חשבון אלא לאחר הקמת המשכן, ואז כבר לא הוצרכו ישראל לחשבון, כי המשכן עצמו היה עדות על צדקת משה ויושר כפיו, שנעשה בו נס שהוקם ע\"ו משה בעצמו, ולא יעשה ה' נס לעושה עולל כמ\"ש האה\"ח הקדוש.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 123,
      "char_length": 943,
      "timestamp": "2025-02-06T19:18:58.532261"
    },
    {
      "id": "pekudei_p124",
      "text": "ומיושב מה שהקשינו על דברי האה\"ח הקדוש שכתב כי המשכן עצמו הוא עדות על צדקת משה, וקשה שהרי מבואר בכתובים שנתן להם חשבון, והשתא לק\"מ כי החשבון היה על הכסף והנחשת שנגמרה מלאכתם טרם הקמת המשכן, ואז עדיין לא נתגלתה לעין כל צדקת משה ועל כן הוצרך לחשבון.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 124,
      "char_length": 246,
      "timestamp": "2025-02-06T19:18:58.995797"
    },
    {
      "id": "pekudei_p125",
      "text": "ועפ\"י זה מיושב גם הפסוק ובצלאל וגו' עשה את כל אשר צוה ה' את משה שממנו דרשו ז\"ל שעשה משכן תחלה ואח\"כ כלים, וקשה למה מודיענו הכתוב זאת בפרשה זו שענינה חשבון הנדבה (עי' קושיא ד'), ולדברנו מיושב היטב כי הוא זה בנותן טעם על אשר לא נתן משה חשבון על הזהב העשוי למלאכה לז\"א ובצלאל וגו' עשה כל אשר צוה ה את משה, וכמו שדרשו ז\"ל שהקשה למשה כלים שאני עושה להיכן אכניסם ועל כן עשה משכן תחלה, ואכתי מה הועיל בזה והיכן היו מונחים הכלים מכ\"ה כסליו עד ר\"ח ניסן. וצ\"ל כמו שכתבנו כי שייר בהם מלאכת דבר מועע, ועל כן אתי שפיר שלא היה יכול לתת חשבון הזהב העשוי למלאכה, לפי שלא נגמרה מלאכתו עד אחר ר\"ח ניסן. שהרי רוב הזהב נכנס בכלים, ואחר ר\"ח ניסן לא הוצרכו לחשבון לפי שהמשכן עצמו היה עדות, כדברי האה\"ח הקדוש. ולכן נתן רק חשבון הכסף והנחשת שרובם נעשו למלאכת המשכן עצמו, ומיד בגמר עשייתם בכ\"ה כסליו נתן עליהם חשבון.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 125,
      "char_length": 791,
      "timestamp": "2025-02-06T19:18:59.138721"
    },
    {
      "id": "pekudei_p126",
      "text": "וגם א\"ש דברי המד\"ר הנ\"ל עליו הכתוב אומר ולא יחשבו את האנשים אשר יתנו וגו', ועי' אות ג') דקאי על מלאכת הזהב שלא נתן משה חשבון על הדברים שנעשו ממנו לפי שנגמרה מלאכת הזהב אחר ר\"ח ניסן, ואז היה המשכן עצמו עדות על נקיון כפיו ותום לבבו.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 126,
      "char_length": 230,
      "timestamp": "2025-02-06T19:18:59.539492"
    },
    {
      "id": "pekudei_p127",
      "text": "אלה פקודי המשכן משכן העדות אשר פקד על פו משה עבודת הלוים ביד איתמר בן אהרן הכהן. במד\"ר ד\"א איש אמונות זה משה שנעשה גזבר על מלאכת המשכן וכו' אלא אעפ\"י שהיה משה גזבר לעצמו הוא קורא לאחרים ומחשב על ידיהם שנאמר אלה פקודי המשכן אשר פקד משה און כתיב כאן אלא אשר פקד על פי משה ביד איתמר עליו נאמר ולא יחשבו את האנשים אשר יתנו את הכסף כו באמונה הם עושים וכו' עכ\"ל. ודברי המדרש תמוהים לכאורה שמביא ראיה לסתור דבריו, שהרי התם כתיב ולא יחשבו וגו', וא\"כ למה הוצרך משה לתת לפניהם חשבון מלאכת המשכן, ועי' במתנות כהונה שנדחק בזה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 127,
      "char_length": 514,
      "timestamp": "2025-02-06T19:18:59.683186"
    },
    {
      "id": "pekudei_p128",
      "text": "ונראה לבאר דברי המדרש בפשטות דהנה ביו\"ד סימן רנ\"ז סעיף ב' איתא אין לקבל חשבון מגבאי צדקה וכתב הרמ\"א דאעפ\"י כן כדי שיהיו נקיים מה' ומישראל טוב להם ליתן חשבון בעצמם עיי\"ש. ואפ\"ל כי זה מדוייק בלשון הפסוק הנ\"ל דכתיב ולא וחשבו' את האנשים וגו' לשון מפעיל, הכוונה שאחרים לא יכופו אותם לתת חשבון, אבל הם בעצמם נכון הוא שיתנו חשבון, ועפי\"ז יתיישב המדרש שכתב שהיה משה קורא לאחרים ומחשב על ידיהם, הרי שהם לא תבעו ממנו חשבון, כי אסור לתבוע חשבון מגבאי צדקה, ואעפ\"י כן נתן הוא בעצמו חשבון. וע\"ז מייתי המדרש שפיר ראיה עליו נאמר ולא יחשבו את האנשים וגו' כי באמונה הם עושים, וכמו שפירשנו דכתיב ולא אוחשבו\" לשון מפעיל שאחרים לא יתבעו מהם חשבון, אבל נכון שהם יתנו בעצמם חשבון לצאת ודי שמים וידי הבריות והבן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 128,
      "char_length": 689,
      "timestamp": "2025-02-06T19:18:59.955811"
    },
    {
      "id": "pekudei_p129",
      "text": "באופן אחר י\"ל דברי המדרש הנ\"ל בהקדם מ\"ש כ\"ק אבא מארי זלה\"ה בספרו קדושת יו\"ט לפרש דברי הזה\"ק ור\"פ פקודי) אלה פקודי המשכן משכן העדות ר' יוסי פתח (תהלים ל\"א) מה רב טובך אשר צפנת ליריאך פעלת לחוסים בך נגד בני אדם ע\"כ, על פי מה דאיתא בספר הקדוש אוהב ישראל לפרש הפסוק אלה פקודי המשכן על פי מה שאמרו ז\"ל (בבא מציעא דף מ\"ב ע\"א) אין הברכה שורה לא בדבר המנוי והשקול והספור אלא בדבר הסמוי מן העין. והנה כאן במלאכת המשכן שנעשה הכל על פי חשבון ובמדה הקצובה, ואעפ\"י כן היתה הברכה שורה, דכתיב עיניך ברכות בחשבון (שה\"ש ז\"א, דגבי זרע ישראל אינו מזיקה הסתכלות אף בדבר שיש בו חשבון ובאמת מבואר ענין זה יותר בזה\"ק פ' פקודי (רכ\"א ע\"ב) דכל מה דקיימא בחושבנא לא שריין תמן ברכאן בשלימו וברכאן שריין במה דלא קיימא בחושבנא וכו' משכן העדות אע\"ג דקיימא בחושבנא הואיל ואתפקד על ודא דמשה כל שכן וכל שכן דשריין ביה ברכאן. וז\"ש הכתוב אלה פקודי המשכן ר\"ל שנמנה במשכן כל דבר ונעשה הכל בחשבון, ואעפי\"כ היתה הברכה שורה, והטעם אשר פקד על פי משה, מחמת שיצא המנין מפי משה שהיה בקדושה ובדביקות העליון, ולא עוד אלא שע\"י המנין נתוסף בו ברכה. את\"ד האוהב ישראל זי\"ע, וכ\"כ הקדושת לוי זי\"ע.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 129,
      "char_length": 1044,
      "timestamp": "2025-02-06T19:19:00.352907"
    },
    {
      "id": "pekudei_p130",
      "text": "וכתב א\"א זלל\"ה ולי נראה להסביר הענין יותר, עפ\"י מה שכתב אא\"ז זצוקללה\"ה בספרו ישמח משה פ' תולדות עה\"פ ויזרע יצחק וגו' וימצא מאה שערים. דהטעם שאין הברכה שורה בדבר המדוד, משום דהנהגה הסתמות היא השגחה מסותרת בטבע ולכן בדבר המדוד שאין יכול להיות נסתר אין בו ברכה, ולפי\"ז אם יתן ה' בעצמו ברכה ולא עזי הטבע שהוא רק שליח, ולא תהיה הברכה מכוסה בטבע כלל, ודאי אין שום דבר יכול לעכב על ידו ושורה בכל אף בדבר המדוד וכו', וזהו שפתח בזה\"ק על אמרו אלה פקודי המשכן שנמנה ונמדד כמה פעמים, ואעפי\"כ היתה הברכה שורה בו מחמת שהברכה הבאה מאת ה' שורה אף בדבר המדוד, ואף גם יותר מכדי שהדעת טועה שלא כדרך הטבע, ע\"ז פתח מה רב טובך וגו' פעלת לחוסים בך נגד בנו אדם, היינו נגד דעת בנו אדם ושלא כדרך הטבע ג\"כ, כי הקב\"ה בעצמו יכול להשפיע ברכות וישועות טובות עד אין חקר וכו', עכ\"ד קדשו.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 130,
      "char_length": 754,
      "timestamp": "2025-02-06T19:19:00.923563"
    },
    {
      "id": "pekudei_p131",
      "text": "ונקדים עוד מה דאיתא בתנחומא וי\"א) הובא ברש\"י ז\"ל עה\"פ ויביאו את המשכן אל משה (פל\"ט ל\"ג) וז\"ל לפי שלא עשה משה שום מלאכה במשכן הניח לו הקב\"ה הקמתו שלא היה יכול להקימו שום אדם וכו' ומשה העמידו אמר משה לפני הקב\"ה היאך אפשר הקמתו ע\"י אדם אמר לו עסוק אתה בידיך נראה כמקומו והוא נזקף וקם מאליו וזה שנאמר הוקם המשכן שהוקם מאליו עכ\"ל. וכפי דברי המדרש הללו נראה לפרש גם במאה\"כ אשר פוקד על פו משה ולא כתיב אשר פקד משה, אלא שהיה נראה כאילו עשה משה את החשבון אבל היה נעשה מאליו ע\"י הקב\"ה. וז\"ש הכתוב אשר פוקד שנפקד מאליו, ונראה כאילו היה על פי משה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 131,
      "char_length": 535,
      "timestamp": "2025-02-06T19:19:01.302640"
    },
    {
      "id": "pekudei_p132",
      "text": "ונבא אל הביאור בהקדם עוד דברי א\"א זלה\"ה בקדושת יו\"ט פ' מטות לפרש הפסוק החלצו מאתכם אנשים לצבא היינו שתחלצו ותפשיטו ממכם דמות וצלם אנשים לגמרי, וע\"י שיהיה להם צלם אלקים יראו ויפחדו מהם האומות עיי\"ש. ועפי\"ז יתבארו דברי המד\"ר אלה פקודי המשכן זש\"ה איש אמונות ורב ברכות זה משה, כלומר שאעפ\"י שהיה איש אמונות שעשה חשבון מלאכת המשכן, אעפי\"כ ורב ברכות נשתלחה ברכה בנדבתם. וז\"ש המדרש אשר פקד אכ\"כ אלא אשר פוקד על פו משה, בא לתת טעם למה שנשתלחה הברכה בנדבה אעפ\"י שנתן להם חשבון, על כן אמר אשר פוקד על פו משה שהיה נראה לעין כאלו נעשה החשבון עפ\"י משה אבל באמת נעשה החשבון מאליו ע\"י הקב\"ה. ומסיים המד' עליו הכתוב אומר ולא יחשבו את האנשים וגו' כי באמונה הם עושים, פי' כי מי שהוא עדיין בבחינת אנוש, ולא חלץ והפשיט מעליו טבע בני אדם לגמרי, אסור לו לעשות חשבון משום שמזיק החשבון לנדבה, ורק ע\"י משה היה יכול להעשות חשבון לפי שנחלץ ממנו טבע בנ\"א והוה דמי לבר אלהין, לכן היה יכול החשבון להיות נעשה על ידו, ולא שלט בכסף מארה וחסרון, לפי שנעשה החשבון מאליו, אבל מי שאינו במדרגה זו שיעשה החשבון מאליו, אין לו לעשות חשבון, וזה שמסיים הכתוב לתת טעם למה שאמר ולא יחשבו את האנשים וגו' כי באמונה הם עושים, דהנה ידוע שאמונה הוא מלשון המשכה ורבוי כמו ויהי אומן את הדסה (אסתר ב') (ועי' אוהב ישראל פ' נח באורך) והכוונה שע\"י אמונה ממשיכים את הברכה בממון, ע\"כ אמר הכתוב שאסור לחשוב את האנשים כי באמונה הם עושים, והם ממשיכים שפע ברכה ע\"י האמונה, ולכן אין להם לחשוב חשבונות שלא יזיקו לברכה הנשפעת.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 132,
      "char_length": 1360,
      "timestamp": "2025-02-06T19:19:01.580234"
    },
    {
      "id": "pekudei_p133",
      "text": "או יאמר לבאר המדרש הנ\"ל באופן אחר עפ\"י מה שכתב האוה\"ח הקדוש פ' ויקהל עה\"פ והמלאכה היתה דיים וגו' והותר (פל\"ו ז'), דלכאורה קשה שהם ב' סוגים הפכיים אם דיים אינו הותר ואם הותר אינו דיים. ואולי שישמיענו הכתוב חיבת בני ישראל בעיני המקום לצד שהביאו בני ישראל יותר משיעור הצריך חש ה' לכבוד כל איש שטרחו והביאו ונכנס כל המובא בית ה' במלאכת המשכן, וזהו פירוש הכתוב והמלאכה שהביאו היתה דיים לא חסר ולא יותר הגם שהיתה יותר כפי האמת והוא אמרו והותר כי נעשה נס ולא הותיר. ועפ\"י זה מובן שלא היה אפשר בפשטות לתת חשבון, שהרי באמת נכנס במשכן בדרך נס כל מה שהביאו, יותר ומן הצריך למלאכת המשכן על פי חשבון, ואך ורק איתמר ברוח קדשו היה יכול להבין החשבון הזה ג\"כ, וזאת כוונת המדרש אשר פוקד על פו משה וכו' שהיה קורא לאחרים ומחשב על ידיהם, ולא לאנשים פשועים היה קורא, כי לא היה ביכולתם להשיג החשבון הזה בדעתם, ורק שהיה מחשב על ידי איתמר כמבואר בכתוב ביד איתמר וגו' והוא השיג חשבון זה ברוה\"ק. וז\"ש המדרש עליו הכתוב אומר ולא יחשבו את האנשים וגו', היינו שאותם שהם במדרגת אנשים לא יכלו לחשב אתו, ורק את איתמר שעלה ונתעלה ממדרגת איש, היה קורא ומחשב על ידו.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 133,
      "char_length": 1028,
      "timestamp": "2025-02-06T19:19:02.237314"
    },
    {
      "id": "pekudei_p134",
      "text": "דרוש לשבת שקלים אלה פקודי המשכן משכן העדות וגו' הקשו חז\"ל במדרשים על כפל הכתוב משכן משכן ב' פעמים, ובזוה\"ק פקודי (דף רכ\"א ע\"ב) ובתנחומא ריש פרשה זו דרשוהו על בהמ\"ק שלמעלה שמכוון כנגד בהמ\"ק של מטה. ועוד דרשו במד\"ר שמות (פר' נ\"א ס\"ג) ובתנחומא הובא ברש\"י ז\"ל משכן משכן רמז למקדש שנתמשכן בשני חורבנין על עונותיהן של ישראל, משכן העדות עדות לישראל שויתר להם הקב\"ה על מעשה העגל וכו' וצ\"ב דאין ענינם לכא' וכל הרמזים אלו ראוי להיות מקומם בפרשת הקמת המשכן, או אצל ציווי עשייתו, ואין להם קישור לכאורה לחשבון נדבת המשכן הנזכר בפרשה זו.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 134,
      "char_length": 523,
      "timestamp": "2025-02-06T19:19:02.727484"
    },
    {
      "id": "pekudei_p135",
      "text": "ב) גם צ\"ב קישור הפסוק אשר פקד עפ\"י משה, אם פירושו לשון מנין כמו שתרגם אונקלוס, הול\"ל אשר פקד משה, ומאי עפ\"י משה דקאמר, וכן הקשה האלשיך הק', ואם פירושו מלשון פקידה והתמנות כמו שפירש\"י ז\"ל, הרי בכל מעשה המשכן היתה ההתמנות עפ\"י משה רבינו. ולא רק הזהב וכסף ונחושת שנזכרו בחשבון כאן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 135,
      "char_length": 278,
      "timestamp": "2025-02-06T19:19:02.988240"
    },
    {
      "id": "pekudei_p136",
      "text": "ג) עבודת הלוים ביד איתמר בן אהרן הכהן, הקשה האברבנאל והאלשיך הק' וכ\"ה הא ח\"ק, דמה לו להזכיר עבודת הלוים כאן בזכרון החשבון, כי עדיין לא דבר הכתוב במסעות ולא בנושאי המשכן, ונתבארה עבודת הלוים במקומן בפ' במדבר ונשא, וזכרונם כאן הוא מיותר ושלא במקומן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 136,
      "char_length": 247,
      "timestamp": "2025-02-06T19:19:03.153516"
    },
    {
      "id": "pekudei_p137",
      "text": "ד) גם הרי אמרו ז\"ל בזבחים (קי\"ב ע\"ב) עד שלא הוקם המשכן היתה עבודה בבכורות, אם כן עדיין לא נהגה עבודת הלוים כלל. גם למה הזכיר פקודת איתמר ולא הזכיר פקודת אלעזר וצ\"ב.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 137,
      "char_length": 164,
      "timestamp": "2025-02-06T19:19:03.302879"
    },
    {
      "id": "pekudei_p138",
      "text": "ה) גם הקשו הבעה\"ת והרמב\"ן והראב\"ע ז\"ל דלא הזכיר משרע\"ה בחשבון הזהב, כ\"א סכום הבא בנדבה, כאמרו כל הזהב העשוי למלאכה וגו' תשע ועשרים ככר וגו', אבל לא נפרעו פרטי המלאכה הנעשית ממנה, ובכסף ובנחושת נתן חשבון גם על הנעשה מהם, ולמה לא עשה כן גם בזהב, וטעמא בעי, ו) ובצלאל בן אורי בן חור וגו' עשה את כל אשר צוה ה' את משה, ובירושלמי (פאה פ\"א ה\"א) והובא ברש\"י כאן אשר צוה אותו משה אין כתיב כאן. אלא כל אשר צוה ה' את משה, אפילו דברים שלא א\"ל רבו, הסכימה דעתו למה שנאמר למשה בסיני, כי משה צוה לבצלאל לעשות תחלה כלים ואח\"כ משכן, א\"ל בצלאל מנהג עולם לעשות תחלה בית ואח\"כ משים כלים בתוכו וכו' א\"ל בצל א\"ל היית, כי בודאי כך צוה לי הקב\"ה וכו', וצ\"ב דלמה רמזה תורה ע\"ז כאן אצל חשבון הנדבה, והול\"ל בפ' ויקהל גבי ויעש בצלאל את הארון. או גבי עשיית המשכן כו שם מקומה הנכון. ומה גם שאמר אש ובצלאל, ומשפט הוא\"ו מורה על החיבור וקישור ענין של מעלה, ולכאורה אין לו שום שייכות וקישור א נין החשבון הנ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 138,
      "char_length": 874,
      "timestamp": "2025-02-06T19:19:03.423039"
    },
    {
      "id": "pekudei_p139",
      "text": "ז) במד\"ר (פר' נ\"א ס\"ב) ולא יחשבו את האנשים אשר יתנו את הכסף כו באמונה הם עושים וכו' א\"ר יוחנן לב' בקרים הביאו והותר וכו' אמר משה לפני הקב\"ה עשינו את מלאכת המשכן והותרנוג מה נעשה בנותר, אמר לו לך ועשה בהם משכן לעדות וכו' כיון שבא ליתן חשבון. אמר כך וכך יצא למשכן וביתר עשיתי משכן לעדות, הוי אלה פקודי המשכן משכן העדות עכ\"ד ז\"ל. וכעין זה איתא בתנחומא, וצ\"ב דמשמע דבשביל שהותר ע\"כ הוצרך לתת חשבון, וקשה דמה ענין זה לזה, ולמה הסמיכו במדרש ב' ענינים אלו שהותיר ובא ליתן חשבון, דמשמע דזה הביאו ליתן חשבון וצ\"ב.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 139,
      "char_length": 504,
      "timestamp": "2025-02-06T19:19:03.870561"
    },
    {
      "id": "pekudei_p140",
      "text": "ח) במס' ברכות (נ\"ה ע\"א) א\"ר שמואל בר נחמני א\"ר יונתן בשעה שאמר לו הקב\"ה למשה לך אמור לבצלאל עשה לי משכן ארון וכלים הלך משה והפך וא\"ל עשה ארון וכלים ומשכן, א\"ל, משה רבינו מנהגו של עולם אדם בונה בית ואח\"כ מכניס כלים לתוכו, ואתה אומר עשה לי ארון וכלים ומשכן, כלים שאני עושה להיכן אכניסם. שמא כך אמר לך הקב\"ה עשה משכן ארון וכלים, א\"ל שמא בצל אל היית וידעת עכ\"ל הגמ'. והקשו התוס' היכא אשכחן שצוהו הקב\"ה לעשות משכן תחלה, הרי בפ' תרומה כתוב ארון תחלה ושולחן ומנורה ואח\"כ משכן, ותירצו דבפרשת כו תשא (וכן בפ' ויקהל) כתיב את אהל מועד ואת הארון לעדות עכ\"ל. וצ\"ב למה באמת בפ' תרומה צוה השי\"ת לעשות הארון והכלים תחלה, ובפ' כי תשא הקדים המשכן תחלה, והרי לא יתכן שנוי רצון לפניו ית'.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 140,
      "char_length": 668,
      "timestamp": "2025-02-06T19:19:04.134500"
    },
    {
      "id": "pekudei_p141",
      "text": "ט) גם קשה אחר שנצטוה משרע\"ה בפ' כי תשא לצוות לבצלאל על עשיית משכן תחלה, איך יתכן ששינה משה מאמרו ית', וצוה לבצלאל היפך ממה שאמר לו ית'.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 141,
      "char_length": 135,
      "timestamp": "2025-02-06T19:19:04.473428"
    },
    {
      "id": "pekudei_p142",
      "text": "י) ועו\"ק כיון שאמר לו משרע\"ה לבצלאל בשם הקב\"ה, איך רצה בצלאל להשיג על דבריו ולשנותם מכח סברא ומנהג העולם, וכי אפשר לפלפל על גזרתו ית' מכח סברא, ואם השיג כן בנבואה או ברוה\"ק, למה ליה למימר למשה רבינו מכח מנהגו של עולם דאדם בונה בית ואח\"כ כלים והול\"ל כן הוגד לי ברוה\"ק, וסברא למ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 142,
      "char_length": 279,
      "timestamp": "2025-02-06T19:19:04.576941"
    },
    {
      "id": "pekudei_p143",
      "text": "יא) גם צ\"ב מה שהקשה בצלאל למשה ממנהגו של עולם, וכי בנין המשכן נעשה עפ\"י מנהגו של עולם, והרי כל מעשה המשכן ובחי' השראת השכינה שעליו הוה הכל שלא כדרך הטבע ונסי נסים, ואין להקשות עלי' ממנהגו של עולם. ובודאי במנהגו של עולם ובדרך הטבע צריך להכין מקום ולבנות בית תחלה ואח\"כ כלים, אבל בנין המשכן לא היה משועבד אל הטבע ולמנהגו של עולם, ולמ\"ל להתחכם על דברי ה' לומר כלים שאני עושה להיכן אכניסם. והרי כל פרעי מעשה המשכן עפ\"י הנבואה נאמרה למשה כמשה\"כ ככל אשר אני מראה אותך את תבנית המשכן וגו', ואפילו תבנית הבהמ\"ק נמסרה למשה מסיני כמ\"ש שלמה הכל בכתב מיד ה' עלי השכיל, וכדאיתא באגדת שמואל, ואיך יתכן לדחות את הנבואה בשביל ההתדמות למנהגו של עולם, וצ\"ב מה היתה טענתו של בצלאל בזה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 143,
      "char_length": 666,
      "timestamp": "2025-02-06T19:19:04.739235"
    },
    {
      "id": "pekudei_p144",
      "text": "יב) ועוד יפלא דבכל המדרשים מבואר מהיפך להיפך ממ\"ש בגמ' ברכות הנ\"ל, והכי איתא במדרש (שמו\"ר פר' נ' ס\"ב) בשעה שא\"ל הקב\"ה למשה עשה המשכן, בא ואמר לבצלאל וכו' א\"ל בצלאל והיכן התורה נתונה, א\"ל משאנו עושים את המשכן אנו עושין הארון, א\"ל רבינו משה אין כבודה של תורה בכך, אלא אנו עושין הארון ואח\"כ המשכן לפיכך זכה שיקרא על שמו שנאמר ויעש בצלאל את הארון עכ\"ל. וכ\"כ הבעה\"ת דבכל הכלים כתיב ויעש, ובארון כתיב ויעש בצלאל, ולא מצינו שמו של בצלאל על שום כלי מכל כלי המשכן אלא על הארון, וזהו שאמרו חז\"ל שמדעתו הי' סדר העשי' להקדים הארון, וכן איתא בתנחומא ויקהל (ס\"ו), ובילקוט סוף פ' ויקהל. ובופ\"ת וכן הזית רענן על הילקוט כתבו דהך מדרשא פליגא על מה דאמרינן בברכות שבצלאל א\"ל למשה שמא כך צוה לך הקב\"ה לעשות המשכן תחלה עיוש\"ד, אמנם לא יתכן לומר כן, ולעשות פלוגתא בין הגמ' ומדרשי חז\"ל מהיפך להיפך.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 144,
      "char_length": 775,
      "timestamp": "2025-02-06T19:19:05.063345"
    },
    {
      "id": "pekudei_p145",
      "text": "והנה באמת אין ראיה מוכרחת מהפסוקים לא לשיטת הגמ' ולא לשיטת המדרשים, ומ\"ש רש\"י ז\"ל אשר צוה אותו משה אין כתיב כאן: אלא אשר צוה ה' את משה, מכאן שאפילו דברים שלא א\"ל משה הסכימה דעתו של בצלאל למ\"ש למשה בסיני לכאורה אין מזו ראיה מוכרחת ששינה בצלאל ממ\"ש לו משה, דהא גם להלן כתיב ותכל עבודת משכן וגו' ויעשו בנ\"י ככל אשר צוה ה' את משה, ולא כתיב כאשר צוה אותם משה, והתם לא דרשינן מינה מידי, ובודאי שלא שינו ישראל מציווי משרע\"ה כלום. ואפ\"ל עפ\"י פשוטו דע\"כ כתיב כאשר צוה ה' את משה, ולא כתיב כאשר צוה משה, דעשו ישראל על דעת וכוונת המצו' ית', כמ\"ש ק\"ז הישמח משה זלל\"ה בפ' ויצא, דישנו בכל מצוה כוונות אשר לא נודעו רק למשה בחיר ה\"נ ויותר מהמה אשר לא נודע עוד לשום נברא רק המצוו' הבוי\"ת יודע מקומה, והנה העושה ע\"ד המצו' ית', א\"כ מתקן המצוה בשורשו אף מה שנעלם מכל נברא, משא\"כ העושה עפ\"י השכל אינו יכול לתקן יותר ממה שהשכל מגיע ומשיג, עויש\"ד, ואפשר שע\"כ כתיב ויעשו בנ\"י כאשר צוה ה' את משה שעשו ע\"ד המצו' ית\"ש, וכמו\"כ אפ\"ל בבצלאל דלכוונה זו נאמר כאשר צוה ה' את משה, ואין ראיה מוכרחת ששינה בצלאל ממ\"ש לו משה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 145,
      "char_length": 987,
      "timestamp": "2025-02-06T19:19:05.467973"
    },
    {
      "id": "pekudei_p146",
      "text": "ואפילו לפי דרשת רש\"י ז\"ל דאיכא למידק מכאשר צוה ה' את משה, ששינה בצלאל ממ\"ש לו משה והסכימה דעתו למ\"ש הקב\"ה למשה בסיני, אבל אינו מוכרח ממשמעות הפסוק לא כדברי הגמ' ולא כדברי המדרשים, ואינו מבואר איך היה ציווי הקב\"ה למשה רבינו, ובמה שינה משרע\"ה וכמה שינה בצלאל, ועכ\"ח צ\"ל דקבלה היה לחז\"ל בזה וסמכוהו על הפסוק, ואפשר דכוונת רש\"י ז\"ל דאלו היה כתיב ויעש בצלאל כאשר צוה אותו משה, היה נשמע מהפסוק דלא שינה בצלאל ממה שאמר לי משה כלום, והיה משמעות הפסוק היפך קבלתם ז\"ל, אבל עכשיו דכתיב כאשר צוה ה' את משה, הרי משמעות הפסוק מסכמת לקבלת חז\"ל, ששינה בצלאל ממה שאמר לו משה, אבל אופן השנוי ואופן הציווי עכ\"ח אנו צריכים לקבלת חז\"ל בזה, כי אינו מבואר ולא נשמע מהפסוק מידי. ולפי\"ז פלוגתת הגמ' והמדרשים אינו במשמעות הכתובים כו און במשמעות הכתובים ראיה והכרח לא לדברי זה ולא לדברי זה, ואיך יתכן שיחלוקו בקבלתם מהיפך להיפך, וע\"כ צריך להיות הקבלה אמת ומקובל איש מפי איש עד משה רבינו ע\"ה כמ\"ש הרבינו יונה בריש מס' אבות, וא\"כ קשה לומר כדברי המפורשים דהגמ' ומדרשים חולקים, וצ\"ב להשוות דבריהם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 146,
      "char_length": 966,
      "timestamp": "2025-02-06T19:19:06.127413"
    },
    {
      "id": "pekudei_p147",
      "text": "יג) במד\"ר (פר' נ\"ב ס\"א) ויביאו את המשכן אל משה הה\"ד עוז והדר לבושה ותשחק ליום אחרון (משלי ל\"א) וצ\"ב יד) קרינו היום בפ' שקלים וידבר ה' אל משה לאמר כי תשא את ראש בנ\"י לפקודיהם וגו' דקדק האוהחה\"ק טעם אומרו את ראש ולא הספיק לומר כו תשא את בנ\"י, שאין לומר שלא יצוה ה' למנות אלא לראשום בלבד, כי הענין יכחיש זה, ומצינו בפ' במדבר שאמר הכתוב פקוד את בני לוי ולא נאמר את ראש בני לוי ע\"כ קושיתו, והנה בפסיקתא רבתי (סי' י') הקשו כן למה אמר הכתוב כו תשא את ראש, אלא אמר הקב\"ה למשה, כל מה שאתה יכול לרומם את האומה זו רוממה, שכאילו אתה מרומם אותי, שנאמר כי תשא את ראש בנ\"י, כי תשא את בנ\"י אין כתיב כאן, אלא כו תשא את ראש בנ\"י, ואין ראשם של ישראל אלא הקב\"ה, שנאמר ויעבור מלכם לפניהם וה' בראשם וכו' עיי\"ש, וראוי להבין איך תהיה סגולת מצות מחצית השקל שתתרומם על ידו בחי' שכינתו ית' כביכול, יותר מע\"י שאר כל מצות, ובודאי שסגולת כל המצות כן הוא. ולמה נאמרה נשיאת ראש אצל מצות מחצית השקל דוקא.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 147,
      "char_length": 871,
      "timestamp": "2025-02-06T19:19:06.622649"
    },
    {
      "id": "pekudei_p148",
      "text": "טו) והנה בחי' הנ\"ל מתבארת יותר במאמר אחר בפסיקתא שם וז\"ל כי תשא את ראש אייר שמואל בן נחמן ג' תרומות יש כאן וכו' אמר הקב\"ה למשה אמור להם שיביאו שקלים וכו' אמר הקב\"ה בשקלים שהביאו ישראל עשו אדני המשכן, וכל כך למה אלא שהשכינה באה לתוך המשכן והם נושאים אותה, שנאמר כי תשא את ראש ופי' ראשם של ישראל שהיא השכינה כביכול), ואם און אתה למד מכאן יש לך מנין ללמד, שנאמר כי עבודת הקודש עליהם בכתף ישאו (במדבר ז' ט') ופי' שם בביאור הגרא\"ז מרגליות דדריש לי' ממלת הקדש שיש עליהם בחי' השראת השכינה. וראוי להבין דלפי\"ז דבחי' נשיאות ראש היה ע\"ו האדנים, הוה לו לכתוב לרמז על זה בפ' ויקהל בעשייתן של האדנים, או בפ' פקודי אצל הקמתן, ומ\"ש דנקטי' הכתוב הכא במצות מחצית השקל שזה היה רק הכנה לעשיית האדנים. ויותר קשה מה דמייתי הפסיקתא ראיה מקרא דעבודת הקדש עליהם הנאמר במשא בני קהת, והרי פסוק זה לא נאמר באדנים כלל, דהאדנים היו משא בני ררי, ואדרבה הפסוק הזה בא לאפוקי משא בני מררי, ולהורות שלא היה בחי' זו דעבודת הקדש עליהם כי אם במשא בנו קהת שהיו נושאים הארון והשולחן והמזבחות, וע\"כ לא ניתן להם עגלות משא\"כ לבני מררי, א\"כ האדנים לא היו בבחי' זו והרי זה ראיה לסתור וצ\"ב.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 148,
      "char_length": 1045,
      "timestamp": "2025-02-06T19:19:07.106390"
    },
    {
      "id": "pekudei_p149",
      "text": "טז) במס' ב\"ב ודף י' ע\"ב) א\"ר אבהו אמר משה לפני הקב\"ה רבש\"ע במה תרום קרן ישראל, אמר לו בכו תשא, ופרש\"י אם באת לשאת ראשם בהגבהה, קח מהם כופר לצדקה ע\"כ, וראוי להבין דאם סגולת הצדקה לגרום נשיאות ראש לישראל, היה ראוי יותר לכתוב לשון נשיאות ראש בפ' תרומה בפסוק כל איש אשר ידבנו לבו, שהוא צדקה גדולה מזו, או בפ' ראה בפסוק פתח תפתח את ידך דעיקר מצות צדקה נאמרה שם, ומ\"ש דרמז עלי' הכתוב במצות מחצית השקל דוקא וצ\"ב.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 149,
      "char_length": 405,
      "timestamp": "2025-02-06T19:19:07.607729"
    },
    {
      "id": "pekudei_p150",
      "text": "יז) איתא במד\"ר ובתנחומא, בפרשת שקלים אמר משה לפני הקב\"ה רבש\"ע משאני מת אין אני נזכר, א\"ל הקב\"ה חייך כשם שאתה עומד עכשיו ונותן להם פ' שקלים ואתה זוקף את ראשן, כך בכל שנה ושנה שקוראין אותה לפני, כאילו אתה עומד שם באותה שעה וזוקף את ראשן וכו', וראוי להבין למה דוקא בפ' שקלים חש משרע\"ה שמא משמת לא יזכר עוד, ולא חש כן בפרשיות אחרות שצוה אותם לבני ישראל לדורות, וגם מה שהבטיחו השי\"ת שע\"י פרשת שקלים יהיה זוקף את ראשן, צ\"ב למה דוקא ע\"ו קריאת פרשת שקלים, ואיך תהיה סגולת קריאת פרשה זו להיות זוקף את ראשן וצ\"ב הכוונה בזה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 150,
      "char_length": 513,
      "timestamp": "2025-02-06T19:19:07.830394"
    },
    {
      "id": "pekudei_p151",
      "text": "יח) בתנחומא (סי' ה') כי תשא את ראש, ר' יונה פתח כי אלקים שופע זה ישפיל וזה ירים (תהלים ע\"ה) פתר קרא בישראל, בלשון זה הוגבהו ובלשון זה הושפלו, בלשון זה הושפלו כי זה משה האיש, ובלשון זה הוגבהו זה יתנו עכ\"ל, ובפסיקתא רבתי (סי' י') איתא קצת בסגנון אחר וז\"ל כיון שראה דוד שבזה כפרה יש להם, התחיל אומר בואו וראו נפלאותיו של הקב\"ה ומעשיו, שבדבר שהכעיסוהו, בו בדבר נתן להם כפרה, כי אלקים שופט זה ישפיל וזה ירים, זה שהשפיל ישראל לבאר שחת בעגל, וזה ירים שרומם קרנם בזה שנאמר זה יתנו עכ\"ל, וצ\"ב מ\"ש בלשון זה הושפלו כי זה משה האיש, וכי היה עיקר חטאם במ\"ש זה משה האיש, וכמו\"כ אמרו בעגל לשונות אחרים במעשה החטא עצמו, שאמרו אלה אלהיך ישראל, עשה לנו אלהים, וגם עשו מעשה שנאמר וישתחוו לו ויזבחו לו, ולמה נקטו במדרש מאמר כו זה משה האיש שאין זה מעיקר החטא, וביותר תימה מ\"ש בפסיקתא בדבר שהכעיסוהו בו בדבר נתן להם כפרה שנאמר זה יתנו, ומה נפק\"מ ואיזה תועלת בהשתוות הלשון, ומצינו שאמרו חז\"ל במד\"ר ויקרא (פר' כ\"א ס\"ה) אם עשית חבילות של עבירות עשה כנגדן חבילות של מצות, עינים רמות והיו לטוטפות בין עיניך, לשון שקר ולמדתם אותם את בניכם וכו' ומני ואזיל כמה בחי' שיעשה האדם מדה טובה כנגד מדה רעה, ובזה יהיה תיקון לנפשו, אבל עכ\"פ צריך שיהיה מדה כנגד מדה בפנימיות המעשה, ואיך יתוקן החטא בהשתוות הלשון וצ\"ב.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 151,
      "char_length": 1176,
      "timestamp": "2025-02-06T19:19:08.085985"
    },
    {
      "id": "pekudei_p152",
      "text": "יט) במס' מגילה (י\"ב ע\"ב) אמר ר\"ל גלוי וידוע לפני מי שאמר והיה העולם שעתיד המן לשקול שקלים על ישראל, לפיכך הקדים שקליהן לשקליו והיינו דתנן בא' באדר משמיעין על השקלים וכו' וראוי להבין איך יספיק כח סגולת השקלים לבטל גזרת המן, והלא אין הדבר תלוי אלא בתשובה, ובאמת עשו ישראל אז תשובה גדולה, כמ\"ש זאל גדולה הסרת טבעת יותר ממ\"ח נביאים וכו' וגזרו צום ובכי שק ואפר, ובפרט כי מצות השקלים בפועל א\"א לקיים רק בזמן שהבהמ\"ק קיים, ולאחר החורבן קריאת הפרשה היא רק זכר למקדש, וגזירת המן לאחר החורבן היתה, ואיך תספיק זכות הקריאה לבד להצילם מכלי'.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 152,
      "char_length": 528,
      "timestamp": "2025-02-06T19:19:08.687757"
    },
    {
      "id": "pekudei_p153",
      "text": "כ) זה יתנו וגו' פרש\"י והוא במד\"ר הראה לו הקב\"ה כמין מטבע של אש וכו' וא\"ל כזה יתנו, ובמס' מנחות (כ\"ט ע\"א) תניא ר\"ו בר' יהודה אומר ארון של אש ושולחן של אש ומנורה של אש ירדו מן השמים, וראה משה ועשה כמותם שנאמר וראה ועשה כתבנותם אשר אתה מראה בהר, והקשו בגמ' אלא מעתה והקמות את המשכן כמשפטו אשר הראית בהר הכי נמי, ופרש\"י הכי נמי דמשכן של אש ורד מן השמים בתמיה, ותירצו בגמ' הכא כתיב כמשפטו, והתם כתיב כתבניתם ופירש רש\"י כתבניתם משמע שהראהו כדמותם עכ\"ל. וצ\"ב כוונת רש\"י ז\"ל מ\"ש בתמיה, וכי מן הנמנע להיות כן, והרי כמו שהוריד הקב\"ה ארון ושולחן ומנורה של אש מן השמים, כמו כן אפשר שהוריד ג\"כ משכן של אש, ומהו התמיהא שכתב רש\"י ז\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 153,
      "char_length": 619,
      "timestamp": "2025-02-06T19:19:08.955253"
    },
    {
      "id": "pekudei_p154",
      "text": "ובעיון יעקב (מבעל שבות יעקב) במס' ברכות (נ\"ה) דקדק בדברי רש\"י אלו כנ\"ל, ותירץ עפ\"י דברי הזוה\"ק בפ' בראשית (הובא בילקוט ראובני פ' תרומה) ותו\"ד הזה\"ק שם וראה ועשה בתבניתם אשר אתה מראה וגו' דא\"ל הקב\"ה למשה כל תיקונין וכל דיוקנא למשכנא וכו' וחמי לו' למט\"ט דקא משמש לכהנא רבא, והקשו בזוה\"ק וא\"ת דהא לא איתוקם משכנא לעילא, עד יומא דאיתוקם משכנא לתתא, ולא שמש ההוא נער לעילא עד יומא דשמש כהנא רבא לתתא, ותירצו אלא ודאי הכי הוא, דחמי לי' משכנא וחמי לי' נער דמשמש לבתר, וכולא מתעכב עד דיתוקם הכא לתתא עכת\"ד הזוה\"ק. עכ\"פ ראי' מקושית הזוה\"ק דא\"א שהראו לו למשה משכן של אש של מעלה, עד דלא איתקם למטה, וע\"כ הקשה רש\"י ז\"ל בתמיה, עכ\"ד בעל עיון יעקב ז\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 154,
      "char_length": 637,
      "timestamp": "2025-02-06T19:19:09.277828"
    },
    {
      "id": "pekudei_p155",
      "text": "ולא הבינותי דבריו ז\"ל, דאיך הביא ראי' מקושית הזוה\"ק, ואדרבה מתירוצם מוכח להיפך דהראהו למשה כתבנית שיהיה לבתר, אע\"ג דלא אותקם עוד. ועוד דמשטחיות לשון הזוה\"ק משמע דעיקר קושיתם הוא על הקרבנות דא\"א שישמש מע\"ט לעילא עד שישמש כהנא רבא לתתא, ולפי\"ז אין שום ראיה מדברי הזוה\"ק. ובפשטות אפ\"ל דקושית המקשן במנחות אזלא אדברי ר\"י ב\"ר יהודה, דלא קא חשיב בברייתא אלא ג' דברים של אש שירדו מן השמים, וע\"כ הקשו על דבריו אלא מעתה ליחשב נמי משכן של אש, והוא כמו ולטעמיך. אבל מלשון רש\"י ז\"ל שכתב בתמיה משמע דא\"א במציאות שיהיה כן וצ\"ב דברי רש\"י ז\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 155,
      "char_length": 527,
      "timestamp": "2025-02-06T19:19:09.618096"
    },
    {
      "id": "pekudei_p156",
      "text": "כא) הפייט יסד בתפלת מוסף לשבת שקלים, אור פניך עלינו אדון נשא, ושקל אשא בבית נכון ונשא, ובצדק הגה ערך כי תשא וכו', וראוי להבין כוונת הפיוט אור פניך עלינו אדון נשא, ומדוע בענין השקלים דוקא, וכל המצות סגולתן כן הוא להמשיך ע\"י הארת המצות מאורו ית', וכולם הם אורות עליונים נאצלים מאורו ית', גם צ\"ב מ\"ש ושקל אשא, והרי המצוה במחצית השקל דוקא דכתיב העשיר לא ירבה, והול\"ל ומחצית השקל אשא וכו' גם ראוי להבין מ\"ש ובצדק הגה ערך כו תשא, וצ\"ב הכוונה במלת ערך המורה על דמיון וערך שוים ומהי הכוונה בזה. ואם מפני שקריאת הפרשה הוא בערך מצות שקלים בפועל, בבחי' ונשלמה פרים שפתינו, והרי גם תפלת מוספי שבת ויו\"ט וכל הקרבנות אנו משלימין ע\"י בחי' זו, ולא מצינו בהם שנתפלל על בחי' הערך וצ\"ב הכוונה כאן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 156,
      "char_length": 678,
      "timestamp": "2025-02-06T19:19:09.882409"
    },
    {
      "id": "pekudei_p157",
      "text": "כב) בטעם מה שצוה השי\"ת ליתן מחצית השקל ולא שקל שלם, כתב האלשיך הק' בשם מהר\"ש אלקבץ ז\"ל להורות את בנ\"י יחס אחדותם, לבל יעלה על לב איש מהם שהוא נפרד מחבירו, כי אם כאילו כל אחד רק חצי, ורק בהתחברו עם כאו\"א מישראל נעשה אחד שלם עכ\"ל, וראוי להבין דכמו\"כ שקל שלם יורה על האחדות, דאינו מספיק וראוי לבנין המשכן כ\"א בצירוף כל שקלי ישראל ביחד, וא\"כ כמו\"כ יבוא הרמז בשקל שלם, ומה טעם למחצית השקל דוקא וצ\"ב.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 157,
      "char_length": 394,
      "timestamp": "2025-02-06T19:19:10.223626"
    },
    {
      "id": "pekudei_p158",
      "text": "וטרם נבוא לבאר כל הענין נציע יסוד מוסד להשוות דברי הגמ' ברכות הנ\"ל (בקושיא ח') עם שיטת המדרשים דלא פליגי כלל, ומוכח כן מתוך לשונם כמו שנבאר. דהנה בגמ' מבואר דטענתו של בצלאל היה, דכלים שאני עושה להיכן אכניסם שמא כך א\"ל הקב\"ה עשה משכן תחלה, ובפשטות טענה זו מלתא דמסתברא היא. אולם מה דאיתא במדרשים שטען בצלאל דאין כבודה של תורה לעשות הארון באחרונה, אינו מובן לכאורה סברת טענה זו, ואדרבה הסברא מורה להיפך, דזהו כבודו של ארון להכין לו בית ומקום ולעשות הארון באחרונה, וכמ\"ש בגמ' להיכן אכנוסם, ואם כן צ\"ב סברת הטענה לפי דברי המדרשים.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 158,
      "char_length": 526,
      "timestamp": "2025-02-06T19:19:10.486523"
    },
    {
      "id": "pekudei_p159",
      "text": "אמנם נראה ביאור הענין כך הוא, דמה שמצינו בגמ' שטען בצלאל כלים שאני עושה להיכן אכניסם, לא היה טענתו על הארון כ\"א על שאר הכלים שולחן ומנורה וכו', דטענה זו לא יתכן גבי ארון כללו דהא מבואר בגמ' מגילה (דף י' ע\"ב) א\"ר לוי דבר זה מסורת בידינו מאבותינו, מקום ארון אינו מן המדה, ובגמ' הביאו החשבון דקדש הקדשים היה כ' אמה, וכנף הכרוב הא' עשר אמות וכן השני, ארון גופי' היכא הוה קאי, אלא לאו ש\"מ בנס היה עומד, ופרש\"י אינו אוחז למעט מדת קרקע וכו'. ובמס' סוטה (ל\"ה ע\"א) אמרינן ארון נושא את נושאיו, ועל דבר זה נענש עוזא שנאמר וישלח עוזא את ידו לאחוז את הארון, א\"ל הקב\"ה עוזא, נושאיו נושא, עצמו לא כ\"ש מיד ויחר אף ד' בעוזא. וכו' עכ\"ל. נמצא שהארון היה עומד באויר ועפ\"י נס וא\"צ למקום כלל, ואפילו כשנשאוהו על הכתף היה נושא את עצמו ואת נושאיו, ומעתה לא היתה טענת בצלאל בגמ' ברכות הנ\"ל על הארון כללו דלא שייך לומר להיכן אכניסם וא\"צ להכין לו מקום, שאפילו לאחר שנבנה המשכן לא היה צריך הארון למקום כלל, ואינו אוחז למעט מדת קרקע, כפרש\"י ז\"ל שהיה עומד באויר ועל כרחך כל טענתו של בצלאל היתה רק על שאר הכלים, שולחן ומנורה וכו' שלא היו בבחי' זו דאינו מן המדה ונושא את נושאיו, שלא היתה בחי' זו אלא בארון לבד. אבל שאר הכלים היו צריכים להכנת מקום.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 159,
      "char_length": 1115,
      "timestamp": "2025-02-06T19:19:10.784911"
    },
    {
      "id": "pekudei_p160",
      "text": "ומעתה א\"ש דאין כאן סתירה בין הגמ' והמדרשים כללו דמ\"ש בגמ' שאמר בצלאל מנהגו של עולם בונה בית ואח\"כ מכניס כלים לתוכו, היתה עיקר טענתו על שאר כלי המשכן חוץ מהארון, כי הם צריכים להכנת מקום כנ\"ל, וז\"ש כלים שאני עושה להיכן אכניסם, וכוונת שאלתו היה על שאר הכלים. ומ\"ש בשמו\"ר ובתנחומא הנ\"ל שאמר בצלאל אין כבודה של תורה בכך, לעשות את הארון באחרונה, היתה טענתו על הארון לבד, ודרשו כן מדכתיב ויעש בצלאל את הארון, ובשאר הכלים לא נזכר שמו של בצלאל על העשי' כמ\"ש בעה\"ת הנ\"ל, דע\"כ זכה שיקרא עשיית הארון על שמו, לפי שהקדים עשיית הארון למשכן, עכ\"פ כל טענתו לא היה רק להקדים את הארון ולא על שאר הכלים, ומעתה מובנת סברת טענתו שאמר און כבודו של ארון לעשותו באחרונה, דזה פגיעה בכבוד הארון, דנראה כאילו צריך להכין מקום עבורו, שהרי מה\"ט לא ניתן לבני קהת עגלות, וכמ\"ש במס' סוטה הנ\"ל שעל דבר זה נענש עוזא, על ששלח ידו לאחוז בארון, דאין כבודו של ארון בכך להיות נישא כמנהגו של עולם, כי הוא נושא את נושאיו, וה\"נ טען בצלאל כי אין כבודו של ארון להיות נעשה באחרונה, וכמנהגו של עולם להכין לו מקום, כי בנס היה עומד ואינו צריך להכנת מקום כלל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 160,
      "char_length": 1008,
      "timestamp": "2025-02-06T19:19:11.400080"
    },
    {
      "id": "pekudei_p161",
      "text": "נמצא מבוארת שפיר טענת בצלאל לפי דברי הגמ', וסברת טענתו לפי\"ד המדרשים, ואין שום סתירה ביניהם, ומר אמר חדא ומר אמר חדא ולא פליגי, ודברי שניהם אמת וקבלה אמיתית, אלא שבגמ' דיברו משאר הכלים חוץ מארון, שהקדים בצלאל עשיית המשכן לעשייתם כדי להכין להם מקום, ובמדרשים דיברו חז\"ל מעשיית הארון שעשאו בצלאל לפני עשיית המשכן דא\"צ למקום ואין כבודו לעשותו באחרונה כנ\"ל וא\"ש. ולהלן נבאר מה שיקשה עוד לפי דרכנו, דבגמ' ברכות הנ\"ל איתא שאמר בצלאל למשה רבינו, שמא כך אמר לך הקב\"ה עשה לי ארון וכלים ומשכן וכו', הרי ששאל בצלאל גם על הקדמת הארון, יבואר להלן בעזה\"ש אולם לא מצינו מבורר בטענתו רק להקדים את הכלים, כמ\"ש כלים שאני עושה להיכן אכנוסם. ולא נמצא בדבריו טענה מספקת על הקדמת הארון, כי טענה זו לא תתכן לגבי הארון שאין לו צורך להכנת מקום, כמבואר בדברינו לעיל, ועל כרחך שהיתה כל טענתו להקדים הכלים כנ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 161,
      "char_length": 783,
      "timestamp": "2025-02-06T19:19:11.919259"
    },
    {
      "id": "pekudei_p162",
      "text": "ועתה נבוא לבאר כל הענין ודברי הגמ' ברכות הנ\"ל, וגם מ\"ש התוס' שם דבפ' תרומה צוה הקב\"ה להקדים הארון ושולחן ומנורה ואחר כך המשכן, ובפ' תשא ובפ' ויקהל הקדים ית' עשיית המשכן תחלה, ולכאורה קשה איך יתכן שנוי רצון לפניו ית', וגם למה בחר משרע\"ה לצוות על עשיית הארון תחלה כמ\"ש לו הקב\"ה בפ' תרומה, והרי כבר נצטוה על ההיפך אח\"כ, ויתבארו גם יתר הקושיות הנ\"ל, ונקדים מה שאמרתי כבר לפרש דברי המדרש רבה במדבר (פר' י\"ב) ויביאו את קרבנם לפני ה' שש עגלות צב וכו' מלמד שהביאום הנשיאים וכו' לא קבל משרע\"ה מהם, עד שנאמרה לו מפי הגבורה קח מאתם הה\"ד ויאמר ה' אל משה לאמר קח מאתם, מהו לאמר, תני רב הושעיא א\"ל הקב\"ה משה צא ואמור להם דברי כבושין ודברי נחמות ע\"כ דברי המדרש, וראוי להבין מה טעם שלא רצה משה רבינו לקבל מהם עד שנאמרה לו מפי הגבורה קח מאתם, ומה הן דברי כבושין ודברי נחמות שנצטוה לאמר להן, ומה ענינם לעגלות.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 162,
      "char_length": 791,
      "timestamp": "2025-02-06T19:19:12.301634"
    },
    {
      "id": "pekudei_p163",
      "text": "ויתבאר בהקדם מה דאיתא שם במדרש רבה (סט\"ז) הלכו הנשיאים והביאו עגלות שיהיו נושאים עליהם את המשכן, ומי נתן להם העצה הזאת שבטו של יששכר, שכך אמרו להם, משכן שעשיתם פורח הוא באויר, אלא התנדבו עגלות שתהיו נושאים אותו בהם, ובשה\"ש רבה (סי' ו') הובא ג\"כ מדרש הנ\"ל ומסיים בה הוא שהכתוב משבח שבט יששכר שנאמר ומבני יששכר יודעי בינה לעתים לדעת מה יעשה ישראל וכו', וראוי להבין הכוונה במ\"ש הוא שהכתוב משבחן שנאמר ומבני יששכר יודעי בינה לעתים, ומהו כל השבח הזה עבור עצתם, ולכאורה לפי הנראה היתה עצתם כפי סברא הפשוטה, וא\"צ בינה יתירה לזה, ומדוע שיבחן הכתוב בבינה לעתים דוקא, וכי מה היה צורך בידיעת העתים לעצתם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 163,
      "char_length": 593,
      "timestamp": "2025-02-06T19:19:12.709938"
    },
    {
      "id": "pekudei_p164",
      "text": "אמנם י\"ל אמיתת הענין עפ\"י מה שכתבנו לעיל דהארון לבדו היה בבחי' זו להיות נושא את נושאיו, ולא שאר הכלים, וגם המשכן עצמו לא היה בבחי' זו, אמנם איתא בתנחומא (סי\"א) וובשמו\"ר פר' נ\"ב ס\"ג) והובא ברש\"י ז\"ל עה\"פ ויביאו את המשכן אל משה וגו' שלא היה יכול שום אדם להקים את המשכן מחמת כובד הקרשים שאין כח באדם לזקפן, אמר משה לפני הקב\"ה איך אפשר הקמתו ע\"ו אדם, א\"ל עסוק אתה בידך, נראה כמקימו, והוא נזקף ועומד מאליו, וז\"ש הוקם המשכן, הוקם מאליו עכ\"ל רש\"י בשם מדרש תנחומא, מבואר מזה דמעצם קדושתן, היה כל המשכן בבחי' זו להיות נושא את עצמו ואת נושאיו, דכמו שהוקם מאליו בדרך נסע כמו\"כ היה יכול להיות נושא את עצמו ופורח באויר, וכ\"ז היה בהם בכח. ומשה רבינו המשיך עליהם בחי' קדושה זו בגודל קדושתו, שהוקם מאליו ונישא מאליו בדרך נס, ע\"ו כח קדושתו של משה שהמשיך אלי' בחי' ההוא, כמ\"ש בתנחומא הוקם מאליו, ומי העמידו משה שנאמר ויקם משה את המשכן, ר\"ל שמשרע\"ה המשיך אליו בחי' הקדושה ההיא שיוקם מאליו, אבל כל ישראל והלוים לא יכלו להמשיך אלי' בחי' הקדושה ההיא, ולכך לא היה כח בשום אדם לזקפן, וע\"כ הוצרכו הלוים נושאי המשכן לנשאו בעגלות, שלא היה בכוחם להמשיך אלי' בחי' הקדושה ההיא להיות נושא את נושאיו, אלא הארון לבדו היה לו תמיד בחי' קדושה זו להיות עומד בנס, ומקום ארון אינו מן המדה, ונושא את נושאיו כמ\"ש ז\"ל במס' סוטה ובס' מגילה הנ\"ל וכ\"ז היה ע\"ו כח התורה שבארון, וע\"י שבצלאל המשיך אלי' בחי' קדושה זו כמו שנבאר להלן, וע\"כ נקרא עשיית הארון על שמו, שנאמר ויעש בצלאל את הארון.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 164,
      "char_length": 1341,
      "timestamp": "2025-02-06T19:19:13.026775"
    },
    {
      "id": "pekudei_p165",
      "text": "וכ\"ז היה רק בזמן שלא היה עדיין תכלית השלימות ולא ניתקן עדיין חעא העגל לגמרי ע\"כ לאו היו ראוים להמשיך קדושה כזו שיהיו המשכן וכליו בבחי' זו להיות נושא את נושאיו, אלא הארון לבדו כנ\"ל, אבל לעתיד כשיהיה עולם התיקון. וחטא העגל יהיה ניתקן לגמרי, אז יהיה המשכן וכל כליו בבחי' נושא את עצמו, ועוד יבואר להלן עפי\"מ דאמרינן (ברכות כ\"ח ע\"א) מעלין בקודש ואין מורידין, וכיון דהמשכן וכל כליו כבר היה להם בחי' קדושה זו ע\"ו משה, מוכרח שיחזור אליו בחי' קדושה זו לעתיד דאין מורידין שהרי אותו המשכן עצמו שהיה במדבר יוחזר אלינו לעתיד כדאמרינן במס' סוטה (ט' ע\"א) משנבנה מקדש ראשון נגנז אהל מועד קרשיו קרסיו בריחיו ועמודיו ואדניו, ועתיד הקב\"ה להחזירה לנו לעתיד, כמ\"ש ז\"ל במס' יומא (ע\"ב ע\"א) עצי שעים עומדים, שמא תאמר אבד סברן, פרש\"י משנגנזו אבד סברן שלא ישובו עוד, ת\"ל עומדים שעומדים לעולם ולעולמים, ולכשיחזרו אלינו לעתיד יחזרו בבחי' קדושה שהיה להם ע\"ו משה רבינו להיות נושא את נושאיו דמעלין בקודש ואין מורידין כנ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 165,
      "char_length": 891,
      "timestamp": "2025-02-06T19:19:13.703192"
    },
    {
      "id": "pekudei_p166",
      "text": "וז\"ש במדרש הנ\"ל מי נתן העצה הזאת להתנדב עגלות שבטו של יששכר, שכך אמרו להם משכן שעשיתם פורח הוא באויר, אלא התנדבו עגלות שיהיו נושאים אותו בהם, ר\"ל שע\"י חכמת התורה אשר בהם, השיגו שלפי מצב של אותו הדור עדיין לא הגיעו אל התיקון השלם, שיהא המשכן פורח באויר ונושא את נושאיו ועדיין צריכים לעגלות, וזה שסיימו במדרש הוא שהכתוב משבחן ומבני יששכר יודעי בינה לעתים, לדעת מה יעשה בישראל, שוש בהם בינה לדעת העתים ומצב הדור, וז\"ש לדעת מה יעשה ישראל, וכפי מדרגת ישראל באותו הזמן יעצו אותם לתת את העגלות, וא\"ש מ\"ש במדרש שלא רצה משה לקבל מהם העגלות, כי משה רבינו היה משתוקק שיהיה התיקון השלם מיד, ולטעם זה רצה ליכנס לא\"י כמובא בדברי חז\"ל, ולכשיהיה התיקון השלם אז לא יצטרכו לעגלות, כי יהיה הארון נושא את עצמו ואת נושאיו, וע\"כ לא רצה לקבלו עד שנאמרה לו מפי הגבורה קח מאתם, כי עדיין אינם ראוים להמשיך בחי' קדושה כזאת, וז\"ש ז\"ל במדרש מהו לאמר צא ואמור להם דברי כבושין ודברי נחמות, כי בזה שצוה הקב\"ה ליקח העגלות מאתם, דיבורים אלו הם דברי כבושין לישראל, שעדיין לא הגיעו לתיקון השלימות, ודברי תוכחה הוא להם, וגם ניחם אותם ודיבר על לבם כו לעתיד תתגלה בחינת קדושה זו.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 166,
      "char_length": 1040,
      "timestamp": "2025-02-06T19:19:14.152156"
    },
    {
      "id": "pekudei_p167",
      "text": "ומעתה יתורץ קושיא הנ\"ל, דלמה הקדים הכתוב בפ' תרומה הארון והכלים לפני עשיית המשכן, ובפ' תשא ובפ' ויקהל הקדים המשכן תחלה, אמנם כתבו בעה\"ת בריש פ' תרומה דפרשת ויקחו לי תרומה נאמרה בתוך מ' יום ממתן תורה לפני חטא העגל וכן מבואר בזוה\"ק ויקהל (דף קצ\"ה ע\"א) אבל פ' תצוה ופ' כי תשא אחר חטא העגל נאמרו (עיין בדברינו פ' תרומה ופ' תשא דמבואר כן מזוה\"ק פ' פנחס ומדברי בעה\"ת תצוה עיי\"ש). וע\"כ בפ' תרומה לפני חטא העגל נאמר ציווי המשכן בבחי' גבוה, וכפי הבחי' שיהיה לעתיד, וכל הכלים הי\"ל בחי' קדושה שיהיה נושא את עצמו ופורח באויר, ע\"כ היה ציווי השי\"ת לעשות הארון והכלים תחלה ואח\"כ המשכן דלא היו צריכין הכנת מקום, והיו כל הכלים בבחי' אינו מן המדה, ואדרבה אין כבודם בכך להכין להם מקום. כי אין להם צורך לזה כמ\"ש לעיל לענין הארון, אבל בפ' תשא ובפ' ויקהל שנאמרו אחר חטא העגל לא היו ישראל ראוים עוד להמשיך בחי' קדושה כזו, ע\"כ היה הצורך להכין מקום להם, ולכן הקדים הכתוב עשיית המשכן תחלה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 167,
      "char_length": 863,
      "timestamp": "2025-02-06T19:19:14.669430"
    },
    {
      "id": "pekudei_p168",
      "text": "אך לפי שהיה דיבורו ית' אלינו בפ' תרומה ציווי המשכן בבחי' גבוה כנ\"ל, ע\"כ מוכרח שיחזור אלינו בחי' זו לעתיד, וע\"ד שכתב האוהחה\"ק בפ' ויחי עה\"פ איש אשר כברכתו בירך אותם, דמה שאמר לראובן דברי קנטור ראובן בכורי אתה וגו' שם צוה את הברכה, ע\"ד שאמחז\"ל עתידה עבודה שתחזור לבכורות, והגם שניתנה הבכורה ללוים, לעתיד שקולים יהיו, ויבואו שניהם לעבוד עבודת הקודש, כי מעלין בקודש ולא מורידין, וכפי\"ז כיון שקבע יעקב אבינו שם הבכורה לראובן עתיד הוא לעמוד לשרת לע\"ל עיי\"ש, וה\"נ כיון שהיה ציווי השי\"ת בפ' תרומה לפני חטא העגל בבחי' גבוהה ע\"כ מוכרח שיחזור אלינו לעתיד בחי' קדושה הזאת, אלא שלאחר חטא העגל וקודם שנשלמו תיקון השלם לא היינו ראוים לבחי' קדושה ההיא כנ\"ל, לכן הקדים הכתוב עשיית המשכן תחלה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 168,
      "char_length": 675,
      "timestamp": "2025-02-06T19:19:15.071934"
    },
    {
      "id": "pekudei_p169",
      "text": "אמנם משה רבינו היה משתוקק שיהיה התיקון השלם מיד כידוע וכמ\"ש לעיל, וע\"כ הציע לפני בצלאל עשיית המשכן על אופן המעולה והבחינה הגבוהה, כמו שהיה מאמרו ות' לפני חטא העגל ובבחי' שיהיה לעתיד, ואמרו חז\"ל בשמו\"ר (פר' מ' ס\"ב) שהראה הקב\"ה למשה ספרא דאדה\"ר וא\"ל אף בצלאל מאותה שעה התקנתיו, (ועיין בדברינו פ' ויקהל) שהשיג בצלאל בחי' המקדש דלעתיד ועשה המשכן וכליו דוגמת בחי' דלעתיד עיי\"ש, וע\"כ חשב משרע\"ה אולי יהיה בכח קדושתו של בצלאל להמשיך אליהם בחי' הקדושה דלעתיד, כו מאחר שהוא מיוחד ומתוקן לכך אולי יהיה בכח קדושתו לעשות המשכן וכליו בבחי' הקדושה כמו שצוה השי\"ת בפ' תרומה לפני חטא העגל, וע\"כ מסר לו משרע\"ה הציווי כמו שנצטוה בפ' תרומה לעשות הכלים ואח\"כ המשכן כי בבחי' זו שהיו לפני חטא העגל לא היו צריכים להכנת מקום, דהיה להם בחי' נושא את נושאיו ופורח באויר כנ\"ל, אכן בצלאל השיב לו שזה א\"א לפי מצב הדור, שעדיין לא הגיעו לתכלית השלימות ולתיקון השלם של חטא העגל, וז\"ש בצלאל מנהגו של עולם אדם בונה בית ואח\"כ מכניס כלים וכו' כלים שאני עושה להיכן אכניסם, והכוונה דלפי מצב הדור עדיין אינם ראוים לבחי' הקדושה עפ\"י דרך נס, ולפי הנהגת העולם ומצבם של ישראל שעדיין לא ניתקן החטא, צריכים להתנהג עדיין כדרך העולם להיות בונים בית ואח\"כ כלים, כי כלים שאני עושה להיכן אכנוסם, כי א\"א להמשיך אליהם בחי' קדושה דלעתיד שיהיו פורחים באויר ועומדים בנס.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 169,
      "char_length": 1214,
      "timestamp": "2025-02-06T19:19:15.386082"
    },
    {
      "id": "pekudei_p170",
      "text": "וז\"ש לו משרע\"ה שמא בצל א\"ל היית וידעת, ואפשר הכוונה עפומ\"ד במדרש (מובא בעבודת הקודש לר\"מ גבאי ז\"ל) ה' צילך, מה הצל אם אתה מצחק לו הוא משחק לך. אם אתה בוכה לו הוא בוכה כנגדך, אם אתה מראה לו פנים נעימות או מסוברות, אף הוא מראה לך כך, אף הקב\"ה ה' צלך כשם שאתה הוו' עמו הוא הוו' עמך, (ובספרי תלמידי בעש\"ט הק' מובא זה המאמר בשמו, ונראה שהיה מרגלא בפומיה מאמר זה, ע\"כ הזכירוהו תלמידיו הק' בשמו), וז\"ש לו משה רבינו בצל אשל היית וידעת, שאתה משיג בחי' הצל למעלה שהוא כפו מצב הדור למטה, וע\"כ ידעת שעדיין אינם ראוים להשפעת בחי' הקדושה דלעתיד.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 170,
      "char_length": 531,
      "timestamp": "2025-02-06T19:19:15.941759"
    },
    {
      "id": "pekudei_p171",
      "text": "וא\"ש דברי הגמ' ברכות (נ\"ה) הנ\"ל, שאמר בצלאל שמא כך אמר לך קב\"ה עשה משכן וארון וכלים, הרי שרצה בצלאל לעשות הכנת מקום גם לארון. אמנם אפשר דאחר חטא העגל מיד נחלש כח הקדושה, וגם בארון לא יכלו להמשיך כח קדושה כזו שיהיה פורח באויר ונושא את נושאיו, ובאמת היה ציווי הבוי\"ת כן לאחר חטא העגל דבפ' תשא ובפ' ויקהל כתיב לעשות האהל מועד ואח\"כ הארון וכמבואר במדרשים הנ\"ל שאמר משרע\"ה משאנו עושים את המשכן אנו עושים את הארון כנ\"ל, אלא שפעל בצלאל ע\"י כח התשובה שעשו ישראל על חטא העגל, וגם ע\"י נדבת המשכן שהיה להם לכפרה על חטא העגל כמ\"ש ז\"ל (ירושלמי שקלים פ\"א ה\"ב) יבוא זהב ויכפר על זהב, ובצלאל שהיה מקבל הנדבה מישראל ראה התלהבות ישראל בנדבת המשכן לעשות מקום להשראת השכינה, וע\"כ בצירוף כח התורה שבארון, היה יכול להמשיך על הארון בחי' קדושה דלעתיד, שלא יצטרך להכין לו מקום, וז\"ש במדרש שאמר בצלאל אין כבודה של תורה להכין לו מקום וא\"צ לכך, אבל מיד אחר חטא העגל חשב גם בצלאל שגם הארון יצטרך להכנת מקום, ולא יכלו להמשיך עליו קדושת העתיד, וז\"ש בגמ' ברכות הנ\"ל שאמר בצלאל שמא צריך להקדים המשכן לארון ולכלים וא\"ש.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 171,
      "char_length": 985,
      "timestamp": "2025-02-06T19:19:16.265459"
    },
    {
      "id": "pekudei_p172",
      "text": "ומעתה נבאר דברי המדרשים והילקוט שא\"ל משה רבינו לבצלאל משאנו עושים את המשכן אנו עושים את הארון, ולפי דרכינו מעתה אחר שהודיע לו בצלאל מצב ומעמד הדור חשב משרע\"ה שהמשכן יקדים אף לארון. דלפי מצב הדור גם הארון לא יהיה לו בחי' קדושה ראשונה, כמו שהיה הציווי עליו לפני חטא העגל, וע\"כ צריך להכין לו מקום כמנהגו של עולם, וע\"ז א\"ל בצלאל, רבינו משה אין כבודה של תורה בכך, דע\"י כח התורה שבארון המסייע, יהיה אפשר להמשיך אליו בחינת קדושה גבוהה להיות נושא את עצמו ופורח באויר, וא\"צ להכנת מקום כלל, כי אין כבודה של תורה להכין לה מקום, וזהו פגיעה בכבוד התורה כנ\"ל וזהו ויעש בצלאל את הארון ועשי' זו לשון תיקון הוא, כמו ועשתה את צפרניה (דברים כ\"א), ובכל הכלים לא כתיב ויעש בצלאל אלא בארון, לפי שפעל ותיקן להמשיך אליו בחי' קדושה גבוהה, וז\"ש במדרש לפיכך זכה שיקרא על שמו שנאמר ויעש בצלאל, מעתה נתבאר הכל בטעמו ונימוקו, דברי הגמרא ודברי המדרשים, וטענת בצלאל ותשובת משרע\"ה, בהסבר וטעם נכון.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 172,
      "char_length": 865,
      "timestamp": "2025-02-06T19:19:16.796094"
    },
    {
      "id": "pekudei_p173",
      "text": "ועתה נבוא לבאר דברי רש\"י ז\"ל במס' מנחות כ\"ט ע\"א (עיין לעיל קושיא כ\"(ן דהנה הקשו המפרשים על מה שאמרו חז\"ל לקח הקב\"ה כמין מטבע של אש מתחת כסא הכבוד והראהו למשה ואמר לו כזה יתנו, ולכאורה אינו מובן, דהרי השקל היה מטבע היוצא בהוצאה באותן הימים, ויותר מושג לו, כשיאמר לו הקב\"ה משקלו בפירוש, ממה שיכיר בתבנית אש שאין לו דמיון כלל, והעו\"ז ז\"ל בספר דברי דוד עה\"ת מבאר דלא נתקשה משה במטבע של מחצית השקל ובתבניתו, וא\"ש מה שלא מנו חז\"ל מטבע זו בין הדברים שנתקשה משרע\"ה עליהם אלא שהראה לו הקב\"ה מטבע של אש, לרמז לו דקדושה גדולה יהיה במטבע שיתנו, דהוא עצמו המטבע של אש שבא מתחת כסא הכבוד, וימשך עליו בחי' קדושה של מעלה, וע\"ז אמר זה יתנו כלומר דבר זה עצמו היינו המטבע של אש יתנו, ויוסיפו קדושה למעלה ע\"ו נתינת מטבע של כסף שלהם. עכ\"ד הטו\"ז ז\"ל. וכמו\"כ אפ\"ל מ\"ש חז\"ל במס' מנחות (כ\"ט ע\"א) הנ\"ל דארון של אש ושולחן של אש וכו' ירדו מן השמים וראה משה ועשה כתבנותם, לא שנתקשה משרע\"ה בתבנית הארון והשולחן כי לא מנו אותם חז\"ל במנחות פרק הקומץ בין הדברים שנתקשה משה עליהם, אלא שהראה הקב\"ה למשה עצם בחי' קדושתן שיש בהם בכח, ואפשר להמשיך עליהם בחי' קדושה שלמעלה, להיותן ממש כמו השולחן של אש וארון של אש למעלה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 173,
      "char_length": 1081,
      "timestamp": "2025-02-06T19:19:17.221900"
    },
    {
      "id": "pekudei_p174",
      "text": "אמנם לא זכו ישראל ולא היו ראוים עדיין להמשיך בחינת קדושה זו על כל הכלים, כ\"א בארין לבדו כמו שנתבאר לעיל, ולעתיד יהיו כל הכלים והמשכן בבחי' זו כנ\"ל, ורק בני קהת נושאי הארון והשולחן וכלי הקודש, לגודל קדושתן המשיכו עליהם בחי' קדושה שלמעלה לפי שעה, וע\"כ לא היו צריכים לעגלות, שהיו כל הכלים בבחי' נושא את עצמו, ובעת משאם המשיכו עליהם בחי' השראת השכינה, וכמ\"ש בפסיקתא הנ\"ל שהשכינה באה לתוך המשכן והם נושאים אותה, אבל לא נשארה בחי' קדושה זו בכל הכלים לדורות, אלא בארון לבדו וכמ\"ש במס' סוטה (ול\"ה ע\"א) הנ\"ל דעל דבר זה נענש עוזא בימי דוד על ששלח ידו בארון, והארון היה נושא את נושאיו לעולם, אבל בכל הכלים לא נתקיים בחי' קדושה זו שהמשיכו אלי' בני קהת אלא לשעה, וע\"כ לא היו צריכים לעגלות, וז\"ש הכתוב ולבני קהת לא נתן, כי עבודת הקודש עליהם שהמשיכו בחי' הקדושה שלמעלה, וע\"כ בכתף ישאו דהיה בבחי' נושא את עצמו כנ\"ל, ומעתה יתבארו דברי הגמ' מנחות הנ\"ל שהקשו שם אלא מעתה והקמות את המשכן כמשפטו וגו' הכי נמי, ופרש\"י ה\"נ דמשכן של אש ירד מן השמים בתמיה, וכוונתו דא\"כ היה נמשך גם למשכן בחינת קדושה בדוגמת האש שלמעלה, כמו שהמשיכו בנו קהת בחי' זו לשולחן וארון ומנורה, וא\"כ לא היה צורך לעגלות כלל אף למשכן כמו משא בני קהת בכל הכלים והרי חזינן דלאו הכי הוה, וצוה הקב\"ה קח מאתם והיו לעבוד את עבודת אהל מועד, ע\"כ דא\"א לומר דמשכן של אש ירד מן השמים. (ומתורץ קושיא כ' הנ\"ל).",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 174,
      "char_length": 1243,
      "timestamp": "2025-02-06T19:19:17.747248"
    },
    {
      "id": "pekudei_p175",
      "text": "והשתא יבואר דברי הפסיקתא רבתי הנ\"ל (בקושיא י\"ד וט\"ו), כי תשא את ראש בנ\"י ואין ראשם של ישראל אלא הקב\"ה וכו' אמר הקב\"ה בשקלים שהביאו ישראל עשו אדני המשכן, והשכינה באה לתוך המשכן והם נושאים אותה וכו' מנין שנאמר כי עבודת הקודש עליהם בכתף ישאו, ויובן לדרכנו דהנה כי תשא לשון עתיד וכמ\"ש בתנחומא שא את ראש לא נאמר אלא כו תשא, והכתוב מרמז כאן על בחי' דלעתיד, כשיהיה תיקון השלם וכל המשכן וגם האדנים תהיה להם בחי' קדושה עליונה, וכפי הבחי' שנצטוה משה רבינו בפרשת תרומה, והמשכן והאדנים יהיו נושאים את עצמם ואת נושאוהם, וז\"ש בפסיקתא שהשכינה באה לתוך המשכן והם נושאים אותה, ומעתה לא יהיה כבחינת משא במנהגו של עולם, אלא בבחי' נושא את נושאיו.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 175,
      "char_length": 626,
      "timestamp": "2025-02-06T19:19:18.350397"
    },
    {
      "id": "pekudei_p176",
      "text": "וא\"ש מה שהביא הפסיקתא ראיה מקרא דעבודת הקדש עליהם הנאמר במשא בני קהת (עיין קושיא ע\"ו) דכמו שבני קהת המשיכו בחי' השראת השכינה ובחי' קדושה שלמעלה על כלי המשכן הארון והשולחן והמנורה כמ\"ש לעיל, כמו\"כ לעתיד יהיה כל המשכן כן ועוד בבחי' יותר גבוהה, שהשכינה עצמה כביכול תהיה נישאת בהם, כמ\"ש כו תשא את ראש, ואין ראשם של ישראל אלא הקב\"ה, והא דרמז קרא ע\"ז במצות מחצית השקל, ולכאורה מקומה הנכון יותר בפרשת עשיית האדנים או בעשיית המשכן כקושיתינו לעיל, אמנם כפו מ\"ש לעיל בשם הטו\"ז זלל\"ה דמחצות השקל היה ממש הבחי' וכח הקדושה דמטבע של אש מתחת כסא הכבוד, וז\"ש הכתוב זה יתנו ר\"ל המטבע של אש שהראה לו הקב\"ה למשה זה עצמו יתנו, ולפי שממחצית השקל עשו דנו המשכן, ע\"כ נמשך בהם קדושה עליונה כבחי' מטבע של אש, אלא שלא זכו ישראל לבחי' זו מיד כנ\"ל, אבל יזכו אלי' לעתיד ועוד יהיה בחינתה גבוה יותר כמבואר בזוה\"ק פ' פנחס דבנין דלעתיד יהיה בנוי ומשוכלל מן השמים, וכ\"כ רש\"י ותוס' סוכה (מ\"א ע\"א), ויהיה בית המקדש של אש ובבחי' קדושה שלמעלה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 176,
      "char_length": 905,
      "timestamp": "2025-02-06T19:19:18.671755"
    },
    {
      "id": "pekudei_p177",
      "text": "ועתה נבוא לבאר קישור הפסוקים בפרשתונו והדקדוקים שבענין כנ\"ל, ונקדים מה דאיתא בתנחומא למה עשה משה רבינו חשבון, אלא מפני ששמע ליצני הדור משיחין אחריו שנאמר והיה כצאת משה וגו' והביטו אחרי משה, ומה היו אומרים, אדם שנתמנה על ככרי כסף וזהב שאין לו חקר וכו' מה אתה רוצה שלא יהיה עשיר, כששמע כן אמר חייכם משנגמרה מלאכת המשכן אני נותן לכם חשבון וכו', ולכאורה אינו מובן, הגם דאל שחשדוהו הוו מדלת העם וליצני הדור, אבל בעלי בינה בודאי שלא היתה ידם ודעתם בזה, מ\"מ קשה להבין דאפילו הקל שבקלים איך יחשוב ככה על משרע\"ה, אחרי שראו קרן עור פניו ויראו מגשת אליו, וכל ישראל ראו במעמד הנבחר שדיבר ה' עם משה פנים אל פנים ואיך לא יראו לדבר במשה דברים זרים כאלה, וגם מה זה שאמרו שנתעשר משה מנדבת המשכן, הלא כבר היה עשיר מפסולת הלוחות, כמ\"ש ז\"ל (נדרים ל\"ח ע\"א) פסל לך וכו' משם נתעשר משה ואפ\"ל עפי\"מ שפירשתי כבר (עיין בדברינו פ' ויקהל) מאמר הפסוק והמלאכה היתה דים וגו' והותר, שהקשה האוהחה\"ק ז\"ל דהם ב' דברים הפכיים, דאם דים אינו הותר, ואם הותר אינו דים, ועיי\"ש מה שתירץ, ואפ\"ל עוד עפימ\"ש בתנחומא פרשה זו איש אמונות ורב ברכות זה משה וכו' שכל הדברים שהיה גזבר עליהם הוו מתברכים וכו', ולכאורה כיון שהביאו ישראל די והותר א\"כ למה היה נורך שיתברך ויתרבה בדרך נס, ויתותר אח\"כ, והרי לא עביד קוב\"ה ניסא למגנא.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 177,
      "char_length": 1174,
      "timestamp": "2025-02-06T19:19:19.111569"
    },
    {
      "id": "pekudei_p178",
      "text": "אמנם מבואר בזה\"ק פ' תרומה ודף קכ\"ח ע\"א) ויקחו לו תרומה מאת כל איש מההוא דאקרי איש, דאתגבר על יצרי' וכו' אשר ידבנו לבו דיתרעי בי' קוב\"ה וכו', ולפי\"ז לא זכו כל ישראל להיות להם חלק בבנין המשכן, כי בני עליה שיהיו להם כל המעלות האלו מועטים הם ואלו שלא זכו להיות חלקם בבנין המשכן נותרה נדבתם ולא נשתמשו בה, ומעתה בדרך הטבע לא הספיקה נדבת המשכן, כי חלק גדול ממנה נותותר, ולא זכו בעליהם להיות להם חלק בבנין המשכן, על כן היה הצורך שתתברך ותתרבה הנדבה בדרך נס שיהיה דים, וא\"ש הפסוק והמלאכה היתה דים והותר, ושניהם היו בנדבת המשכן דמפני שנתותר חלק מהנדבה על כן היה צורך שישלח ה' בו את הברכה בדרך נס שיהיה דים.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 178,
      "char_length": 597,
      "timestamp": "2025-02-06T19:19:19.674137"
    },
    {
      "id": "pekudei_p179",
      "text": "ומעתה אפ\"ל דהם חשדו למשה רבינו, דמחמת שהוא אוהב מצות מאוד. ואוהב מצות לא ישבע מצות, והקב\"ה רצון יראיו יעשה, ע\"כ אפשר שחלק נדבתו נתברך ונתרבה בדרך נס, ע\"י שזכות צדקתו מסייעתו והספיקה נדבתו לכל מלאכת המשכן, ונדבת כל ישראל או רובם נותרה, וזו היתה דאגתם שלא יהיה להם חלק בבנין המשכן, וחשדו למשה רבינו שלקח כל זכות המצוה לעצמו ולא הניח לחלקם כלום, אולם בעלי השגה ובני העליה שבישראל לא חשדו את משרע\"ה גם בזה, כי ידעו והשיגו שמשרע\"ה עושה הכל רק לטובת ישראל, ומסר את נפשו תמיד עבור טובת ישראל ורק אנשים קטני השכל הם שחשדו למשה, ואף אלו לא חשדו אותו ח\"ו על בצע כסף, כי אין הדעת סובלת לחשוב ככה, אלא היתה החשדא על בחי' הנ\"ל, ומה שאמרו שנתעשר מנדבת המשכן הי' כוונתם ברוחניות, שלקח כל המצות לעצמו, או אפשר שהם אמרו בפירוש אופן החשדא כנ\"ל, וחז\"ל רמזו ע\"ז בדרך משל, וע\"כ כששמע משה רבינו כן, אמר חייכם שאני נותן לכם חשבון, כך וכך היתה הנדבה, כך וכך הוצאתי למלאכה, ונתן להם חשבון מדוקדק להראות להם שמחלק נדבת ישראל נעשה ונבנה המשכן, ולא מחלק נדבתו, ואיתא במדרש תנחומא שעשה חשבון גם על מה שנותר, וא\"כ ראו ישראל שלא נותרה כל נדבתם, והיה להם ג\"כ חלק בבנין המשכן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 179,
      "char_length": 1043,
      "timestamp": "2025-02-06T19:19:19.992416"
    },
    {
      "id": "pekudei_p180",
      "text": "ולדרכנו יתורץ קושיתנו הנ\"ל, על מ\"ש במד\"ר (פר' נ\"א), אלה פקודי המשכן וגו' א\"ר יוחנן לב' בקרים הביאו והותר, אמר משה לפני הקב\"ה מה נעשה בנותר וכו' הוי אלה פקודי המשכן (עיין לעיל קושיא ט\"ו), ויובן לדרכנו דלפי שהותר, ע\"כ חשדוהו למשרע\"ה שחלקם של ישראל ותותר כנ\"ל וע\"כ הוצרך ליתן חשבון מהנדבה, ומה שעשה מהנותר כנ\"ל, וז\"ש הוי אלה פקודי המשכן, ומקושר דרשא זו לאלה פקודי המשכן וא\"ש.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 180,
      "char_length": 372,
      "timestamp": "2025-02-06T19:19:20.502098"
    },
    {
      "id": "pekudei_p181",
      "text": "והנה כתב רש\"י ז\"ל משכן העדות, עדות לישראל שויתר להם הקב\"ה על מעשה העגל שהרי השרה שכינתו ביניהם. עכ\"פ מבואר דא\"א להיות בחי' השראת שכינה כל זמן שוש פגם חטא חיו, ומכ\"ש שא\"א שתחול השראת השכינה על דבר שנבנה ונעשה ע\"י עול, וצריך להיות מזוקק אפילו מבחי' שלא לשמה, וכמ\"ש ק\"ז הושמח משה זלל\"ה בפרשת קרח בשם ס' עור בנימין דבהמ\"ק ומשכן שאמחז\"ל שמכוון כנגד מקדש שלמעלה ע\"כ צריך להיות לשמה דוקא, כי בחי' שלא לשמה הוא רק עד השמים כמ\"ש ז\"ל במס' פסחים (נ' ע\"ב) עיי\"ש, ולפי\"ז הכלים שהיו משא בני קהת שהמשיכו עליהן בחי' השראת שכינה מקדושה שלמעלה כמ\"ש הכתוב זאת עבודת בנו קהת באהל מועד קדש הקדשים (במדבר ד') ופירש\"י המקודש שבכולם הארון והשולחן והמנורה והמזבחות והפרוכת וכלי שרת. ולטעם זה לא היו צריכים לעגלות כו היו הכלים בבחינת נושאים את עצמם כדכתיב כי עבודת הקדש עליהם בכתף ישאו (במדבר ז') ועל כן לא הוצרך משה לתת חשבון על מה שנעשה בזהב לפי שמן הזהב נעשו הכלים שהיו משא בנו קהת הארון המנורה והשלחן וכו' ובהם לא היה שייך חשד זה כי בחינת הקדושה העליונה שהיתה בהם היא עדות לישראל שלא נעשה כל עול בעשייתן, אבל משא בני מררי ובני גרשון שהי' עבודת הלוים ביד איתמר בן אהרן הכהן, ולפי שהיו נושאים בעגלות ולא היו ישראל ראויים עדיין שתמשך בחינת קדושה שלמעלה על המשכן והאדנים כמ\"ש לעיל, נמצא דלא היה בהם עדות של בחי' השראת השכינה, ע\"כ היה עליהם חשדא בבחי' הנ\"ל, ולכך הוצרך משה רבינו ליתן חשבון על הכסף ועל הנחושת שהיה משא בני מררי ביד איתמר, ולא הוצרך לתת חשבון על הזהב שהיה משא בנו קהת ביד אלעזר, שעליהם לא היה חשדא כלל, (ומתורץ קושיא ה').",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 181,
      "char_length": 1409,
      "timestamp": "2025-02-06T19:19:20.734225"
    },
    {
      "id": "pekudei_p182",
      "text": "ומעתה א\"ש קישור הפסוקים אלה פקודי המשכן משכן וגו' דהנה באמת למה לא היה כל המשכן בבחי' זו דנושא את נושאיו, ובבחי' מקדש שלמעלה, לפי שעתיד ליחרב, וכמ\"ש ק\"ז הישמח משה זלל\"ה בפ' תרומה (דף ק\"פ ע\"ב) דע\"כ לא ירד המשכן בנוי ומשוכלל מן השמים, דאילו היה כן לא היה הבהמ\"ק יכול להתמשכן בעונותיהם של ישראל, משום דקדושת המשכן נעתקה אל המקדש כמו המעתיק מכתב לכתב, ואילו היה המשכן בנוי ומשוכלל מן השמים ולא היה לישראל חלק בו, לא הוה המקדש שנעתק ממנו נחרב לעולם, כמו המקדש העתיד שיהיה בנוי ומשוכלל לא יחרב לעולם, ואלמלא שפך חמתו על עצים ואבנים לא נשתייר ח\"ו משונאיהם של ישראל שריד ופליט, וע\"כ לא היה אפשר שיהא נעשה המשכן בבחי' גבוהה כזו, שירד בנוי ומשוכלל מן השמים.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 182,
      "char_length": 647,
      "timestamp": "2025-02-06T19:19:21.402487"
    },
    {
      "id": "pekudei_p183",
      "text": "וזהו התכת קישור הפסוקים אלה פקודי המשכן, שהוצרך משרע\"ה ליתן חשבון על נדבת המשכן, ולמה הוצרך לזה, לפי שלא הי' עלי' עדיין בחי' הנס להיות נושא את נושאיו, ולא היה בכל המשכן עדות דהשראת השכינה כמו שהיה במשא בני קהת כנ\"ס, והטעם משכן משכן לפי שעדיין עתיד להתמשכן בעונותיהם של ישראל, וע\"כ לא ירד בנוי ומשוכלל ובבחי' גבוהה כמו לעתיד, אשר פקד עפ\"י משה, הכתוב משמיענו רבותא שאע\"פ שנעשה כל המשכן עפ\"י משה. רבינו, ובגודל קדושתו המשיך עליו בחי' קדושה זו לפי שעה, וכמ\"ש לעיל בשם המדרש ויקם משה את המשכן, וכתיב הוקם את המשכן שהוקם מעצמו בדרך נס, שבכח קדושתו המשיך אליו בחי' קדושה דלעתיד להיות נושא את עצמו, אבל לא היו ישראל ראויים עדיין לבחי' קדושה ההיא, והלוים לא היו יכולים להמשיך בחי' זו אלא למשא בני קהת קודש הקדשים כלים המקודשים, אבל כל המשכן לא היה אפשר עדיין להיות בבחי' זו כנ\"ל, וע\"כ לא נתן חשבון כי אם על עבודת הלוים שביד איתמר, דהיינו משא בני גרשון ומררי שהם היו משתמשים בעגלות, ולא היה בבחי' נושא את עצמו, ע\"כ לא הוה בחי' הנס עדות בהם, לארך לתת חשבון. אבל במשא בני קהת שהיה ביד אלעזר, לא נתן משה רבינו חשבון עליהם, לפי שהי' בחי' הנס עדות עליהם כנ\"ל, ומהאי טעמא לפי שלא היה אפשר עדיין להמשיך בחי' ההוא על כל המשכן, שלא היה עדיין התיקון השלם, ע\"כ ובצלאל בן אורי בן חור וגו' עשה את כל אשר צוה ה' את משה, וכמו שפירש\"י דלא כתיב אשר צוה משה, אלא אשר צוה ה' את משה, שהסכימה דעתו למה שאמר הקב\"ה למשה להקדים המשכן ואח\"כ הכלים, ולעשות הכנת מקום כמנהגו של עולם, כי ראה לפי מצב הדור שאינם ראויים עדיין להמשיך בחי' קדושה גבוהה דלעתיד, ולעשותו כבחי' שצוה הקב\"ה בפ' תרומה כנ\"ל, וא\"ש מ\"ש ובצלאל בוא\"ו החיבור, וקישור הפסוקים יבואו על נכון, שכפי הנראה המה ענינים נפרדים ולדרכנו כולם על בחי' אחת נאמרו כנ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 183,
      "char_length": 1583,
      "timestamp": "2025-02-06T19:19:21.725065"
    },
    {
      "id": "pekudei_p184",
      "text": "ועתה נבוא לבאר מדרש הנ\"ל (קושיא י\"ג) ויביאו את המשכן אל משה הה\"ד עוז והדר לבושה ותשחק ליום אחרון. דהנה בעלי ההשגה שבישראל כאשר ראו והשיגו שאין המשכן בשלימות בבחי' קדושתו לעתיד, והבינו מזה החורבנות העתידות לבוא עליהם, וגלות ישראל שעתידה להיות, כמ\"ש לעיל כי לטעם זה לא היה המשכן בשלימות קדושתו בנוי ומשוכלל, מפני שעתיד להתמשכן וכו', וע\"כ נשבר לבם בקרבם כו ידעו שמצב הדור הוא הגורם, ואלולי כן היה המשכן בבחי' גבוהה, וכפי הבחי' שצוה השי\"ת לעשותו בפ' תרומה לפני חטא העגל, אמנם רמזה תוה\"ק כאן הבטחת נחמה, שעתידה אותה בחי' לחזור לנו לעתיד, וע\"ד שכתב האוהחה\"ק בפ' ויחי על מ\"ש חז\"ל שעתידה העבודה שתחזור לבכורות, וכתב הוא ז\"ל בטעמו דמעלין בקודש ואין מורידין (עיין לעיל), וה\"נ כיון שהיה מתחלה ציווי הבורא וית' להיות המשכן בבחי' גבוהה, וגם משה רבינו ע\"ה הקימו בבחי' זו, כמשארז\"ל שהוקם מאליו בבחי' נושא את עצמו כקדושתו לעתיד, ע\"כ מוכרח שאותה הבחי' תחזור אליו, ולע\"ל משרע\"ה עצמו ימשיך אל המשכן בחי' גבוהה, ויהיה המשכן של אש ממש בנוי ומשוכלל מן השמים, ומוכרח כן מטעמא דמעלין בקודש ואין מורידין כנ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 184,
      "char_length": 984,
      "timestamp": "2025-02-06T19:19:22.512729"
    },
    {
      "id": "pekudei_p185",
      "text": "והנה במס' מנחות (צ\"ט ע\"א) אמחז\"ל מנלן דאין מורידין אמר רבי דאמר קרא ויקם משה את המשכן, ופירש\"י מדלא סייעוהו אחיו הכהנים בהקמת עמודים ואדנים ש\"מ אין מורידין, לפיכך לא נתעסקו בו אחרים אחרי שהתחיל בו משה רבינו, עכ\"פ ממאמר הכתוב ויביאו את המשכן אל משה וגו' ויקם משה את המשכן, נשמע גדולתם של ישראל לעתיד, ובחי' המשכן לעתיד מטעמא דמעלין בקודש וכו', וז\"ש במדרש הה\"ד עוז והדר לבושה וגו', דהנה איתא במד\"ר (פר' מ\"ה ס\"ב) ויתנצלו בנ\"י את עדים מהר חורב, ומונה והולך כמה מיני לבושי הוד והדר שנתלבשו ישראל כשאמרו נעשה ונשמע עטרה ופורפראות וכו' ואמרו ז\"ל במס' שבת (פ\"ח ע\"א) וכולן עתיד הקב\"ה להחזירן לנו לע\"ל שנאמר ושמחת עולם על ראשם, שמחה שמעולם על ראשם, והיינו נמי מטעמא דמעלין בקודש ואין מורידין כנ\"ל, וז\"ש ויביאו את המשכן אל משה ונשמע מכאן דמעלין בקודש ואין מורידין, הה\"ד עוז והדר לבושה בשעת מ\"ת, ואע\"פ שהתנצלו את עדיים מהר חורב, אבל ותשחק ליום אחרון שעתיד הקב\"ה להחזירן לנו. ונשמע מכאן גדולתם של ישראל לעתיד, ובחי' המשכן ומקדש דלעתיד, ומשרע\"ה יהיה עומד וזוקף את ראשן כמ\"ש ז\"ל במדרש.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 185,
      "char_length": 970,
      "timestamp": "2025-02-06T19:19:22.970274"
    },
    {
      "id": "pekudei_p186",
      "text": "ועתה נבוא לבאר מדרשי חז\"ל בפ' שקלים המובאים בדברינו, דהנה מצות מחצית השקל בחינתה גדולה וגבוהה יותר מכל הצדקות כמו שכתבתי לעיל, דמצות הצדקה אפשר שתהיה אפילו בבחי' שלא לשמה, כמ\"ש ז\"ל (פסחים ח' ע\"א) האומר סלע זו לצדקה בשביל שיחיה בני הרי זה צדיק גמור, משא\"כ מחצית השקל שעשו מהם האדנים, ובחינתה מעל השמים כמ\"ש היש\"מ בשם עיר בנימין הנ\"ל היתה הנתינה חייבת להיות לשמה דייקא כמ\"ש לעיל, וגם גדלה מעלתה עפימ\"ש הטו\"ז זלל\"ה הנ\"ל דקדושה גדולה היתה במטבע שנתנו, ונמשכה עליה בחי' מטבע של אש שלמעלה, הגם שכל המצות סגולתן כן הוא להמשיך על ודם קדושה עליונה מאורו ית', ע\"ו הארת המצות שהם אורות עליונים נאצלים מאורו ית', אבל במצות מחצית השקל ניקל יותר להשיג בחי' זו, כי מוטבעת בה בחי' קדושה שלמעלה מאתו ית', ע\"ו מטבע של אש שהראה למשה וא\"ל כזה יתנו: וע\"כ בחי' צדקה זו סגולתה לרומם קרן ישראל ובחי' הקדושה, וא\"ש דברי הגמ' (ב\"ב י' ע\"ב הובא לעיל קושיא ט\"ז) אמר משה לפני הקב\"ה רבש\"ע במה תרום קרן ישראל, אמר לו בכו תשא, ופירש\"י אם באת לשאת ראשם קח מהם כופר לצדקה, כו דוקא צדקה זו דמחצית השקל סגולתה להשיג בחי' זו כנ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 186,
      "char_length": 991,
      "timestamp": "2025-02-06T19:19:23.426133"
    },
    {
      "id": "pekudei_p187",
      "text": "אמנם משרע\"ה היה מתיירא דעכשיו יש להם לישראל הכח הזה על ידו, להמשיך ע\"ו מחצית השקל בחי' מטבע של אש ולרומם קרן ישראל, אבל אחר שיסתלק מן העולם היה חושש שלא יהיה להם זה הכח ובחי' הקדושה הזאת, וז\"ש במדרש בפרשת שקלים אמר משה וכו' משאני מת אין אני נזכר, וא\"ל הקב\"ה בכל שנה ושנה שקוראין אותה לפני כאילו אתה עומד וזוקף את ראשן, שגם ע\"י קריאת הפרשה יהיה אפשר להמשיך בחי' מעבע של אש ע\"ח כוחו של משה רבינו וכמו שיבואר להלן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 187,
      "char_length": 411,
      "timestamp": "2025-02-06T19:19:23.899851"
    },
    {
      "id": "pekudei_p188",
      "text": "ועתה נבוא לבאר דברי התנחומא הנ\"ל בלשון זה הושפלו כו זה משה האיש ובלשון זה הוגבהו זה יתנו, ולכאורה יל\"ד מ\"ש כו זה משה האיש וגו' מאי כוונו במלת זה, וחז\"ל אמרו במס' שבת (פ\"ט ע\"א) שהראה להם השטן דמות מטתו, והיינו דקאמרי לי' לאהרן כו זה משה האיש אשר העלנו מארץ מצרים לא ידענו מה הוה לו, אמנם עדיין צ\"ב דיספיק לומר כו האיש משה אשר העלנו מארץ מצרים וגו' ומידע ידיע, דהכוונה על משה זה ולא ל לאחר, ובודאי יש עוד איזה כוונה במלת זה, ואפ\"ל דהנה כתבו כל הראשונים הבע\"ת והרמב\"ן והראב\"ע, כי לא כוונו ישראל לעשות את העגל לשם ע\"ז, כ\"א לעשות שופט ומנהיג במקומו של משרע\"ה, והנה בעלי התוס' הקשו ע\"ז, דאם כל חפצם הוה רק לעשות מנהיג, למה לא מנה אהרן עליהם לראש את כלב או את נחשון, או הוא בעצמו יהיה מנהיגם, ולמה עשה את העגל הזה, עיי\"ש מה שתירצו דחשש שמא יקשה בעיני משה ויקפיד עליו, ותירוצם ז\"ל קשה להבין דלמה חש אהרן על הקפדת משה, והיה לו לחשוש יותר על הקפדת השי\"ת, וגם כי אהרן הכהן מסר נפשו עבור ישראל כמ\"ש ז\"ל (ויק\"ר פ\"י ג') שאמר מוטב יתלה הסרחון בו וכו', וא\"א לומר שלא עמד בנסיון מחמת חשש הקפדת משה עליו.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 188,
      "char_length": 986,
      "timestamp": "2025-02-06T19:19:24.116523"
    },
    {
      "id": "pekudei_p189",
      "text": "אולם אפשר לתרץ קושית בעה\"ת בפשטות, כי המה ידעו והשיגו גדולת ומעלת משרע\"ה, שעלה ונתעלה למדריגה יותר ממלאכי מרום, ונתקרב אל השכינה הק' עד שדיבר ה' אליו פה אל פה, ע\"כ ידעו שאין מציאות במין האנושי שיהיה להם מנהיג בבחי' משה, ובאמת לא יהיה כן עד מלך המשיח שאמחז\"ל בתנחומא פ' תולדות עה\"פ הנה ישכיל עבדי ירום ונשא וגו' ירום מאברהם ונשא ממשה, ועיין בספרי ויואל משה (מאמר א' סי' ל\"ז) שלפי המבואר בזוה\"ק ובמדרשים יהיה מלך המשיח נשמת משרע\"ה, עכ\"פ לא קשה קושית בעה\"ת למה לא מינה להם אהרן מנהיג אחר במקום משה, כי המה רצו דוקא במנהיג היורד מן השמים, כדי שיהיה בבחי' משה, מפני שידעו שבמין האנושי לא ימצאו מנהיג כבחינתו ומדריגתו, וז\"ש כי זה משה האיש, דמנהיג כזה כבחי' משה ובמין האנושי לא ידענו מה היה לו, ועתה איה ואיפה נמצא מנהיג כזה במין האנושי, וע\"כ אמרו קום עשה לנו אלהים, ר\"ל מנהיג בדוגמתו, וזה א\"א ע\"ו כלב או נחשון או אהרן אלא רצו דוקא במנהיג היורד מן השמים, והרמב\"ן ז\"ל הביא בשם פרדר\"א ששמעו צורה מהמרכבה, שנאמר ופני שור מהשמאל בד' חיות הנושאות את הכסא עיי\"ש, עכ\"פ הם רצו דוקא במנהיג שיהיה לו השפעה מן השמים, ומעשה השטן הצליח שטעו בעגל, שיצא העגל מעצמו בדרך נס ולא היה בדרך הטבע באמת, אלא שהיה מקורו מכח הסט\"א, ואלו שטעו בו חשבו שהוא נס מן השמים והשפעת אלקות בבחי' משה, עד שבא משה רבינו ע\"ה ושרפו ויזר את עפרו על פני המים, וכולם ראו שאין בו ממש ולא התנגדו כלל למעשה משה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 189,
      "char_length": 1260,
      "timestamp": "2025-02-06T19:19:24.605477"
    },
    {
      "id": "pekudei_p190",
      "text": "והנה אף שהמעשה בעצמו היה בלתי מיושר, אבל עכ\"פ היה בזה גם בחי' מחשבה טובה, במה שהיו משתוקקים להשפעת קדושה מבחי' של מעלה, וגם כיון שראו שמשה איננו היה לבם נשבר בקרבם על הורדת בחי' הדור, וכמ\"ש ז\"ל (ב\"ב ע\"ה ע\"א) א נים שבדור אמרו פנו משה כפני חמה פנו יהושע פני לבנה, אוי לאותה בושה אוי לאותה כלימה, וע\"כ בקשו מנהיג בבחי' משה רבינו להוריד להם השפעה מקדושה שלמעלה, ולפי שהיתה מחשבתם טובה בזה, ע\"כ מדה כנגד מדה נתן להם הקב\"ה מצות מחצית השקל, והראה להם מטבע של אש וא\"ל כזה יתנו, דמחצית השקל בחינתו להמשיך השפעת קדושה בדרגא דלעילא כמובא לעיל בשם הטו\"ז זלל\"ה, וזה לעומת זה יהיה תיקון על מ\"ש כי זה משה האיש, כי גם בזה היתה מחשבתם לטובה, אלא שטעו ע\"ו הסתת היצה\"ר ובהשתדלות הערב רב, ועתה נתן להם השי\"ת את אשר אותה נפשם, להוריד השפעת קדושה בדרגא דלעילא, וז\"ש במדרש ובפסיקתא הנ\"ל בא וראה נפלאותיו של הקב\"ה, שבדבר שהכעיסוהו, בו בדבר נתן להם כפרה, כי אלקים שופע זה ישפיל וזה ירום, בלשון זה הושפלו ובלשון זה הוגבהו, שהיה תקנה זו להם מדה כנגד מדה וזה לעומת זה כנ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 190,
      "char_length": 945,
      "timestamp": "2025-02-06T19:19:25.207129"
    },
    {
      "id": "pekudei_p191",
      "text": "וזה מאמר המדרש הנ\"ל שחש משרע\"ה שמא משאני מת לא יהיה להם הכח הזה להוריד השפעת אלקית בבחי' זו, ע\"ח הבטיחו השי\"ת בכל שנה ושנה שקוראין פרשת שקלים אתה זוקף את ראשן, דכמו שהיתה להם השפעת הקדושה ע\"ו משרע\"ה במצות מחצית השקל, שהמשיך להם בחי' מטבע של אש ונתרומם קרן ישראל בכי תשא את ראש כמ\"ש ז\"ל, כן מוכרח שיחזור לנו הכח והבחי' ההיא, דמעלין בקודש ואין מורידין כנ\"ל, ובכל שנה ישראל מתעוררים בקריאת פרשת שקלים, ונמשך להם בחי' קדושה עליונה מאש של מעלה, מבחי' מטבע של אש שהראה ות' למשרע\"ה, והוא אור אמיתי מאור אין סוף ב\"ה, ויתרומם קרן השכינה כמ\"ש ז\"ל כי תשא את ראש אין ראשם של ישראל אלא הקב\"ה, ובזכות הצדקה של מחצית השקל וכן ע\"ו קריאת הפרשה מתעוררת בחי' הגאולה ושישראל מושגחים מאתו ית' למעלה מן הטבע, כי זהו סגולתה לרומם קרן ישראל וקרן השכינה כביכול, וא\"ש מ\"ש במס' מגילה (י\"ב ע\"ב) שהקדים הקב\"ה שקליהם לשקלי המן (עיין קושיא י\"ט) ואף שלא היה נוהג מצות שקלים בפועל בימי המן, אבל גם קריאת הפרשה סגולתה לעורר ישועה ונסים ובחי' גאולה כנ\"ל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 191,
      "char_length": 919,
      "timestamp": "2025-02-06T19:19:25.672282"
    },
    {
      "id": "pekudei_p192",
      "text": "וז\"ש בפייט דשקלים אור פניך עלינו אדון נשא, שע\"י מצות מחצית השקל וקריאת הפרשה יאיר אלינו מאורו ית' מבחי' אש שלמעלה, כי כן סגולת מצוה זו, ואפשר דע\"כ צותה התוה\"ק ליתן רק מחצית השקל ולא שקל שלם להורות דמה שאנו נותנין, אינו עדיין תכלית השלימות, אלא עבודתינו להמשיך עי\"ז בחי' מטבע של אש ושקל שלמעלה, ובהצעררף אליה מטבע של אש תהי' בחינתם א' ואז יהיה שקל שלם בשלימות האמיתי, וז\"ש אור פניך עלינו אדון נשאל וכשיהיה בבחי' זו אז ושקל אשא בבית נכון ונשא, דלעתיד יהיה השקל שלם בשלימות בחינתו, וישיגו כל ישראל בחי' מטבע של אש, שעכשיו הוא רק בהסתרה, ולעתיד יתגלו כל ההבעחותו כמ\"ש (צפניה ג') בשובי את שבותיכם לעיניכם אמר ה\"נ ובצדק הגה ערך כו תשא שאנו מבקשין מלפניו ית', שע\"י קריאת הפרשה יתעורר הערך של כי תשא, ר\"ל מטבע של אש שלמעלה שהוא הערך של מחצית השקל שהראה הקב\"ה מטבע של אש ואמר לו זה יתנו, ואנו מבקשין שיצורף אל קריאתינו הערך, דהיינו בחי' מטבע של אש שלמעלה, ויהיה שקל שלם ובחי' שלימה ויתרומם קרן השכינה וקרן ישראל, ונזכה לביאת משיח צדקנו מתוך אנפין נהירין בהתגלות כבוד שמים עלינו במהרה בימינו אמן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 192,
      "char_length": 986,
      "timestamp": "2025-02-06T19:19:26.141993"
    },
    {
      "id": "pekudei_p193",
      "text": "ובצלאל בן אורי בן חור למטה יהודה עשה את כל אשר צוה ה' את משה, פירש\"י ז\"ל אשר צוה אותו משה אין כתיב כאן אלא כל אשר צוה ה' את משה אפילו דברים שלא אמר לו רבו הסכימה דעתו למה שנאמר למשה בסיני כי משה צוה לבצלאל לעשות תחלה כלים ואח\"כ משכן אמר לו בצלאל מנהג עולם לעשות תחלה בית ואח\"כ משים כלים לתוכו אמר לו כך שמעתי מפי הקב\"ה א\"ל משה בצל א\"ל היית כי בודאי כך צוה לי הקב\"ה וכן עשה המשכן תחלה ואח\"כ עשה כלים עכ\"ל. והכי איתא בגמרא ברכות (דף נ\"ה ע\"א) וז\"ל אמר ר' שמואל בר נחמני א\"ר יונתן בצלאל ע\"ש חכמתו נקרא בשעה שאמר לו הקב\"ה למשה לך אמור לו לבצלאל עשה לי משכן וארון וכלים הלך משה והפך וא\"ל עשה ארון כלים ומשכן, א\"ל, משה רבינו מנהגו של עולם אדם בונה בית תחלה ואח\"כ מכניס לתוכו כלים וכו' כלים שאני עושה להיכן אכניסם שמא כך אמר לך הקב\"ה עשה משכן ארון וכלים אמר לו שמא בצל אשל היית וידעת עכ\"ל הגמרא. והנה כמה קולמוסין נשתברו כבר על מאמר זה וילאו כל חכמי לב ליישבו מדוע צוה משה רבינו ע\"ה לבצלאל לעשות כלים תחלה היפך ממה שצוהו הקב\"ה וכבר ביארנו בזה לעיל ועוד לאלקי מילין.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 193,
      "char_length": 957,
      "timestamp": "2025-02-06T19:19:26.678512"
    },
    {
      "id": "pekudei_p194",
      "text": "ב) התוס' שם הקשו היכן מצינו שצוה הקב\"ה למשה לעשות משכן תחלה, והרי בפ' תרומה כתיב ארון תחלה, ותירצו כי בפ' תשא כתיב את אהל מועד ואת ארון העדות עכ\"ד, ולתירוצם אכתי קשה שנמצא לפי\"ז כי ציווי הקב\"ה בפ' תרומה לעשות כלים תחלה סותר למה שצוה בפ' תשא לעשות משכן תחלה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 194,
      "char_length": 257,
      "timestamp": "2025-02-06T19:19:27.175541"
    },
    {
      "id": "pekudei_p195",
      "text": "ג) עוד יל\"ד בדברי הגמ' שהשיב בצלאל מנהגו של עולם וכו' כלים שאני עושה להיכן אכניסם, וצ\"ב מדוע הוצרך בצלאל להשיבו מכח מנהג העולם והלא בלאו הכו נמי טענה נכוחה בפיו, כלים שאני עושה להיכן אכנוסם, ואם נאמר כי טענתו כלים שאני עושה להיכן אכנוסם היא אך מכח מנהג העולם, ובלאו הכי היה יכול להניחם בחוץ: א\"כ קשה מה שייך לדמות מעשה המשכן אשר נבנה בסודות נשגבים וברזין עילאין, למנהג העולם שאדם בונה בית תחלה וכו', והרי כל מעשי המשכן היו ענינים רמים אשר שרשם בגבהי מרומים, ואמרו ז\"ל (שם) יודע היה בצלאל לצרף אותיות שנבראו בהם שמים וארץ, ונעשו בהקמתו נסים ונפלאות, ואין שייך להקשות מכח מנהג העולם.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 195,
      "char_length": 581,
      "timestamp": "2025-02-06T19:19:27.332727"
    },
    {
      "id": "pekudei_p196",
      "text": "ד) החתם סופר זלה\"ה בספרו תורת משה הביא להקשות בשם רבו חסיד שבכהונה הגאון מו\"ה נתן אדלער זצ\"ל דמה תועלת היה במה שעשה בצלאל את המשכן תחלה ואח\"כ כלים, והלא מלאכת המשכן וכליו נשלמה בכ\"ה בכסליו. כדאיתא במדרש והביאו העור או\"ח סי' תרפ\"ד, ולהקים את המשכן צוה ה' בר\"ח ניסן. וא\"כ להיכן נתנו את הכלים עד ר\"ח ניסן, וכקושית בצלאל ותירץ דעיקר הקפידא היתה על הכלים לאחר משיחתן, שאז נתקדשו במשיחתן, אבל בצלאל יפה הקשה, שאם היו נעשים הכלים תחלה, ראוי היה שגם המשיחה תהיה בהם ראשונה עכ\"ד.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 196,
      "char_length": 470,
      "timestamp": "2025-02-06T19:19:27.638677"
    },
    {
      "id": "pekudei_p197",
      "text": "ובעיני יפלא מאד תירוצו, מי גילה לנו דהא בהא תליא והמוקדם לעשיה הוא המוקדם למשיחה, ואם אמנם נתפוס כדבריו שהקפידא היתה רק אחר המשיחה, א\"כ הרי היו יכולים לעשות הכלים תחלה ואח\"כ המשכן, ולהניח הכלים בחוץ, ומשיחת המשכן תקדם למשיחת הכלים. וא\"כ מה היתה טענת בצלאל כלים שאני עושה להיכן אכניסם. ומצינו כיוצא בזה בקרבנות דמי שנתחייב חטאת ועולה אף שהחטאת קודמת לעולה בשחיטה כאמרם ז\"ל (זבחים ז' ע\"ב) לפרקליע שנכנס ריצה פרקליט נכנס דורון אחריו, אעפי\"כ להקטרת האברים עולה קודמת, כיון שהיא כולה כליל, כדתנן בפ' כל התדיר (פ\"ט ע\"א), וכמו כן בעשיית המשכן, אף אם היו הכלים מוקדמים לעשייה, היו יכולים להקדים משיחת המשכן ואח\"כ משיחת הכלים, כיון שיש טעם בדבר. וכן מצינו שהקדים הכתוב למנות בנו קהת קודם בני גרשון אף שהוא הבכור, כיון שוש טעם בדבר כי בנו קהת היו טוענו הארון. עוד יש לחקור דהיכן היו מונחים הכלים במשך זמן המסעות כשפירקו את המשכן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 197,
      "char_length": 819,
      "timestamp": "2025-02-06T19:19:27.882358"
    },
    {
      "id": "pekudei_p198",
      "text": "וכדי לבא אל ביאור הענין, נקדים מה שנחלקו קדמונינו ז\"ל אם מעשה העגל קדם לציווי מלאכת המשכן דדעת רש\"י ז\"ל בפ' תשא ומקור דבריו במדרש תנחומא פ' פקודי כי מעשה העגל קדם לציווי מלאכת המשכן ימים רבים, ואף שציווי המשכן כתיב קודם אין מוקדם ומאוחר בתורה. אמנם הזה\"ק כתב דפרשת ויקחו לי תרומה נצטוו קודם חטא העגל: וע\"כ כתיב בה מאת כל איש אשר ידבנו לבו לרבות הע\"ר. משא\"כ בפ' ויקהל כתיב קחו מאתכם למעט הערב רב שעשו את העגל. וכבר הקשו המפרשים ז\"ל ע\"ד רש\"י ז\"ל מדוע לא פירש כדעת הזה\"ק כי הפרשיות כתובות כסדרן, ומעשה העגל מאוחר מצוווי מלאכת המשכן, ומה דחקו לומר שמעשה העגל קדם, והוכרח לומר כי אין הפרשיות כסדרן ואין מוקדם ומאוחר בתורה. (ועי' בדברנו לעיל פ' תרומה הארכנו לבאר הענין בכמה אנפי).",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 198,
      "char_length": 674,
      "timestamp": "2025-02-06T19:19:28.287301"
    },
    {
      "id": "pekudei_p199",
      "text": "ונראה לבאר הענין בהקדם לתרץ מה שהקשינו עי' קושיא ב') כי לכאורה ציווי הקב\"ה בפ' תרומה לעשות כלים תחלה סותר לציווי בפ' תשא שנאמר משכן תחלה ואח\"כ כלים, ויובן עפ\"י דברי הזה\"ק שפ' תרומה נאמרה קודם מעשה העגל, ובאמת קודם חטא העגל לא היתה שייכת קושיית בצלאל כלים שאני עושה להיכן אכניסם, שהרי מקום היה להניחם במחנה ישראל, שהיה קדוש בקדושה נפלאה, וכלל ישראל היו כולם קדושים וטהורים, וגם היו מובדלים מן הע\"ר בהיותם מוקפים בענני הכבוד, ולא עוד אלא שאף הע\"ר היו במדרגה גבוהה, שהרי היו במעמד הנבחר. ואם כן אתו שפיר מה שנצטוו בפרשת תרומה לעשות כלים תחלה ואחר כך משכן, כו מקום הוה להניח את הכלים במחנה ישראל. אמנם אחר חטא העגל שנתגשמו וירדו ממדרגתם, ונתחללה קצת קדושת מחניהם: שוב לא היו יכולים להניח את הכלים במחנה ישראל, כי סר ממנו תוקף הקדושה, וגם הוצרכו לשמרם מן הערב רב שנתקלקלו מאד ונעשו שפלים ופחותים על כן הוצרכו לבנות משכן תחלה ואחר כך כלים, ואתי שפיר אשר בפרשת תשא כתיב משכן תחלה, כי פרשה זו נאמרה אחר חטא העגל, ואז לא היו יכולים להניח הכלים במחנה ישראל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 199,
      "char_length": 947,
      "timestamp": "2025-02-06T19:19:28.615429"
    },
    {
      "id": "pekudei_p200",
      "text": "ועפ\"י זה י\"ל כי באמת לא פליגי רש\"י והזה\"ק כלל, וגם רש\"י ז\"ל ס\"ל כדברי הזה\"ק כי פרשת תרומה נאמרה קודם חטא העגל, אלא שעל מה דכתיב בפ' תשא לפני פרשת העגל משכן תחלה ואח\"כ כלים ע\"ז קאמר רש\"י ז\"ל כי מעשה העגל קדם, אף שהקדים הכתוב לכתוב ציווי המשכן, וא\"ש מה שהקשינו מאין יצא לרש\"י ז\"ל לומר כי חטא העגל קדם, כי לדברינו מוכרחים אנו לומר כן, שלא תקשה לנו כי הציווי בפ' תרומה סותר למה דכתיב בפ' כו תשא, וע\"כ לומר כי ציווי עשיית המשכן דכתיב בפ' תשא נאמר אחר חטא העגל וע\"כ כתיב ביה משכן תחלה, ואח\"כ כלים, אלא שהקדימו הכתוב לפני מעשה העגל, כי אין מוקדם ומאוחר בתורה. וראי' לדברינו שכוונת רשיז\"ל קאי רק על ציווי המשכן האמור בפ' תשא שהרי בפ' תשא במעשה העגל שם הודיענו רש\"י ז\"ל כי ציווי מלאכת המשכן מאוחר הוא למעשה העגל, ואם נאמר שהכוונה הוא על ציווי המשכן האמור בפ' תרומה, למה המתין רש\"י ז\"ל לכתוב זאת עד פ' תשא, והוה ליה להודיענו דבר זה בתחלת ציווי המשכן האמור בפ' תרומה, אלא ודאי שגם רש\"י ז\"ל סבר כדעת הזה\"ק שפרשת תרומה נצטוו קודם מעשה העגל, והא דכתב רש\"י ז\"ל כו אין מוקדם ומאוחר בתורה כוונתו לציווי המשכן האמור בפ' כי תשא.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 200,
      "char_length": 1009,
      "timestamp": "2025-02-06T19:19:29.078565"
    },
    {
      "id": "pekudei_p201",
      "text": "ועפ\"י דרכנו ניחא גם מה שהקשה הגאון ר' נתן אדלער זצ\"ל (קושיא ד') דהיכן הניחו את הכלים מכ\"ה בכסליו שנשלמה עבודת המשכן וכליו עד ר\"ח ניסן שבו הוקם המשכן, והשתא א\"ש כי ע\"י שנתנו ישראל נדבתם למשכן. ונעשתה בנדבתם עבודת המשכן, נתכפר להם על מעשה העגל, כדאיתא בירושלמי (שקלים פ\"א ה\"א) תנא ריב\"ח הדא מתניתא ועשית כפורת זהב עהור (שמות כ\"ה) יבא זהב של כפורת ויכפר על זהב של עגל ע\"כ. וראיה שמחל להם הקב\"ה מיד על מעשה העגל וחזרה השכינה לשרות בתוכם שהרי כתיב להלן בפרשה וירא משה את כל המלאכה והנה עשו אותה כאשר צוה ה' ויברך אותם משה, פירש\"י ז\"ל אמר להם יהי רצון שתשרה שכינה במעשה ידיכם ובמדרש ילקוט מבואר שאמר להם משה כשם שנתעסקתם במלאכת המשכן ושרתה השכינה\" במעשה ידיכם כן תזכו ותבנו לפניו בית הבחירה ותשרה שכינה במעשה ידיכם ע\"כ. הרי שמיד בגמר מלאכת המשכן שרתה עליהם שכינה, וא\"כ מיושב שפיר מה שהקשה הגאון ר' נתן אדלער ז\"ל שהרי מעת גמר מלאכת המשכן היו יכולים להניח הכלים במחנה ישראל שהרי כבר נתכפר להם על מעשה העגל, וכן בשעת המסעות שפורקו את המשכן היה מקום הנחת הכלים במחנה. ושאלת בצלאל כלים שאני עושה היכן אכניסם היתה אם יעשו כלים תחלה ואח\"כ משכן, כי עד שלא נעשה המשכן היו נזופים מחטא העגל ולא היו יכולים להניח את הכלים במחנה ישראל כו לא היו ראוים אז להשראת השכינה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 201,
      "char_length": 1149,
      "timestamp": "2025-02-06T19:19:29.569771"
    },
    {
      "id": "pekudei_p202",
      "text": "ועתה נבא ליישב למה צוה משה לבצלאל לעשות כלים תחלה היפך מה שנאמר לו מפי הגבורה ואח\"כ חזר והודה לדבריו (קושיא א'), ויתבאר בהקדם מ\"ש בסה\"ק אוהב ישראל בשם המגיד הקדוש מזלאטשוב זלל\"ה בביאור דברי רש\"י ז\"ל בפרשת נח עה\"פ ויבא נח אל התיבה מפני מי המבול, וז\"ל, אף נח מקעני אמנה היה, מאמין ואינו מאמין שיבא המבול וכו' וזלה\"ק לכאורה הוא פלא גדול לחשוד את נח הצדיק שהיה מקטני אמנה בהשי\"ת, ונ\"ל דתיבת אמנה יש לו ב' פירושים, א' כפשוטו האמנת הדבר שבודאי יהיה כך, עוד י\"ל אמנה מלשון ויהי אומן את הדסה והוא לשון המשכה וכו', כי באמונה יש כח זה שע\"י האמונה יומשך הדבר הזה ממקורו ויבא, היינו שע\"י שהוא מאמין בהשי\"ת ובוטח בו באמונה שלמה על שום איזה דבר אז נמשך הדבר ההוא ובא בשלמות. והנה נח הצדיק בודאי האמין בשלימות בכל אשר דיבר אליו השי\"ת בכל לבו ובכל נפשו וכו', אך בדבר זה היה ירא להאמין באמונה שלמה בכל לבבו, כי אולי יהיה הוא הגורם להבאת המבול, היינו ע\"י שלימות אמונתו יומשך בודאי מזה הבאת המבול, ולא היה יודע ליתן עצות בנפשו מה לעשות, וז\"ש רש\"י ז\"ל מקטני אמנה היה מאמין ואינו מאמין, ר\"ל שבאמת היה מאמין, רק שהיה ירא להאמין בשלימות וכו' עכ\"ל הק'.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 202,
      "char_length": 1028,
      "timestamp": "2025-02-06T19:19:30.106761"
    },
    {
      "id": "pekudei_p203",
      "text": "ועפ\"י זה י\"ל מה שצוה משה לבצלאל כלים ואח\"כ משכן כי משה רבינו ע\"ה התפלל על בני ישראל שימחול ה' להם על מעשה העגל, והיה ממתין ומצפה כו תיכף ומיד יתכפר להם אף טרם עשית המשכן ולכן אף שצוה לו ה' אחר מעשה העגל לעשות משכן תחלה ואח\"כ כלים כמבואר בפ' תשא, אעפ\"כ לא צוה כן לבצלאל אלא היפך הסדר וצוה לעשות כלים תחלה, כו הוה ירא שע\"י דיבורו ואמונתו בשלימות במה שצוהו הקב\"ה לעשות משכן תחלה, יהיה הוא הגורם להמשיך הדבר מן השמים שלא יתכפר לישראל על מעשה העגל אלא בהקמת המשכן, ע\"כ צוה לעשות כלים תחלה, כי השתוקק וציפה בנפשו ומאודו שימחול ה' להם מיד על מעשה העגל, ויחזרו למעמד ומצב שהיו קודם חטא העגל, ושפיר יוכלו לעשות כלים תחלה.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 203,
      "char_length": 612,
      "timestamp": "2025-02-06T19:19:30.619149"
    },
    {
      "id": "pekudei_p204",
      "text": "אמנם בצלאל אשר ראה מצב העם באותה שעה, וכו עדיין אינם ראוים להשראת השכינה עד שיעשו מלאכת המשכן, על כן הקשה לו מנהגו של עולס\" אדם בונה בית תחלה ואח\"כ כלים. ר\"ל שאני יודע בטיב מנהגו של עולם, דהיינו מעמד ומצב עם בני ישראל בשעה זו, שעדיין אינם ראוים להשראת השכינה, וא\"כ כלים שאני עושה להיכן אכניסם, שהרי איני יכול להניחם במחנה ישראל, אשר אינו בתוקף קדושתו כטרם החעא, וחזר משה והודה לדברי בצלאל, ואמר לו בצל ארל היית ושמעת. ויובן עפ\"י מה דמרגלא בפומיה דהבעש\"ט הקדוש מאמר המדרש (הובא בשל\"ה הקדוש שער הגדול ל' בשם מדרש) עה\"כ ה' צלך (תהלים קכ\"ב) מה צלך אם אתה משחק לו הוא משחק לך ואם אתה בוכה לו הוא בוכה כנגדך, כך הקב\"ה צלך כשם שאתה עמו כך הוא עמך ע\"כ. וע\"כ אמר לו משה בצל ארל היית וידעת, כי הוא השיג בחינת ה' צלך שהקב\"ה מתנהג עם ישראל כמעשיהם, ולפי מעשיהם אינם ראוים עדיין להשראת השכינה עד הקמת המשכן, ועל שהשיג בחינה זו הוא נקרא בצלאל.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 204,
      "char_length": 829,
      "timestamp": "2025-02-06T19:19:30.980813"
    },
    {
      "id": "pekudei_p205",
      "text": "עוד יש לפרש מה שאמר לו משה בצל א-ל היית וידעת, עפ\"י מה שכתב בסה\"ק זרע קודש בדרושים לחה\"ס לבאר מה שאמרו אדם יושב בצל סוכה, ולכאורה הרי האדם יושב בסוכה עצמה ולא בצלה, שהרי ענין הצל הוא רק הדמות המועתקת מגוף הדבר. וביאר כי אכן עיקר הסוכה היא הסוכה דלעילא, וסוכה זו שאנו יושבים בה היא רק צלה של הסוכה דלעילא. וכמו כן יש לומר לענינינו. דהנה אמרו ז\"ל (תנחומא ר\"פ פקודי) משכן של מטה מכוון כנגד משכן של מעלה ועיקר הקדושה הוא במשכן העליון, והמשכן דלמטה הוא רק בבחינת הצל של אותו משכן שלמעלה, וזהו אומרו בצל א\"ל היית, כלומר שהשיג בחינת המשכן דלמעלה המיצל על בחינת משכן דלמטה, ומשם השיג וידע לעשות משכן תחלה ואח\"כ כלים והבן.",
      "source_file": "Pekudei.txt",
      "chumash": "שמות",
      "parsha": "pekudei",
      "paragraph_index": 205,
      "char_length": 613,
      "timestamp": "2025-02-06T19:19:31.412198"
    }
  ],
  "shape": [
    206,
    768
  ],
  "created_at": "2025-02-06T19:19:31.770152"
}