{
  "paragraphs": [
    {
      "id": "bmidbar1_p0",
      "text": "במדרש ילקוט (פרשה זו רמז תרפ\"ד) בשעה שקבלו ישראל את התורה נתקנאו אוה\"ע בהן מה ראו להתקרב יותר מן האומות סתם פיהן הקב\"ה ואמר להן הביאו לו ספר יוחסין שלכם וכו' כשם שבני מביאין וכו'. וצריך ביאור להבין מה טענה בפיהם של האומות מה ראה להתקרב להם לישראל יותר מן הכל, אחרי שהקב\"ה החזיר את התורה על כל אומה ולשון ולא חפצו בה כמו שדרשו ז\"ל (ספרי פ' ברכה) עה\"פ וזרח משעיר למו. ומה להם עוד כי נזעקו לבא בטענה אם הם עצמם מאסו בתורת ה' ולא נתרצו לקבלה.  ב)",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 0,
      "char_length": 442,
      "timestamp": "2025-02-06T18:24:22.701650"
    },
    {
      "id": "bmidbar1_p1",
      "text": "גם יל\"ד בל' הילקוט בשעה ''שקבלו\" ישראל את התורה, וכי טענתם היתה על מה שקבלו ישראל את התורה, הלא קנאתם וגם שנאתם היו על שנתנה להם הקב\"ה, והול\"ל בשעה שנתן הקב\"ה את התורה לישראל ג)",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 1,
      "char_length": 177,
      "timestamp": "2025-02-06T18:24:22.952268"
    },
    {
      "id": "bmidbar1_p2",
      "text": "צריך להבין אומרו סתם פיהם הקב\"ה, דממשמעות הלשון מוכח דבאמת אין תשובה זו מספקת לתרץ שאלתם של אומות העולם, אלא שדחאן הקב\"ה בגילא דחיטתא, וסכר פיהן שלא יקטרגו וצ\"ב שהרי תשובתן בצדן הביאו לי ספר יוחסין שלכם, ומדוע לא תספיק תשובה זו לדחות טענתם מכל וכל.  ד) גם במה שהשיב להם הקב\"ה הביאו לי ספר",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 2,
      "char_length": 288,
      "timestamp": "2025-02-06T18:24:23.129346"
    },
    {
      "id": "bmidbar1_p3",
      "text": "יוחסין יש לדקדק, דלכאורה מה שייך מעלת היחוס לקבלת התורה, וכי בעבור שאין האומות מגזע היחס כבני ישראל אינם ראויים לקבל את התורה כמותם, והלא חזינן דלאו הכי הוא שהרי החזיר הקב\"ה את התורה על כל אומה ולשון, הרי דאין קבלת התורה תלויה ביוחסין.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 3,
      "char_length": 235,
      "timestamp": "2025-02-06T18:24:23.305792"
    },
    {
      "id": "bmidbar1_p4",
      "text": "ונראה כי הנה כאשר בחר בנו ה' מכל העמים אשר על פני האדמה, להיות לו לעם סגולה לשמור תורתו ומצוותיו, הבטיח לנו הקב\"ה מתנה יקרה וחביבה יחד עם התורה הקדושה אשר נתן לנו. והיא הבטחת ירושת הארץ הקדושה, שהרבה מצוות בתורתנו הקדושה תלויות בביאתנו אליה, ולא נוכל לשמרם בהיותנו בגלות, כמ\"ש כמ\"פ כי תבואו אל הארץ וכו', דמצוות שהם חובת קרקע אינן נוהגות אלא בארץ. וגם ההבטחות הטובות אשר הועיד ה' לעם סגולתו אם יקיימו מצוותיו כראוי הבטיחן הקב\"ה שיהיו מתקיימין בהם בבואם אל הארץ, כדכתיב ארץ זבת חלב ודבש וכיו\"ב הרבה. ומה גם שעיקר התורה והמצוות הם בהיות ישראל בא\"י, כמ\"ש הרמב\"ן ז\"ל בס\"פ אחרי כי עיקר כל המצוות ליושבים בארץ ה', ומה שנצטוינו במצוות בגלות הוא כדי שלא יהיו חדשים עלינו כאשר נחזור לארץ כמאה\"כ הציבי לך ציונים וכו'.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 4,
      "char_length": 707,
      "timestamp": "2025-02-06T18:24:23.447494"
    },
    {
      "id": "bmidbar1_p5",
      "text": "ובאמת טענה זו צריכה לפנים, למה לא הבטיח ה' אף להם את הארץ כאשר הציע להם לקבל את התוה\"ק, ומדוע לא הודיעם מהטובות הרבות המיועדות לבא על מקבלי תה\"ק בבואם אל הארץ. אמנם הנה נודע מפי ספרים וסופרים עוצם מעלת ארץ ישראל ותוקף הפלגת קדושתה, ולרוב מעלתה איננה סובלת עוברי עבירה כלל וכלל, וכידוע מ\"ש הרמב\"ן ז\"ל בפ' וירא כי משפט סדום הקשה היה למעלת ארץ ישראל, וגם הכותים לא נענשו אלא בבואם אל הארץ וכ\"כ הרשב\"ם ז\"ל בפ' עקב כי הארץ טובה היא מכל הארצות לשומרי מצוותיו, ורעה מכלם ללא שומרם (ועיין מה שכ' בזה בספרי ויואל משה מאמר ישוב ארץ ישראל מסי' קס\"ב). ולזאת לצד גודל מעלת הארץ הקדושה בהכרח היה שתפול זאת הארץ בנחלה לפני בני ישראל הקדושים בני א-ל חי, ולא יירשוה עובדי זרים בני בליעל האומות הטמאים זרע עשיו וישמעאל, שהם רעים ומושחתים מצד שורשם ויסודם, כי מוצאם ממקור הטומאה. ואינם ראויים לרשת ארץ ישראל ארץ אשר ה' אלקיך דורש אותה תמיד עיני ה\"א בה וגו'. שאילו ח\"ו היתה הארץ נופלת בידם לנחלה היו מטמאים אותה במעשיהם הרעים בתועבותם ובעלילותיהם כמעשה ארץ כנען תושבי הארץ מקדם שהקיאתם הארץ מפני רוע מעשיהם. על כן לא הבטיח הקב\"ה לאוה\"ע מתנת הארץ בשעה שהציע להם לקבל את התורה, כי מתנה זו מושללת מהם בהכרח שאין הם ראויים אליה.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 5,
      "char_length": 1104,
      "timestamp": "2025-02-06T18:24:23.771855"
    },
    {
      "id": "bmidbar1_p6",
      "text": "אמנם לא רצה ה' לומר להם טעם זה בגלוי, משום שאז היו האומות קמים לערער בטענות שונות, על כן דחאן הקב\"ה בקנה לסתום פיהם שלא יבואו בטענה באמרו להם הביאו לי ספר יוחסין שלכם כדרך שבני מביאין, כלומר שארץ כנען מוחזקת לבני ישראל, שהרי אחוזת נחלתם הוא מצד אבותיהם הקדושים אברהם יצחק ויעקב ולהם משפט הבכורה לזכות בארץ יותר מכל האומות. ואף אוה\"ע עצמם הודו בכך ולא היה להם עוד פ\"פ לקטרג דבר. אכן תשובה זו היא רק לסכור פיהם דבאמת בלאו הכי מן הנמנע היה לתת את ארץ כנען לאוה\"ע, שאין הם ראויים לה מצד שורשן הרע, דלא זו בלבד שלא היו מקיימין מצוות התלויות בה, אף היו מטמאין את הארץ בתועבותיהם כמו שנתבאר.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 6,
      "char_length": 584,
      "timestamp": "2025-02-06T18:24:24.313445"
    },
    {
      "id": "bmidbar1_p7",
      "text": "ובזה מבואר על נכון המדרש בשעה שקבלו ישראל את התורה, הכוונה על ירושת הארץ שהיא סיבה גדולה רבה ונכבדה לקיום התה\"ק בשלימות, ואילו לאומות העולם לא הציע הקב\"ה מתנת הארץ שהיא חלק מן התוה\"ק אם יתרצו לקבלה, לפיכך נתקנאו בהם אוה\"ע ואמרו מה ראו להתקרב להם יותר מן הכל, לתת להם ארץ ישראל יחד עם התוה\"ק, מה שלא קדם להציע לפניהם, סתם פיהן הקב\"ה הביאו לי ספר יוחסין שלכם כשם שבני מביאין. שהם מתיחסין על אברהם יצחק ויעקב שהבטיח להם הקב\"ה לנחול את הארץ. אמנם העיקר הוא כטעם הנ\"ל וזו אינה אלא תשובה לסתום פיהם שלא יערערו.  ה' תשב\"ך",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 7,
      "char_length": 514,
      "timestamp": "2025-02-06T18:24:24.606768"
    },
    {
      "id": "bmidbar1_p8",
      "text": "במדרש (שה\"ש רבה פ\"א כ\"ד) עה\"פ משכני אחריך נרוצה איתא מאמר פלאי וזה תוארו, א\"ר מאיר בשעה שעמדו ישראל לפני הר סיני לקבל התורה אמר להם הקב\"ה וכו' אני נותן לכם את התורה אלא הביאו לי ערבים טובים שתשמרוה ואני נותנה לכם, אמרו לפניו רבש\"ע אבותינו ערבים לנו. אמר להם אבותיכם צריכים ערבים, למה\"ד לאחד שהלך ללות מן המלך וכו' והביא לו ערב אחד א\"ל ערבך צריך ערב וכו', הלך והביא לו ערב שני, וא\"ל וכו' כיון שהביא לו ערב שלישי אמר תדע כי מפני זה אני מלוה לך. כך אמרו ישראל אבותינו ערבים אותנו אמר להם הקב\"ה אבותיכם יש לי עליהם, אברהם יש לי עליו שנאמר (בראשית פט\"ו) במה אדע כי אירשנה, יצחק יש לי עליו שהי' אוהב לעשיו ואני שנאתיו וכו', יעקב שאמר (ישעי' מ') נסתרה דרכי מה', אלא הביאו לי ערבים טובים ואני נותנה לכם. אמרו לפניו רבש\"ע נביאנו ערבים לנו אמר להם יש לי עליהם שנאמר (ירמי' ב') והרועים פשעו בי, וכתיב (יחזקאל י\"ג) כשועלים בחרבות נביאיך ישראל היו וכו'. אמרו הרי בנינו ערבים אותנו. אמר הקב\"ה הא וודאי ערבים טובים, על ידיהם אתננה לכם הה\"ד (תהלים ח') מפי עוללים ויונקים יסדת עוז ואין עוז אלא תורה. וכו' בשעה שהלוה נתבע ואין לו לשלם מי נתפש. לא הערב וכו'.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 8,
      "char_length": 1039,
      "timestamp": "2025-02-06T18:24:24.865062"
    },
    {
      "id": "bmidbar1_p9",
      "text": "והמדרש הזה הוא הפלא ופלא וצריך ביאור ליישבו. חדא ראוי להתבונן במה שהשיבו ישראל על מה שא\"ל הקב\"ה הביאו לי ערבים טובים אמרו לפניו אבותינו ערבים לנו. ולכאורה מהו ענין הערבות הלזה שאבותינו ערבים בעדנו, והלא ענין הערבות הוא שהערב מקבל על עצמו שאם לא יהא ביד הלוה לפרוע חובו, ישלם הוא במקומו, וזהו גם ענין הערבות שמביא המדרש במשל לא' שהלך ללות מאת המלך והביא לו ערב וכו', משא\"כ הכא איך יהיו האבות מתחייבים אם ח\"ו לא ישמרו ישראל את התורה, וכי מה יש בידם לעשות בתורת ערבות למען קיום התורה.  ד)",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 9,
      "char_length": 485,
      "timestamp": "2025-02-06T18:24:25.392265"
    },
    {
      "id": "bmidbar1_p10",
      "text": "גם צ\"ב להבין מה שלא רצה הקב\"ה לקבל ערבות האבות הקדושים, משום אותם החטאים שמונה אברהם אמר במה אדע וכו', האם בעבור כן שוב אינם יכולים להיות ערבים בעדינו.  ה) ותו שאם לא רצה הקב\"ה לקבל ערבות האבות הקדושים כמו שאמר יש לי עליהם. מה טעם שיאמרו ישראל נביאינו ערבים לנו. וכי עלתה על דעתם שיתרצה הקב\"ה בנביאים לקבלם בתורת ערבים אחרי שלא רצה לסמוך על ערבות האבות הקדושים, וכי סברו ישראל שתהי' ערבות הנביאים בטוחה ומתקבלת לפני המקום ב\"ה יותר מערבותם של האבות, שלא נתרצה בה הקב\"ה, באמרו ערבך ערבא צריך.  ו)",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 10,
      "char_length": 494,
      "timestamp": "2025-02-06T18:24:25.632967"
    },
    {
      "id": "bmidbar1_p11",
      "text": "עוד צריך להבין מה שמסיים המדרש אמרו ישראל בנינו ערבים אותנו. וקיבל הקב\"ה ערבות הבנים ואמר הא וודאי ערבים טובים. דלכאורה מה ענין ערבות הוא זה שיהיו הבנים נענשים בגלל חטאי אבותיהם, וכי יש בעונש זה תשלומין למה שהאבות חייבים בשמירת התורה. ואיזה דמיון בין ערבות זו לערבות דעלמא, שהלוה מביא ערב בעדו שאם לא יהא בידו לשלם יהא המלוה בטוח שישתלם החוב ע\"י הערב, דלכאורה אין ערבות הבנים דומה כלל לזה, שהרי הכא האב מחוייב בשמירת התורה, ואם חיסר וגרע משמירתה במה ישתלם חובו אם יהיו בניו נענשים להיות נתפסים במקומו. אדרבה ע\"י שהבנים נענשים כביכול גדול יותר צערו של הקב\"ה, כדאי' במדרש התם שהקב\"ה מתאונן מי יאמר בתורה לפני ברכו את ה' המבורך. וכו' יעיי\"ש. וא\"כ מה ערבות הוא זו מה שהבנים נענשים ח\"ו, אחרי שאין ביד האבות לשלם חובותיהם להקב\"ה. הרי אף הם אין בידם לשלם בעד עוונות אבותם, ולא עוד אלא שיוגדל הצער פי כמה. ותו דאם נאמר שהערבות כאן הוא מענין פריעת חוב, צ\"ע במה הבנים ראויים שיהיו נפרעים מהם החובות יותר מן האבות בעצמם, והלא הבוי\"ת בידו נפש כל חי, ונפשות האבות והבנים גם יחד הם ברשותו לעשות בהם כחפצו וכרצונו, ומדוע יותר נקל להשתלם החוב בעונש הבנים ח\"ו. כמו\"כ בידו להפרע אותו פרעון מן האבות עצמן. ולהעניש החוטא על רעתו אשר עשה.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 11,
      "char_length": 1117,
      "timestamp": "2025-02-06T18:24:25.881896"
    },
    {
      "id": "bmidbar1_p12",
      "text": "ולפי חומר הנושא נראה לבאר המדרש דמונח בו כוונה אחרת: ומלבד ההבנה הפשוטה שהערבות היא ע\"צ העונש, עוד יתבאר המדרש שערבות הבנים הוא ע\"צ הטובה. דהנה הבורא ית' כאשר בא לתת תורה לעם סגולתו צפה והביט מראש עד סוף כל הדורות, ולפניו נגלה המצב השפל של הדורות האחרונים  בעקבתא דמשיחא. והנה במעמד הנבחר נמצאו והיו כל נשמות ישראל העתידים להבראות, כדאיתא במדרש רבה פ' יתרו (פכ\"ח ד') ודריש ליה מדכתיב בפ' נצבים כי את כל אשר ישנו פה וגו' ואת אשר איננו פה עמנו היום. דקאי על הנשמות העתידות להברא שהיו באותו מעמד.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 12,
      "char_length": 493,
      "timestamp": "2025-02-06T18:24:26.393291"
    },
    {
      "id": "bmidbar1_p13",
      "text": "והשלה\"ק בעש\"מ (מאמר השני דף מ\"ד ע\"ב) כתב ליישב קושיית בעל העקידה ז\"ל היאך חלו האלות והשבועות שהשביע הקב\"ה את ישראל במ\"ת על הדורות הבאים ואף שהיו שם הנשמות, מ\"מ המצוות חובת הגוף הם וכיון שלא היו הגופים שם כיצד חלה השבועה עליהם. והשיב השלה\"ק על קושייתו דכשם שהיו שם הנשמות של כל הדורות, כך הי' שם גם המרכז והפנימיות של הגופים. וכיון שהי' שם המרכז והפנימיות שזהו השורש של קיום כל הגוף, דינו כאילו היו הגופים בעצמם שם וחלה השבועה. יעיי\"ש באריכות דבריו. (ועי' בזה בספרי ויוא\"מ מאמר ישוב א\"י סי' קכ\"ט).",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 13,
      "char_length": 496,
      "timestamp": "2025-02-06T18:24:26.642061"
    },
    {
      "id": "bmidbar1_p14",
      "text": "ומכיון שהיו במעמד הנבחר כל הדורות העתידים, רצה הקב\"ה להבטיח שיהי' קיום לתוה\"ק אף בשפל המצב של הדורות האחרונים, ולכן אמר אני נותן לכם תורתי הביאו לי ערבים טובים שתשמרוה וכו'. וענין הערבות כאן פירושו שתביאו לי כח חזק שעליו אתם סמוכים ובטוחים שתהי' התורה מתקיימת בידכם לעולם בכל הדורות ובכל המצבים. ואף שכבר הבטיח הקב\"ה (דברים פל\"א) כי לא תשכח מפי זרעו, מ\"מ הבחירה חפשית ביד האדם לבחור בא' מב' הדרכים, אלא שהקב\"ה הבטיח שתהי' סייעתא דשמיא למי שיבחר להחזיק בדרך התורה. אבל מאין תהי' איזו הבטחה חזקה וברורה כי לא תמחה ח\"ו לגמרי בדורות השפלים מה הוא הכח והזכות שעליו ישראל בטוחים שלא תמוש התורה מהם לעולם. ועל כך השיבו ישראל כי כח האבות הקדושים וזכותם הגדולה יהיו מגינים וסוככים עליהם, שתהא התורה מתקיימת בידם לעולם",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 14,
      "char_length": 708,
      "timestamp": "2025-02-06T18:24:26.916482"
    },
    {
      "id": "bmidbar1_p15",
      "text": "וכן יצחק אע\"ה ראה ברוח קדשו שפלות דורות הבאים, שעל כן סיבב הקב\"ה שיבואו הברכות בדרך עקלתון, ע\"י שירמה אותם יעאע\"ה מעשו, כמבואר בזה\"ק פ' תולדות באורך שלטעם זה גלגל הקב\"ה שיאהב יצחק את עשיו וירצה לברך אותו ויקח יעקב אותם מידו. (עי' במה שכתבנו בזה לעיל פ' תולדות). וא\"כ אף על כחו של יצאע\"ה לא די לכם לסמוך. שהרי אף הוא פחד מפני השפלות של דורות האחרונים.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 15,
      "char_length": 350,
      "timestamp": "2025-02-06T18:24:27.267689"
    },
    {
      "id": "bmidbar1_p16",
      "text": "וגם יעקב אע\"ה אמר נסתרה דרכי מה', כלומר שיבואו עתים שתהי' הסתרת פנים גדולה, כמבואר בדבריהם ז\"ל, דכל מה שהי' יעקב אע\"ה מתיירא מעשו לא היתה היראה מחמת עצמו, שהרי הוא הי' מובטח מהקב\"ה ושמרתיך בכל אשר תלך אלא שהי' ירא מחמת הדורות העתידים. ועל כן ביקש רחמים ואמר הצילני נא מיד אחי מיד עשיו, ואי' במד\"ר שם שביקש הצל נא את בני לעת\"ל מיד בני בניו שבאו עליהם מכוחו של עשיו. וכן כל הפרשה שם רומזת על דורות העתידים, וא\"כ אכתי אין כאן ערבות והבטחה חזקה שתהי' התורה מתקיימת בישראל, דאף יעקב אע\"ה בעצמו התיירא מכך.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 16,
      "char_length": 500,
      "timestamp": "2025-02-06T18:24:27.473080"
    },
    {
      "id": "bmidbar1_p17",
      "text": "אמרו ישראל נביאנו עריבים לנו, פי' הנביאים שעמדו לישראל בכל הדורות הם ערבות ובטחון שתתקיים התורה בישראל, ע\"י שיעמדו בשער להוכיח את ישראל, וילמדו אותם ליראה את ה'. והשיבם הקב\"ה שאף בתוכחות הנביאים לא סגי להיות ערבון בטוח שתתקיים התורה בישראל דאף שיהיו הנביאים הק' מייסרים ומוכיחים אותם, מ\"מ הרי לעומתם יקומו  גם נביאי שקר ורועי אלול אשר יסיתו את ישראל לרע, ויהיו מייפים להם מעשיהם הרעים, באמרם שלום לכם אל תיראו. וכמו שנאמר והרועים פשעו בי וגו' שהמנהיגים ידיחו את ישראל מדרך התורה. ועוד כתיב קרא לאמר כשועלים בחרבות נביאיך ישראל, וכיון שיעמדו נביאי שקר מסיתים ומדיחים לנגד נביאי האמת, אי אפשר להיות בטוחים בכח נביאי האמת והצדק, דאף אם יהיו הנביאים אומרים דברי תוכחה לישראל, מ\"מ אם הדור שפל ורבו בו נביאי הבעל והרועים הפושעים בה' הם מחלישים כוחם של נביאי האמת, ומי יערוב בעד הדורות הללו שתתקיים התורה והיהדות בישראל.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 17,
      "char_length": 813,
      "timestamp": "2025-02-06T18:24:27.724055"
    },
    {
      "id": "bmidbar1_p18",
      "text": "אמנם דבר אחד עדיין יש בידינו שבכוחנו לעשותו בשלימות הגמור בלי שום שינוי ממה שהי' בדורות הראשונים (אריגינאל) והוא מה שאמרו ז\"ל (שבת קי\"ט ע\"ב) אר\"ל משום ר\"י נשיאה אין העולם מתקיים אלא בשביל הבל פיהן של תנוקות של בית רבן אמר ליה ר\"פ לאביי דידי ודידך מאי, א\"ל אינו דומה הבל שיש בו חטא להבל שאין בו חטא. ע\"כ. חזינן מזה עד כמה גדול כח תורתן של תשב\"ר, לפי שהוא הבל שאין בו חטא, וכחו יפה אפילו מכח התורה של האמוראים הקדושים שהיתה עבודתם בדעת נשגב מאד, אפ\"ה אינו דומה וכו' להבל שאין בו חטא. וא\"כ כח זה עדיין מסור הוא בידינו בשלימות, הוא כח תורתן של תשב\"ר הבל שאין בו חטא, שהרי אף בימים קדמונים אין כחם שלי תשב\"ר אלא מה שהוא הבל שאין בו חטא.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 18,
      "char_length": 631,
      "timestamp": "2025-02-06T18:24:28.106969"
    },
    {
      "id": "bmidbar1_p19",
      "text": "ולזאת אמרו ישראל בנינו ערבים אותנו, כי זהו הערבות היחידי הבטוח שיכולים לתת אף בזמן שיהיו בשפלות נורא, וכח התורה וכח העבודה ירוד מאד, ומצב היהדות בכללה דל ושפל. עכ\"פ הבטיחו ישראל שיגדלו את בניהם לתלמוד תורה ויחנכו אותם חינוך טוב. שזהו ערבות ובטוחות חזק איתן לקיום היהדות, ובזה משתלם מקצת החוב שאנו חייבים לו ית', ולדברים אלו הסכים הקב\"ה ואמר הא וודאי ערבים טובים.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 19,
      "char_length": 362,
      "timestamp": "2025-02-06T18:24:28.429393"
    },
    {
      "id": "bmidbar1_p20",
      "text": "ומה שמסיים המדרש בשעה שהלוה נתבע ואין לו לשלם נתפס הערב וכו', דמיניה משמע שהערבות הוא ע\"צ העונש ח\"ו, אין זה סותר לפירושינו דבאמת הא בהא תליין, דכיון שעיקר קיומו של הדור הוא על כח התשב''ר, ע\"כ לפעמים כשאין הדור ראוי הרי הם נענשים ח\"ו, אבל עיקר הערבות אינו ע\"צ העונש, אדרבה להיפוך קיום התשב\"ר הוא הערבות שתתקיים התורה והיהדות בקרב ישראל. וזהו שסיים המדרש, על ידיהם אתננה לכם, ומייתי ראי' מקרא דכתיב מפי  עוללים ויונקים יסדת עוז, שע\"י הבל פיהן של תשב\"ר שהוא הבטחה וערבון שתתקיים התורה בישראל נתן הקב\"ה תורתו לנו, וזש\"ה ''מפי'' עוללים ויונקים יסדת עוז, כלומר בכח הבל היוצא מפיהם הטהור הבל שאין בו חטא, שהוא מעמיד כח התורה בישראל, נתן הקב\"ה לנו את התוה\"ק הקרויה עוז. היוצא לנו מזה שבקיום ובהחזקת חינוך תשב\"ר מונח כח קבלת התורה, ולפיכך צריכים להתאמץ להעמיד חינוך התשב\"ר שיהי' בשלימות, ולהתעמל בעבור זה בכל הכוחות.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 20,
      "char_length": 807,
      "timestamp": "2025-02-06T18:24:28.613925"
    },
    {
      "id": "bmidbar1_p21",
      "text": "אכן הכתוב צווח ואומר מפי עוללים ויונקים יסדת עוז למען צורריך להשבית אויב ומתנקם. פירוש לפי שכח התשב\"ר היא שהביאה לקבלת התורה, והיא הנקודה העיקרית שעליה סובב קיומו של כלל ישראל ברוחניות ובגשמיות, אורך ימים בימינה ובשמאלה עושר וכבוד, על כן מתגברים צוררי ישראל אויביו ומתנקמיו לבטל ח\"ו כח התשב\"ר מישראל שהרי קיום התורה וכח התשב\"ר הוא המשבית כח שונאי ה' על כן הם עומדים עליו לבטל כח זה. ובפרט בא\"י שם גברו מאד כוחות הטומאה בעוה\"ר כידוע, וצריכים למסנ\"פ גדול שיוכלו להתקיים. וכבר דברנו מזה במקו\"א (עי' לעיל פ' ויצא ע' י\"ד) עד היכן גדול חיוב החזקת ת\"ת, ושם הבאתי דברי השטה מקובצת (כתובות דף נ') דהא דתיקנו חכמים באושא המבזבז אל יבזבז יותר מחומש היינו לעניים דוקא, אבל לתלמוד תורה אין לו שיעור למעלה, ודייק כן מרש\"י ז\"ל, יעו\"ש. ובאמת מבואר כן להדיא בתנחומא פ' צו (סי' י\"ד) כי יש חיוב באדם לתת ''כל ממונו'' ללמד תורה לעצמו ולבניו.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 21,
      "char_length": 821,
      "timestamp": "2025-02-06T18:24:28.996327"
    },
    {
      "id": "bmidbar1_p22",
      "text": "ובבחינה זו ביארתי הא דאי' במד\"ר (רות רבה פ\"ד) עה\"פ אל תלכי ללקוט בשדה אחר, ע\"ש לא יהי' לך אלהים אחרים. דלכאורה אינו מובן שהרי הוא הלכה ללקוט מתנות עניים השייכות לה עפ\"י הדין לקט שכחה ופאה, ומה ענין להזהירה בזה לא יהי' לך אלהים אחרים. ואמרתי דהוא אמת כפשוטו. דאם תלך ללקוט לקט שכחה ופאה בשדה שבעליה עובד ע\"ז, או נתפס בדעות נפסדות חלילה, אזי עלולה היא להיות נתפסת ברשת הע\"ז ח\"ו, דלפי שהשפעת הפרנסה תבוא ממקור טמא יש לחוש שישפיע עליה לרע. ע\"כ הזהירה אל תלכי ללקוט בשדה אחר ע\"ש שנא' לא יהי' לך אלהים אחרים, כדי שלא תתפסי ח''ו לע\"ז.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 22,
      "char_length": 527,
      "timestamp": "2025-02-06T18:24:29.422313"
    },
    {
      "id": "bmidbar1_p23",
      "text": "אי לזאת מוטלת החובה על היהודים המועטים שעדיין מחזיקים בדרך התורה, להחזיק את החינוך הטהור הכא והתם מבית ומחוץ. והבוכ\"ע יעזור וישפיע לבנ\"י ותהי' להם הרחבת הדעת, שיהי' ביכלתם להחזיק מוסדות התורה שלא יוצרכו להנות ממקורות הזרים ח\"ו שעי\"ז נופלים, וזהו יסוד הכל והנקודה העקרית שנוכל להחזיק מעמד ולהתקיים, שהרי כח תשב\"ר היא יסוד קיומנו וכל הכח שעדיין נותר לנו.  וכדי לבא לביאור הילקוט המוצג בפתח דברנו נקדים לבאר מאה\"כ כה תאמר לבית יעקב ותגיד לבני ישראל, ופירש\"י אמירה רכה לנשים ודבור קשה כגידין לאנשים, וקשה דאין כאן ב' מיני דבורים בפרשה, ואיך תהי' כאן אמירה רכה לאלו ודבור קשה לאלו (קושיא ב'). ויתבאר עפי\"מ דאי' במד\"ר (יתרו פכ\"ח ב') על הך קרא כה תאמר לבית יעקב וגו', למה לנשים תחלה ואח\"כ לאנשים כדי שיהי' מנהיגות בניהם לת\"ת. ולכאורה קשה שהרי החיוב מוטל על האב לחנך בנו לת\"ת דכתיב ולמדתם אותם את בניכם, ולמדתם אתם (ופירש\"י האב עצמו מחויב ללמדו מדכתיב ולמדתם אתם חסר וא\"ו) הרי דעיקר החיוב מועל על האב בעצמו, אלא דאחר שראו שח\"ו יכולה תורה להשתכח התקין ר\"י בן גמלא שיהיו מושיבין מלמדי תינוקות וכו' בכל עיר ועיר, אבל מעיקרא דמילתא חיובא רמיא על האב גופיה ללמד את בנו תורה, משא\"כ הנשים אינם מצוות על כך, וכיון דעיקר חיובא  רמיא על האנשים א\"כ אדרבה היה ראוי להקדים את האנשים לנשים בקרא כדי שיהיו האנשים זריזין להנהיג בניהם לת\"ת. וביארו המפרשים כוונת המדרש כי לצד שהנשים מצויות בביתם תמיד, דכל כבודה בת מלך פנימה, יש להם פנאי לגדל בניהם לת\"ת יותר מן האנשים שהם טרודים בעמל הפרנסה, לפיכך הקדים הכתוב נשים תחלה לזרזם להשתדל בחינוך בניהם להנהיגן לת\"ת.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 23,
      "char_length": 1434,
      "timestamp": "2025-02-06T18:24:29.699489"
    },
    {
      "id": "bmidbar1_p24",
      "text": "ועתה מובן היטב מה שאמה\"כ לשון אמירה רכה בנשים ודבור קשה באנשים, דממה שהקדים נשים לאנשים כדי לזרזם להנהיג בניהם לתורה, נודע להם שיבואו זמנים שלא יהיו הגברים פנויים לת\"ת, אלא יהיו טרודים בצרכי פרנסתן. והיה בדברים אלו אמירה רכה לנשים. שיהיה בידם שכר אקרויי בנייהו לבי כנישתא, משא\"כ לאנשים היו אלו דברים קשים כגידין, שנודע להם שיפלו ממדריגתן ולא יהיו בחי' עושין רצש\"מ, ומחמת כן יוצרכו לעסוק במלאכתן, ולא יהי' בידם לגדל בניהם לת\"ת, אלא יהי' הדבר מוטל על הנשים.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 24,
      "char_length": 455,
      "timestamp": "2025-02-06T18:24:30.335822"
    },
    {
      "id": "bmidbar1_p25",
      "text": "וא\"ש דבאמת לא הגיד להם ב' סוגי דבורים, ולא נאמר להם אלא הדברים הנאמרים בפרשה, וכדרשת המכילתא הנ\"ל אלה הדברים וגו' לא פחות ולא יותר, אלא שבאמרו כה תאמר לבית יעקב, תחלה, ואח\"כ ותגיד לבני ישראל זה בעצמו הי' להם אמירה רכה ודברים קשים.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 25,
      "char_length": 230,
      "timestamp": "2025-02-06T18:24:30.565017"
    },
    {
      "id": "bmidbar1_p26",
      "text": "ועתה נחזור לביאור המדרש ילקוט בשעה שקבלו ישראל את התורה נתקנאו בהם אוה\"ע, דהנה אף שהקדמנו לעיל מדברי המד\"ר שרצו ישראל לתת את האבות הק' ערבים שתתקיים התורה בישראל, ולא רצה הקב\"ה בערבותן עד שהביאו את בניהם לערבון, מ\"מ כדי שיוכלו להעמיד תשב\"ר יראים ושלמים כראוי הוא רק בכח האבות הקדושים. דהנה אמה\"כ (בפ' וירא) כי ידעתיו למען אשר יצוה את בניו ואת ביתו אחריו ושמרו דרך ה' וגו', ודקדק כ\"ק אבא מארי זלה\"ה בספרו קדוי\"ט דתיבת אחריו יתירא לכאורה (יע\"ש מ\"ש בזה). ואפ\"ל שהכתוב משמיענו שלא הסתפק אברהם אע\"ה במה שציוה את בניו בלבד לשמור דרך ה', אלא שהשריש בהם כח  קדושה שיהי' קיים בהם, ואף ינחילו כח זה לבניהם אחריהם בכל דור ודור. ועל פי זה יהי' ביאור הכ' ע\"ד מאה\"כ השבע השביע ודרשו ז\"ל (מד\"ר פרשת בשלח) השביעם שישביעו לבניהם, וה\"נ אברהם אבינו ע\"ה הדריך את בניו ואת ביתו, ומלבד זאת הכניס בקרבם כח שימשיכו שלשלת הקדושה, וזהו ''אחריו\" הם הדורות הבאים אף בהם יתקיים כח זה הבא מכחו של אותו זקן אאע\"ה. וא\"כ נמצא דגם כח תשב\"ר שהוא הערבות שקבל הקב\"ה מישראל שתתקיים בהם התורה, הוא נמשך ובא מכוחם של האבות הקדושים, שהשרישו כח הקדושה לדורות עולם, וכח זה הוא המקיים תשב\"ר.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 26,
      "char_length": 1047,
      "timestamp": "2025-02-06T18:24:30.708304"
    },
    {
      "id": "bmidbar1_p27",
      "text": "וזהו ביאור הילקוט, דהנה בשעה שקבלו ישראל את התורה מחמת שהיו בידם ערבים טובים שתהי' מתקיימת בידם, באו אומה\"ע בטענה מה ראו אלו להתקרב להם יותר מן הכל דהנה אף שהחזיר הקב\"ה את התורה על כל אומה ולשון ולא רצו לקבלה, היינו משום ששיערו בנפשם שלא יתכן שתהי' התורה מתקיימת בידם, דאף אם ישמרו האומות שבאותו הדור את התורה, אבל מאן ערב בדבר שישמרו בניהם אחריהם את התורה ולפיכך מיאנו לקבלה, אבל כשראו אוה\"ע שישראל קבלו את התורה ויש להם ערבון בטוח שתתקיים התורה בידם באו בטענה מה ראו להתקרב יותר מן הכל, מדוע לא זכינו אף אנחנו לכך, הלא אם היינו בטוחים בערבות הבנים היינו מקבלים את התורה גם אנחנו. ועל כך השיבם הקדוש ברוך הוא תשובה ניצחת הביאו ספר יוחסין שלכם וכו', שהרי מה שהתינוקות של בית רבן הם ערבים טובים לישראל, הוא רק בכח קדושתן של האבות הקדושים, שהורישו כחם לבניהם אחריהם, משא\"כ אתם שאין בידכם כח זה, שאבותיכם מקורם מכוחות הטומאה, מה תועיל ערבות של בניכם, הרי אם אין להם כח זה לא תוכל התורה להתקיים בהם.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 27,
      "char_length": 895,
      "timestamp": "2025-02-06T18:24:31.195862"
    },
    {
      "id": "bmidbar1_p28",
      "text": "וידבר ה' אל משה במדבר סיני באהל מועד באחד לחודש השני בשנה השנית לצאתם מארץ מצרים לאמר, שאו את ראש כל עדת בני ישראל למשפחתם לבית אבותם וגו'. במדרש (ילקוט רמז תרפ\"ד) בשעה שקבלו ישראל את התורה נתקנאו אומות העולם בהן מה ראו להתקרב יותר מן האומות סתם פיהן הקב\"ה אמר להן הביאו לי ספר יוחסין שלכם שנאמר הבו לה' בני אלים כשם שבני מביאין ויתילדו על משפחותם לכך מנאן בראש הספר הזה אחר אלה המצוות, אלה המצוות אשר צוה ה' את משה בהר סיני ואח\"כ וידבר ה' אל משה במדבר סיני שאו את ראש וגו', שלא זכו ליטול את התורה אלא בשביל היוחסין שלהן, ע\"כ. ודברי המדרש הללו תמוהין וכבר נאמרו בו פנים מפנים שונים בספרי המפרשים, חדא צ\"ב מה טענה היתה בפי האומות שהקשו לשאול מה ראו להתקרב יותר מן האומות, והרי הקב\"ה החזיר את התורה על כל אומה ולשון והם מיאנו לקבלה, כי קירבת הבוי\"ת לא יחפצון,  ורק ישראל קדושים ששו לקראתה, ובאו בברית יחד לאמר כל אשר דבר ה' נעשה ונשמע, ומה להם צדקה ולזעוק עוד אל המלך כי משוא פנים יש בדבר, וכי ישראל זכו להתקרב יותר מן הכל.  ב) יל\"ד בלשון המדרש בשעה ''שקבלו\" ישראל את התורה, שהיה ראוי שיאמר בשעה שנתנה תורה לישראל, שהרי לא על ישראל תלונתם שנתרצו לקבל את התורה, כי אם על הקב\"ה שנתן תורה לעמו ישראל ג)",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 28,
      "char_length": 1097,
      "timestamp": "2025-02-06T18:24:31.606097"
    },
    {
      "id": "bmidbar1_p29",
      "text": "צריך ביאור להבין תשובת הקב\"ה על טענת האומות, הביאו לי ספר יוחסין, דכי האם קבלת התורה ביחוס תליא, והרי ממה שהחזיר הקב\"ה את התורה על כל אומה ולשון משם ראיה חותכת שאין התורה נקנית ביחוס ד)",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 29,
      "char_length": 185,
      "timestamp": "2025-02-06T18:24:32.146714"
    },
    {
      "id": "bmidbar1_p30",
      "text": "שאו את ראש כל עדת וגו', במד\"ר (פ\"ז ז') איתא אמר הקב\"ה לישראל לא חבבתי בריה יתירה מכם לכך נתתי לכם תלוי ראש ודמיתי אתכם לי שכשם שיש לי תלוי ראש על כל באי עולם שנאמר (דה\"י א' כ\"ט) לך ה' הגדולה כך לכם עשיתי להיות לכם תלוי ראש לכך נאמר שאו את ראש לקיים מה שנאמר (תהלים קמ\"ח) וירם קרן לעמו וכה\"א ונתנך ה\"א עליון על כל גויי הארץ. וצ\"ב מה נשיאות ראש יש במנין בני ישראל. ותו מאי האי דקאמר דמיתי אתכם לי, וכי האם במה שישראל נמנין הם דומין בצד מה כביכול אליו יתברך, הלא הקב\"ה יחיד ומיוחד בתכלית היחוד, ולא יצוייר אצלו ענין המספר כלל ועיקר, וא\"כ לאיזה ענין דימה הקב\"ה את ישראל אליו באמצעות המנין, ומה רבותייהו דישראל במה שהם נמנים.  ה)",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 30,
      "char_length": 624,
      "timestamp": "2025-02-06T18:24:32.264103"
    },
    {
      "id": "bmidbar1_p31",
      "text": "ונראה לבאר הענין בשנקדים מ\"ש בספר בית שמואל אחרון (הו\"ד בישמח משה פ' שמות) לפרש הגמרא (שבת ל\"א ע\"א) באחד שבא לפני הלל וא\"ל גיירני ע\"מ שתלמדני כל התורה כשאני עומד על רגל אחת וא\"ל דעלך סני לחברך לא תעביד זו היא כל התורה, וכו'. והדקדוקים מבוארים מה ראה אותו גר לשטות כזה שילמדהו כל התורה כשהוא נצב על רגלו אחת. ופי' דאיתא בספרים כי כל אחד צריך לקיים כל תרי\"ג מצוות, ואם לא זכה לקיימן כולם בגלגול אחד יתחייב לבא בגלגול שנית עד שיקיים כולם. ודבר זה מבואר בארוכה בספה\"ק שערי הקדושה להרח\"ו זלה\"ה, כי רמ\"ח מצוות עשין הם כנגד רמ\"ח אברי האדם ושס\"ה ל\"ת נגד שס\"ה גידין כל אבר מכוון לעשה א' וכל גיד לל\"ת א' ואם האדם מחסר איזה מצוות נחסרת ההשפעה הרוחנית הצריכה לאותו אבר או גיד המכוון נגד מצוה זו, וא\"א להיות אדם השלם זולתי בקיום המצוות כולם על מתכונתן, ע\"כ.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 31,
      "char_length": 744,
      "timestamp": "2025-02-06T18:24:32.597580"
    },
    {
      "id": "bmidbar1_p32",
      "text": "אכן דבר זה לא יתכן שיהיה האדם מקיים בפועל בגלגול א' רמ\"ח עשין ושס\"ה ל\"ת אחד מהם לא נעדר, שהרי כמה מצוות יש שאינם נוהגות בכל אדם כגון יבום חליצה ומצוות כהונה וכיו\"ב הרבה. והנה יש תקנה לדבר עפי\"מ דאיתא בספה\"ק דמי שמקשר עצמו עם כל אחד מישראל באהבה אחוה וריעות ונפשו קשורה בנפשותם והיו לאחדים, אזי נחשב הוא כגוף אחד עם כל ישראל, וכל מה שמקיים אדם מישראל יחשב לו כאילו קיים אף הוא. וא\"כ גם מצוות אשר אין לאל ידו לקיימם בפועל כנ\"ל, יחשב לו כאילו קיימם גם הוא, דמכיון שנמצאים אנשים מישראל המקיימים מצוות אלו בפועל מעלה עליו כאילו אף הוא עשה אלה המצוות, שהרי כגוף אחד יחשב עם כל ישראל וידם כידו.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 32,
      "char_length": 587,
      "timestamp": "2025-02-06T18:24:32.989136"
    },
    {
      "id": "bmidbar1_p33",
      "text": "אמנם ענין זה לא שייך אלא בישראל דוקא, כי שורש נשמות ישראל חד הוא שהם נצר מטע האבות הקדושים אברהם יצחק ויעקב, על כן בהתקשרם יחד בקיום מצות ואהבת לרעך כמוך יחשבו לגוף אחד, שהרי מוצא נשמתן ממקור ישראל וממקום אחד חוצבו, על כן יתכן שיתחברו והיו לאחד. וכמ\"ש בספר עוללות אפרים על מאמרם ז\"ל (ת\"כ פ' קדושים) זה כלל גדול בתורה ואהבת לרעך כמוך, כי קיום כל התורה תלוי במה שהאדם נמשך אחרי נשמתו החצובה ממעל, וממאס בתאות הגופניות שיסודן מן החומר הכלה והנפסד. ולפיכך מצות ואהבת לרעך כמוך הוא כלל גדול לכל התורה, כי הנה כן הוא בישראל שהגופים פרודים ורק הנשמות מקושרות בשרש אחד, וכיון שהוא מקיים מצות ואהבת לרעך כמוך, הרי הוא כמורה באצבע שהוא מחשיב מאד את כוחות הנפש שלו, שהרי מטעם זה הוא אוהב לחבירו מצד הנשמה הטהורה שבה הם אחוזים ומקושרים, דאילו מצד הגוף יתפרדו, ולפיכך זה כלל גדול בתורה, שבהגברת הכוחות הנפשיים על כוחות התאווה הגופניים תלויה כל התורה.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 33,
      "char_length": 837,
      "timestamp": "2025-02-06T18:24:33.316178"
    },
    {
      "id": "bmidbar1_p34",
      "text": "ויובן ביתר ביאור עפ\"י מה שכתבו הקדמונים שכל אחד מישראל נפשו קשורה בשרשה באות אחת מאותיות התורה, ורמזו זאת בתיבת ישראל שהוא ר\"ת יש ששים רבוא אותיות לתורה, ולפיכך כיון שמקור ושורש נפשות ישראל אחוזים ומקושרים בתורה הקדושה, שכל אחד מהם אחוז באות אחת מאותיותיה, בדין הוא שתהא נחשבת להם התקשרותם יחד כאילו קיימו כה\"ת בפועל, אף אותם שלא יכלו לקיימה בפועל, דכיון שנתקיימה ע\"י אחד מישראל וכולם ענפים משורש אחד ומקורן מס\"ר אותיות התורה שכולם מחוברים יחד יתאחדו ולא יתפרדו עד סוף כל הדורות, הרי הם מקושרים בקשר אמיץ בשורש",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 34,
      "char_length": 510,
      "timestamp": "2025-02-06T18:24:33.749163"
    },
    {
      "id": "bmidbar1_p35",
      "text": "ברם הנה תקנה זו שיש ביד ישראל לקיים כל המצוות בגלגול אחד ע\"י התקשרות לא תתכן אלא בזמן שע\"י הצטרפות כל ישראל מתקיימים כל התרי\"ג מצוות, דאף מצוה שלא יכול כל אדם מישראל לקיים בפועל יוכל לקיימה ע\"י התקשרות, משא\"כ בזמן הגלות שחסרים לנו רוב המצוות ואין לאל ידינו לקיימם בפועל, א\"כ לכאורה אזדא לה תקנה זו, שהרי אף ע\"י ההתקשרות עם כל ישראל לאו סגי להשלים כל חלקי הנפש השייכים לרמ\"ח אבריו ושס\"ה גידיו בגלגול אחד, וא\"כ חזרה החששא למקומה פן תצטרך הנפש לשוב ולרדת לעולם השפל בסבה זו.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 35,
      "char_length": 471,
      "timestamp": "2025-02-06T18:24:33.991700"
    },
    {
      "id": "bmidbar1_p36",
      "text": "אמנם ישנה תקנה גם לזאת, שיהיה האדם משלים כל חלקי נפשו בעוה\"ז, אף אם לא יתכן לקיים מצוות אלו בפועל בזמן הגלות, והוא ע\"י שמקשרין את עצמן אל הדורות הקודמין שזכו לקיים כל התרי\"ג מצוות על מתכונתן, יחשב גם לנו כאילו קיימנום. וזה שייך גם באותם מצוות שנמנע מאתנו לקיימן בזמן הזה, דמכל מקום כיון שהולכים בעקבות הראשונים ואין זזים מדרכם דרך הקדש מתקשרים עמהם ומעלה עלינו כאילו קיימנו אף אנו כל אותם המצוות שקיימו המה, שהרי אנו אסורים עמהם בקושרות. ולפעמים יש אשר איש ישראל עושה מצוה בשלימות וישנם צדיקים הנמצאים כבר בעולם העליון ובחיים חיותם לא היה בידם לקיים אותה מצוה אזי אותם הצדיקים באים ומתדבקים בנשמת איש זה שקיים עתה אותה המצוה בבחינת עיבור כדי שיהיה גם להם חלק באותה מצוה ויש תועלת גם לאיש הזה דע\"י שנתעברו בו נשמות צדיקים מן העולם העליון הם מסייעים לו לעבודת השי\"ת.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 36,
      "char_length": 764,
      "timestamp": "2025-02-06T18:24:34.215954"
    },
    {
      "id": "bmidbar1_p37",
      "text": "עכ\"פ יש התקשרות בין נשמות ישראל בכל הדורות מתחלת בנין אומה הישראלית ע\"י אאע\"ה עד סוף כל הדורות והם מועילים זה לזה ומסויעים זה לזה להשלים קיום כל המצוות. וסייעתא לדברינו מהא דאיתא בילקוט פ' יתרו (רמז רע\"ו) כל אשר דבר ה' נעשה ונשמע ראוי היה לומר נשמע ונעשה אלא אמרו ישראל להקב\"ה רבון כל העולמים עד שלא שמענום קיימנום אנכי קיים יעקב שנאמר (בראשית ל\"ה) ויאמר יעקב הסירו את אלהי הנכר וגו' לא תשא קיים אברהם וכו', זכור קיים יוסף וכו', עיי\"ש. ולכאורה צריך להבין כוונת דרשה זו, שהרי ''נעשה'' הוא לשון עתיד שמקבלים ע\"ע לעשותם, ואיך דרשו מיניה עד שלא שמענום קיימנום, דא\"כ הול\"ל ''עשינו\" ולא ''נעשה\".",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 37,
      "char_length": 589,
      "timestamp": "2025-02-06T18:24:34.576791"
    },
    {
      "id": "bmidbar1_p38",
      "text": "ולפי מה שביארנו יבא על נכון: דישראל קדושים בשעה שאמרו נעשה ונשמע קבלו על עצמם בלב שלם להתקשר בדרכי האבות הקדושים ולא יזועו מינייהו אף זיז כל שהוא, שבזה יחשב עליהם משעת קבלה בלב כאילו הם עשו את כל המצוות האלה, כמבואר דבמה שקיימו וקבלו עליהם לצאת בעקבי פסיעות הראשונים הרי הם מתקשרים עמהם וכאילו קיימום בעצמם. וזהו מה שאמרו נעשה קודם לנשמע, דכוונתם בזה היתה לקבל עליהם לשמור דרכי אבות הקדושים ע\"כ אמרו נעשה כלומר נלך בדרכם הקדושה, ממנו אין לגרוע ועליו אין להוסיף. לשנות מדרכם אפילו כקוצו של יו\"ד, ועי\"כ יחשב לנו כאילו קיימנו כל המצוות. וז\"ש המדרש אמרו ישראל להקב\"ה וכו' עד שלא שמענום קיימנום אנכי קיים אברהם וכו' דע\"י התקשרותנו עמהם כאילו קיימנו אנחנו אותם המצוות שקיימו האבות הקדושים אברהם יצחק ויעקב.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 38,
      "char_length": 700,
      "timestamp": "2025-02-06T18:24:34.869041"
    },
    {
      "id": "bmidbar1_p39",
      "text": "אמנם כאן מצאה החקירה מקום לנוח דלכאורה אילו לא היו מתים כלל וכלל א\"כ לא היה שייך אצלם ענין גלגול הנשמות, שהרי הנשמה חוזרת להתגלגל בזה העולם בסבת החטא בלבד, אם בסבת חטאי עצמה או בעבור חטא הדור, דלפעמים צריכים צדיקים לחזור ולבא בגלגול כדי לתקן דורם, משא\"כ כשהדור בשלימות לא שייך ענין הגלגול, וביותר בשעת מ\"ת שהיו ברום המעלה לא היה שייך גבייהו ענין הגלגול כלל אילו היו נצבים על מעלה זו תמיד. וכיון שכן יש לשאול כיצד היו מתקיימים אז כל המצוות שלא יתכן שיהיו מתקיימים בפועל ע\"י כל אחד מישראל, כדאמרן דאיכא כמה מצוות דלא שייכו בכולהו, ויש כמה מצוות דלא הוו שייכו בשום אדם אילו לא היו מתים כמצות יבום חליצה וכיו\"ב.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 39,
      "char_length": 607,
      "timestamp": "2025-02-06T18:24:35.191212"
    },
    {
      "id": "bmidbar1_p40",
      "text": "ועל כרחך לומר שהיו מתקיימין כל המצוות ע\"ד שביארנו, דהיינו באמצעות התקשרות בין כלל ישראל באהבה ואחוה, שבזה יחשבו להם כל מצוות שאחד מישראל מקיים, וגם ע\"י התקשרות אל דורות הקודמין בקבלה גמורה בלב שישראל מקבלין עליהם ללכת בעקבותם ולבלתי סור מן המצוה ימין ושמאל, שבזה מעלה עליהם כאילו זכו הם עצמם לקיים כל אותם המצוות, שהרי כגוף אחד יחשבון.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 40,
      "char_length": 335,
      "timestamp": "2025-02-06T18:24:35.486617"
    },
    {
      "id": "bmidbar1_p41",
      "text": "ועד\"ז אמרנו ליישב קושיית הרש\"ש ז\"ל בחידושיו מהא דאיתא בגמרא (ב\"מ ק\"ז ע\"ב) עה\"פ ברוך אתה בבואך וברוך אתה בצאתך וכו' כשם שביאתך לעולם בלא חטא כך יציאתך מן העולם בלא חטא, ע\"כ. וכתב הוא דמכאן סתירה קצת לדעת בעלי הגלגול (כוונתו דמדדרשו מיניה כשם שביאתך לעולם בלא חטא וכו', מוכח דלא יתכן שתהא ביאת האדם לעולם מלוכלך בעוונות דאל\"כ מה זה שהחליט דביאתך לעולם בלא חטא הלא אם בא עתה בגלגול פעם שנית מאי פסקא דביאתו לעולם בלא חטא). אמנם לפי\"מ דאמרן לא קשה מידי, דהנה הברכות הכתובות בפרשה זו מיועדות להתקיים בישראל אם יהיו משמרים תורה ומצוות בשלימות, וידוע מ\"ש הרמב\"ן ז\"ל בפ' בחקתי כי לא השיגו ישראל כל הברכות בשלימותן לא הרבים ולא היחידים. שמעולם לא היו בבחינת השלימות שיתקיימו בהם הברכות בשלימותן. וכיון שכן אף יעוד הכתוב ברוך אתה בבואך וגו' קאי על אותו זמן שיהיו ישראל בשלימות הראוי שתחול עליהם ברכה זו. וכשיזכו ישראל להיות בשלימות הראוי, אזי שפיר ניתן לדרוש בהם כשם שביאתך לעולם בלא חטא וכו', שהרי אז ודאי שתהי' ביאתן לעולם בלא חטא דלא יהיה נוהג בהם ענין הגלגול כלל, והבן.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 41,
      "char_length": 963,
      "timestamp": "2025-02-06T18:24:35.664994"
    },
    {
      "id": "bmidbar1_p42",
      "text": "ועפי\"ז יש לתת טעם במה שאמה\"כ גבי ראובן ושמעון לגלגלותם מה שלא אמר כן בשאר השבטים, דהנה היה בהם פגם חטא שבעבורו קנטרן אביהם כמ\"ש בעהתו\"ס הנ\"ל (קושיא ה'), ולזאת בא הכתוב לרמוז ענין זה שעליהם הדבר מועל לתקן לגמרי רושם אותו הפגם, שאם ח\"ו לא יתקנו זאת יצטרכו לבא בגלגול שנית לעוה\"ז וזהו שרמז באומרו ''לגלגלותם'' לזרזם על תיקון חטאם שלא יוצרכו להתגלגל",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 42,
      "char_length": 345,
      "timestamp": "2025-02-06T18:24:36.111811"
    },
    {
      "id": "bmidbar1_p43",
      "text": "ואפ\"ל עוד עפימ\"ש בזוה\"ק פ' פנחס (דף רל\"ז ע\"ב), דהציווי שאו את ראש כל עדת בני ישראל נאמר אחרי שהפרידו והבדילו את הערב מביניהם, שלא היו הערב רב בכלל המנין, אלא ישראל קדושים ההולכים בתורת ה' תמימה המה בלבד נמנו. והנה כל זמן שהע\"ר נמצאים בקרב ישראל הם גורמים להחטיאם ולהכניס בהם מחשבות רעות ולהשביתם מקיום מצוות ה', ובעבור זה אין ישראל יכולים להתדבק אליו יתברך ולהתקשר כביכול אליו, שהרי ההתקשרות תתכן רק באמצעות קיום המצוות שהם אברין דמלכא בשלימות כנ\"ל, מה שאין כן כשהערב רב מפריעים את ישראל הם גורמים ח\"ו שלא יהיו אסורים בקושרות אליו יתברך, ורק אחרי שהפרידו את כתות הערב רב למיניהם מבין ישראל, אז קיימו ישראל מצוות ה' בשלימות, ויהי הקשר אמיץ בין ישראל לאביהם שבשמים. וזהו ענין הגדולה ונשיאות הראש לישראל שהפרידו את הערב רב מתוכם, כמבואר בזהר הקדוש, וע\"י כן נתקשרו אליו יתברך, שע\"י כן יתייחס לומר עליהם נתתי לכם תלוי ראש מן הע\"ר, וע\"י כן דמיתי אתכם לי, ע\"י התקשרות ישראל לאבשב\"ש, והבן. וצריך לדעת ולהשכיל מזה עד כמה צריך להתרחק מן המינים והכופרים. שהם הגרועים ביותר מן הה' כתות שבערב רב. לכן צריכין בני ישראל שומרי תורה ומצוות להפרד ולהתבדל מהם, ולא יהיה לבני ישראל חלק ונחלה עמהם בשום פנים ואופן, ואין לנו אלא לעמוד ולצפות לרחמי שמים שהשי\"ת יאיר עיניהם של ישראל ורוח הטומאה יעביר מן הארץ והאלילים כרות יכרתון לתקן עולם במלכות שד-י, ויתוודע ויגלה לעיני כל כי אין דבר אחר בעולם זולתי האמונה השלימה בה' ובתורתו הקדושה.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 43,
      "char_length": 1312,
      "timestamp": "2025-02-06T18:24:36.310604"
    },
    {
      "id": "bmidbar1_p44",
      "text": "ועפ\"י האמור לעיל מצינו טעם נכון על שקורין לעולם פרשה זו בשבת שלפני חג מתן תורתנו, דהנה בפ' זו כתיב שאו את ראש וגו' למשפחותם לבית אבותם ובמקו\"א נאמר להיפוך לבית אבותם למשפחותם, להורות על כך כי כדי לזכות לקיום התורה והמצוות בשלימות זקוקים להתקשרות בין נשמות ישראל בכל הדורות, ולזאת אמר לבית אבותם למשפחותם, כלומר המצוות שקיימו בית אבותם הקדושים בדורות הקודמין יחשבו למשפחותיהם הם כאילו קיימו הם בעצמם, וכן להפוך למשפחותם לבית אבותם, דכאשר יחסר לאבותיהם איזה מצוה שלא קיימוה ישלימו מצוה זו ע\"י שיקיימו בניהם אחריהם לדורותם אותה מצוה, וע\"י ההתקשרות עמהם יחשב להם כאילו קיימו אף הם מצוה זו, וזה למשפחותם, המצוות שמקיימין משפחותם יחשבו לבית אבותם הצדיקים שבעולם העליון.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 44,
      "char_length": 663,
      "timestamp": "2025-02-06T18:24:36.918534"
    },
    {
      "id": "bmidbar1_p45",
      "text": "או יאמר לבאר המדרש ילקוט בשעה שקבלו ישראל את התורה נתקנאו בהם אוה\"ע אמרו מה ראו להתקרב להם יותר מכל האומות סתם פיהם הקב\"ה וא\"ל הביאו לי ספר יוחסין וכו' כדרך שבני מביאין שנאמר ויתילדו על משפחותם וכו', ע\"כ. וצ\"ב מה טענו האומות, הלא הקב\"ה החזיר את התורה על כל אומה ולשון וסירבו לקבלה. גם איך נתקררה דעתן באמור להם הביאו ספר יוחסין. והרי אין קבלת התורה תלויה ביחוס כלל.  ב)",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 45,
      "char_length": 369,
      "timestamp": "2025-02-06T18:24:37.231722"
    },
    {
      "id": "bmidbar1_p46",
      "text": "במד\"ר (פ\"ב י\"ב) איתא שאו את ראש כל עדת בני ישראל הה\"ד (הושע ב') והיה מספר בני ישראל א\"ר ברכיה הכהן והיה מספר הסופר כמספר התורה נתבקש להם שכך נאמר להם ע\"י משה ברוך תהיה מכל העמים, וצריך ביאור.  ג)",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 46,
      "char_length": 195,
      "timestamp": "2025-02-06T18:24:37.434624"
    },
    {
      "id": "bmidbar1_p47",
      "text": "במדרש הובא בישמח משה פ' זו שאו את ראש וגו' זש\"ה (משלי ב') כי ה' יתן חכמה מפיו דעת ותבונה, וצריך להבין שייכות מקרא זה לכאן.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 47,
      "char_length": 122,
      "timestamp": "2025-02-06T18:24:37.571024"
    },
    {
      "id": "bmidbar1_p48",
      "text": "ונראה בהקדם מה שמצינו בדברי הקדמונים ז\"ל שחתרו למצוא טעם על קריאת לשוננו בשם לשון הקדש, וכי מה קדושה יש בו בלשון. הרמב\"ם ז\"ל בספר המורה כתב אל תחשוב שנקרא לשוננו לשון הקדש לגאוותינו או לטעותינו, אבל הוא כי זה לשון קדוש לא ימצאו בו שמות לאברי המשגל וכו' רק בכינוי. וכתב עליו הרמב\"ן ז\"ל בפ' תשא שאין צורך לטעם הזה, כי הדבר ברור שהלשון קדש קדשים הוא, משום שדברי התורה והנבואות וכל דברי קדושה כולם בלשון ההוא נאמרו: והוא הלשון שבו הקב\"ה מדבר עם נביאיו ועם עדתו אנכי ולא יהיה לך ושאר דברות התורה והנבואה, ובו נקרא בשמותיו הקדושים וכו', והשם הגדול המיוחד, ובו ברא עולמו וקרא שמות שמים וארץ וכל אשר בם ומלאכיו וכל צבאיו וכו', עכ\"ד הרמב\"ן ז\"ל, יעיי\"ש.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 48,
      "char_length": 643,
      "timestamp": "2025-02-06T18:24:37.674394"
    },
    {
      "id": "bmidbar1_p49",
      "text": "ומרן החת\"ס זלה\"ה בספר תו\"מ פ' שמות (בדרוש לכבוד התורה) השיב על דברי הרמב\"ן ז\"ל, דאפ\"ל דמפני שהמקבלים דברו בשפת עבר משו\"ה נאמרה באותו הלשון, ואילו היו המקבלים ישמעאלים או אדומים אפשר היה מדבר עמהם בלשונם. וכתב הוא ז\"ל דהנה ספר התורה שלנו מעט הכמות, אך א\"א להשיגו מבלתי ידיעת כל החכמות, ומאין נדע כל אותם החכמות הצריכים לתורה ואין שום זכר למו בתורה והספר קטן וקצר מהכיל, אבל דע והאמן כי אם הוא זרתיים ארכו וזרתיים רחבו ארוכה היא מארץ מדה ורחבה מני ים, ואין לך חכמה בעולם ומה למעלה ולמטה לפנים ולאחור שלא נרמז במלותי' ובאותיותיה, ובלי ספק כי בפ' החדש הזה לכם רמוזה כל חכמת קדוש החודש וכו', דכיון שבתוה\"ק ברא הקב\"ה את העולם מההכרח שיהיו כל שרשי החכמות מושרשים בה, ויותר מהמה מה שרמוז בסתרי תורה מה שלמעלה מהשכל. וזהו החילוק בין לה\"ק לשאר לשונות, דבהיות התורה כתובה בל' שנאמרה מפי הקב\"ה למשה הרי היא כפטיש יפוצץ סלע וכל פסוק סובל פירושים שונים, וע\"כ של ישראל ישמעו לדברי חכמים וחידותם וכהנה וכהנה מה שדרשו חז\"ל רוב גופי הלכות מן הלשונות, משא\"כ בהעתק התורה ללשון לעז אי אפשר לבחור כי אם כוונה פשוטה אחת ולכתבה באותה הלשון, כי אין לשונות העמים סובלים ככה. ועל כן כשהעתיק תלמי המלך את התורה יוונית נעשה ג' ימים חשך בעולם, כי אז החלו בנ\"י לטעום טעם פשוטו של מקרא, ומאז החלה האפיקורסות להתנוצץ ולא אבו שוב שמוע לקול דחז\"ל ולפירושיהם וכו', עכת\"ד הקדושים, עיי\"ש באורך.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 49,
      "char_length": 1256,
      "timestamp": "2025-02-06T18:24:38.007912"
    },
    {
      "id": "bmidbar1_p50",
      "text": "וחזינן דאף בזמן הש\"ס לא היו מדברים בלה\"ק וכמ\"ש בספר חסידים (סי' תשפ\"ה) שהיו מכירין בל' ארמית יותר מלה\"ק, וע\"כ נסדר התלמוד בלשון ארמי. וכן מצינו בכל הדורות שלא הנהיגו לדבר בלה\"ק, והיו מדברים כל דבריהם בלשון משובש וצ\"ל דהיינו טעמא כדאמרן דמחמת שראו הדורות מתמעטין והולכין חששו שידברו בלשון הקודש דברים פחותים ונמאסים, ע\"כ מוטב נמנעו מלהשתמש בו מאשר יכשלו בו (ועיין מה שכתבתי מזה בארוכה בספרי ויואל משה מאמר לה\"ק מסימן י\"ד ואילך). ומזה ברור דמה שהחזיר הקב\"ה את התורה על כל אומה ולשון, לא היתה הכוונה אלא ליתנה להם בלשונם ובשפתם בלבד, ולא היו זוכים אליה בלה\"ק אף אם היו מתרצים לקבלה. וכמו שאמרו ז\"ל בסוטה (דף ל\"ה ע\"ב) שכתבו את התורה ע\"ג האבנים בע' לשון כדי שלא יהיה להם פ\"פ לומר אילו שמענוה בלשונינו קבלנוה ועל דבר זה נתחתם דינם לבאר שחת שהיה להם ללמוד ולא למדו, ע\"כ. והטעם דאין הם ראויים להשתמש בלה\"ק לגודל קדושתו ששרשן רע והם עלולים להשתמש בו לדברים פחותים ונמאסים, ומוטב שישתמשו בשאר לשונות.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 50,
      "char_length": 890,
      "timestamp": "2025-02-06T18:24:38.602228"
    },
    {
      "id": "bmidbar1_p51",
      "text": "אכן טענת האומות המתקנאים בישראל שזכו ללה\"ק מאליה היא דחויה, דהנה איתא בפרקי דר\"א (פכ\"ד) ר\"ש אומר קרא הקב\"ה לע' מלאכים הסובבים כסא כבודו ואמר להם בואו ונבלבל לשונם לשבעים גויים ולשבעים לשון, והפילו גורלות שנא' בהנחל עליון גוים ונפל גורלו של הקב\"ה על אברהם ועל זרעו שנאמר כי חלק ה' עמו יעקב חבל נחלתו והנחיל להם לה\"ק וכו', ע\"כ. וא\"כ נמצא דלה\"ק שייך לישראל ובדין הוא מגיע להם, כי על פי הגורל נחלקו כל האומות ללשונותם לארצותם, ונפלו ישראל לגורלו של הקב\"ה, וזכו בלה\"ק, משא\"כ שאר אומות שנפלו תחת ממשלת השרים, קבלו כ\"א לשונו ע\"י השר הממונה עליהם, ומה טענה עוד בפיהם. אמנם לכאורה אכתי הם באים בטענה נכוחה, דמאחר שבדור הפלגה לא היה עדיין לאברהם אע\"ה זרע, והקב\"ה הנחיל לו ולזרעו לה\"ק, א\"כ כל הנולדים לאאע\"ה זכאים לירש מתנה זו, ואף עשיו וזרעו הבאים מיצחק בדין הוא שיותן להם לה\"ק.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 51,
      "char_length": 768,
      "timestamp": "2025-02-06T18:24:39.006871"
    },
    {
      "id": "bmidbar1_p52",
      "text": "אך אין בטענתם ממש דהנה המהרי\"ט ז\"ל בתשובותיו (ח\"ב סימן ו') כתב על מה שיש מפקפקין שאין לומר בתפלת ר\"ה ועקידת יצחק לזרעו היום ברחמים תזכור משום שאף עשיו הוא בכלל זרע יצחק, דאף שאמר הקב\"ה לאברהם כי ביצחק יקרא לך זרע ולא כל יצחק היינו דווקא שאין עשיו קרוי זרע אברהם, אבל זרע יצחק מקרי (עיין מג\"א תקצ\"א ס\"ק ז'). ותירץ המהרי\"ט דכיון שעשיו וזרעו נשאו נכריות ונתערבו בגויי הארצות, תו אין בניהם הנולדים מן הכנעניות מתייחסים אחרי יצחק אע\"ה, דבנך הבא מן הנכרית אינו קרוי בנך אלא בנה. עכת\"ד ז\"ל. והשתא שוב אין לזרע עשיו טענה שמגיע להם לה\"ק מצד שהם מזרע האבוה\"ק, דכיון שנתערבו בגוים ונתחתנו עמהם ונוהגים בחוקותיהם שוב לא מקרי זרע אברהם יצחק ויעקב.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 52,
      "char_length": 634,
      "timestamp": "2025-02-06T18:24:39.370680"
    },
    {
      "id": "bmidbar1_p53",
      "text": "וכיוצא בענין זה כתב בחידושי מהרצ\"א מהגה\"ק בני יששכר זלה\"ה במה שדרשו ז\"ל על הכתוב וישמע הכנעני יושב הנגב וגו' שלא היו כנעניים אלא עמלקים ומתוך ששינה לשונו ומלבושו ללשון כנען נקרא כנען. והקשה דבתה\"ק הכל אמת ואין נמצא בה דבר שקר ח\"ו, וא\"כ מדוע כתבה תורה וישמע הכנעני ולא היה אלא עמלק. ותי' דכיון ששינה לשונו ומלבושו ללשון ומלבוש הכנעניים שוב אין הוא קרוי עמלק אלא כנען, דנשתנה עצם בחינת מהותם מעמלק לכנען. מאחר שמדברים בשפתם והולכים בלבושם, ע\"כ. וא\"כ מה להם לזרע עשיו כי נזדעקו לזכות בלה\"ק מצד שהם מזרע אברהם יצחק ויעקב, אחרי ששינו כל מהותם ונתערבו לגמרי באוה\"ע שוב אינם מכונים זרע אברהם יצחק ויעקב כלל, ואין בדין שתנתן להם תורה בלה\"ק, אלא באותו לשון שניתן להם בדור הפלגה ע\"י השר הממונה עליהם. וזו תשובה השיבן הקב\"ה הביאו לי ספר יוחסין כדרך שבני מביאין. דכיון שכבר נתערבו בשאר אומות אין הם מתיחסין עוד אחרי האבות הקדושים, ובתוך בני ישראל לא ינחלו נחלה לרשת לשון הקדש, ודוקא ישראל קדושים המתיחסים אחרי האבות הקדושים הם יקחו חלקם, כי חלק ה' עמו, והוא נתן להם לה\"ק לנחלה.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 53,
      "char_length": 965,
      "timestamp": "2025-02-06T18:24:39.698086"
    },
    {
      "id": "bmidbar1_p54",
      "text": "ועל כן באו בטענה מה ראו ישראל להתקרב יותר מכל האומות שנתנה להם תורה בלשון הקדש, ויש להם התקשרות ודביקות בתורה הקדושה, שכ\"א מישראל שרש נשמתו באות אחת מאותיותיה ואילו האומות לא היו זוכים לכך אילו נתנה להם תורה בלשונם, והשיב להם הקב\"ה הביאו לי ספר יוחסין וכו' כדרך שמביאין בני, דאין לה\"ק שייך אלא לישראל שהם זרע אברהם יצחק ויעקב, והם עם ה' ונחלתו השייכים לחלקו ולגורלו, משא\"כ אוה\"ע שאינם מתיחסים אחרי האבות משום שהתערבו בגוים ונטמעו ביניהם אין שייך להם לה\"ק כנ\"ל.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 54,
      "char_length": 460,
      "timestamp": "2025-02-06T18:24:40.142999"
    },
    {
      "id": "bmidbar1_p55",
      "text": "והשתא שייך שפיר מה שנתקנאו אוה\"ע בישראל שקבלו את התורה לפרשה זו, דכיון שנמנו ישראל ונודע לאוה\"ע שמספרן ס\"ר, ויש לכ\"א מהם אחיזה באות מאותיות התה\"ק אז נודעה להם מעלת ישראל  שקבלו תורה בלה\"ק, ומכאן נצמחה טענתם על שלא הציעו להם לקבל את התורה אלא בלשונם.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 55,
      "char_length": 249,
      "timestamp": "2025-02-06T18:24:40.363924"
    },
    {
      "id": "bmidbar1_p56",
      "text": "ויובן בזה המד\"ר והיה מספר בני ישראל וגו' והיה מספר הסופר כמספר התורה נתבקש להם, כלומר דמספר בני ישראל שהם ששים רבוא ע\"י והיה מספר הסופר שסופרים אותיותיה של תורה יחד עם קדושת הקריאה שנאמרה מפי הקב\"ה למשה, כמספר התורה נתבקש להם יגיע מספרם של ישראל כמספר התורה במכוון שהוא ס\"ר, וכל נשמות ישראל במשך כל הדורות כלולה נשמתן בנשמות אותם הס\"ר, והם אחוזים באות א' מן התורה. ומסיים המדרש שכך אמר להם ע\"י משה ברוך תהיה מכל העמים, שנתברכו ישראל בכך שיהיו מקושרים בנשמותיהם אל אותיות התוה\"ק ע\"י שנתנה להם התורה בלה\"ק, משא\"כ שאר אומות שלא היו זוכים במעלה זו.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 56,
      "char_length": 544,
      "timestamp": "2025-02-06T18:24:40.502998"
    },
    {
      "id": "bmidbar1_p57",
      "text": "ובזה מבואר ע\"נ גם המדרש המובא בישמח משה זש\"ה כי ה' יתן חכמה מפיו דעת ותבונה, שהרי קנאת האומות בישראל שמחמתה ציוה הקב\"ה על ישראל להביא ספרי יחוסיהן הוא משום שזכו ישראל במעלה זו שיהיו ס\"ר נשמותיהן מקושרות בס''ר אותיות התורה. ולכאורה תקשה שלא מצינו בתורה כי אם לערך שלשים וא' רבוא אותיות, וכיצד מכוון חשבון ס\"ר, לז\"א המדרש זש\"ה כי ה' יתן חכמה, כלומר שנתן לנו את התוה\"ק בכתב שעליה יתייחס לשון נתינה דעל דבור בע\"פ ל\"ש לשון נתינה, ומלבד זאת ''מפיו\" דעת ותבונה היא קדושת הקריאה שאמר הקב\"ה בפה למשרע\"ה, שגם זה יחשב למספר האותיות. ובהצטרפות התורה שבכתב עם מה שנאמר מפי ה' למשה יש ששים רבוא אותיות לתורה, כמ\"ש הפנ\"י ז\"ל, כנגד ששים רבוא נשמות ישראל המקושרים ואחוזים בתוה\"ק, ולפיכך נתקנאו בהם אוה\"ע שזכו להתקשר בתוה\"ק, וציוה הקב\"ה ליחסם על משפחותם לבית אבותם.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 57,
      "char_length": 747,
      "timestamp": "2025-02-06T18:24:40.764627"
    },
    {
      "id": "bmidbar1_p58",
      "text": "שאו את ראש כל עדת בני ישראל למשפחתם לבית אבותם וגו'. במדרש ילקוט (רמז תרפ\"ד) בשעה שקבלו ישראל את התורה נתקנאו אומות העולם בהן מה ראו להתקרב יותר מן האומות סתם פיהן הקב\"ה אמר להן הביאו לי ספר יוחסין שלכם שנאמר (תהלים כ\"ט) הבו לה' משפחות עמים כשם שבני מביאין ויתילדו על משפחותם, עכ\"ד הילקוט. והקושיא נודעת מה ענין מעלת יוחסין לקבלת התורה דבשביל שנעדרה מן האומות מעלת היוחסין אינם ראויים לקבלה ולא מצינו כזאת בשום מקום שתהא קבלת התורה תלויה ביחוס. אדרבה, איפכא מצינו בדבריהם ז\"ל וכמו שאמרו כתר תורה מונח כל מי שירצה יבא ויטול (עי' רמב\"ם רפ\"ג מהלכות ת\"ת).  ב)",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 58,
      "char_length": 555,
      "timestamp": "2025-02-06T18:24:41.120006"
    },
    {
      "id": "bmidbar1_p59",
      "text": "גם צריך להבין לשון המדרש סתם פיהן הקב\"ה, מה כוונתו בזה, אם לומר שדחה טענתן, היה ראוי",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 59,
      "char_length": 84,
      "timestamp": "2025-02-06T18:24:41.382021"
    },
    {
      "id": "bmidbar1_p60",
      "text": "שיאמר השיב להן הקב\"ה וכדומה, מאי האי לישנא דסתם פיהן דנקטיה הכא.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 60,
      "char_length": 64,
      "timestamp": "2025-02-06T18:24:41.476106"
    },
    {
      "id": "bmidbar1_p61",
      "text": "והנראה בזה על פי מה דאיתא בגמרא (תענית כ\"ז ע\"ב) א\"ר אסי אלמלא מעמדות לא נתקיימו שמים וארץ (פירש\"י אלמלא מעמדות, עסקי קרבנות שישראל עושין היו הן כלין בחטאן ומשהן כלין שמים וארץ העומדים בזכותן אין מתקיימין) שנא' (בראשית ט''ו) ויאמר ה' אלקים במה אדע כי אירשנה. אמר אברהם רבש\"ע שמא ישראל חוטאים לפניך אתה עושה להם כדור המבול וכו' אמר לו קחה לי עגלה משולשת וגו' (בזכות הקרבנות) א\"ל תינח בזמן שבהמ\"ק קיים, בזמן שאין בהמ\"ק קיים מה תהא עליהן א\"ל כבר תוקנתי להם סדר קרבנות בזמן שהם קורין בהם לפני מעלה אני עליהם כאילו הקריבום לפני ואני מוחל להם על כל עוונותיהם, ע\"כ. היוצא מזה דבזמן הגלות שחרב בית מקדשנו בחטאינו ואין לנו מזבח ולא קרבן לכפר בעדינו עולה קריאת ולימוד סדר הקרבנות כאילו הקרבנו אותם בפועל ובזכות לימוד תורת הקרבן הקב\"ה מוחל לעוונות עמו בית ישראל, ובזה יש קיום לעולם כשם שהי' מתקיים בזמן שביהמ\"ק הי' קיים בזכות הקרבנות.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 61,
      "char_length": 822,
      "timestamp": "2025-02-06T18:24:41.550708"
    },
    {
      "id": "bmidbar1_p62",
      "text": "אמנם במדרש רבה פ' תצוה (פל\"ח ד') איתא עה\"פ וזה הדבר אשר תעשה להם לטהרם הה\"ד (הושע י\"ד) קחו עמכם דברים וגו' וכו' לפי שישראל אומרים רבון העולם וכו' עניים אנו ואין לנו להביא קרבנות אמר להם דברים אני מבקש שנאמר קחו עמכם דברים ושובו אל ה' ואני מוחל על כל עוונותיכם ואין דברים אלא דברי תורה וכו' אמרו לו אין אנו יודעין, אמר להם בכו והתפללו לפני ואני מקבל וכו', עיי\"ש דמייתי כמה מקראות שפדה הקב\"ה את אבותינו הקדושים בזכות התפלה, ומסיים המדרש הוי איני מבקש לא זבחים ולא קרבנות אלא דברים, שנאמר קחו עמכם דברים ושובו אל ה' וכו', עכ\"ד המד\"ר. ולכאורה משמע מדברי המד\"ר דבאם אין ישראל יודעים ולא מבינים לעסוק בלימוד סדר הקרבנות סגי להו בבכי ובתחנונים לפני הקב\"ה ויעלה להם כקרבן, דכשם שלימוד תורת הקרבנות עולה כאילו הקריבו אותם בפועל כן התפלה והבכיה לפני השי\"ת חשובה ומקובלת ומרוצה כקרבנות.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 62,
      "char_length": 775,
      "timestamp": "2025-02-06T18:24:41.938688"
    },
    {
      "id": "bmidbar1_p63",
      "text": "ואפ\"ל בהבנת דברי המד\"ר פ' תצוה הנ\"ל בדרך אחר קצת דלעולם אימא דאין דברים אלא דברי תורה וכדיליף במסכת תענית הנ\"ל דלימוד סדר הקרבנות חשוב ומקובל ומרוצה כאילו הקריבוהו בפועל אלא דהא דקאמר המד\"ר א\"ל בכו והתפללו לפני ואני מקבל, היינו שאם לא זכה האדם להבין ולהשיג בתה\"ק, כמו שאמרו ישראל לפני הקב\"ה אין אנו יודעים, אזי תקנה יש לו להתחנן ולשפוך שיח בבכי יבא ובתחנונים לחלות פני אבינו האב הרחמן שייאיר עיניו ויפקח שכלו להשכיל בתה\"ק. ובאמת כאשר נתבונן בדבר יפלא בעינינו כיצד יוכל האדם אשר הוא קרוץ מחומר גשם עכור לבוא למדריגה גבוהה כ\"כ להשיג בתורת ה' דברי אלקים חיים וכל התורה שמותיו של הקב\"ה חמדה גנוזה היא לו שבה נסתכל וברא עולמו ומלאכי רוח משרתי אש נתאוו וחמדו לזאת התורה ובאו בטענה תנה הודך על השמים ואיך יזכה אדם שפל להשיג אמיתיות התוה\"ק לולא שהקב\"ה בעזרו ותומך בידו להאיר מאור עיני שכלו בתוה\"ק. ועל כך צריך האדם להרבות בתחנה ובקשה לפני הבוית\"ש שיחוננהו דעת להבין ולהשכיל בתורת ה'.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 63,
      "char_length": 875,
      "timestamp": "2025-02-06T18:24:42.301706"
    },
    {
      "id": "bmidbar1_p64",
      "text": "והשתא הא דקאמר הקב\"ה בכו והתפללו לפני ואני מקבל היינו דמי שלא בא לידי מדה זו לעסוק בתוה\"ק בסדר הקרבנות שהם קיומו של עולם יבכה ויתחנן לפני בעל הרחמים שיפקח עיני שכלו ויזכה להשיג בתה\"ק. וא\"ש הא דקאמר המד\"ר אין דברים אלא דברי תורה דהא דקאמר בכו והתפללו לפני אינו אלא הכשר והכנה שיזכה ללמוד בתורה ולהשכיל ע\"ד אמת, והבן.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 64,
      "char_length": 315,
      "timestamp": "2025-02-06T18:24:42.688928"
    },
    {
      "id": "bmidbar1_p65",
      "text": "ובדרך זה אפ\"ל הא דאיתא בגמרא (עירובין ס\"ה ע\"א) שמעתא בעי צלותא כיומא דאיסתנא, ופירש רש\"י ז\"ל צלותא, דעת צלולה ומיושבת. ולפי\"מ דאמרן יתכן שהכוונה דלהבין שמעתא על בוריה ובפרט לאסוקי שמעתתא אליבא דהלכה בעי ''צלותא'' צריך להתפלל ולבקש רחמים ממי שהחכמה שלו שיאיר עיניו  להשיג האמת בתה\"ק. (וכיו\"ב יתבאר גם במגלה (דף כ\"ח ע\"ב) בעובדא דרבא ששם הובא ג\"כ מאמר זה שמעתא בעי צילותא יעיי\"ש, דעיילינהו לבי כנישתא ואמר להו הטעם משום דשמעתא בעי צילותא. וצריך לומר כנ\"ל לפי שבהכנ\"ס הוא מקום קבול התפלות דאין תפלתו של אדם נשמעת אלא בבהכנ\"ס על כן עייל לבי כנישתא להתפלל לפני הקב\"ה שיתן לו דעה צלולה והשגה נכונה ואמתית להשיג האמת).",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 65,
      "char_length": 610,
      "timestamp": "2025-02-06T18:24:42.860905"
    },
    {
      "id": "bmidbar1_p66",
      "text": "ונקדים עוד מ\"ש אבא מארי זלה\"ה בקדושת יו\"ט פ' נשא לפרש מאה\"כ (תהלים מ\"ד) כי שחה לעפר נפשנו דבקה לארץ בטננו קומה עזרתה לנו וגו' עפ\"י מ\"ש בסה\"ק בני יששכר (מאמרי כסלו טבת מאמר ב' סי' כ\"ט) לפרש אמרינו בתפלה עזרת אבותינו אתה הוא מעולם מגן ומושיע להם ולבניהם אחריהם בכל דור ודור דהנה החילוק בין עזרה לישועה הוא שלשון עזר יצדק על העזרה מבלי בקשה תחלה מאת הנעזר, ותשועה היא כשמושיע המושיע עפ\"י בקשת הנושע ע\"ד צעקה הנערה המאורסה ואין מושיע לה. והנה אבותינו שהיו צדיקים גדולים הנה היית עזרתם גם בטרם התפללו אליך אבל בניהם אחריהם עכ\"פ אחר התפלה יש לנו ישועה. וזהו ''עזרת\" אבותינו אתה הוא מעולם בטרם יקראו מגן ''ומושיע\" להם ולבניהם שלבניהם לא היית אלא בבחינת מושיע עוד הם מדברים ואני אשמע, אלו תו\"ד הבני יששכר זלה\"ה.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 66,
      "char_length": 703,
      "timestamp": "2025-02-06T18:24:43.161121"
    },
    {
      "id": "bmidbar1_p67",
      "text": "והנה לפי שנתבאר לעיל בדברינו שגם ללימוד התורה יש צורך להקדים תפלה לחנן ולשפוך שיח לפני רבון כל העולמים שנזכה להבין ולהשכיל בתה\"ק, א\"כ מה נענה ומה נאמר בדורות השפלים הללו שאין בנו כח וגבורה לעמוד ולהתפלל לפני בוראינו האב הרחמן ית\"ש, וכמו שמתאונן אאמו\"ר זלה\"ה כנ\"ל שתש כחנו וחלש שכלנו עד שאין בנו התגברות אפילו להתפלל ולשפוך שיח. וא\"כ כיצד נוכל להשכיל עד אמת בלימוד התה\"ק שהיא יסוד קיום העולם ואלמלי העסק בתה\"ק שהיא במקום קרבן לא נתקיימו שמים וארץ. ועל כרחך לומר כי גם בשפלותנו ובדלות מצבנו ומעמדינו לא עזבנו יוצרנו יתברך שמו אלא ישלח לנו עזרו מקדש בטרם נקרא אליו יעננו להאיר עינינו להבין ולהשכיל בתה\"ק גם מבלי שנקדים תפלה ותחנונים לפניו ית\"ש.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 67,
      "char_length": 641,
      "timestamp": "2025-02-06T18:24:43.562843"
    },
    {
      "id": "bmidbar1_p68",
      "text": "ולפי שקיום כל הבריאה תלוי בעסק התורה שהיא במקום קרבנות בעל כרחך לומר דעוד בתחלת הבריאה כאשר ראה קורא הדורות מראש הצופה ומביט עד סוף כל הדורות שעתיד לעמוד דור חלש כזה שאין ביניהם מי שיעורר רחמים ויבקש מלפניו ית' על עמו כך עלתה במחשבה לפניו לחון אותנו בני הדור השפל הזה בבחינת אבותינו הקדושים, דהיינו בחי' עזרה בטרם נקרא אליו יעננו בכח ובזכות האבות הקדושים שהיו במדריגה זו. אכן אחרי שישלח לנו הקב\"ה ''עזרו\" מקדש לפקוח עיני שכלנו במאור תורתו הקדושה ויטע בלבנו אהבתו ויראתו אז כבר יהי' בכוחנו לעמוד ולשרת לפניו וגם להטיף אמרות נכוחות דברים הראויים לאמרם לפני הבוית\"ש והוא ברחמיו יאזין לקול שועתינו ויעתר לנו בתחנתינו וחפצינו ובקשתינו ימלא ברחמים.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 68,
      "char_length": 642,
      "timestamp": "2025-02-06T18:24:43.909612"
    },
    {
      "id": "bmidbar1_p69",
      "text": "ולדרכנו יהי' שיעור הכתוב והי' טרם יקראו ואני אענה וגו' עז\"ה, דמכיון שלא יהיה לנו פה לדבר ולשפוך שיח לפני יוצרנו יתעלה בדברי תפלה ובקשה על כן יהיה בטרם יקראו ואני אענה בזכות אבותינו הקדושים שהי' הקב\"ה עונה להם בעת צרתם בבחינת ''עזרה\" בטרם קראו ומאחר שיענה לנו השי\"ת מבלי שנקדים להתפלל אליו ויאיר עינינו להשיג האמת אזי ''עוד הם מדברים'' פירוש מיד נזכה שיושפע לנו שפע קדש לדבר לפני השי\"ת דבורים קדושים אמיתיים והקב\"ה יקשיב שוועתינו וישמע ויאזין לקול תחנתינו ויאיר עינינו באור תורתו שהיא קיום כל העולם.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 69,
      "char_length": 498,
      "timestamp": "2025-02-06T18:24:44.207861"
    },
    {
      "id": "bmidbar1_p70",
      "text": "היוצא לנו מזה כי כל כוחנו וקיומנו בדורות השפלים הללו הוא בזכות אבותינו הקדושים שזכו לבחי' עזרה מבלי שיקדימו להתפלל על צרכיהם ומכוחם זכינו גם אנחנו שבטרם נקרא אליו יתברך יעננו. ולולא זאת ח\"ו איך נפתח פה ואיככה נשא עין להתחנן לפני שוכן מרומים הלא דבר אין בפינו ובלשונו מלה להתפלל ולשפוך שיח לפני בוראינו יתברך ויתעלה, אלא שזכות אבותינו עומדת לנו שהקב\"ה עוזר לנו בטרם נקרא כשם שענה את אבותינו בעת צרתם ובזכותם הקב\"ה משפיע לנו דבורים אמיתיים לאמר לפניו וע\"י תפלתנו אנו זוכים להבין בתה\"ק שהיא קיום העולם.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 70,
      "char_length": 499,
      "timestamp": "2025-02-06T18:24:44.469034"
    },
    {
      "id": "bmidbar1_p71",
      "text": "ובזה נבוא לביאור המדרש ילקוט בשעה שקבלו ישראל את התורה נתקנאו בהם אוה\"ע מה ראו להתקרב יותר מן הכל וכו', דהנה מצינו לשון קורבה שהוא מורה על קיבול תפלות כדכתיב בפרשת ואתחנן (פ\"ד ז') כי מי גוי גדול אשר לו אלקים קרובים אליו כה' אלקינו בכל קראינו אליו ותרגם אונקלוס ארי מן עם רב די ליה אלהא דקריב ליה לקבלא צלותיה בעדן עקתיה כה' אלקנא בכל עידן דאנחנא מצלין קדמוהי, ע\"כ. הרי דלשון קורבה פירושו שהקב\"ה קרוב לקוראיו ומאזין ומקשיב תפלות עמו ישראל ברחמים ומושיעם מכל צרותיהם.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 71,
      "char_length": 465,
      "timestamp": "2025-02-06T18:24:44.732764"
    },
    {
      "id": "bmidbar1_p72",
      "text": "''סתם פיהם'' הקב\"ה. נקט סתם פיהם ולא אמר השיב להם הקב\"ה, משום דסתימת הפה ירמוז שאין תפלתם נשמעת ולא בקשתם של אוה\"ע מתקבלת במרום ולא יתכן שיהיו נושעים בבחי' עזרה בטרם יקראו, ומפרש והולך הטעם הביאו ספר יוחסין כשם שבני מביאין, כלומר דלא יתכן שיזכו לכך אלא ישראל קדושים המתייחסים אחרי אבותיהם הקדושים שהיו נענים בבחי' עזרה בטרם יקראו ומכוחם וזכותם זכו בניהם אחריהם לפיכך ראויים הם לקבל את התורה שאין כוחם אלא בפה להתפלל ולשפוך שיחם לפני הקב\"ה, משא\"כ אוה\"ע פיהם סתום ולא יוכלו להתפלל ואין להם לקוות לעזרה בטרם יקראו דאין להם יחוס לזכות לכך, והבן.  וזה אפשר לומר גם בביאור הכתוב שאו את ראש כל עדת בני ישראל למשפחותם שציוה הכתוב לייחס כל אחד מישראל אחרי משפחתו כנ\"ל במדרש הביאו לי ספר יוחסין שלכם וגמר אומר לבית אבותם פי' דאף אותם שאינם ראויים ואינם יכולים להתפלל ולשפוך שיח יענה להם הקב\"ה בטרם יקראו בזכות אבותיהם הקדושים.  במסיבה להחזקת המוסדות הקדושים ''יטב לב\" בארץ",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 72,
      "char_length": 862,
      "timestamp": "2025-02-06T18:24:44.977394"
    },
    {
      "id": "bmidbar1_p73",
      "text": "באופן אחר יתבאר המדרש ילקוט בשעה שקבלו ישראל את התורה נתקנאו אוה\"ע בהם מה ראו להתקרב יותר מן האומות סתם פיהן הקב\"ה א\"ל הביאו לי ספר יוחסין שלכם כשם שבני מביאין ויתילדו על משפחותם וכו'. וידועה הקושיא מה טענה היתה בפיהם מה ראו להתקרב יותר מכל אוה\"ע, הלא הקב\"ה רצה לתת להם את התורה ולא רצו לקבלה.  ב) וכן יל\"ד בלשון המדרש מה ראו להתקרב וכו' דכי האם על ישראל טענתם שהתקרבו אל הקב\"ה, הלא כלפי קב\"ה כביכול המה טוענים על שקירב את ישראל אליו יותר מכל האומות, וא\"כ הול\"ל מה ראה לקרבם יותר מן הכל.  ג) ותו מה תשובה השיבן הקב\"ה הביאו לי ספר יוחסין שלכם, האם קבלת התורה ביחוס תליא הלא ראינו שהחזיר הקב\"ה את התורה על כל אומה ולשון, דלא תליא קבלת התורה ביחוס.  ד)",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 73,
      "char_length": 649,
      "timestamp": "2025-02-06T18:24:45.365530"
    },
    {
      "id": "bmidbar1_p74",
      "text": "במדרש (הובא בישמח משה) שאו את ראש כל עדת בני ישראל זש\"ה (משלי ב') כי ה' יתן חכמה מפיו דעת ותבונה, וצ\"ב.  ה)",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 74,
      "char_length": 107,
      "timestamp": "2025-02-06T18:24:45.718193"
    },
    {
      "id": "bmidbar1_p75",
      "text": "ונראה לבאר הענין עפ\"י מה דאיתא במד\"ר פ' יתרו (פכ\"ט ג') א\"ר לוי ב' דברים שאלו ישראל מלפני הקב\"ה שיראו כבודו וישמעו קולו והיו רואין את כבודו ושומעין את קולו וכו' צפה הקב\"ה שהן עתידין לעשות ע\"ז שלא יהו אומרין אילו הראנו את כבודו לא היינו עושים ע\"ז וכו'. גם נודע הא דאיתא במכילתא עה\"פ וכל העם רואים את הקולות, רואים את הנשמע, דהיינו שראו בעיניהם את הקול יוצא מפי הגבורה בברקים ורעמים. והנה להתגלות גדולה כזו לראות הקולות והדבורים בראיה מוחשית ממש לא זכו כי אם בני ישראל בלבד, משא\"כ הע\"ר שלא היו ראויים לא זכו לכך, וכ\"ש אומות העולם ודאי לא שמעו ולא ראו זאת. ואף שכל האומות שמעו את הדברות בלשונם, כמ\"ש ז\"ל (שבת פ\"ח ע\"ב) שדיבורו של הקב\"ה נחלק לע' לשונות, מ\"מ זה לא היה דבורו של הקב\"ה בעצמו, כי אם ע\"י התלבשות שנתלבשה השפעת הדיבור של הקב\"ה בע' לשון אבל לשמוע הדבור כהווייתו מפורש יוצא מפי הגבורה בלי שום התלבשות לא זכו אפי' הערב רב, וכ\"ש אומות העולם, ורק בני ישראל בלבד היו מיוחדים במעלה זו.  וזה שטענו האומות מה ''ראו\" אלו להתקרב יותר מן הכל, כלומר מדוע ראו אלה בעיניהם את הקולות, ולפי שזכו להתגלות גדולה כ\"כ היא שגרמה להם להתקרב אל הקדושה ולקבל את התורה, ומדוע לא זכו האומות למעלה זו לראות במו עיניהם את הקולות, דאף מה ששמעו היה ע\"י התלבשות ואמצעי. ועל כך השיבם הקב\"ה הביאו לי ספר יוחסין שלכם, דלא יתכן לזכות להתגלות כזו בלתי השראת השכינה דתליא ביחוס, כאמרם ז\"ל (קידושין ע' ע\"ב) אין הקב\"ה משרה שכינתו אלא על משפחות מיוחסות שבישראל, ולפיכך לא זכו לכך אלא בני ישראל שהם מיוחסים זרע אברהם יצחק ויעקב ההולכים בדרכי אבותיהם הקדושים באמת ולא זזים ממנו, אז זוכים להתגלות גדולה ונפלאה, משא\"כ באוה\"ע דלא שייך כל זה דאינם מיוחסין, ע\"כ לא יתכן שיראו את הקולות, ואף אם יראו אותם לא יזכו להתכוון אל האמת, כי מי שאינו הולך בדרכי אבות יש לו עינים אחרות ורואה את הדבר באופן אחר מאותם ההולכים בדרך האבות. וכן הוא בכל דור ודור אף שהכל עמון ומכוסה כ\"כ שאין רואים כלום מגודל ההסתרה, אפ\"ה גם כל הכתוב בתוה\"ק רואים באופן אחר כל אלו שאינם רוצים לזוז מדרך הקודם. וגם השאר הנוטים מן הדרך אומרים שרואים כתוב בתוה\"ק אחרת, אבל לא ראו היטב כי שגו ברואה ועינים להם ולא יראו האמת, כאשר רואים אותם הרוצים לילך בדרך האמת.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 75,
      "char_length": 1982,
      "timestamp": "2025-02-06T18:24:45.825366"
    },
    {
      "id": "bmidbar1_p76",
      "text": "ואפ\"ל עוד לענינינו בביאור המדרש שטענו האומות מה ראו להתקרב להם מכל האומות, בהקדם לבאר דבריהם ז\"ל במאה\"כ והיה מספר בני ישראל והדר אמר אשר לא ימד ולא יספר, ומשני כאן בזמן שעושין רצש\"מ כאן בזמן שאין עושין רצש\"מ (קושיא ה'). דהנה ידועים דברי הפרשת דרכים (דרוש ד') שכתב להוכיח ממדרשי חז\"ל שהקב\"ה ברוב טובו וחסדו דן את האדם לטובה על שם העתיד שמצרף לזכותו את המצוות ומע\"ט שהוא עתיד לעשות או זרעו אחריו בדורות הבאים, אבל לרעה אין הקב\"ה דן על שם העתיד אלא באשר הוא שם, יעיי\"ש בארוכה. ולכאורה קשה וכי משוא פנים יש בדבר, ממ\"נ אם ראוי לצרף גם העתיד לחשבון מעשיו של האדם א\"כ אף לרעה יצטרפו, ואם אין בדין להקדים ולחשב את העתיד להיות, ולדון על פיהם, א\"כ גם לטובה לא יצטרפו.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 76,
      "char_length": 657,
      "timestamp": "2025-02-06T18:24:46.760476"
    },
    {
      "id": "bmidbar1_p77",
      "text": "אכן נראה דהנה כתיב (איכה ג') מפי עליון לא תצא הרעות, ובאם הקב\"ה גוזר רעה הרי זה נעשה באמצעות שלוחים הממונים להעניש את האדם ולייסרו כחטאתיו. והנה השלוחים אינם יודעים במכוון מה שעתיד להיות, דאין נודע להם רק מה שמגלים להם ותו לא, ע\"כ לא יתכן שיהיה האדם נדון לרעה ע\"ש העתיד, דאין בכח השלוחים הדנים את האדם ומענישין אותו לדעת בבירור איך יהיו מעשיו של האדם להבא, משא\"כ לטובה שהקב\"ה בעצמו דן את האדם לטובה ולפניו ית' נגלו כל תעלומות ואין נסתר לפני כסא כבודו, ואצלו עבר הוה ועתיד הכל ברגע אחד, על כן הקב\"ה דן לטובה ע\"ש העתיד, והבן.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 77,
      "char_length": 523,
      "timestamp": "2025-02-06T18:24:47.082664"
    },
    {
      "id": "bmidbar1_p78",
      "text": "ולדרכנו אף אנו נאמר, הנה כל יהודי מתאמץ לפזר מממונו לצדקה כפי כוחו ויכלתו, אבל עם כל זאת הריהו נותן במספר ובמדה, ואין בכך די, כי צריכים ממון רב לצורך קיום התורה. אכן הנה אדמו\"ר הקדוש בעל דברי חיים זלה\"ה פירש במאה\"כ (דברים ע\"ו) נתון תתן לו ולא ירע לבבך בתתך לו כי בגלל הדבר הזה יברכך ה' אלקיך וגו'. כי הנה לפעמים כאשר נותנים צדקה לעני, ידוה ויכאב לב הנותן בקרבו לאמר וכי במעט הכסף שנתתי היתה  לו הרווחה ונושע, הלא הוא זקוק להרבה מאד, ואמר הוא ז\"ל כי העצה היעוצה לכך הוא שמלבד הממון שנתת לו תעניק לו גם זכות המצוה שלך, כי הנה כח וזכות המצוה הוא להשפיע ברכה מרובה, ומאחר שהענקת לו גם זכות מצות הנתינה יתברך העני המקבל בברכה מרובה ויהיה לו הרבה מאד.  וזהו ביאור הכתוב נתון תתן לו, פי' שתתן לו את ה''נתון\", כלומר זכות מצות נתינת הצדקה, ובאמצעות כך ולא ירע לבבך בתתך לו'', כלומר שלא יכאב עוד לבך לומר כי לא נתת לו די הצורך שהרי בגלל הדבר הזה\" כלומר מצות הצדקה ''יברכך ה' אלקיך\" וכיון שנתת לו זכות המצוה גם ברכת ה' הבאה בזכות המצוה נתנה לו למנה, ושוב אין לך להצטער, שהרי כבר נתת לו הרבה מאד, עכדה\"ק.  וזאת אפשר לרמז בדברי הכתוב והיה מספר בני ישראל\" כלומר שנותנין מעט לצדקה במספר, וצריכים הרבה מאד לקיים ולהחזיק מוסדות התורה והחינוך, אמנם אם נותנים במדה גדושה טוב עין הוא יבורך, שמשתלחת הברכה בנתינתו, ונעשה מזה ''אשר לא ימד ולא יספר\" וכמו שנתבאר דהשכר שהקב\"ה משלם בעד המצוה הוא ברכה מרובה מאד, ונמצא דאף שהיתה נדבתו במספר, ע\"י ברכת הקב\"ה נתרבתה ונעשתה אשר לא ימד ולא יספר.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 78,
      "char_length": 1365,
      "timestamp": "2025-02-06T18:24:47.357472"
    },
    {
      "id": "bmidbar1_p79",
      "text": "הבוכה\"ע יעזרנו שנלך בדרכי אבותינו הקדושים זיע\"א שבכח זה שמשרישין תורה וקדושה בדרך אבותינו זוכים להביט ולראות בתוה\"ק בעינים טהורות ומשיגים בה השגות אחרות מאשר רואים אותם ההולכים בדרכים עקלקלות. הבוכה\"ע יעזור שנזכה להרחיב גבולי התורה והקדושה ולהעמיד דורות ילדי ישראל תשב\"ר שתתקיים התורה והקדושה בישראל לנחת רוח לפניו יתברך, ובכוחם ובזכותם נוושע במהרה בכל מיני ישועות טובות, וננצל מכל מיני פורעניות שבעולם. הבוכה\"ע יעזור ויושיע את ישראל בזמן ובמעבר שצריך עדיין להיות עד ביאת המשיח, שיאיר עיני ישראל, וננצל מכל צרה וצוקה, ונזכה לקבל פני משיח צדקנו באמת בשמחה ובנחת בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו בב\"א.",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 79,
      "char_length": 618,
      "timestamp": "2025-02-06T18:24:48.054083"
    },
    {
      "id": "bmidbar1_p80",
      "text": "או יאמר באופן אחר לבאר הא דאיתא בגמרא (יומא כ\"ב ע\"ב) א\"ר שמואל בר נחמני ר' יונתן רמי כתיב (הושע ב') והיה מספר בני ישראל כחול הים (אלמא אית להו מספר ומנין) וכתיב (שם) אשר לא ימד ולא יספר ומשני לא קשיא כאן בזמן שישראל עושין רצונו של מקום כאן בזמן שאין עושין רצונו של מקום. והקשו המפרשים (הובא בעץ יוסף שם) עפ\"י מה דאיתא בקדושין (דף מ\"ט ע\"ב) האומר לאשה הרי את מקודשת לי על מנת שאני צדיק אעפ\"י שהוא רשע גמור מקודשת שמא הרהר תשובה בלבו, הרי כי בזמן מועט ביד האדם להשתנות ולהתהפך מרשע לצדיק, וא\"כ קשה דאם יהיו ישראל בבחי' שאין עושין רצונו של מקום שאז יש להם מספר ובזמן מן הזמנים יעבור עליהם רוח טהרה וישתנו למעליותא, כיצד יהיה הדבר שישתנו מיד כרגע מוהיה מספר לאשר לא ימד ולא יספר.  ב) ועוד יש להקשות, דלפי מאי דמשני הגמרא נמצא דרישא דקרא דכתיב והיה מספר מיירי בזמן שאין ישראל עושין רצש\"מ ואילו סיפיה דכתיב אשר לא ימד ולא יספר מיירי בזמן שעושין רצש\"מ. ולכאורה היה ראוי שיאמר הכתוב איפכא שיתחיל דבריו במדה טובה שאם יזכו ישראל לעשות רצון קונם יהיו אשר לא ימד ולא יספר, ואם לאו והיה מספר, ולמה הקדים הכתוב והיה מספר שהוא מדת פורענות ברישא.  ג)",
      "source_file": "bmidbar1.txt",
      "chumash": "במדבר",
      "parsha": "bmidbar1",
      "paragraph_index": 80,
      "char_length": 1033,
      "timestamp": "2025-02-06T18:24:48.332646"
    }
  ],
  "shape": [
    81,
    768
  ],
  "created_at": "2025-02-06T18:24:48.837218"
}