{
  "paragraphs": [
    {
      "id": "ki sisa_p0",
      "text": "וידבר ד' אל משה לאמר כי תשא את ראש בנ\"י לפקודיהם, ונתנו איש כופר נפשו לד' בפקוד אותם ולא יהי' בהם נגף בפקוד אותם, יל\"ד על כפל והשנות לשון פקידה פעמים הרבה, ואפ\"ל ע\"ד הרמז דהנה קשה מאוד שיגיע האדם למעלת השלימות, ואין אדם צדיק בארץ אשר יעשה טוב ולא יחטא, אך זאת העצה היעוצה שידע האדם בנפשו שהוא מלא חסרונות ועונות וחטאים, ויהי' לבו נשבר בקרבו, ויבקש מהשי\"ת שיאיר עיניו בתורתו הקדושה להורות לו דרך האמת, וכתיב אשכון את דכא, והשי\"ת ירחם עליו להצילו מעבותות היצר ויזכהו לשמור ולעשות ולקיים התוה\"ק ומצותי' באהבה, וז\"פ כי תשא את ראש בנ\"י לפקודיהם מלשון חסרון ע\"ד אומרו ולא נפקד ממנו איש, ר\"ל שח\"ו ימצאו בנ\"י מלאי חסרונות, העצה לזה ונתנו איש כופר נפשו לד' בפקוד אותם, שיגלה נפשו לד' ויודה על חסרונותיו, ויבקש רחמים שיעזרהו השי\"ת להגיע אל האמת, עי\"ז ולא יהי' בהם נגף בפקוד אותם, שלא יהי' סיבת החסרון לנגף ועונש ר\"ל, אדרבה זה יביאהו לתכלית האמיתי ויזכה לעבוד השי\"ת בשלימות.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 0,
      "char_length": 863,
      "timestamp": "2025-02-06T19:33:26.838748"
    },
    {
      "id": "ki sisa_p1",
      "text": "במד\"ר ור\"פ זו) א\"ל הקב\"ה למשה חייבין לי ישראל מה שלוו הימני שנא' כו תשא, כמה דתימא כי תשה ברעך (דברים כ\"ד), אמור להם שיפרעו מה שהם חייבים לי הוו כי תשא, ואשלמה להם שנא' והי' מספר בנ\"י כחול הים עכ\"ד המדרש. וצ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 1,
      "char_length": 210,
      "timestamp": "2025-02-06T19:33:27.294487"
    },
    {
      "id": "ki sisa_p2",
      "text": "ב) במדרש תנחומא (ס\"ד) כו תשא את ראש בנ\"י זש\"ה (תהלים ג') רבים אומרים לנפשי אין ישועתה לו באלקים סלה וכו', רבנן פתרי קרא באוה\"ע, רבים אלו עכו\"ם שכתוב בהן הוי המון עמים רבים (ישעי' י\"ז) שאומרין לישראל אומה ששמעה בסיני אנכי ד' אלקיך לא יהי' לך אלהים אחרים, ולסוף מ' יום אמרו לעגל אלה אלהיך ישראל יש להם תשועה, און ישועתה באלהים סלה, ואתה ה' מגן בעדי אמרו ישראל רבון העולם ואתה הסכמת עמהם ואמרת זובח לאלהים יחרם, מגן בעדי בזכות אבות, כבודי שהשרות שכינתך בתוכנו ואמרת ועשו לי מקדש ושכנתי בתוכם ומרים ראשי תחת שהיינו חייבין לך תלוי ראש, נתת לנו הרמת ראש ע\"ו משה שנא' כו תשא את ראש. עכ\"ד המדרש. וצ\"ב הקישור ואיך יהי' במצות מחצית השקל לדחות טענת האומות עכו\"ם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 2,
      "char_length": 651,
      "timestamp": "2025-02-06T19:33:27.461896"
    },
    {
      "id": "ki sisa_p3",
      "text": "ג) עוד במדרש (תנחומא סי' ג') בפרשת שקלים אמר משה לפני הקב\"ה רבש\"ע משאני מת אין אני נזכר, א\"ל הקב\"ה חייך כשם שאתה עומד עכשיו ונותן להם פ' שקלים ואתה זוקף את ראשן, כך בכל שנה ושנה שקוראין אותה לפני, כאלו אתה שם באותה שעה וזוקף את ראשן ע\"כ במדרש, גם אמרו ז\"ל בגמ' וב\"ב י' ע\"ב) א\"ר אבהו אמר משה לפני הקב\"ה רבש\"ע במה תרום קרן ישראל, אמר לו בכי תשא, וראוי להבין איך תהי' סגולת השקלים להרים קרן ישראל וליתן להם הרמת ראש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 3,
      "char_length": 413,
      "timestamp": "2025-02-06T19:33:27.796895"
    },
    {
      "id": "ki sisa_p4",
      "text": "ד) זה יתנו כל העובר על הפקודים, בתרגום יונתן כל דעבר בימא יתן (גירסא זו הובא בישמח משה והם דברי ר' נחמי' בירושלמי שקלים פ\"א ה\"ג) וצ\"ב הקישור, ומדוע תליא חיוב מצו' זו במאן דעבר בימא דייקא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 4,
      "char_length": 187,
      "timestamp": "2025-02-06T19:33:28.035312"
    },
    {
      "id": "ki sisa_p5",
      "text": "ה) עוד שם בגמ' (ט\"ז ע\"א) אזל המן אשכחי' דיתבי רבנן קמי' ומחוי' להו הלכות קמיצה וכו', אמר להו אתא מלי קומצי קמחא דידכו, ודחי עשרה אלפי ככרי כספא דידי, אמר לי' רשע עבד שקנה נכסים עבד למי ונכסים למי עכ\"ד הגמ' וראוי להבין איך הוא סגולת הקמיצה לדחות עשרה אלפי דהמן. ומה ענין זה לזה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 5,
      "char_length": 277,
      "timestamp": "2025-02-06T19:33:28.166823"
    },
    {
      "id": "ki sisa_p6",
      "text": "ולבאר הענין נקדים דברי הגמ' (מעילה כ\"א ע\"ב במתני' שם) נפלה פרוטה של הקדש בתוך כיסו, או שאמר פרוטה בכיס זה הקדש, כיון שהוציא את הראשונה מעל דברי ר\"ע וחכ\"א עד שיוציא את כל הכיס וכתבו התוס' לדברי ר\"ע כיון שהוציא את הראשונה מעל, ואע\"ג דספיקא הוא אם נהנה בשל הקדש, ר\"ע לטעמי' דמחייב על ספק מעילות אשם תלוי וכו', אמנם הקשו התוס' לרבנן אמאי מעל כשיוציא כל הכיס וליבטל האי פרוטה של הקדש שנפלה ברובא וכ\"ת דבר שיש לו מתירין הוא ע\"י פדיון. ואפי' באלף לא בעיל, הא ליכא למימר דדבר שיש לו מתירין דרבנן, (והאיך יביא קרבן מעילה למקדש, וה\"ה חולין בעזרה מה\"ת) ותירצו התוס' דצריך לומר דליכא אלא עוד חד בכיס דליכא ביטול, אי נמי מטבע חשיב ולא בעיל עכ\"ד התוס'. והנה על תירוץ הא' הקשו דל\"ל דליכא אלא חד בכיס דא\"כ מאי עד שיוציא כל הכיס דאמרי רבנן, הכי הול\"ל עד שיוציא את השני', ועל תירוצם השני' דמטבע חשיב ולא בטיל, הקשה מהר\"י אלפאנדארי ז\"ל דהך דדבר חשוב לא בטיל נמי מדרבנן, והאיך יביא קרבן מעילה לעזרה, וא\"כ מה הועילו התוס' בתירוצם, וכמו דקשיא להו על דבר שיש לו מתירין יקשה ג\"כ על תירוצם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 6,
      "char_length": 965,
      "timestamp": "2025-02-06T19:33:28.336607"
    },
    {
      "id": "ki sisa_p7",
      "text": "הרמב\"ם ה' מעילה ופ\"ז ה\"ו) פוסק כרבנן דלא מעל עד שיוציא כל הכיס ובכסף משנה שם הקשה על פסק הרמב\"ם כקושית התוס' אמאי מעל ולבטיל ברובא, ותירץ דמטבע חשוב ולא בעיל כתירוץ התוס', ובמשנה למלך שם הקשה דהך דדבר חשוב לא בטיל הוא מדרבנן והאיך יביא קרבן מעילה כקושיתנו לעיל, והביא בשם הר\"י אלפאנדארי ראי' לסברת התוס' מההוא דאמרי' (פ\"ק דשקלים ה\"ג) א\"ר יהודה העיד בן בוכרי כל כהן ששוקל אינו חוטא (פי' בקרבן העדה דס\"ל שאין כהנים חייבים לשקול) א\"ל ריב\"ז לא אלא כל כהן שאינו שוקל חוטא, ומפרש בירושלמי דס\"ל לריב\"ז זה יתנו י\"ב שבטים יתנו (כמנין זה) ואף הכהנים חייבים בשקל, אלא שהכהנים דורשים מקרא זה לעצמן וכל מנחת כהן כליל תהי' לא תאכל, הואיל ועומר ושתי הלחם ולחם הפנים שלנו הם (שבאים מדמי השקלים) האיך נאכלים, ובגמ' משיבין חכמים לר' יהודה חטאת יחיד מתה, אין חטאת צבור מתה, מנחת יחיד קריבה כליל ואין מנחת הצבור קריבה כליל, וס\"ל דמותר להביא עומר ושתי הלחם אף משקלי כהנים, שלא נאמר וכל מנחת כהן כליל תהי', אלא במנחת כהן יחיד. אבל לא במנחה שוש לו בשותפות עם הצבור ור\"י ס\"ל דאף חטאת צבור מתה. עו\"ש בירושלמי כל העובר על הפקודים ר' יהודה ור' נחמי', חד אמר כל דעבר בימא ותן ואף הכהנים חייבים בשקל מסייע לריב\"ז, וחרנא אמר כל דעבר על פיקודיוא ותן מסייע לבן בוכרי, דכהנים לא נמנו במנין ישראל מבן כ' ולמעלה וע\"כ פטורים מלשקול ע\"כ, ואם איתא דמטבע יש לו ביטול ברוב, הא פשיטא דרוב השקלים היו של לוים וישראלים, וא\"כ כדין אוכלים עומר ושתי הלחם ולחם הפנים, ואף שיש במעות אלו מעות של כהנים שהם אסורים באכילה, מ\"מ בטלים הם ברוב, אלא ודאי דמטבע חשיב ולא בעיל, והמשנה למלך דחה ראייתו, דאין ממשנה זו ראי' אלא שאין למטבע ביטול, אבל שיהי' דין זה דבר תורה לא שמענו, והדרא קושיא הראשונה לדוכתי', דא\"כ האיך מעל ויביא קרבן לעזרה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 7,
      "char_length": 1582,
      "timestamp": "2025-02-06T19:33:28.793002"
    },
    {
      "id": "ki sisa_p8",
      "text": "ואפשר לתרץ שיטת התוס' ושיטת הרמב\"ם ז\"ל בהקדם דברי הגמ' ביצה (דף ל\"ח ע\"א) האשה ששאלה מחבירתה תבלין מים ומלח לעיסתה הרי אלו כרגלי שתיהן, ובגמ' הקשו ואמאי ולבטול מים ומלח לגבי עיסה, א\"ל ר' אבא הרי שנתערב לו קב חטין בעשרה קבין חטין של חבירו יאכל הלה וחדי, וס\"ל דמידי דאית להו בעלים לא בעלה, א\"ל ולטעמיך הא דא\"ר חסדא נבילה בטלה בשחוטה לפי שא\"א לשחוטה שתעשה נבילה (להיות מטמא במגע ומשא כמותו הו\"ל מין בשאינו מינו) ה\"נ דכו אית לה בעלים לא בטלה, והקשה במהרש\"א אמאי לא דקדק הכו אהך פלוגתא דר\"י ורבנן גופא, דלר\"י מין שאין במינו בעיל, ולרבנן אף במינו בעיל והו\"ל לאקשויי ה\"נ דכי אית לי' בעלים לא בעיל, וי\"ל דודאי מסתמא כל איסורין לית להו בעלים, דמסתמא בעלים מפקירים להו, ובהכי ודאי מצינן לאוקמי מילתא דר\"י ורבנן וכו' עיי\"ש, והקשה בקרני ראם מנ\"ל דפשיטא דאיסורי אכילה לית להו בעלים, ולמה יפקירם כיון שיש בו היתר הנאה, וכן הקשה הפרמ\"ג עיי\"ש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 8,
      "char_length": 826,
      "timestamp": "2025-02-06T19:33:29.570698"
    },
    {
      "id": "ki sisa_p9",
      "text": "והברוך טעם בסוגיא דדשיל\"מ מתרץ קושית המהרש\"א והפרמ\"ג, דמוכרחים אנו לחלק בהא דמידי דאית להו בעלים לא בעיל, בין אם יש לבעלים תביעה בגוף האיסור או אין להם בו רק דמי שוויה בלבד, דהנה אמרז\"ל (בפ\"ד דתרומות) התרומה עולה בא' ומאה, וילפי' לו' מדכתיב את חלבו את מקדשו ממנו דבר שאתה תורם ממנו (דהיינו תרומת מעשר שהוא א' ממאה) אם נפל לתוכו מקדשו, אבל במאה ואחד בעיל, ולכאורה אמאי בעיל, והרי תרומה אות לה בעלים הכהנים. אלא ע\"כ אף דאית לו' בעלים אינו נמנע מלהיות בטיל, רק דנוכל לחלק דהא דאמרי רבנן שחוטה שנתערבה ברוב נבלה,. אין השחוטה בטלה להיות הנוגע בהן עמא ודאי לשרוף תרומה על מגעו התם יש לבעלים תביעה בגוף השחוטה דלא שוויא יותר ממה שהי' קודם התערובת, אדרבה נאסרה באכילה מחמת תערובתה ובהא איכא למימר דמידי דאית להו בעלים לא בטיל גם לענין טומאה, אבל איסור בהיתר שנתערב באופן דנתבטל איסורו כגון מין בש\"מ לר\"י ולרבנן אף מין במינו, מעתה אין לבעל חתיכת האיסור תביעה בגוף החתיכה, שנעשה היתר ושוה יותר ממה שהי' כ\"א על דמיו כמו שהי' שו' בשעת איסור, ובכה\"ג לא מהני שם בעלות להפקיע הביטול, וכמו תרומה דבטילה בא' ומאה מה\"ט ואף דאית לי' בעלים, דשם הבעלות אינו אלא על דמיו ושפיר בטלה, ומתורץ קושית המהרש\"א ז\"ל אמאי לא דקדקו בגמ' אפלוגתא דר\"י ורבנן: במין במינו לרבנן ובמין בשא\"מ לר\"י אמאי בעיל והרי אית להו בעלים, אמנם באיסור שנתערב בהיתר באופן שהאיסור נעשה היתר, פשיטא לי' שאין שם הבעלות מפקיע הבטול, דאין לו בו אלא דמיהן, אבל משחוטה בנבלה מקשה שפיר, דשחוטה אות לבעלים תביעה בגוף החתיכה ואפ\"ה אי לאו טעמא שאפשר לנבלה שתעשה שחוטה הי' בעלה ועיין במהרש\"א שם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 9,
      "char_length": 1431,
      "timestamp": "2025-02-06T19:33:29.961364"
    },
    {
      "id": "ki sisa_p10",
      "text": "ובזה יתורץ ג\"כ שיטת התוס' והרמב\"ם ז\"ל, דכשיוציא כל הכיס מעל ויביא קרבן מעילה, ולא אמרי' דיבטל פרוטה של הקדש ברובא דחולין דמטבע חשוב ולא בטיל, ואף דדבר חשוב לא בעיל רק מדרבנן. מ\"מ איכא למימר כיון דמדרבנן לא בעיל, א\"כ יש להקדש שם בעלות בגוף הפרוטה, וכמו דהפקר ב\"ד הפקר להפקיע זכותו מה\"ת, דנפקא לי' מקרא (גיטין ל\"ו ע\"ב ירושלמי שקלים פ\"א ה\"ב) כמו כן יש להם כח לזכות על ידו מן התורה, ומידי דאית ליה בעלים לא בטלה מן התורה ואתי שפיר דמעל, והכי נמי נימא לענין השקלים דלא בטלי שקלי הכהנים ברוב שקלי ישראל, דמטבע חשיב ולא בטלי, וא\"כ יש להו שם בעלות מה\"ת, ואעפ\"כ עומר ושתי הלחם נאכלין, דלא אמרה תורה וכל מנחת כהן כליל תהי' אלא במנחת כהן יחיד אבל לא במנחה שיש לו בשותפות עם הצבור וכדברי חכמים שם ולר\"י לוקחים עומר ושתי הלחם משקלי ישראל לבדן עיי\"ש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 10,
      "char_length": 736,
      "timestamp": "2025-02-06T19:33:30.625221"
    },
    {
      "id": "ki sisa_p11",
      "text": "ובדרך זו נבוא לביאור המדרשים המוצגים בפתח דברנו, בהקדם מה שחקר הפמ\"ג ז\"ל בקונטרסו מתן שכרן של מצות בטעם הדבר דמהני תשובה לכפר על חטא, וכתב דהוא מטעם ביטול ברוב כי העבירה אין בה אלא גוף המעשה ולא המחשבה, דמחשבה רעה אין הקב\"ה מצרפה למעשה כאמרז\"ל (קידושין ל\"ט ע\"ב) ובמצות תשובה יש מחשבה טובה וגם מעשה, כאמרז\"ל (שם) ישב ולא עבר עבירה נותנין לו שכר כעושה מצוה, ולפיכך בטלה העבירה ברוב. ואף דבעוון ע\"ז נחשבת המחשבה כמעשה כדאיתא בגמ' שם, אעפי\"כ מועלת תשובה גם בע\"ז, לפי שאין האדם הולך בפתע פתאום לעבוד ע\"ז, אלא בתחלה נכשל בקלות, ומן הקל אל החמור, עד שנכשל בע\"ז כאמרז\"ל (שבת ק\"ח ע\"ב) כך היא אומנותו של יצה\"ר היום אומר לו עשה כך ומחר אומר לו עשה כך עד שאומר לו לך עבוד ע\"ז והולך ועובד ע\"כ. ולפיכך מהניא תשובה גם לע\"ז שהרי בידו כל אלו הזכיות שקנה לעצמו בתשובתו על החטאים שקדמו לע\"ז, ובצירוף זכיות אלו בטל גם עוון ע\"ז ברובא והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 11,
      "char_length": 818,
      "timestamp": "2025-02-06T19:33:31.004443"
    },
    {
      "id": "ki sisa_p12",
      "text": "ועפ\"י זה יתבארו דברי המדרש תנחומא (קושיא ב) כי תשא וגו' הה\"ד רבים אומרים לנפשי אין ישועתה לו באלקים סלה רבים אלו אומות העולם שאומרים לישראל אומה ששמעה בסיני אנכי ולא יהי' לך ולסוף מ' ימים אמרו לעגל אלה אלהיך ישראל וכו' אין ישועתה לו באלקים סלה וכו'. דהנה אומות העולם באים בנכליהם על ישראל. באמרם כי אין להם תוחלת ותקוה, וטענתם היא מכח ממנ\"פ, שהרי חטאו ישראל בעגל וכלום תקנה יש להם, ואם תאמר דמועלת תשובה לחטאם מטעם ביטול ברוב, א\"כ הם מקטרגים על ישראל שיהיו בעלים ברוב אומות העולם כמאה\"כ כי אתם המעט מכל העמים (דברים ז) וכטענת אותו עכו\"ם המובאת במד\"ר פ' ויקרא (פ\"ד ו') ואם תמצי לומר כי אין טענתם טענה משום דדבר דאית ליה בעלים לית ליה ביטול, וישראל יש להם בעלים כי הקב\"ה הוא הבעלים שלנו במה שבחר בנו מכל עם להיות לו לנחלה, על כך הם משיבים דיש להם ראי' מפרשת שקלים שאפילו דבר שיש לו בעלים מהני לוה ביטול, וראיתם ממה שאמר הכתוב זה יתנו ואיתא בירושלמי שקלים (פ\"א ה\"ג) זה בגימטריא י\"ב, דכל הי\"ב שבטים חייבים במחצית השקל וגם כהנים בכלל, וכן מייתי התם מדכתיב כל העובר על הפקודים יתן ודריש מיניה כל מאן דעבר בימא יתן דאף הכהנים בכלל נתינה. הרי שהכהנים חייבים במחצית השקל, ולא חיישינן דאיך יביאו עומר ושתי הלחם מן השקלים, והרי מנחת כהן אינה נאכלת אלא ודאי דשקלי הכהנים בטלים ברוב שקלי ישראל ומינה מוכח דאף מידי דאית ליה בעלים בעיל ברוב, וא\"כ הדרה טענת אומה\"ע דיבטלו ישראל ברוב ולא יועיל להם מה דאית להו בעלים. ובזה נתבארו דברי התנחומא כמין חומר דעל כן סמך לפרשת כי תשא הך קרא רבים אומרים לנפשי וגו', כי מפרשת שקלים הם מביאים חיזוק לטענתם שהם הרבים וישראל בעלים ביניהם ברוב, ולא מהני מאי דאית להו בעלים, כשם ששקלו הכהנים בעלים ברוב שקלי ישראל אף דאית להו בעלים.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 12,
      "char_length": 1550,
      "timestamp": "2025-02-06T19:33:31.478529"
    },
    {
      "id": "ki sisa_p13",
      "text": "אמנם אין בטענתם ממש, דבאמת אין ישראל בטלים בינייהו משום דאית להו בעלים ודבר שיש לו בעלים אינם בעל ימה שהם מביאים ראי' משקלי כהנים אין בדבריהם ממש, דאין הטעם שמקריבין עומר ושתי הלחם מן השקלים משום ששקלו הכהנים בעלים ברוב שקלי ישראל, אלא דטעמא דמילתא הוא כדאיתא בירושלמי שם, דלא אמרה תורה וכל מנחת כהן כליל תהי' אלא במנחת כהן יחיד, אבל לא במנחה שיש לו בשותפות עם הצבור. וזה שמשיבין ישראל ואתה ה' מגן בעדי כבודי וגו' כלומר דאין טענת האומות כלום כי השי\"ת הוא מגן בעדינו כבודי שהשרות שכינתך בתוכנו שהוא הבעלים שלנו וא\"כ אין שייך ביטול ברוב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 13,
      "char_length": 535,
      "timestamp": "2025-02-06T19:33:32.303406"
    },
    {
      "id": "ki sisa_p14",
      "text": "ומה שדרש בתנחומא ואתה ה' מגן בעדי בזכות אבות יתבאר ג\"כ ע\"ד זה בהקדם לבאר דברי הילקוט ר\"פ במדבר בשעה שקבלו ישראל את התורה נתקנאו אומות העולם בהן מה ראו להתקרב יותר מן האומות סתם פיהן הקב\"ה אמר להן הביאו לי ספר יוחסין שלכם וכו' כשם שבני מביאין ויתילדו על משפחותם. ונראה דהנה הקשו המפרשים מה היתה טענת האומות מה ראה להתקרב להם יותר מן הכלל והרי החזיר הקב\"ה את התורה על כל אומה ולשון ולא רצו לקבלה, (ספרי פ' ברכה) ומה צדקה יש להם לזעוק עוד אל המלך, אמנם י\"ל דטענתם היא שגם ישראל לא יקבלו את התורה לפי שהם מיעוט בון האומות והם בעלים ברוב, ועל כך סתם הקב\"ה את פיהם הביאו לי ספר יוחסין שלכם כשם שבני מביאין, כלומר שאין ישראל בטלים ברוב משום דאית להו בעלים הם האבות הקדושים, ומידי דאית לוה בעלים לא בטל. ותשובה זו היא רק כדי לסתום פה האומות אבל לאמתו של דבר אין צורך בכך, שהרי הקב\"ה בכבודו ובעצמו הוא הבעלים שלנו, ולפיכך אין אנו בעלים ברוב, אלא כדי שלא יהי' פתחון פה לאומות שאינם מאמינים בהשי\"ת, השיבו להם כי האבות הקדושים הם הבעלים שלנו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 14,
      "char_length": 930,
      "timestamp": "2025-02-06T19:33:32.579286"
    },
    {
      "id": "ki sisa_p15",
      "text": "וזאת אפ\"ל בכוונת המדרש תנחומא הנ\"ל שהשיבו ישראל כלפי האומות מגן בעדי בזכות אבות, שאין ממש בטענתם שיבעלו ישראל ברוב, שהרי אית לנו בעלים הם האבות הקדושים והדר אמר כבודי שהשרות שכינתך בתוכנו, כלומר דאותה טענה שאין אנו בעלים ברוב משום דאית לנו בעלים האבות הקדושים היא רק כלפי האומות, אבל לקושטא דמילתא הטעם שאין לנו ביטול הוא משום שהקב\"ה השרה שכינתו בתוכנו והוא הבעלים שלנו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 15,
      "char_length": 370,
      "timestamp": "2025-02-06T19:33:33.035522"
    },
    {
      "id": "ki sisa_p16",
      "text": "ובזה יובן מה שתרגם יונתן וכ\"ה בירושלמי שקלים כל העובר על הפקודים יתן וגו' כל דעבר בימא והקשינו למה תלה מצות שקלים בקרי\"ס דוקא ואם לרבות כהנים היה יכיל לתת סימן אחר כגון כל היוצא ממצרים (עיין קושיא ד'). ולדרכנו מובן היטב: דהנה מדכתיב זה יתנו מרבינן נמי כהנים דזה בגי' י\"ב, ולכאורה מזה מתעורר הקטרוג על ישראל, שהרי מדחזינן שהכהנים שוקלים מחצית השקל יש ראי' דאף מידי דאית ליה בעלים בטיל, דאל\"כ כיצד מקריבים עומר ושתי הלחם הבאים מן השקלים, ולהוציא מקטרוג זה אמה\"כ כל העובר על הפקודים ותרגם יונתן כל דעבר בימא, כי מקרועת י\"ס יש ראי' דמידי דאית לוה בעלים לא בעיל, דהנה איתא בזה\"ק (עי' זוה\"ק בשלח נ\"א ע\"א ובפ' ואתחנן רס\"ט ע\"ב) כי בשעת קרי\"ס בא הס\"מ ושרי האומות לעזור למצרים, ולכאורה למה לא באו אלא בשעת קרי\"ס ולא באו קודם לכן בעוד שהיו בני ישראל במצרים ולקה פרעה בעשר מכות ונראה כי הם באו לסייע במצרים בטענה כו האומות הם הרוב לגבי ישראל וישראל בטלים ביניהם ולפיכך חשבו שאין להם צורך בטענה זו בעוד שהיו ישראל במצרים כי בלא\"ה ישראל בטלים ברוב הרשעים שבתוכם וכאמרז\"ל (במדבר ר\"פ בשלח) עה\"פ וחמושים עלו בני ישראל ד\"א אחד מחמשה וי\"א אחד מחמישים וי\"א אחד מחמש מאות. ולזאת סברו האומות כי מעט הכשרים שבישראל בטלים ברוב הרשעים, אכן כל אותם הרשעים מתו בשלשת ימי אפלה, ובשעת קריעת י\"ס היו כולם אהובים כולם ברורים כלם קדושים, לזאת חשו שרו האומות לבא לעזרת מצרים כדי שיהיו ישראל בעלים ברוב ביניהם. אבל יושב בשמים ישחק ה) ילעג למו, כי בעלה טענתם דישראל אית להו בעלים כו יעקב בחר לו י\"ה ישראל לסגולתו, ומידי דאית ליה בעלים לא מהני ליה ביטול, ולפיכך הציל הקב\"ה את ישראל מיד מצרים וקרע להם את הים.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 16,
      "char_length": 1472,
      "timestamp": "2025-02-06T19:33:33.231949"
    },
    {
      "id": "ki sisa_p17",
      "text": "היוצא מזה כי ממה שקרע הקב\"ה את הים לפני ישראל, ולא נתקבל קטרוג האומות שהם הרוב איכא ראי' ברורה דמידי דאית ליה בעלים לא בטיל. ולזאת אמר הכתוב בפרשת שקלים כל העובר על הפקודים ותרגם יונתן כל דעבר בימא, כי מקרי\"ס יש ראי' לבטל טענת האומות המביאים ראי' מפ' שקלים שישראל בטלים ברוב ביניהם, דע\"כ לומר דמידי דאית ליה בעלים לא בטיל, והא דעומר ושני הלחם באים מן השקלים אף שיש ביניהם שקלי כהנים הוא משום דאית לצבור שותפות בגווייהו, ולא נאמר במנחת כהן כליל תהי' אלא בקרבן יחיד.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 17,
      "char_length": 464,
      "timestamp": "2025-02-06T19:33:33.917749"
    },
    {
      "id": "ki sisa_p18",
      "text": "ובזה יבואר גם אידך מדרשא (קושיא א) א\"ל הקב\"ה למשה חייבין לי ישראל מה שלוו הימני שנא' כי תשא וכו' כו תשה ברעך וכו'. דהנה טעם הדבר שע\"י מנין שולט הנגף. הוא משום דע\"י המספר נודע כי ישראל הם המעט מכל העמים ומתעוררת טענת האומות לומר כי ישראל בעלים ברוב. אמנם בזמן שאין ישראל עושין רצונו של מקום הרי הם ממושכנים אליו יתברך בעבור עוונותיהם וא\"כ יש להם בעלים דבע\"ח קונה משכון (ב\"מ פ\"ב ע\"א) ומידי דאית ליה בעלים לא בעיל. וז\"ש המדרש חייבין לו ישראל וכו' אמור להם שיפרעו מה שהם חייבים לי, וכיון שאין להם לפרוע הרי הם ממושכנים להשי\"ת, ולפיכך ואשלמה להם שנא' והיה מספר בני ישראל כחול היסק דאף שיהיו נמנים לא יזיק להם המנין להיות בטלים ברוב, לפי שהם ממושכנים אליו ית' ומידי דאית ליה בעלים לא בעיל. ובזה מובן מה דמסיים בתנחומא הנ\"ל (קושיא ב) תחת שהיינו חייבים לך תלוי ראש נתת לנו הרמת ראש ע\"ו משה שנא' כי תשא את ראש פירוש כי דבר זה בעצמו שהיינו חייבים להקב\"ה תלוי ראש הוא הנותנת שנתת לנו הרמת ראש ע\"י משה, שנצטווה למנות את ישראל, כי בעבור שאנו חייבים להשי\"ת שאין אנחנו יכולים לצאת ודי חובותינו אליו יתברך. לפיכך הננו משועבדים אליו בגופנו וברוחינו ובנשמותינו, וחובתנו היא ישועתנו ופדות נפשנו, דמידי דאית ליה בעלים לא בטיל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 18,
      "char_length": 1106,
      "timestamp": "2025-02-06T19:33:34.155304"
    },
    {
      "id": "ki sisa_p19",
      "text": "ובבחינה זו יש לבאר דברי המדרש (קושיא ג') בפרשת שקלים אמר משה רבש\"ע משאנו מת און אני נזכר. דהנה ק\"ז הישמח משה זלה\"ה בפ' שמות כתב לדחות טענת האומות שישראל בטלים ברוב ביניהם, עפ\"י מה שמצינו דבישראל אחד שקול כנגד כמה וכמה כמו שאמרו ז\"ל (מכילתא בשלח) משה שקול כנגד כל ישראל וכן בדור המדבר דבר צוה לאלף דור שכל אחד מהם היה שקול כנגד אלף איש ומשה כנגד כולם, וא\"כ לפי זה און לדעת משקל החשיבות של איש ישראל כי זה נשקל רק בדעתו של אל דעות. וא\"כ אם אחד שקול כנגד כמה וכמה מישראל עאכו\"כ כנגד העובדי כוכבים דהפחות שבישראל אפשר שקול כנגד כולם (ועי' בספרי פ' ראה פי\"ד כל אחד ואחד מישראל חביב לפני הקב\"ה יותר מכל עובדי אלילים) ואפשר לאו רובא הם, עכ\"ד הישמח משה זלה\"ה עיי\"ש שהאריך. ולפי זה י\"ל כי זה היה פחדו של משרע\"ה, כי כל זמן שהוא בחיים חיותו לא היה ירא שיתבטלו ישראל ברוב האומות, כו ודאי שהאומות בטלים נגד חשיבות ישראל, אכן חש שמא בדורות הבאים תחזור להתעורר טענת האומות שישראל בעלים ברוב גבייהו ויביאו ראי' לכך מפרשת שקלים כנ\"ל ועל כך השיב לו הקב\"ה כשם שאתה עומד וזוקף את ראשן בכח קדושתך וחשיבותך שאתה שקול כנגד כולם, ואין להם ביטול, כך בכל שנה ושנה שקורין פ' שקלים כאילו אתה עומד וכו' וזוקף את ראשן, שהרי משם ראי' שאין להם בטלה עולמית, כדפירשנו, מדכתיב כל העובר על הפקודים, כל דעבר בימא, ומקריעת ים סוף ראי' ברורה דמידי דאית ליה בעלים לא בטיל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 19,
      "char_length": 1232,
      "timestamp": "2025-02-06T19:33:34.675152"
    },
    {
      "id": "ki sisa_p20",
      "text": "וזה אפ\"ל גם בכוונת הגמרא ב\"ב הנ\"ל (קושיא ג) אמר משה לפני הקב\"ה רבש\"ע במה תרום קרן ישראל אמר לו בכו תשא, דהנה תיבת תשא סובלת ג' פירושים לשון קבלת מנין, ולשון הרמה ונשיאות ראשו ולשון חוב כדאי' במדרש הנ\"ל קרי ביה כי תשה. ובאמת כל הג' פירושים כחדא נינהו בפסוק זה דע\"י שאנו חייבים לו יתברך, אנחנו משועבדים אליו, ולפיכך יש לנו הרמה ונשיאות ראש שאין אנו בטלים בין האומות, דמידי דאית ליה בעלים לא בעיל ומשום כך יש לנו מנין ואין לחוש לשליטת הנגף.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 20,
      "char_length": 437,
      "timestamp": "2025-02-06T19:33:35.263153"
    },
    {
      "id": "ki sisa_p21",
      "text": "ועל פי אמרינו יתבארו דברי הגמרא מגלה (קושיא ה') שאמר המן אתי מלא קומצי דידכו ודחי עשרה אלפי ככרי כספי דידי. דאיתא במדרש (הביאו בספר מנות הלוי) דכאשר אמר המלך להמן הכסף נתון לך הלך ונתן כל העשרת אלפים ככר לצדקה. ואולי כוונת המן הרשע היתה כי ע\"ו כח הצדקה ימצא מחסה בצל הקב\"ה ולא יהי' לו ביטול עולמית, וכמו שאמרו ז\"ל במד\"ר (רות פ\"ה ד') בא וראה כמה גדול וכו' כחה של צדקה וכמה גדול כחן של גומלי חסדים שאין חסין לא בצל שחר ולא בצל כנפי ארץ וכו' ולא בצל כרובים ולא בצל שרפים אלא בצל מו שאמר והיה העולם שנא' (תהלים ל\"ו) מה יקר חסדך אלקים ובני אדם בצל כנפיך יחסיון. ולכן חשב המן כי בזכות הצדקה יחסה בצלו של המקום, ולא יהי' לו ביטול עולמית, דמידי דאית ליה בעלים לא בטל. אמנם בעת שראה את מרדכי עוסק בהלכות קמיצה, וכמו שפירש\"י ז\"ל שם שהיה יום ששה עשר בניסן והיה דורש בענינו של ויום בדיני מנחת העומר, ומתוך כך נודע לו כי מנחת העומר נאכלת, ואי אמרינן דמידי דאית ליה בעלים לא בטיל, כיצד נאכלת מנחת העומר, והרי יש לכהנים חלק בנדבת השקלים וכל מנחת כהן כליל תהי', אלא ודאי דאף מידי דאית ליה בעלים בעיל. ולפיכך אמר המן אתי מלא קומצו דידכו ודחי עשרת אלפים ככרי דכספא דידי, כי לא הועיל בנתינת הצדקה, דאף מידי דאית לוה בעלים בטל, ועל כך השיב לו מרדכי, רשע עבד שקנה נכסים עבד למי ונכסים למי מה שקנה עבד קנה רבו, דטעות היא בידך שאתה סובר דמידי דאית ליה בעלים בעיל, ובאמת מידי דאית ליה בעלים לית ליה ביטול עולמית, ואין ראיה ממנחת העומר כנ\"ל דאית לצבור שותפות בגויה, ולפיכך אין לה דין מנחת כהן, ומה שאתה היית סבור כי יועילו לך עשרת אלפים ככר שנתת לצדקה שלא יהי' לך ביטול, טעות הוא בידך מטעם אחר, שהרי אין הממון שלך, דכל מה שקנה עבד קנה רבו ולא תועיל לך זכות הצדקה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 21,
      "char_length": 1538,
      "timestamp": "2025-02-06T19:33:35.499164"
    },
    {
      "id": "ki sisa_p22",
      "text": "היוצא מזה כי גדולה צדקה שבזכותה אנו חוסים בצל הקב\"ה לבדו ואין לנו בטלה עולמית, ובדבר הזה תלויה גאולתינו ופדות נפשנו כאמרז\"ל (שבת קל\"ט ע\"א) אמר עולא אין ישראל נפדה אלא בצדקה וכו'. על כן חובה מוטלת על כל אחד מישראל לקיים מאה\"כ (דברים ט\"ו) פתוח תפתח את ידך ולהחזיק ידי הגולים יותר מכדי יכולתו, וימלא רחמים עליהם, כי לא ידע האדם את עתו ובפרט בצוק העתים הללו, כידוע לכאו\"א, לכן צריך כל אחד להרבות בצדקה כל זמן שיש בידו ומצוי לו, ובזכות הצדקה יגאלנו ה\"ג גאולת עולם תהי' לנו, כו נכנס תחת רשותו של הקב\"ה. עוד באתי להזהיר כי ח\"ו לא יעלה על מחשבת אדם לילך ברעיון הכתות הידועות המתפארים כי בזרוע ידם יכבשו את הארץ, כי לא מהם תהי' הישועה ואנחנו מייחלום ומצפים רק לישועת ה\"כ וצריך להתאמץ בכל עוז ותעצומות שלא לנטות מדרך השי\"ת, וכל כחם של הכתות הללו הוא בזמן זה שהצרות מתגברות, כי בזה המה מוצאים מקום למשוך לבות בני ישראל אחריהם, וכמו שפירשתי מדוע החלה מחלוקת קרח ועדתו אחר מעשה מרגלים, כמ\"ש רש\"י ז\"ל בפ' קרח עה\"פ וישמע משה ויפול על פניו, ולכאורה מדוע המתינו קרח ועדתו עד עתה, ולא התחילו לעורר על הכהונה מיד בעת הקמת המשכן בשעה שנתמנה אהרן לכהונה גדולה. אכן קרח פקח גדול היה והבין בעת הקמת המשכן כי עדיין אין הזמן גרמא לחלוק על משה, כו ישראל היו באותה העת ברום המעלה, חונים לדגליהם והשכינה שרויה ביניהם, ובודאי לא יעלה אז בידו להטות לב העם אחריו, כי מי לא יחוש לחלוק על משה שעשה להם נסים גדולים, אמנם אחרי חטא המרגלים שנגזרה גזרה על ישראל שיפלו פגריהם במדבר, ולא יזכו להכנס לארץ, היו כלם שבורים ונדכאי רוח. אז הבין קרח כו עתה הגיעה שעת הכושר לחלוק על משה, כי לגודל מרירות לב העם יעלה בידו למשכם אחריו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 22,
      "char_length": 1487,
      "timestamp": "2025-02-06T19:33:36.275335"
    },
    {
      "id": "ki sisa_p23",
      "text": "וכמו כן עתה שאין לך יום שאין קללתו מרובה משל חבירו, ולבבות בני ישראל נשברים ועיניהם צופוות לאיזה ישועה, לכן המה מוצאים את הזמן מוכשר לעשות רווחים מצרות ישראל, לפתות את מרי הנפש הכמהים לישועה ולצוד נפשות תמימות ונקיות אחרי רעוונם הטמא, ואיך טחו עינים מראות, אשר פיהם דבר שוא וימינם ימין שקר, כו היעלה על הדעת שאנשים העוברים על התורה כולה הם יושיעו אותנו מצרותינו וגאולה תהי' לנו ע\"י, והרי אין א\"י סובלת עוברי עבירה, אלא מקיאה אותם כאשר יקוא האדם אוכל הנמאס שגעלה נפשו. (תורת כהנים פ' קדושים) על כן שומר נפשו ירחק מהם כמטחוי קשת, כי גדולה מאד רעת החטאים האלה בנפשותם. ופוק חזי מה דאיתא בגמרא סוף סוכה ת\"ר מעשה במרים בת בילגה שהמירה דתה והלכה ונשאה לסרדיוט אחד ממלכי יונים כשנכנסו יונים להיכל היתה מבעטת בסנדלה ע\"ג המזבח ואמרה לוקוס לוקוס עד מתי אתה מכלה ממונן של ישראל ואו אתה עומד להם בשעת הדחק וכששמעו חכמים בדבר קבעו את טבעתה וסתמו את חלונה וכו'. ולכאורה הרי מה שהמירה דתה והלכה ונישאה לסרדיוט עכו\"ם זאת היא רעה גדולה יותר ומדוע לא קבעו את חלונה אלא כששמעו חכמים שהיתה מבעטת בסנדלה ע\"ג המזבח וכו' אמנם מכאן נראה ברור כי על מה שהמירה דתה ונשאת לעכו\"ם לא חשו חכמים כ\"כ לקנוס משמרתה, כי מכך לא יצא מכשול לעדת ישראל, שהרי נחלקה מעדת ישראל לגמרי, והיא תשא את עוונה. אכן כאשר העיזה לבא בשעת צרתם של ישראל ולהחציף פניה ולומר כו העבודה שישראל עובדים להשי\"ת אינה עומדת להם בשעת דחקם, על כך הקפידו חז\"ל מאד וראו בכך סכנה גדולה, כי בדברי שחץ אלה יש מקום להסית ולהדיח לבבות נשברים ודכאי רוח, ולפיכך קבעו את טבעתה וסתמו את חלונה. והוא הדבר אשר דברנו: כי רבה רעת האנשים האלה המנצלים את צרותיהם של ישראל המתרבות מיום ליום לעשות נפשות לרעיונם הטמא, וכל מי שבשם ישראל מכונה עליו להבדל מהם ומהמונם ומכל השמות הנרדפים שלהם, ואין לנו להשען אלא על אבינו שבשמים: והשי\"ת ירום קרן התורה וישראל במהרה בימינו אכיה\"ר.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 23,
      "char_length": 1691,
      "timestamp": "2025-02-06T19:33:37.027008"
    },
    {
      "id": "ki sisa_p24",
      "text": "וידבר ה' אל משה לאמר כי תשא את ראש בני ישראל לפקודיהם וגו', בתנחומא (סי' ד') זש\"ה (תהלים ג') רבים אומרים לנפשי אין ישועתה לו באלקים סלה, רבנן פתרי קרא באומה\"ע, רבים אלו אוה\"ע וכו' שאומרים לישראל אומה ששמעה בסיני אנכי ה' אלקיך לא יהי' לך אלקים אחרים, ולסוף מ' יום אמרו לעגל אלה אלהיך ישראל, אין ישועתה לו באלקים סלה, אמרו ישראל ואתה ה' מגן בעדי, בזכות אבות, כבודי שהשרות שכינתך בתוכנו ואמרת ועשו לו מקדש ושכנתי בתוכם, ומרים ראשי, תחת שהיינו חייבים לך תלוי ראש, נתת לנו הרמת ראש ע\"י משה רבינו שנא' כי תשא את ראש. ראוי להבין כוונת אמרם ז\"ל תחת שהיינו חייבין וכו' נתת לנו הרמת ראש, משמע דהפעולה עצמה שהי' מחייבת ח\"ו תלוי ראש, נצמח לנו על ידו הרמת ראש, ואיך יתכן זה שיהי' גמול העבירה הרמת ראש, והול\"ל אף שהיינו חייבין תלוי ראש נתת לנו הרמת ראש, ולשון תחת צ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 24,
      "char_length": 754,
      "timestamp": "2025-02-06T19:33:37.871441"
    },
    {
      "id": "ki sisa_p25",
      "text": "ב) עוד שם בתנחומא (סי' ג') כו תשא את ראש פתח ר' תנחומא והשבע לעשיר איננו מניח לו לישון (קהלת ה'), בעשירי תורה הכתוב מדבר, כיצד הי' אדם גדול ועשיר בתורה וכו' אע\"פ שמת, אין התלמידים שהעמיד מניחין לו לישון, אלא יושבין ועוסקין בתורה ואומרים הלכות ושמועות משמו, ומזכירין שמו בכל שעה, ואין מניחין אותו לישון בקבר, וכן משה למד תורה לישראל וכו' והם מזכירים אותו בכל פרשה ופרשה, ובפרשת שקלים אמר משה לפני הקב\"ה משאני מת אין אני נזכר, א\"ל הקב\"ה חייך כשם שאתה עומד עכשיו ונותן להם פרשת שקלים ואתה זוקף את ראשן, כך בכל שנה ושנה וכו' את עומד שם עמהם וזוקף את ראשן, מנין ממ\"ש כי תשא את ראש, שא לא נאמר אלא כי תשא לשון עתיד שלעולם יזכר שמו עכ\"ד המדרש, ראוי להבין מדוע חשש משה רבינו ע\"ה בפרשת שקלים דייקא שמשמת לא יזכר, ולא חש כן בכל התורה כולה, וגם במצוה זו מזכירין שמועות והלכות משמו, כמו בכל התורה כולה וצ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 25,
      "char_length": 795,
      "timestamp": "2025-02-06T19:33:38.277564"
    },
    {
      "id": "ki sisa_p26",
      "text": "ג) ולא יהי' בהם נגף בפקוד אותם, פירש\"י שהמנין שולט בו עין הרע, והדבר בא עליהם כמו שמצינו בימי דוד, ואיתא בגמ' (ברכות דף ס\"ב ע\"ב) א\"ל הקב\"ה לדוד מסית קרית לי, הרי אני מכשילך בדבר שאפילו תשב\"ר יודעים אותו: שנא' כו תשא את ראש בנ\"י ונתנו איש כופר, וכתיב ויסת את דוד לאמר לך מנה את ישראל וגו' ויתן ה' דבר בישראל וגו', ותמהו בזה המפורשים איך יתכן שטעה אדונינו ידוד המלך ע\"ה בדבר המפורש בפסוק ותשב\"ר יודעים בו, וכתב האוה\"ח הק' ומצינו שרז\"ל אמרו (שם) כי מן השמים הכשולוהו בדבר שאפי' תנוקות של בית רבן וכו' לטעם אומרו (שמואל א' כ\"ו) אם ה' הסיתך בו וכו' ושגגה היתה בידו, אולם מ\"מ צריך שיהי' איזה סברא שבו נתלה טעותו, כי בלא\"ה לא הי' עושה דבר היפך ממה שמבואר בפסוק, ואם נאמר שהוא שגג בזה, ומן השמים אינו לידו מכשול זה, אבל מה נענה ביואב למה קבל דבריו ולא מאן לשמוע לו, הלא דברי הרב ודברי התלמיד דברי מי שומעין, הו\"ל לצעוק לפני המלך ולבוא בטענה הנשמעת ומדוע לא ענו אותו דבר.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 26,
      "char_length": 862,
      "timestamp": "2025-02-06T19:33:38.681723"
    },
    {
      "id": "ki sisa_p27",
      "text": "והרמב\"ן ז\"ל והמזרחי תירצו שטעו דוד ובני דורו, כי המצוה הזאת למנות את ישראל ע\"ו שקלים, אינה אלא מצוה לשעה ולא לדורות, ובלבוש תמה ע\"ז, כו איך יתכן לטעות בזה, אחרי שמפורש בפסוק הטעם ולא יהי' בהם נגף בפקוד אותם, ובחשש הנגף ודאי שא\"א לחלק בין לשעה או לדורות, והרמב\"ן ז\"ל בפ' במדבר כתב וז\"ל, כפי דעתי הי' הקצף עליו בעבור שמנאם שלא לצורך, כי לא הי' יוצא למלחמה וכו', ומנאם רק לשמח את לבו שמלך על עם רבע וראיתי במדרש (במדב\"ר פ' ב' סי' י\"ז) ר\"א בש\"ר יוסי בן זמרא אמר כ\"ז שנמנו ישראל לצורך לא חסרו, שלא לצורך חסרו, לצורך בימי משה וכו', שלא לצורך בימי דוד, וכ\"כ בתנחומא בפרשה זו וסי' ט'), וכעי\"ז פירשו הגו\"א והאוהחה\"ק בפרשתינו עיוש\"ד, ומדייק האוהחה\"ק כן מתשובת יואב שאמר לדוד ואדוני המלך למה חפץ בדבר הזה, כוונת אמירתו שאחרי שאין בו תועלת וצורך אין למנותם עיי\"ש, אמנם עדיין אין הדעת מתיישבת בתירוצם, ואדרבה תגדל התמי' יותר, כי איך יתכן לחשוב על אדונינו דוד משיח ה', שעשה מעשה הנוגע לבחי' כללות ישראל ללא צורך, ולכבוד עצמו ח\"ו לשמח את לבו, חס מלהזכיר דברים אלו, ואף אם לא יהי' חשש נגף וסכנה במעשה המנין, לא יתכן אצל קדושי עליונים כדוד המלך ע\"ה לעשות פעולה שלא לצורך, והרי זה דרכם כל הימים שבכל תנועה ותנועה עושים רק רצון הבוי\"ת, לעשות נחת רוח לפניו ית', ולא יצוייר אצלם אף תנועה קלה בלי עבדות ה' ועשיית רצונו ית', וא\"כ און לך צורך גדול מזה, וידועים דברי החובת הלבבות (שער עבודת אלקים פ\"ד) כי כל מעשי בנ\"א אינם יוצאים או מגדר הציווי לעשותם, או מגדר אזהרה שלא לעשותם, וגם די הספוק במזון ובצרכי האדם ההכרחיים נכנסים בשער הציווי, וא\"כ אין לך דבר רשות בעולם עיי\"ש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 27,
      "char_length": 1447,
      "timestamp": "2025-02-06T19:33:39.122214"
    },
    {
      "id": "ki sisa_p28",
      "text": "והובא בשם הגר\"א ז\"ל לפרש לשון המשנה (בפ\"ג דאבות) וע\"כ אתה עתיד ליתן דין וחשבון, דדין הוא על עצם העבירה שנפסק דינו ר\"ל בעונש הראוי לו, וחשבון שמחשבין לו אבידת הזמן, שבאותו הזמן והכח שעשה עבירה הי' אפשר לו לעשות מצוה וצריך כפרה ע\"ז, א\"כ אף במעשה שלא לצורך צריך כפרה מה\"ע, ומכ\"ש במספר בנ\"י שיש בו סכנה כמשה\"כ ולא יהי' בהם נגף ע\"י המנין, א\"כ תגדל התמי' יותר, היתכן שעשה דוד דבר זה שלא לצורך, ואף לפי תירוצם שדוד טעה ועשה ח\"ו שלא כהוגן איך יתכן לומר כן, והרי אמרו חכז\"ל במס' שבת ודף נ\"ו ע\"א) א\"ר שמואל בר נחמני אר\"י כל האומר דוד חטא אינו אלא טועה שנאמר (שמואל א' י\"ח) ויהי דוד לכל דרכיו משכיל וה' עמו וגו' איפשר חטא בא לידו ושכינה עמו וכו' והדרא קושיא לדוכתי' וצריך הסבר לקרב הדברים אל השכל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 28,
      "char_length": 686,
      "timestamp": "2025-02-06T19:33:39.851349"
    },
    {
      "id": "ki sisa_p29",
      "text": "ד) להלן בפרשה ויתן אל משה ככלותו לדבר אתו בהר סיני שני לחת העדות וגו' כתובים באצבע אלקים, פירש\"י ז\"ל (והוא בגמ' נדרים דף ל\"ח ע\"א ובמד\"ר) ככלתו כתיב חסר, שנמסרה לו תורה במתנה ככלה לחתן וכו', ולכאורה ראוי להבין קישור דרשתם ז\"ל לכאן. ומקומו הנכון יותר בפ' יתרו במתן תורה, או בסוף פרשת משפטים כשעלה משרע\"ה לקבל הלוחות, ומדוע המתין הכתוב עד לפני מעשה העגל, ואם לא הו' נתינת מתנה זו אלא לסוף מ' יום, הו\"ל להזכירו אחר מעשה העגל בפ' וירד משה מן ההר, שאז נשלמו המ' יום. ושם נתבארו ענין הלוחות באריכות, והלוחות מכתב אלקים ומעשה אלקים, ומדוע הקדימו הכתוב לכתבו כאן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 29,
      "char_length": 554,
      "timestamp": "2025-02-06T19:33:40.201631"
    },
    {
      "id": "ki sisa_p30",
      "text": "ה) עוד שם בתנחומא (סי' ע\"ו) ויתן אל משה ככלתו זש\"ה מתן אדם ירחיב לו ולפני גדולים ינחנו (משלי י\"ח), כמעשה באבון רמאה וכו', והקשה היפ\"ת דאיך יתקשר מאמר זה אל הפסוק ויתן אל משה ככלתו, ומיישב שם בדוחק ועדיין צ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 30,
      "char_length": 208,
      "timestamp": "2025-02-06T19:33:40.485976"
    },
    {
      "id": "ki sisa_p31",
      "text": "ו) ויתן אל משה וגו', פירש\"י אין מוקדם ומאוחר בתורה, דמעשה העגל קודם לציווי מלאכת המשכן ימים רבים וכו' ונאמרה לאחרי', וכן הוא בתנחומא (סי' ל\"א) דבי\"ז בתמוז נשתברו הלוחות, ואז הי' מעשה העגל, וציווי מלאכת המשכן הי' ממחרת יוהכ\"פ כמ\"ש רש\"י ז\"ל, ובהג\"ה במוסגר הקשה דמנ\"ל הכרח דפרשיות אלו לא נאמרו על הסדר דלמא הכל כסדר נכתבו, וציווי הקב\"ה למשה על מלאכת המשכן קדמה למעשה העגל, וע\"כ נאמרה פ' תרומה ותצוה קודם פ' העגל, אבל משה לא הגיד לישראל ציווי המשכן עד למחרת יוהכ\"פ שהיו ישראל מרוצים להקב\"ה, וזה נאמרה בפ' ויקהל אחר סיפור מעשה העגל, וכן הוא בהדיא בזוה\"ק ויקהל (קצ\"ה ע\"א) דבציווי הקב\"ה בפ' תרומה כתיב מאת כל איש אשר ידבנו לבו אפילו מערב רב, שזה הי' קודם חטא העגל ובציווו משה אל ישראל כתיב קחו מאתכם דייקא ולא מערב רב, וכ\"כ בעלי התוס' בריש פ' תרומה דפרשת ויקחו לי תרומה נאמרה בתוך מ' יום, א\"כ מנ\"ל לרש\"י הכרח דפרשיות אלו לא נאמרו על הסדר ועיין במזרחי שעמד על דברי רש\"י אלו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 31,
      "char_length": 866,
      "timestamp": "2025-02-06T19:33:40.628882"
    },
    {
      "id": "ki sisa_p32",
      "text": "ז) ראוי להתבונן בעונש חטא העגל, דהנה כתבו בעלי התוס' והרמב\"ן ז\"ל שלא לשם ע\"ז נתכוונו. כ\"א להיות מורה דרך במקומו של משה, והראב\"ע ז\"ל כתב דלכבוד השם עשאום, ומעטום היו שחשבו אותו לשם ע\"ז, כמשה\"כ ויפול מן העם כשלשת אלפי איש והוא חלק מאתים ממחנה ישראל ומאלו לא נשארו כלום, כמ\"ש בגמ' (יומא דף ס\"ו ע\"ב, הובא ברש\"י ז\"ל) ג' מיתות נדונו שם, עדים והתראה בסייף, עדים שלא בהתראה במגפה וכו', עכ\"פ לא נשארו כ\"א הכלל ישראל הכשרים שלא הי' להם מחשבת ע\"ז כלל, וא\"כ ראוי להבין מה שהפליגה התוה\"ק בחומר העון הזה ששמורה עברתו לדורות.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 32,
      "char_length": 510,
      "timestamp": "2025-02-06T19:33:41.057391"
    },
    {
      "id": "ki sisa_p33",
      "text": "ח) ויותר קשה שאחרי שעשו ישראל תשובה שלימה במסירת נפש כמ\"ש הרמב\"ן זאל עה\"פ ויתנצלו בנו ישראל וגו' שקבלו עליהם את המיתה ברצון נפשם, ומבואר במדרש רבה (פרשה מ\"ה סי' ז') שנתרצה הקב\"ה להם ע\"ו נדבת המשכן, ובתנחומא פקודי (סי\"א) איתא שהביאו הנדבה בזריזות ובשמחה, ונזדרזו ישראל במלאכת המשכן מאוד, וגודל ההפצרות שהתפלל משרע\"ה שימחל להם חטא העגל כמבואר בפסוקים, ואמרו חכז\"ל במדרש (דברים רבה פרשה ג' סי' י\"א) לא הניח משה זוית ברקיע שלא נתחבט בה, עד שענה לו השי\"ת סלחתי כדבריך, ואיך יתכן שאחר כל אלה עדיין רושם החטא שמור לדורות, כמו שאמה\"כ וביום פקדי ופקדתי עליהם חטאתם, ודרשו חכז\"ל בסנהדרין (דף ק\"ב ע\"א) אין לך כל פרעניות ופרעניות שבאה לעולם שאין בה א' מכ\"ד בהכרע ליטרא של עגל הראשון, עוד דרשו ז\"ל (שם) וביום פקדי, עת מזומנת לפורעניות, פירש\"י בע' באב הוא יום מזומן לפורעניות וכו', ואיך יתכן שלא הועיל התשובה וזכותו הגדול של משה רבינו ע\"ה לבטל רושם החטא לגמרי, והרי מבואר בגמ' (קדושין דף מ' ע\"ב) וברמב\"ם (פ\"א מה' תשובה ה\"ג) בעשה תשובה אין מזכירין לו שום דבר מרשעו וצ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 33,
      "char_length": 955,
      "timestamp": "2025-02-06T19:33:41.333964"
    },
    {
      "id": "ki sisa_p34",
      "text": "ט) עוד קשה ממ\"ש ז\"ל במס' ע\"ז ודף ד' ע\"ב) אמר ר' יהושע בן לוי לא עשו ישראל את העגל אלא ליתן פתחון פה לבעלי תשובה שנאמר (דברים ד') מי יתן והי' לבבם זה להם ליראה אותי כל הימים וגגו\", פירש\"י לא עשו ישראל את העגל כלומר גבורים ושליטים ביצרם היו ולא הי' ראוי להתגבר יצרם עליהן אלא גזירת מלך היתה לשלוט בם כדי ליתן פ\"פ לבעלי תשובה שאם יאמר החוטא לא אשוב שלא יקבלני, אומרין לו צא ולמד ממעשה העגל שכפרו ונתקבלו בתשובה עכ\"ל רשיז\"ל, עוד שם בגמ' והיינו דא\"ר יוחנן משום ר\"ש בן יוחאי לא דוד ראוי לאותו מעשה (דבת שבע, רש\"י) ולא ישראל ראויין לאותו מעשה, לא דוד ראוי לאותו מעשה דכתיב (תהלים ק\"ט) ולבי חלל בקרבי, ולא ישראל ראויין לאותו מעשה דכתיב מו יתן והי' לבבם זה להם ליראה אותי כל הימים, אלא למה עשו, לומר לך שאם חטא יחיד אומרים לו כלך אצל יחיד, ואם חטאו צבור אומרים להו לכו אצל צבור, וצריכא וכו' עד כאן דברי הגמרא. וכתבו המפורשים לא שהשי\"ת גזר על החטא, דמפי עליון לא תצא הרעות, ואין הקב\"ה מונע הבחירה מבנ\"א, ואלו כן לא היו ראויים שיענשו, אמנם הכוונה דלפי שהיתה בחי' היראה גדולה אצלם מאוד, כמו שאמה\"כ מי ותן והי' לבבם זה ליראה וגו', והשי\"ת רגלי חסידיו ישמור, ומן הראוי שיהי' השי\"ת בעזרם להצילם מאותו מעשה, וכן בדוד שאמר לבי חלל בקרבי, ולא הי' ראוי לאותו מעשה, גם אמרו ז\"ל דהתורה מצלת מן החטא, אלא כדי ליתן פתחון פה לבעלי תשובה הניחם הקב\"ה על מנהג העולם ונשארו על עצם בחירתם עכ\"ד ז\"ל, ולכאורה איך יהי' בזה פ\"פ לבעלי תשובה, כמ\"ש רש\"י ז\"ל שאם יאמר החוטא לא אשוב שלא וקבלנו אומרין לו צא ולמד ממעשה העגל וכו', ואדרבה יפול לב האדם בקרבו ויתוואש ח\"ו מלשוב, בראותו גודל הפגם של החטא, שאחר כל הפצרות ותפילות של משה רבינו, לא הועיל אלא מחילה לשעה, אבל רושם החטא עדיין שמורה לדורות עולם, א\"כ מה יעשה האדם בדורות האחרונים, שאין לנו כוחו וזכותו של משה רבינו להתפלל ולדפוק על שערי רחמים, גם אין בחינת תשובתינו כבחינת תשובה של הדור ההוא דור דעה, שהיו בדורו של משה רבינו ע\"ה ולגבי משה יראה מילתא זוטרתא, וא\"כ לאיזה תכלית היתה גזירת מלך עליהם שיסתבבו לחטוא. ואין בזה תועלת לבעלי תשובה, אדרבה ותרפו ידי עושי תשובה עי\"ז.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 34,
      "char_length": 1886,
      "timestamp": "2025-02-06T19:33:41.863799"
    },
    {
      "id": "ki sisa_p35",
      "text": "י) גם ראוי להבין מדוע נסתבב מן השמים לגרום מכשול ותקלה לכלל ישראל דור דעה שיעשו אותו מעשה ולדוד המלך, הלא הי' אפשר להורות תשובה ע\"י הערב רב שחטאו בלא\"ה, ויסייעו להם מן השמים לשוב, ויהי' בזה הוראת תשובה לרבים, וכמו\"כ הוראת תשובה ליחיד הי' אפשר שיסתבב ע\"י אדם אחר בעל עבירה ורשע, ויסיועו לו מן השמים לשוב, וע\"י שיקבל תשובתו יהי' בזה הוראת תשובה ליחיד: ולמה הי' צורך להביא צדיקים לידי חטא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 35,
      "char_length": 386,
      "timestamp": "2025-02-06T19:33:42.871589"
    },
    {
      "id": "ki sisa_p36",
      "text": "יא) כתב בספה\"ק עבודת ישראל פ' בלק וז\"ל עפ\"י הקדמת הגאון החסיד מו\"ה לוי יצחק זללה\"ה בעהמח\"ס קדושת לוי זי\"ע, שאמר בפי' הפסוק וביום פקדי ופקדתי עליהם חטאתם אשר עשו את העגל, וקשה הנה אבינו אב הרחמן הסולח ומוחל ומעביר אשמתינו בכל שנה ושנה, ס\"ד שיכתוב בתורתו דבר קשה כזה, שיזכור לעולם את חטא העגל אפילו אחר שעשו ישראל תשובה, וגם יקשה ממ\"ש חז\"ל במס' ברכות (דף ל\"ב ע\"ב) דא\"ר אושעיא מאי דכתיב (ישעי' מ\"ה) גם אלה תשכחנה זה מעשה העגל ואנכי לא אשכחך (שם), זה מעשה סיני, וזה היפך מכוון פסוק הנ\"ל, ותו\"ד לתרץ דהנה לפי ראות עינינו, אם אחד מגזע טובים וישרים הולך בדרך תמים ועובד את יוצרו, אין זה דבר נפלא, כי התורה מחזרת על אכסניא שלה, אבל אדם הבא ממשפחה בזוי' ושפלה, יעשה הטוב בעיני ה' ואנשים, אז יתהלל יותר מבן משפחה הנכבדת, בעבור עזבו רכי אבותיו ונטה אל הטובל וכמו\"כ להיפך במעשה הרע יתגנה יותר בן משפחה הנכבדת, ממה שיעשה זה הרע בן משפחה הבזוי\"נ כי לו יאתה השפלות מעון אבותיו. והנה ישראל קדושים הם הגם שקבלו התורה במעמד הר סיני, לא הי' הדבר נפלא ומהולל, כו קדושת אבותיהם הוא הנותנת שיהיו עובדי ה\"נ אבל כיון שעשו את העגל אח\"כ, והעוזו פניהם נגד יוצרם, ניכר שוש בהם עדיין איזה שורש רע שלא נתקן והם עם קשה עורף בטבע עי\"ז גדלה ונפלאה בעיני ה' מעלתם בקבלת התורה, דנתברר שלא עשו את העוב מושרש בטבע להם מקדושת אבותיהם, אלא שהם בעצם בחירתם בחרו בזה, וז\"ש חז\"ל גם אלה תשכחנה זה מעשה העגל, שישכח לגמרי כיון שעשו תשובה, אבל ואנכי לא אשכחך זה מעשה סיני, כלומר בעת שאני זוכר מעשה סיני, אז לא אשכח מעשה העגל, וזכור אזכרנו להגדיל זכותם בקבלת התורה, וזה פי' הפסוק וביום פקדי כשאזכור בם להטוב להם, ופקדתי את העגל את כח הרע אשר בקרבם, ועי\"ז יגדיל זכותם כנ\"ל עכת\"ד ז\"ל, והנה ראויין הדברים למי שאמרן. אבל לכאורה מבואר בדברי חכז\"ל ההיפך כמ\"ש לעיל דברי הגמ' סנהדרין (דף ק\"ב ע\"א) א\"ר יצחק אין לך כל פורעניות ופרעניות שאין בה אחד מכ\"ד בהכרע ליטרא של עגל הראשון שנאמר (שמות ל\"ב) וביום פקדי ופקדתי עליהם חטאתם, הרי נראה שעל צד הפורעניות והעונש יזכר ויפקד עון העגל, והדרא קושיא לדוכתי', גם הוא סתירה למ\"ש רז\"ל גם אלה תשכחנה זה מעשה העגל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 36,
      "char_length": 1895,
      "timestamp": "2025-02-06T19:33:43.093251"
    },
    {
      "id": "ki sisa_p37",
      "text": "יב) להלן בפרשה וישב משה אל ה' ויאמר אנא חטא העם הזה חטאה גדולה ויעשו להם אלהי זהב, לכאורה קשה הרי משרע\"ה הפציר והתפלל ומסר נפשו על מחילתם עד שאמר ואם אין מחני נא, וא\"כ למה הגדיל את עונם ואמר חטאה גדולה, וזה טענת הקטיגור ולא יאות טענה זו לסניגורן של ישראל משרע\"ה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 37,
      "char_length": 262,
      "timestamp": "2025-02-06T19:33:44.072270"
    },
    {
      "id": "ki sisa_p38",
      "text": "יג) ועתה אם תשא חטאתם ואם אין מחני נא וגו', פירש\"י הרי טוב, איני אומר לך מחני, ואם אין מחני וזה מקרא קצר וכן הרבה עכ\"ד רשיז\"ל, אבל לכאורה טעמא בעי למה קיצר הכתוב בביאור אופן ההן, ובכ\"מ שקיצר הכתוב צריך ליתן טעם ע\"ז, כי לא דבר ריק הוא גם צ\"ב מלת ועתה למאי אתא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 38,
      "char_length": 259,
      "timestamp": "2025-02-06T19:33:44.232449"
    },
    {
      "id": "ki sisa_p39",
      "text": "יד) מחני נא מספרך וגו', פירש\"י מכל התורה כולה שלא יאמרו עלי שלא הייתי כדאי לבקש עליהם רחמים, ראוי להבין הלא משרע\"ה כל כוונתו הי' רק לטובת ישראל, ולא לכבוד עצמו ח\"ו, ואם חלילה לא יועיל תפילתו לישא חטאתם, מהו התועלת בזה לישראל אם ימחה שמו מתוה\"ק, ולמה רצה בזה, וכי לטעם שלא יאמרו, כדאי שימחה שמו ח\"ו מתוה\"קו ולא ישתנה מצבם בין אם יאמרו או לא יאמרו ומה איכפת לי\"ג וצ\"ב כוונתו בזה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 39,
      "char_length": 377,
      "timestamp": "2025-02-06T19:33:44.402050"
    },
    {
      "id": "ki sisa_p40",
      "text": "טו) רש\"י והרמב\"ן ז\"ל ורוב מפוה\"ת פי' דמחני נא מספרך מכל התורה כולה, אולם בגמ' (ר\"ה דף ע\"ז ע\"ב) מבואר באופן אחר, א\"ר יוחנן ג' ספרים נפתחין בר\"ה וכו', א\"ר אבין מאי קרא (תהלים ס\"ט) ימחו מספר חיים ועם צדיקים אל יכתבו, ימחו מספר זה ספרן של רשעים גמורין, חיים זה ספרן של צדיקים ועם צדיקים אל יכתבו זה ספרן של בינוניים ר\"נ בר יצחק אמר מהכא ואם אין מחני נא מספרך אשר כתבת, מחני נא זה ספרן של רשעים, מספרך זה ספרן של צדיקים, אשר כתבת זה ספרן של בינוניים, הרי דרשו חז\"ל מחני נא מג' ספרים שנפתחים לפני ב\"ד של מעלה, ופלא שלא הזכירו המפורשים דברי הגמרא והשמיעו דרשה זו מפירושם וצ\"ב טז) עוד יפלא בדברי הגמ' הנ\"ל וכי ס\"ד של משה רבינו ע\"ה שנכתב שמו בספרן של רשעים עד שבקש מחני נא, ואפי' בספרן של בינונים וצדיקים לא יכתב בספרים אלו, דמבואר בזוה\"ק דרק בר\"ה נידון האדם ע\"י ב\"ד של מעלה, ולהכי צריכין ספרים להציע לפניהם לראות מי הוא צדיק או רשע, אבל ביום הכיפורים נדונין ע\"י הקב\"ה, ורב חסד מטה כלפי חסד וא\"צ לספרים, ומכ\"ש שלא יצטרך אליהם משה רבינו לעולם, הגם שאפ\"ל שחז\"ל הסמיכו לפסוק זה דרשתם דג' ספרים נפתחים בר\"ה, ולא לגבי משה אמרו כן, אבל כללא אית לן דהדרש צריך שיהי' קרוב לפשוטו, דאין מקרא יוצא מידי פשוטו, ומרע\"ה אמר פסוק זה דמחני נא על עצמו, ולא יתכן אצלו דרשה זו דג' ספרים נפתחים, וצ\"ב לקרב אל השכל דרשתם ז\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 40,
      "char_length": 1195,
      "timestamp": "2025-02-06T19:33:44.616186"
    },
    {
      "id": "ki sisa_p41",
      "text": "יז) כי לא אעלה בקרבך כו עם קשה עורף אתה פן אכלך בדרך, פרש\"י וכ\"כ הרמב\"ן והראב\"ע ורוב מפוה\"ת דהכוונה על שליחות המלאך, ולטובתם לא יהי' שכינתו ית' בקרבכם, כי עם קשה עורף אתה, וכששכינתו בקרבכם ואתם ממרים ח\"ו בו, מרבה אני עליכם זעם ופן אכלך בדרך ח\"ו, וצ\"ב למה כפל הכתוב מיד בפסוק שלאחריו, אתם עם קשה עורף רגע אחד אעלה בקרבך וכליתיך, וכבר מלתו אמורה והכפל למה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 41,
      "char_length": 354,
      "timestamp": "2025-02-06T19:33:45.224953"
    },
    {
      "id": "ki sisa_p42",
      "text": "יח) ופלא שהתרגום אונקלוס פו' בזה להיפך מדברי רש\"י והמפורשים, כו לא אעלה בקרבך וגו' ארי לא אסלק שכינתי מבינך וכו', וכן בפסוק שלאחריו רגע א' אעלה בקרבך וגו' שעה חדא אסלק שכינתי מבינך וכו' ויתפרש מלת אעלה מלשון סילוק, כמ\"ש ובפ' לך) ויעל אלקים מעל אברהם, ופי' ואסתלק, וגם התרגום יונתן ב\"ע פי' בדרך זה, ופלא שרש\"י ז\"ל וכל מפוה\"ת לא הביאו כלל פי' התרגום, ורש\"י ז\"ל דרכו בכ\"מ להביא גם פי' האונקלוס וכאן לא הזכירו כללו והיותר קשה דלשון המקרא לא יתפרש ופה לפירוש האונקלוס דהול\"ל כו לא אעלה מקרבך, ואין לשון בקרבך נופל על סילוק, ומה טעם לומר לא אסלק שכינתי מבינך כי עם קשה עורף אתה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 42,
      "char_length": 572,
      "timestamp": "2025-02-06T19:33:45.454462"
    },
    {
      "id": "ki sisa_p43",
      "text": "יט) גם המשך המקראות לא יתפרש ופה לפי פירוש האונקלוס, דאחר שכבר א\"ל ה' לא אסלק שכינתי מבינך, ביקש עוד משה עמר ואתה ל הודעתני את אשר תשלח עמי, ואמר עוד אם און פניך הולכים אל תעלנו מזה, ולפי' התרגומים כבר הבטיח לו השי\"ת שלא יסלק שכינתו ית', ומה מקום לבקשתו עוד.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 43,
      "char_length": 258,
      "timestamp": "2025-02-06T19:33:45.770561"
    },
    {
      "id": "ki sisa_p44",
      "text": "כ) גם צ\"ב דברי התרגום ווב\"ע שמרכיב ב' הפירושים יחד, ופי' עה\"פ כי לא אעלה בקרבך, ארום לית אפשר דאיסלק שכינת יקרי מביניכון. ברם לא יהא יקרי שרי במדור משרותיכון. ארום עם קשה קדל אנת וכו', וצ\"ב איך יסבול הכתוב ב' בחינות הפכיות יחד, ואיך יתאחדו ב' בחי' אלו. שלא יסלק שכינתו ית' וגם לא יהא יקרי שרית במשריתיכון, והוא תרתי דסתרי לכאורה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 44,
      "char_length": 329,
      "timestamp": "2025-02-06T19:33:45.939360"
    },
    {
      "id": "ki sisa_p45",
      "text": "כא) ראה אתה אומר אלי העל את העם הזה, ואתה ולא הודעתני את אשר תשלח עמו וגו' פירש\"י ז\"ל ואשר אמרת לי הנה אנכי שולח מלאך, אין זו הודעה, שאין אנו חפץ בה עכ\"ל, לכאורה לא יצדק לשון לא הודעתני שהרי הודיעו השי\"ת אלא שאין חפץ בה, והול\"ל אם אין פניך הולכים אל תעלנו מזה כמ\"ש להלן. אבל איך יאמר ואתה לא הודעתני אם האמת לא הי' כן שהרי הודיעו ית' וצ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 45,
      "char_length": 339,
      "timestamp": "2025-02-06T19:33:46.149584"
    },
    {
      "id": "ki sisa_p46",
      "text": "כב) הרמב\"ן ז\"ל הקשה ג\"כ על פרש\"י הנ\"ל כמ\"ש אין אנו חפץ בהודעה זו של שליחות המלאך, דהרי מצינו בפ' משפטים שא\"ל הבוי\"ת עוד קודם חטא העגל הנה אנכי שולח מלאך, ושתק משה רבינו ולא בקש לבעלה, וכי יבקש עתה להרויח בעבור מעשה העגל, גם במגיד מישרים הקשה כן ופי' הפסוק באופן אחר עיישאד.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 46,
      "char_length": 273,
      "timestamp": "2025-02-06T19:33:46.358726"
    },
    {
      "id": "ki sisa_p47",
      "text": "כג) ואתה אמרת ידעתיך בשם וגם מצאת חן בעיני, ועתה אם נא מצאתי חן בעיניך וגו' פירש\"י אם אמת שמצאתי חן וכו' וצ\"ב וכי הי' משרע\"ה ח\"ו מסופק אם האמת כן. אחרי שא\"ל השי\"ת וגם מצאת חן, והשפתו חכמים כתב בזה דברים שאסור לשומען. דלמא מה שאמרת מצאת חן בעיני, מצחק היית בי כדרך בנו אדם עכ\"ל, ישתקעו הדברים ולא יאמרו, עכ\"פ צ\"ב כוונת הכתוב וגם דברי רש\"י ז\"ל שכתב אם אמת הדבר, ואיך יתכן לומר כן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 47,
      "char_length": 378,
      "timestamp": "2025-02-06T19:33:46.545071"
    },
    {
      "id": "ki sisa_p48",
      "text": "כד) ואדעך למען אמצא חן בעיניך, צ\"ב למה כפל עוד בקשת מציאות החן פעמים ושלש, וכבר מלתו אמורה וכפולהל ורש\"י ז\"ל פי' ואדע בזו מדת תגמולך וכו' ופתרון למען אמצא חן למען אכיר כמה שכר מציאת החן עכ\"ל, ולפי\"ז לא ביקש כאן על מציאת החן אלא על ידיעת שכרו אבל אין פשוטו של מקרא סובל זה, שא\"כ הול\"ל ותודיעני שכרך, וממ\"ש למען אמצא חן, משמע ששאל על עצם מציאת החן, והרי כבר בקש עליו ותנתן לו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 48,
      "char_length": 374,
      "timestamp": "2025-02-06T19:33:46.795918"
    },
    {
      "id": "ki sisa_p49",
      "text": "כה) ויאמר פני ילכו והנחתי לך, ויאמר אליו אם אין פניך הולכים אל תעלנו מזה, וצ\"ב שהרי כבר הבעיחו השי\"ת פני ילכו, ומה בקשתו עוד ותעש, ורש\"י ז\"ל פי' שאמר בזו אני חפץ, כי ע\"י מלאך אל תעלנו מזה, וצ\"ב דהוא אך למותר ואין זה מדרך הכבוד, כו למה יאמר בזו אנו חפץ, אחרי שכבר נתרצה לו השי\"ת לזה, גם הרמב\"ן ז\"ל הקשה כן, כי חלילה שיאמר כן אחרי שהבטיחו השי\"ת, ופסוק זה מיותר לכאורה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 49,
      "char_length": 366,
      "timestamp": "2025-02-06T19:33:47.024541"
    },
    {
      "id": "ki sisa_p50",
      "text": "כו) הלוא בלכתך עמנו ונפלינו אני ועמך מכל העם אשר על פני האדמה, בגמ' ברכות (דף ז' ע\"א) א\"ר יוחנן משום ר' יוסי ג' דברים בקש משה מלפני הקב\"ה ונתן לו וכו', בקש שלא תשרה שכינה רק על ישראל ונתן לו שנא' ונפלינו אני ועמך וגו' עכ\"ד הגמ', ולכאורה יקשה כאן ג\"כ כקושית הרמב\"ן לעיל בשליחות המלאך, דמדוע לא בקש והתפלל ע\"ז קודם חטא העגל בשעת מ\"ת או לאחרי', שהיו ישראל ברום המעלה והבעוחם השי\"ת והייתם לו סגולה מכל העמים, והו\"ל לבקש אז ונפלינו אנו ועמך שלא תשרה שכינה על עכו\"ם, ולא התפלל ע\"ז עד לאחר חטא העגל, וכי עבור החטא רצה להרויח עוד, גם ראוי להבין מה איכפת לי' אם ישרה השי\"ת שכינתו על העכו\"ם, ועיקר בקשתו צ\"ל לטובת ישראל שישרה שכינתו על ישראל וצ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 50,
      "char_length": 637,
      "timestamp": "2025-02-06T19:33:47.249886"
    },
    {
      "id": "ki sisa_p51",
      "text": "כז) ילך נא ה' בקרבנו כי עם קשה עורף הוא, צ\"ב איזה נתינת טעם יש בזה, לפי שעם קשה עורף הוא. אדרבה לעיל א\"ל השי\"ת לא אעלה בקרבך כי עם קשה עורף אתה, ואף שנתרצה אח\"כ השי\"ת לבקשתו, מ\"מ אין זה סיבה להשראת שכינה, ולא הו\"ל להזכיר סיבת המנגדת לבקשתו, ועיין רש\"י ז\"ל שפי' דכי האמור כאן הוא במקום אם, וקאי אלהלן אם עם קשה עורף הוא וסלחת לעונינו וכו' ועיין במזרחי, אולם עדיין קשה דלמה הזכיר קשיות ערפם ואין צורך בזה לבקשתו, ועוד דכבר הקשינו לעיל (קושיא כ\"ה) מה שכפל לומר אם אין פניך הולכים אל תעלנו, אחר שכבר הבטיח לו השי\"ת פני ילכו, ולאיזה צורך שנה ושלש בקשה זו עוד הפעם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 51,
      "char_length": 559,
      "timestamp": "2025-02-06T19:33:47.578383"
    },
    {
      "id": "ki sisa_p52",
      "text": "ונבוא אל הביאור ונבאר תחלה ענין חטא העגל ומ\"ש חז\"ל און לך כל פורעניות וכו' שאין בה א' מכ\"ד בהכרע ליטרא של עגל הראשון, ונקדים מ\"ש בספה\"ק תולדות יעקב יוסף דחטא העגל נכלל בכל החטאים, ולא ע\"צ העונש, אלא שבכל החטאים יש בהם חלק מחטא העגל ע\"ו שנמשך בחי' החטא מן הכח הרע והארס שנכנס בהם ע\"ו עשיית העגל עכ\"ד ז\"ל, ועד\"ז פירשתי (בדברינו פ' ויחי עמוד תקס\"ח) מאמר הכתוב (תהלים ע\"ט) אל תזכור לנו עונות ראשונים. שהעון הראשון הוא שורש המר, והאחרים נמשכין אחריו, אבל המקור וההשחתה הוא מעון הראשון, וכמו\"כ חטא העגל הוא יסוד ושורש כל עבירות שבעולם. אף שבאמת בענין העגל בעצם היתה כוונתם לש\"ש כמ\"ש הרמב\"ן והאב\"ע ז\"ל, אמנם לפי שטרם שעשו העגל ולאחר מ\"ת מיד, היו ישראל כמלאכי מעלה ולא היו עלולים לחטוא כלל, הגם שאפשר שבהמשך הימים ע\"י התגברות היצר היו באים לידי חטא ח\"ו אפילו בלו סיבת חטא העגל, מ\"מ חטא העגל הי' השורש והמקור הראשון, שהעביר את ישראל על דעתם ועל דעת קונם ר\"ל, והכל הולך אחר ההתחלה, וכמו שפירשתי מאמר חכז\"ל (יומא דף כ\"ט ע\"א) הרהורי עבירה קשו מעבירה, ולכאורה איך אפ\"ל שקשו ממעשה העבירה עצמה, הלא בוודאי שאין עונש המחשבה כעונש המעשה, אבל לפי שההרהורים הם יסוד ושורש והגורם לעבירה ר\"ל, וע\"כ הם מזיקים לנפש, וברוחניות הם קשים מעבירה עצמה, כי הם היסוד ושורש הרע ומנפש ועד בשר תכלה. (ועיין בדברנו לעיל בפרשת תרומה באורך).",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 52,
      "char_length": 1204,
      "timestamp": "2025-02-06T19:33:47.904973"
    },
    {
      "id": "ki sisa_p53",
      "text": "ובזה יובן קצת מאמרם ז\"ל מ\"ש אין לך כל פורעניות ופורעניות שבאה לעולם שאין בה א' מכ\"ד בהכרע ליטרא של עגל הראשון, ואין כוונתם שמצורף על צד העונש חטא העגל, אלא שבכח החטא יש בו חלק מחטא העגל, דהוא השורש והיסוד כל החטאים, וממילא ויש שייכות בכל פורעניות לחטא העגל, ונבאר להלן דהזכרת העגל הוא לטובתם ולזכותם של ישראל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 53,
      "char_length": 309,
      "timestamp": "2025-02-06T19:33:48.510827"
    },
    {
      "id": "ki sisa_p54",
      "text": "ועתה נבוא לבאר מה שאמרו חז\"ל במס' ע\"ז (דף ד' ע\"ב) לא הי' דוד ראוי לאותו מעשה, ולא ישראל ראויין לאותו מעשה אלא למה עשו, לומר לך וכו' ליתן פתחון פה לשבים (עיין פרש\"י שם) ונקדים דברי הזוה\"ק בפרשת תולדות (דף קל\"ז ע\"א) וזלה\"ק, ויעתר יצחק לה' דצלי צלותי' וחתר חתירה לעילא וכו', ת\"ח כ' שנין אשתהי יצחק עם אתתי' ולא אולידת עד דצלי צלותי\", בגין דקוב\"ה אתרעי בצלותהון דצדיקיא וכו', מאי טעמא בגין דיתרבי ויתוסף רבות קודשא לכל מאן דאיצטריך ע\"י צלותהון דצדיקיא עכלה\"ק, וכוונת המאמר שהכין הקב\"ה ע\"י כח תפילתם וזכות קדושתם, צנור הממשיך ישועה והשפעות טובות לדורות הבאים, מה שלא הי' אפשר להשיג בכוחינו ובזכותינו, כי בעוה\"ר כח הקטרוג והס\"מ חזק מאוד לנגדינו, ואין בכוחינו להכריע כנגדם ולהחליש כוחותם, אבל כיון שנזדמן כזה לאבות הקדושים, הם בכוחם וזכותם הגדול פתחו שביל וצינור ומעיין הישועה לדורות ישראל עד עולם, וכמ\"ש ק\"ז הייטב לב זלה\"ה בשם המפורשים לפרש הפסוק (ישעי' י\"ב) ושאבתם מום בששון ממעיני הישועה, שהישועה הוא בחי' מעיין לשאוב ממנו תמיד בכל דור ודור, משל למלך שהי' צמא למים במדבר שמם, ורצו עבדיו להביא לו מים מרחוק, א\"ל לי יש סיפק בידי להביא מים ממרחק ע\"ו שיש לי כמה עבדים ורוכבי סוסים, אבל מה יעשה אדם אחר שהולך בדרך הזה ויצמא למים, נמצא יסתכן, ע\"כ צוה לעבדיו שיכרו לו מעיין באר מים חיים, שיהיו מים מצויים לכל עובר, וכמו\"כ האבות הקדושים וצלותהון דצדיקיא שבכל דור ודור, בכוחם הגדול וזכותם עושים מעיין הישועה לכל ישראל עד עולם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 54,
      "char_length": 1313,
      "timestamp": "2025-02-06T19:33:48.701741"
    },
    {
      "id": "ki sisa_p55",
      "text": "ובזה יבואר דברי הגמ' הנ\"ל, דע\"י שנזדמן להם לדור המדבר דור דעה חטא העגל, ועשו תשובה הגונה כמבואר בפסוקים ובדברי חכז\"ל וע\"י כוחם וזכותם הגדול, והפצרת ותפילות משרע\"ה נתקבלה תשובתם ונמחל להם עונם, ועי\"ז פתחו צנור ודרך לדופקי בתשובה שבכל דור ודור שיתקבל תשובתם, ואלולא כן הי' קשה שיתקבל התשובה, דכח הקטרוג חזקה מאוד, והמדות העליונים כולם לא הסכימו שיתקבל כח התשובה כמאמרם ז\"ל בירושלמי (מכות פ\"ב ה\"ו) שאלו לחכמה חוטא מהו עונשו, א\"ל חטאים תרדוף רעה וכו', שאלו להקב\"ה, א\"ל יעשה תשובה ויתכפר לו, אמנם משרע\"ה בכוחו וזכותו הגדול התגבר עליהם ופתח צינור ודרך לכל בעלי תשובה שיתקבל תשובתם לפני כסא כבודו ית', מה שלא הי' אפשר להשיג בכוחנו ובזכותינו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 55,
      "char_length": 634,
      "timestamp": "2025-02-06T19:33:49.392431"
    },
    {
      "id": "ki sisa_p56",
      "text": "ומעתה לא קשה קושיתינו הנ\"ל (קושיא י') מדוע לא סיבבו מן השמים להורות תשובה ע\"ו הערב רב וכת החוטאים, ולמה הוצרכו דור המדבר דור דעה לבוא לידי מכשול בשביל הוראת תשובה, ולדרכינו א\"ש כי לא הי' אפשר שיהי' הוראת תשובה לרבים כ\"א ע\"ו דור דעה ודור של משה רבינו, ורק ע\"ו כוחם וזכותם הגדול, וזכות תפלת משרע\"ה נתקבלה תשובתם לדורות עולם, ובוודאי שלא הי' אפשר להשיג דבר זה ע\"י כת של חוטאים, כי אין בכח תשובתם לדחות את מדת הדין הקשה, ועדיין לא הו' כח מספיק שיתקבל תשובת היחיד, כי אין מדה\"ד וכח הקטרוג מסכמת, והם לא פתחו צינור ודרך כ\"א לתשובת הרבים, ע\"כ נסתבב אותו מעשה לדוד, וע\"י קדושתו הנפלאה ותשובתו הגדולה, ובכח תפילתו הזכה הי' בכוחו לדחות המקטריגים ומדה\"ד הקשה ונתקבל תשובתו באהבה, ועי\"ז פתח צינור וכח התשובה לכל יחיד ששב, וזהו כוונתם במאמרם ז\"ל לא היו ישראל ראויים לאותו מעשה אלא כדי ליתן פתחון פה לבעלי תשובה וכפירש\"י שיתקבל תשובתם, וכדי להורות תשובה לרבים: ומעשה דוד הי' להורות תשובה ליחיד.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 56,
      "char_length": 880,
      "timestamp": "2025-02-06T19:33:49.704396"
    },
    {
      "id": "ki sisa_p57",
      "text": "ואפ\"ל עוד רמז בדבריהם ז\"ל, דהנה דרך העולם להקל בעבירה שרבים נכשלים בה ר\"ל, ואין משימים על לב לשוב עלי', באמרם כי רוב העולם עושים כן, ואין רוב הציבור יכולים לעמוד בה, ובוודאי לא וצא הקצף להשחית כל הכלל כולו ח\"ו וכעין מ\"ש האוהחה\"ק בפרשת ראה בענין המסית שנאמר מקצה הארץ ועד קצה הארץ, שזה טענת המסית שכולם עובדים ע\"ז זו מקצה הארץ ועד קצהו, ע\"כ הזהירה התוה\"ק לא תאבה ולא תשמע לו, וע\"כ נסתבב חטא העגל להורות תשובה לרבים, ר\"ל דאף בעבירה שרבים נכשלים בה צריכים לרחמים גדולים ולהפצרת ותפילות של משרע\"ה לעורר כח התשובה, וז\"ש להורות תשובה לרבים שגם רבים צריכים תשובה, ואין זו אמתלא וטענת זכות מה שרוב העולם נכשלים בה ר\"ל, וכמו\"כ מ\"ש להורות תשובה ליחיד, שגם מי שהוא גדול ויחיד בדורו צריך לעשות תשובה על חטאו, ואל יסמוך על זכותו או זכות אבותיו, ואומרים לו כלך אצל דוד שהי' יחיד בדורו בצדקתו וחסידותו, ואעפ\"כ עשה תשובה בכל מאמצי כוחו והתודה והרבה תפילה שיתקבל תשובתו, וז\"ש להורות תשובה ליחיד, כנ\"ל בדרך רמז מוסר.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 57,
      "char_length": 898,
      "timestamp": "2025-02-06T19:33:50.133111"
    },
    {
      "id": "ki sisa_p58",
      "text": "נחזור לדרכינו הראשון דמ\"ש חכז\"ל ליתן פ\"פ לבעלי תשובה ולהורות תשובה לרבים, כוונתם ז\"ל דהוכן כח התשובה ונפתח הצינור והמקור שיתקבל תשובת ישראל לדורות עולם, ע\"י כח התשובה שעשו ישראל על חטא העגל, ובזה יתפרש מאמרם ז\"ל במס' סנהדרין (הנ\"ל) אין לך כל פורעניות וכו' שאין בה א' מכ\"ד בהכרע ליטרה של עגל הראשון, אפ\"ל כוונתם ז\"ל דכשבאה ח\"ו גזירת פורעניות לעולם, וישראל עושין תשובה, אבל כח הקטרוג חזקה למאוד, ואין בכוחנו לדחות מדת הדין הקשה, גם אולי אין בחי' תשובתינו הגונה וראוי' להתקבל, ע\"כ מזכירין למעלה חטא העגל, כו כל עבירה ופורעניות שבעולם מקושר עם חטא העגל, כי משם שורשה כנ\"ל, ומדינא יש לצרף אלי' חטא העגל כי הענף בתר השורש גריר ושדי נופו בתר עיקרו, ולפי שכל חטא הוא חלק מעגל הראשון, והוא שורש וגורם כח כל החטאים כנ\"ל, ושם יש לו לימוד זכות גדול, דלא היו ראויים לעשות עבירה זו, ונסתבב להם כן בגזירת מלך, וע\"כ ע\"ו הזכרת חטא העגל ייקל הפורעניות וכח העונש, וגם כח התשובה נוחה להתקבל ע\"ו עגל הראשון, כי הוכנה כח התשובה אז לדורות עולם כנ\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 58,
      "char_length": 926,
      "timestamp": "2025-02-06T19:33:50.565003"
    },
    {
      "id": "ki sisa_p59",
      "text": "וז\"ש ז\"ל אין לך פורעניות שאין בה הכרע מחטא עגל הראשון, שחטא העגל והתשובה שעשו ישראל יש בה כח הכרעה להקל תוקפה של מדה\"ד ופורעניות הקשה ר\"ל, והוא כעין בחי' שכתב הקדושת לוי הנ\"ל, אלא שהוא כתב שלענין מעשה המצות יזכר חטא העגל להגדיל מעשה הטוב וזכותם, ולדרכינו הכוונה שאף לענין פורעניות יזכר חטא העגל, אבל לא ע\"צ העונש ח\"ו, כ\"א להקל העונש והפורעניות.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 59,
      "char_length": 344,
      "timestamp": "2025-02-06T19:33:51.032868"
    },
    {
      "id": "ki sisa_p60",
      "text": "או אפ\"ל דברי הגמ' הנ\"ל עפ\"י דרכו ז\"ל, דע\"י שמזכירין חטא העגל יתגדל כח וזכות של קבלת התורה, כמו שפי' הוא ז\"ל מ\"ש בגמ' ואנכי לא אשכחך זה מעשה סיני, וזכות כל המצות יתגדלו ע\"ו הזכרת חעא העגל, ממילא יתגדל כח ההגנה נגד מדה\"ד הקשה, ויועיל להקל הפורעניות והעונש, אבל אין כוונת הגמ' שע\"י הכרע חטא עגל הראשון יוכבד ח\"ו מדת הפורעניות, אדרבה הזכרת חטא העגל לטובתם של ישראל להקל מדת העונש כנ\"ל, ומעתה לא יהי' סתירה על פי' הקדושת לוי זלה\"ה מדברי הגמ' הנ\"ל (בקושיא י\"א), וגם דברי הגמ' יתפרשו ע\"ד בחינתו, וז\"ש הקב\"ה למשה ועתה לך נחה את העם וגו' וכפרש\"י שמעתי אליך מלכלותם, אבל וביום פקדי ופקדתי עליהם חטאתם, כשיהיו ישראל חוטאים חזו ופורעניות באה לעולם, אז אזכור את העגל לטובתם להקל עונשם, ושיתקבל תשובתם ע\"ו שנפתח הדרך לדופקי בתשובה בשעת חטא העגל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 60,
      "char_length": 731,
      "timestamp": "2025-02-06T19:33:51.227946"
    },
    {
      "id": "ki sisa_p61",
      "text": "ובדרך זה יתפרש גם מה שדרשו שם בגמ' סנהדרין (דף ק\"ב ע\"א) וביום פקדי וגו' תנא משום ר' יוסי עת הוא מזומן לפורעניות, ופירש\"י ז\"ל וביום פקדי, בתשעה באב שבכל השנה מאותן מ' שנה שעמדו במדבר יום מזומן לפורעניות, בו חזרו מרגלים, בו נחרב הבית בראשונה ובשני' עכ\"ד רש\"י ז\"ל, ואפ\"ל כוונת דרשתם ג\"כ על דרך הנ\"ל, דבכל עת המזומנת לפורעניות, יזכר ויפקד להם חטא העגל לטובתם, ויהי' בה הכרעה לטובה, וכן הי' גם בחורבן בית המקדש ששפך חמתו על עצים ואבנים, ולא עשה בהם כלי' ח\"ו, שע\"י זכירת חטא העגל נתגדל כח וזכות של קבלת התורה ומעשה המצות, ונתגדל כח ההגנה נגד מדה\"ד הקשה להקל הפורעניות ולהעביר גזירת כלי' מעליהם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 61,
      "char_length": 588,
      "timestamp": "2025-02-06T19:33:51.613507"
    },
    {
      "id": "ki sisa_p62",
      "text": "ובזה יתורץ קושיא (ט) הנ\"ל, דאין מאמר זה שדרשו חכז\"ל בפסוק וביום פקדי ופקדתי וגו' סותר מ\"ש ז\"ל לא היו ישראל ראויין לאותו מעשה אלא להורות תשובה, אדרבה לכוונה אחד נאמרו ובחי' א' להם, דלפי שהי' אותו מעשה להורות ולהכין כח תשובה לדורות, ע\"כ דרשו חז\"ל שיזכר להם כח הגנה זו שהוכן להם ע\"ו העגל לטובתם של ישראל ולזכותם וא\"ש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 62,
      "char_length": 314,
      "timestamp": "2025-02-06T19:33:51.977720"
    },
    {
      "id": "ki sisa_p63",
      "text": "וא\"ש דברי התנחומא הנ\"ל (בקושיא א') רבים אומרים לנפשי, אלו אומה\"ע שאומרים אין ישועתה לו באלקים סלה, ע\"ו חטא העגל וגודל הקטרוג ופגם החטא כי נורא הוא, אבל ואתה ה\"נ כי הוכן כ\"ז מאתו ית' וגזירת מלך הי' להכין כח תשובה לדורות, וזה מגן בעדי שהוכן מאתו ות' כח הגנה לדורות, כבודי ומרים ראשי, שעי\"ז יהי' הרמת ראש לישראל, והוכן להם כח התשובה לדורות, וז\"ש תחת שהיינו חייבין לך תלוי ראש נתת לנו הרמת ראש, דהפעולה עצמה, ר\"ל חטא העגל שיתחייב ח\"ו תלוי ראש, עי\"ז נתת לנו הרמת ראש דמזה נצמח הרמת ראש לדורות ע\"י כח התשובה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 63,
      "char_length": 502,
      "timestamp": "2025-02-06T19:33:52.177402"
    },
    {
      "id": "ki sisa_p64",
      "text": "ויתורץ קושיא (י\"ב) הנ\"ל, מ\"ש משה רבינו ע\"ה אנא חטא העם הזה חטאה גדולה ויעשו להם אלהי זהב, ולכאורה מדוע הגדיל כח החטא כנ\"ל, אולם לדרכינו הי' לטענת זכותם. שטען משה רבינו כי לא היו ישראל ראויים לעשות חטא גדול כזה, כמשה\"כ מי יתן והי' לבבם זה להם ליראה אותי כל הימים, וכפי' רש\"י שהיו גבורים ואמיצי לבב ביראתם, אלא וודאי מצד גזירת המלך עשו כן להורות תשובה ולהכין כח ההגנה לדורות, א\"כ בהכרח שיתקבל תשובתם ותמחול להם, כי ע\"כ נסתבב להם חטא זה בגזירת מלך להורות תשובה לדורות כנ\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 64,
      "char_length": 470,
      "timestamp": "2025-02-06T19:33:52.487774"
    },
    {
      "id": "ki sisa_p65",
      "text": "ולבאר מאמר הכתוב מחני נא מספרך וגו' ומה שפרש\"י שלא יאמרו לא הייתי כדאי לבקש עליהם רחמים, עיין לעיל (קושיא י\"ד) נקדים דברי המדרש (שמו\"ר פ' א' סי' כ\"ו) ותקרא שמו משה, מכאן אתה למד שכרן של גומלי חסדים, אף על פי שהרבה שמות היו לו למשה, לא נקבע לו שם בכל התורה אלא כמו שקראתו בתי' בת פרעה, ואף הקב\"ה לא קראהו בשם אחר עכ\"ד המדרש, עוד אמרו במדרש (ויק\"ר פ' א' סימן ג') י' שמות נקראו לו למשה, ירד שהוריד את התורה מלמעלה למטה, חבר שחיבר את הבנים לאביהן שבשמים, יקותיאל רבי לוי ורבי סימא אמר שעשה את הבנים מקוין לאביהם שבשמים וכן כולם ע\"ש מעשיו לטובת ישראל, אמר לו הקב\"ה למשה חייך מכל שמות שנקרא לך איני קורא אותך אלא בשם שקראתיך בתי' בת פרעה ותקרא שמו משה, ויקרא אל משה עכ\"ד המדרש, לכאורה ראוי להבין מדוע נדחו שאר השמות המורים על מדריגתו ומעשיו הגדולים, שהוריד התורה לישראל שהוא שורש ויסוד קיום אמונתינו, ולא נזכר משה רבינו בכל התורה כ\"א בשם שקראתו בתי' בת פרעה, הגם שמדת גמ\"ח גדולה מאוד, כמ\"ש ז\"ל ללמד על שכרן של גומלי חסדים, אבל מ\"מ התורה גדולה עוד יותר, שבה נכללו כל המצות, והיא מקור לכולן כמ\"ש והלכת בדרכיו, ומדוע לא נקרא ג\"כ בשם ורד על שם שהוריד התורה לישראל וצ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 65,
      "char_length": 1059,
      "timestamp": "2025-02-06T19:33:52.738114"
    },
    {
      "id": "ki sisa_p66",
      "text": "ואפ\"ל עפימ\"ש בפרשת דרכים (דרך צדקה דרוש ח\"י) לבאר דברי הגמ' (עירובין דף פ\"ו ע\"א) דרש רבא בר מרי (תהלים ס\"א) ישב עולם לפני אלקים חסד ואמת מן ינצרוהו, אימתי ישב עולם לפני אלקים, בזמן שחסד ואמת מן ינצרוהו, לכאורה מה חידש רבא ומה הוסיף על פשטות משמעות הכתוב, ופי' הוא ז\"ל עפימ\"ש בב\"ר (פרשה י\"ב סי' ט\"ו) בתחלה עלה במחשבה לברוא את העולם בדין, כיון שראה שאין העולם מתקיים בדין, שתף עמו מדת הרחמים שנא' ביום עשות ה' אלקים ארץ ושמים, ולפי\"ז הוקשה לו לרבא היכי קאמר קרא ישב עולם לפני אלקים, דהאיך אפשר שיתקיים העולם במדת הדין, והא אמרינן ראה שאין העולם מתקיים בדין. ע\"ז תירץ אימתי ושב עולם לפני אלקים בזמן שחסד ואמת מן ונצרוהו, כי גדול כח הצדקה שמהפכת מדת הדין לרחמים כמאמרם ז\"ל, וא\"כ אף בלי שיתוף מדת הרחמים, ושב עולם לפני אלקים, לפי שכח הצדקה מהפכת למדת הרחמים, ופי' בזה דברי המדרש שא\"ל הקב\"ה למשה אהי' אשר אהי' כשם שאתה הו' עמי, כך אנו הו' עמך, אם פותחין את ידיהם ועושין צדקה, אף אנו אפתח את ידי וכו', עפימ\"ש מוהר\"ש ופה ז\"ל, ששאלת מה שמו מה אומר להם, כוונתו הי' לשאול אם יהי' הגאולה במדת הדין או במדת הרחמים, וע\"ז השיב לו השי\"ת אהי' אשר אהי', כי זה תלוי לפי מעשיהם עכ\"ד, והוא ע\"ד שאמרו במדרש ה' צלך, שהקב\"ה מתנהג עם ישראל כבחי' הצל, וכפי מעשה האדם מעורר המדה ההוא למעלה, והקב\"ה מתנהג עמו במדת ההוא, וע\"כ ע\"י הצדקה שהוא מדת החסד מעורר מדת החסד למעלה, ונתהפך הדין בשרשו לרחמים וחסדים.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 66,
      "char_length": 1275,
      "timestamp": "2025-02-06T19:33:53.288161"
    },
    {
      "id": "ki sisa_p67",
      "text": "ומעתה יבואר דהנה הבוי\"ת נתן התוה\"ק לעמו ישראל, וע\"י התוה\"ק מתקיים העולם, וגם הקב\"ה שומר תורתו כמ\"ש ז\"ל, וע\"כ אין לך פרשה שבתורה שלא נזכר בה שמו של משה, כי שם משה מורה על כוחן של גומלי חסדים, כמ\"ש במדרש הנ\"ל מכאן אתה למד שכרן של גומלי חסדים, ועי\"ז מתדבקין ישראל במדת החסד, ונתעורר מדת החסד למעלה ע\"ד שאמרו ה' צלך, ועל כי הי' רצון הבוי\"ת שיתנהג העולם במדת החסד והרחמים, ע\"כ לא נזכר משה רבינו בשאר השמות ואפילו בשם המורה על מתן תורה, כו אם בשם המורה על חסד, כדי לעורר שורש מדת החסד בעולם, ועד\"ז הי' טענת משרע\"ה שאמר ועתה מחני נא מספרך, ופרש\"י והמפורשום מכל התורה כולה, דהא תינח אם הקב\"ה מוחל עוונותיהם של ישראל ומתנהג במדת החסד, ע\"כ צריך שיזכר שמו לעורר מדת החסד, אבל חלילה אם און אתה מוחל להם, מחני נא מכל התורה כולה ולא יזכר שמי, וכ\"ז הי' לעורר מדת החסד.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 67,
      "char_length": 753,
      "timestamp": "2025-02-06T19:33:53.933237"
    },
    {
      "id": "ki sisa_p68",
      "text": "ואפ\"ל בכוונת דברי רש\"י ז\"ל שלא יאמרו עלו לא הייתי כדאי לבקש עליהם רחמים (עיין לעיל קושיא י\"ד). דחש משה רבינו שיחלש כח מדת החסד בעולם, ע\"י שיראו שמשה רבינו לא הי' בכוחו לעורר מדת החסד, שומחל להם עון העגל, עי\"ז יחלש כח החסד אצל גומלי חסדים, וירפו ידיהם והתחזקותם במדת החסד, ע\"י שיראו שאין בה כח הגנה לעמוד נגד מדת הדין הקשה, וכמו\"כ אצל המקטריגים שעכ\"פ יש להם התבטלות נגד מדת החסד והצדקה, כמ\"ש הפר\"ד הנ\"ל ושב עולם לפני אלקים, שאפשר להתקיים גם במדת הדין ע\"י חסד ואמת מן ינצרוהו וע\"כ אמר משה רבינו מחני נא מספרך שלא יאמרו שלא הייתי כדאי לבקש רחמים, היינו שאין מדת החסד מדתו של משה כדאי, ואין בה כח לעורר רחמים, וע\"י אמירה זו יחלש כח החסד. וע\"כ בקש מחני נא מספרך.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 68,
      "char_length": 657,
      "timestamp": "2025-02-06T19:33:54.331762"
    },
    {
      "id": "ki sisa_p69",
      "text": "אמנם משה רבינו ודע והשיג שהצורך שישאר זכר ורושם מחטא העגל לטובת ישראל כבחי' הקדושת לוי הנ\"ל, ולהקל פורעניות לעתיד כדברי חז\"ל הנ\"ל, ע\"כ לא התפלל רק שיהי' נמחל להם חטא העגל מיד ולשעה, להצילם מכלי' ח\"ו, אבל אין חטא העגל כשאר חעאים, דכשעשה תשובה לא יזכר ולא יפקד עוד עונו כמ\"ש ז\"ל (הובא לעיל), אבל בחטא העגל ההכרח שיזכר העון לטובתם של ישראל, ע\"כ אמר ועתה אם תשא חטאתם, דייק בתיבת ועתה, שימחק רושם החטא לשעה להצילם מכלי', אבל ישאר רושם החטא לדורות, לעת הצורך לטובתם של ישראל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 69,
      "char_length": 470,
      "timestamp": "2025-02-06T19:33:54.687058"
    },
    {
      "id": "ki sisa_p70",
      "text": "ויתורץ (קושיא י\"ג) מה שקיצר הכתוב ולא פירש אופן ההן. שאמר ועתה אם תשא חטאתם, ולא פי' מה יהי', אולם כוונת משה רבינו הי\"ו שאם תשא חטאתם, אז ישאר כח ההכרעה לדורות, ויהי' מוכן כח החסד וכח התשובה להקל הפורעניות ע\"י הזכרת עון העגל ולא הזכירו בפירוש, כי די' לצרה בשעתה, וטוב יותר אם לא יחטאו עוד, ולא יצטרכו להזכיר עון העגל לטובתם, ע\"כ העלימו ברמז, ולא פירש אופן ההן, וע\"כ קיצר הכתוב ורמזו בתיבת ועתה כמ\"ש לעיל, לא יזכר החטא לשעה להצילם מכלי', אבל יזכר בעתיד.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 70,
      "char_length": 452,
      "timestamp": "2025-02-06T19:33:54.949048"
    },
    {
      "id": "ki sisa_p71",
      "text": "ולדרכינו יבואר המדרש הנ\"ל, שאמר משה בפ' שקלים, שמא משאני מת אין אני נזכר (עיין קושיא ב') ויובן עפימ\"ש במסכת ב\"ב (דף י' ע\"ב) א\"ר אבהו אמר משה לפני הקב\"ה רבש\"ע במה תרום קרן ישראל אמר לו בכי תשא, ופרש\"י אם באת לשאת ראשם בהגבהה, קח מהם כופר לצדקה, וכן איתא בפסיקתא והובא בילקוט ורמז שפ\"ו) צדקה תרומם גוי (משלי י\"ד) בנדבה שהביאו ישראל למלאכת המשכן ניתן להם תלוי ראש ע\"ו משה שנאמר כו תשא את ראש ע\"כ, והוא כבחי' הפר\"ד הנ\"ל כי ע\"ו צדקה ישב עולם לפני אלקים ויתקיים גם במדת הדין וכמ\"ש רש\"י ז\"ל (פ' וירא) גדול כח מתנות עניים שהופך מדת הרוגז לרחמים ע\"כ וע\"כ הי' להם הרמת ראש עמו מחצית השקל שנתנו כופר לצדקה לנדבת המשכן כפירש\"י ז\"ל, ומעתה חשב משה רבינו בגודל ענותנותו, כיון שע\"י הצדקה מהפכים מדה\"ד לרחמים, מעתה אין צורך עוד להזכיר שם משה לעורר מדת החסד בעולם כנ\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 71,
      "char_length": 751,
      "timestamp": "2025-02-06T19:33:55.193325"
    },
    {
      "id": "ki sisa_p72",
      "text": "ואפשר שזה כוונת דברי המדרש הנ\"ל והשבע לעשיר אינו מניח לו לישון וכו', משה רבינו למד תורה לישראל, והם מזכירין אותו בכל פרשה ופרשה, כדי להזכיר ולעורר זכותו ומדת החסד כנ\"ל, כיון שהגיע לפ' שקלים שנאמר כי תשא את ראש, שע\"י הכופר לצדקה יהי' להם הרמת ראש ובכח הצדקה להפך דין לחסד, ע\"כ אמר שמא משאני מת אין אני נזכר שיתעורר מדת החסד עמו הצדקה, והשי\"ת השיב לו בכל שנה ושנה שקורין פרשת שקלים אתה עומד וזוקף את ראשן שנא' כו תשא, שא לא נאמר דמשמע מעצמן, אלא כי תשא ע\"ו משרע\"ה, והכוונה דאף שהחסד והצדקה זכותו גדול להפך מדה\"ד כנ\"ל, אבל צריכים ישראל לכוחו וזכותו של משרע\"ה, שיהי' בחינת הצדקה מקושר עם התוה\"ק ועל דעת משה רבינו והשפעתו, וזולת זה אין בה שלימות וכח להפך מדת הדין, ובהעלם משרע\"ה אתנו בכל דור ודור כמ\"ש האריז\"ל בפרשת שמות בספר הליקוטים, וכתב בש\"ך עה\"ת דע\"כ נעלם שמו בפ' תצוה, להורות שבכל דור ודור הולך עמנו בהעלם, והביא כן בשם רעיא מהימנא עיי\"ש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 72,
      "char_length": 839,
      "timestamp": "2025-02-06T19:33:55.568979"
    },
    {
      "id": "ki sisa_p73",
      "text": "ועתה יתבארו (קושיא ד' וה') בטעם שהסמיך הכתוב ויתן אל משה ככלותו לפני פ' העגל, עפי\"מ שכתב רבינו בחיי דע\"כ נכתב פ' שקלים לפני חטא העגל, מפני שהשקלים היו לכפרה על חטא העגל כמ\"ש בעלי התוס' והכלי יקר ז\"ל, ולהורות כי הכין והקדים הקב\"ה רפואה למכה, וכמו\"כ אפ\"ל בטעם שהקדים הכתוב לומר ויתן אל משה ככלותו קודם חטא העגל, עפימ\"ש חכז\"ל שנמסרה לו תורה במתנה וכו', וע\"כ מאז נקראת תורת משה, וממילא מקושר בה מדת החסד ששם משה מורה ע\"ז, וזה מעורר כח החסד, והקדים הכתוב רפואה למכה. וא\"ש מיש במדרש תנחומא זש\"ה (משלי י\"ח) מתן אדם ירחיב לו וכו', דמזה נשמע כמה גדול כוחם של גומלי חסדים, וזה מעורר מדת החסד בעולם כמ\"ש לעיל צדקה תרומם גוי, ומקושר שפיר עם הפסוק ויתן אל משה ככלתו. דשורש א' ובחי' אחת להם, וסגולתם לעורר מדת החסד, כשיהי' בחי' הצדקה מקושר עם התוה\"ק וע\"ד מרע\"ה והשפעתו, נמצא דשניהם שורש א' הם, והוקדמו לפני פ' העגל מטעם הנ\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 73,
      "char_length": 811,
      "timestamp": "2025-02-06T19:33:55.978848"
    },
    {
      "id": "ki sisa_p74",
      "text": "ועתה נבוא לבאר מאמה\"כ מחני נא מספרך וגו' (לעיל קושיא ט\"ו ט\"ז) עפ\"י דרשת חז\"ל במסכת ר\"ה ודף ע\"ז ע\"ב) על ג' ספרים הנפתחים בב\"ד של מעלה, ונקדים לבאר מאמר ר' אבין שם שהתפלל דוד ימחו מספר חיים ועם צדיקים אל יכתבו, שימחו מכל הג' ספרים עיי\"ש, והקשו המפורשים מדוע התפלל דוד המע\"ה שימחו אף מספרן של רשעים, ומ\"ט לא הניחם בספרן של רשעים וימחו שם עמהם, ותרצו דאותן שהם כתובים בספרן של רשעים למיתה ר\"ל, זו עצמה מחיקה הוא וע\"כ אמר ימחו מספרן של רשעים, אולם אין לשון הגמרא סובל פשט זה דהול\"ל ימחו בספר, ולא ימחו מספר דמשמע שלא יהיו כתובים בספרן של רשעים, עו\"ק מה שהתפלל ימחו מספרן של צדיקים, וכי ס\"ד שיכתבו רשעים בספרן של צדיקים, ואם הם ראויים להיות בספרן של צדיקים מדוע התפלל שימחו משם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 74,
      "char_length": 672,
      "timestamp": "2025-02-06T19:33:56.386079"
    },
    {
      "id": "ki sisa_p75",
      "text": "אולם קושיא זו אפ\"ל בפשטות, כו לפעמים יש לרשע איזה זכות, ומגיע אליהם כמעשה הצדיקים, והשכר והזכות לא יקופח ממנו כי כך הוא המידה, וכמ\"ש חכז\"ל במסכת סנהדרין (דף צאו ע\"א) על נבוכדנצר שהקשו מדוע דרך רשעים צלחה, ופרש\"י ז\"ל מפני מה הצליח נבוכדנצר וכבש ירושלים, ואמרו שם בשכר ד' פסיעות ששלמתי לאותו רשע שרץ אחר כבודי ע\"כ, ובאמת סוף אותו השכר שקבל יהי' לרעתו, כי ינקום ה' נקמתו מן המצירין לישראל, ומכ\"ש מן המחריבין, אלא שכך הוא המידה והארכתי בזה בספרי ויואל משה (מאמר ב' סימן נ' נ\"ב עיי\"ש) ומצינו במשה רבינו שהתפלל במחלקותו של קרח אל תפן אל מנחתם שלא יהי' להם זכות דלפעמים הוא המוספת כח וחיזוק להשלים חפצם ורשעותם, וכמו\"כ התפלל דוד ימחו מספרן של צדיקים, והכוונה שלא יכתבו לזכות ואפילו יש להם זכות, לפי שבאותו הכח והשפעה יוסיפו להרע ולחטוא, ורע להם ורע לעולם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 75,
      "char_length": 748,
      "timestamp": "2025-02-06T19:33:56.739535"
    },
    {
      "id": "ki sisa_p76",
      "text": "ומה שהתפלל ימחו מספרן של רשעים אפ\"ל עפימ\"ש בספה\"ק דברי חיים פרשת נח וז\"ל שמעתי מאדמו\"ר החכם זלה\"ה (בעל זרע קודש) שאין שום קטרוג חטא יכול לבוא לפני כסא הכבוד, ומובא באותיות דר\"ע שבעולם שמכריזין החטא טובלין אותו העולם כמה וכמה טבילות, ולכן בוודאי שלא יכנס החטא לפני בורא כל העולמים אשר הוא טהור עינים וגו', ולכן אינו מהקטרוג רק שורש הקדושה אשר נמצא בעבירה וכו', ובעבורות החיות שבהם, שעי\"ז יכול לעשות תשובה וכו', וע\"כ נכנס הקטרוג פלוני עשה דבר שיש בו תיקון תשובה כך וכך, כי לכל עבירות יש תיקון תשובה, וזהו הקטרוג שאותו אדם שעשה העבירה יתקן כראוי עכ\"ל, נמצא לפי\"ז דא\"א שיזכרו לפני הבוי\"ת רק ע\"ו בחי' התשובה כנ\"ל, אבל המינים והכופרים שאמרו ז\"ל עליהם כל באי' לא ישיבון ואם ישיבון לא ישיגו אורחות חיים, הגם דמהני תשובה לכל אדם אף למינים ואפיקורסים אבל אין הקב\"ה חפץ בתשובתם, וע\"כ התפלל דוד המלך ע\"ה שלא יזכרו בשום א' מהספרים אלא יהיו נמחים מאליהם, ואלו שהם בספרן של רשעים עדיין הם במדריגה להשיג בחי' התשובה אלא שתשובתם קשה, וע\"כ נכתבים בספר לבדם כמ\"ש הערבי נחל זלה\"ה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 76,
      "char_length": 960,
      "timestamp": "2025-02-06T19:33:57.129073"
    },
    {
      "id": "ki sisa_p77",
      "text": "ומעתה יובן מ\"ש משרע\"ה מחני נא מספרך אשר כתבת עפ\"י דרשת חז\"ל שימחה שמו מג' ספרים הנ\"ל, ויובן עפ\"י הבחי' שפירשנו לעיל שע\"כ נזכר שמו של משרע\"ה בכל התורה כולה, כדי לעורר מדת החסד הנרמז בשמו, וכמ\"ש במד\"ר מכאן אתה למד שכרן של גומלי חסדים, שלא נקבע לו שם בכל התורה כולה אלא כמו שקראתו בתי' בת פרעה, וכמו\"כ אפ\"ל בג' ספרים אלו שנפתחים לפני הב\"ד של מעלה, ונזכר בכל א' מהם הזכיות והמעשים של כאו\"א, ובספרן של רשעים רובן עונות, ובספרן של צדיקים רובן זכיות, עכ\"פ בכולן יש בהם גם מעשים של זכיות כמ\"ש לעיל, דגם בספרן של רשעים לא יזכרו רק אלו שיש להם עדיין זכות ושייך אצלם בחי' תשובה, דאלו שאין להם זכות כלל לא יזכרו בספרים שא\"צ לדון בהם כלל, ועכ\"ח כל אלו שנזכרים בספרן של רשעים יש להם גם זכותים אלא שרובן עונות, ע\"כ בוודאי שכולם צריכים להצטרף עמהם כוחו וזכותו של משה רבינו לעורר עליהם מדת החסד, גם שהוא הכין הדרך ופתח הצנור לבעלי תשובה שיתקבלו, וע\"כ כולם הנזכרים בג' ספרים צריכים לזכותו וזכותו מצורף עמהם לזכותם, כי משה רבינו כלול ומקושר עם כל נשמת ישראל, כי הוא השורש וכל ישראל ענפים מחלקי נשמתו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 77,
      "char_length": 981,
      "timestamp": "2025-02-06T19:33:57.573829"
    },
    {
      "id": "ki sisa_p78",
      "text": "ומעתה ז\"ש משרע\"ה מחני נא מספרך על כל ג' ספרים הנ\"ל לפי דרשת חז\"ל ואין הכוונה שמשרע\"ה הי' כתוב באותן הספרים, כי בחינתו היתה למעלה ממלאכי ב\"ד של מעלה כנ\"ל, אלא שכל אותן הכתובים שם בג' ספרים מצורף אליהם זכותו של משה, וה\"ה כאלו כתוב שם עמהם לעורר עליהם מדת החסד, כמו שנכתב בתוה\"ק מהאי טעמא כנ\"ל, ועכשיו שראה שאין יכול להשפיע חסד ומחילה על ישראל להכריע לטובתם, ע\"כ אמר מחני נא מג' ספרים אלו. והטעם כמ\"ש רש\"י ז\"ל שלא יאמרו עלי שלא הייתי כדאי לבקש עליהם רחמים, וכמו שפירשנו לעיל כי חש משה רבינו שזה יגרום חולשא במדת החסד, הן אצל גומלי חסדים, והן אצל המקטריגים, כי יאמרו שאין בכח מדת החסד לפעול כלום כנ\"ל, ולפי\"ז מ\"ש רש\"י והמפורשים ז\"ל מחני נא פי' מכל התורה כולה, ומ\"ש חז\"ל דקאי על הג' ספרים בחי' א' להם, דכמו שנזכר שמו של משה בתוה\"ק כדי לעורר ולהגביר מדת החסד מה\"ע מצורף כוחו וזכותו בג' ספרים אלו, וכשאמר מחני נא התכווין על שניהם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 78,
      "char_length": 823,
      "timestamp": "2025-02-06T19:33:58.048753"
    },
    {
      "id": "ki sisa_p79",
      "text": "ועתה נבוא לבאר (קושיא ו') מ\"ש רש\"י ז\"ל דאין מוקדם ומאוחר בתורה, דמעשה העגל קדמה לצווי מלאכת המשכן וכו', נראה דמוכרח לומר כן, ולא יקשה קושית ההג\"ה במוסגר, דהנה כבר כתבו בעלי התוס' ז\"ל, דע\"כ לא נזכר שמו של משה בפרשת ואתה תצוה, לפי שקללת חכם אפילו על תנאי הוא באה, ולפי שאמר מחני נא מספרך נתקיימה קצת, ומבואר כן בזוה\"ק פ' פנחס, נמצא דאף הזוה\"ק ובעה\"ת דס\"ל דפרשת ויקחו לי תרומה על הסדר נאמרה קודם חטא העגל (עיין לעיל קושיא ו'), מ\"מ גם לפי\"ד מוכרח דפרשת ואתה תצוה לא על הסדר נאמרה, ולאחר מעשה העגל היתה, דאל\"כ מה טעם דלא נזכר משה בפ' ואתה תצוה דייקא, ועדיין לא הי' קללת חכם באותו שעה, שמ\"ש מחני נא מספרך הי' לאחר חטא העגל, ומעתה לא קשה על רש\"י ז\"ל דעדיין לא הי' ספר הזוהר לפניו, ואפשר דס\"ל כמו שפ' תצוה שהוא ציווי מלאכת המשכן נאמרה לאחר חטא העגל, ואף פרשת תרומה שלא במקומה נאמרה, ואין מוקדם ומאוחר בתורה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 79,
      "char_length": 799,
      "timestamp": "2025-02-06T19:33:58.456432"
    },
    {
      "id": "ki sisa_p80",
      "text": "או אפשר שגם רש\"י ס\"ל כשיטת הזוה\"ק דפרשת תרומה במ' יום שהי' משה בהר נאמרה, דאינו מבואר ברש\"י דכל מלאכת המשכן נאמרו אחר חטא העגל, ואפשר דכוונתו רק על פ' תצוה שנכללו בו מלאכת המשכן בגדי כהונה ומזבח הפנימי, אבל בפ' תרומה ס\"ל כדברי הזוה\"ק והבעלי תוס', ועכ\"פ אליבא דכ\"ע אין מוקדם ומאוחר בציווי מלאכת המשכן, ול\"ק על שיטת רש\"י ז\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 80,
      "char_length": 323,
      "timestamp": "2025-02-06T19:33:58.855951"
    },
    {
      "id": "ki sisa_p81",
      "text": "ועתה נבוא לתרץ קושית הרמב\"ן ז\"ל (לעיל קושיא כ\"ב) דקודם חטא העגל כשא\"ל הקב\"ה הנה אנכי שולח מלאך שתק משרע\"ה ולא התפלל לבטלה, וכי יבקש עתה להרויח עבור מעשה העגל, ואפ\"ל דהנה מאמרו ות' שם הנה אנכי שולח מלאך וגו' השמר מפניו ושמע בקולו אל תמר בו כי לא ישא לפשעכם וגו', פרש\"י ז\"ל אינו מלומד בכך שהוא מן הכת שאין חוטאין וע\"כ לא ישא לפשעכם, ועוד שהוא שליח ואינו עושה אלא שליחותו, ואין בידו למחול אלא הבוי\"ת לבדו יכול למחול עיי\"ש, ומעתה יתורץ בפשטות דקודם חטא העגל לא היו ישראל עלולים לחטוא, כמ\"ש לעיל שהיו במדרגת מלאכי מעלה בשעת מ\"ת ואמיצי לב ביראה כפרש\"י שם, ע\"כ לא הפציר משה רבינו אז לבעל גזירת מלאך, אבל אחר חטא העגל שהיו עלולים לחטוא ר\"ל, ע\"כ הפציר והתפלל אם אין פניך הולכים אל תעלינו מזה, ולא הסכים לשליחות המלאך מאחר שאין בידו למחול, ובלי מחילת עונות א\"א לנו להתקיים ח\"ו, וכמ\"ש הרמב\"ן ז\"ל בפתיחה לס' דברים, כי עמך הסליחה למען תורא, שע\"י הסליחה אפשר לזכות למדריגת יר\"ש ולא זולתו עיי\"ש, וע\"כ לא הסכים משרע\"ה אחר מעשה העגל לשליחות המלאך.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 81,
      "char_length": 930,
      "timestamp": "2025-02-06T19:33:59.035848"
    },
    {
      "id": "ki sisa_p82",
      "text": "וכמו\"כ אפ\"ל קושיא (כ\"ו) הנ\"ל, מה שהתפלל משה רבינו אחר חטא העגל ונפלינו אני ועמך וגו' שלא תשרה שכינתו על עכו\"ם, ולא התפלל עץ לפני חטא העגל, אמנם השראת השכינה על עכו\"ם הוא סכנה עצומה ר\"ל, שלא ילמדו ישראל ממעשיהם, פוק חזי מה עלתה לישראל ע\"י נבואת בלעם שהטעה את ישראל במתי שוא, והכניס בנבואתו פשטים שאינו אמת, והנבואה עצמה אמיתית וחלק מתוה\"ק, ונלמד משם תחיית המתים ועוד הרבה דברים וכל מי שאינו מאמין בפרשה זו הוא מין ר\"ל, אלא שהכניס בדיבורו נבואה שנאמרו לו מפי השי\"ת פירושי שקר ומינות, כמ\"ש בעה\"ת (בריש פ' דברים) בשם המדרש שא\"ל לישראל עשו כל תאות לבבכם ולא יעשה השי\"ת לכם רעה, שנאמר ההוא אמר ולא יעשה ודבר ולא יקימנה, ואמר פי' הפסוק בניחותא עכ\"ל, (עיין בדברינו בפ' דברים), ומעתה קודם חטא העגל שהיו ישראל אמוצו לבב ביראה כמשה\"כ מו יתן והי' לבבם זה ליראה אותי כל הימים, לא הי' החשש שיכשלו ע\"י נביאי עכו\"ם והשראת השכינה שעליהם, אבל אחר חטא העגל שהיו עלולים לחטוא, הוצרך מרע\"ה להתפלל שלא תשרה שכינתו על עכו\"ם וא\"ש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 82,
      "char_length": 906,
      "timestamp": "2025-02-06T19:33:59.487064"
    },
    {
      "id": "ki sisa_p83",
      "text": "ועתה נבוא לתרץ קושיא (כ\"א) הנ\"ל מ\"ש מרע\"ה ואתה לא הודעתני את אשר תשלח עמו, ולכאורה הרי הודיעו ית' הנה אנכי שולח מלאך. וגם פרש\"י צ\"ב עיין לעיל, ויבואר בהקדם הכתוב ופ' וילך) ואמר ביום ההוא על כי אין אלקי בקרבי מצאוני הרעות האלה, ואנכי הסתר אסתיר את פני וגו' והקשו המפורשים דלמה יסתיר השם פניו בעונש אמירה זו, והרי זו וידוי וחרעה על מעלם ועל עונם אולם לא יאות לומר וידוי בלשון הזה, דאם אין בחי' אלקי בקרבי אין הוידוי מועיל כלום, דא\"א להיות מחילת עונות כ\"א ע\"י הבוי\"ת לבדו, כמ\"ש רש\"י עה\"פ כו לא ישא לפשעכם, דלא מלאך ולא שליח יכול למחול אלא השי\"ת לבדו, ובאמת גם אחר חטא העגל וגם בגלות החל הזה, תמיד השראת שכינתו ית' בתוכינו, דא\"א להתקיים בלא\"ה אפילו שעה אחת, וגם בימי יהושע שהי' ע\"י שליחות מלאך, כמ\"ש הרמב\"ן בפ' משפטים שאז נתקיים דבור השם שא\"ל למשה הנה אנכי שולח מלאך עיי\"ש, אבל מ\"מ הי' שם בחי' השראת השכינה, דא\"א לזכות למחילת עון ע\"י שליח ולא ע\"ו מלאך, ובלי זה א\"א לנו להתקיים ח\"ו. אלא שהשראת שכינתו ות' אתנו הסתר בתוך הסתר, ובעוה\"ר חסר לנו בחי' הידיעה וההרגשה ששכינתו ית' בתוכינו, ובחי' ההסתר עצמו נסתר ונעלם מעינינו, ונרמז זה בכפל הלשון ואנכי הסתר אסתיר, אבל האמת הברור שהשראת שכינתו ות' בתוכינו תמיד, כי א\"א שיהי' לנו קיום זולתו, אלא שנעלמת ומסולקת מידיעתנו, ומעתה על כי אמר ביום ההוא כי אין אלקי בקרבי, זה עצמו הוא ההסתר שאמר הכתוב ואנכי הסתר אסתיר וגו' שנחסר בחי' הידיעה וההרגשה והכתוב הודיענו שאין האמת כן אלא תמיד השראת שכינתו ית' אתנו. אלא שהוא בבחי' הסתר וחסר לנו הידיעה והרגשה בה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 83,
      "char_length": 1386,
      "timestamp": "2025-02-06T19:33:59.957839"
    },
    {
      "id": "ki sisa_p84",
      "text": "ומעתה ז\"ש משרע\"ה ואתה לא הודעתני וגו' ואתה אמרת ידעתיך בשם, וטענתו ותפילתו הי' ע\"ז הדרך, כו ידע והשיג מרע\"ה כי אף אם יהי' ע\"ו שליחות מלאך אבל בהסתר יהי' שכינתו כבודו ות' עם ישראל כי א\"א להתקיים זולתו, אולם לא הי' מרוצה שיהי' השראת השכינה בהסתר ובהעלם בלי ידיעה והרגשה מצידינו, וע\"כ התפלל שיהי' בידיעה והשגה בדעת שלימה שהשי\"ת שוכן בתוכינו ועי\"ז נהי' דבוקים אליו ית' בכל מחשבותינו ואז טוב לנו כל הימים, והלואי שנזכה לבחי' הידיעה, ולא יהרהר האדם לומר ח\"ו כי אין אלקי בקרבי, ומוכרח שידע האדם שבבחי' הסתרה שכינת כבודו בתוכינו ולית אתר פנוי מני', ואפילו רגע א' לא סר מאתנו השגחתו ית' וצופה ומביט ומשגיח על כאו\"א מישראל ולא נעשה ולא נהי' אפילו תנועה קלה בלי השגחתו ית', ואם נזכה לבחי' ידיעה זו: אז נוכל לדבק בו ות' וללכת בדרכיו ולא זולת זה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 84,
      "char_length": 733,
      "timestamp": "2025-02-06T19:34:00.649259"
    },
    {
      "id": "ki sisa_p85",
      "text": "וזה הי' טענת משרע\"ה ואתה לא הודעתני וגו' ופרש\"י ז\"ל ואשר אמרת הנה אנכי שולח מלאך אין זו הודעה ואין אני חפץ בה, הגם שידע מרע\"ה כי בהסתר יהי' שכינת כבודו ות' בתוכינו אף אם יהי' ע\"י שליחות מלאך: אבל יחסר הידיעה מצידנו ויהי' השראת השכינה בהסתר ובהעלם, ע\"כ אמר אין זו הודעה מה שהבטחתנו כמ\"ש ואתה אמרת ידעתיך בשם ואין אני חפץ בה, והתפלל מרע\"ה שיתגלה שכינתו לעיני כל ישראל בהרגשה אמיתית וידיעה שלימה, כמו שיהי' לעתיד יראו עינינו וישמח לבינו וישמיענו ברחמיו לעיני כל חי לאמר הן גאלתי אתכם אחרית כראשות להיות לכם לאלקים, ויתגלה כבודו ית' לעינינו, וכמו שפירשו במאמר התנא (אבות פ\"ג משנה י\"ד) חביבין ישראל שנקראו בנים למקום חבה יתירה נודעת להם שנקראו בנים למקום. ופירשו דהידיעה וההרגשה הוא חביבה ומשובחת עוד יותר מעצם המתנה, וז\"ש חבה יתירה שנודעת להם, ועד\"ז היה תפלת מרע\"ה הודיעני נא את דרכיך, שיהיה בידיעה והשגה בדעת שלימה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 85,
      "char_length": 812,
      "timestamp": "2025-02-06T19:34:00.999414"
    },
    {
      "id": "ki sisa_p86",
      "text": "ועתה נבאר המשך הפסוקים מ\"ש מרע\"ה ועתה אם נא מצאתי חן בעיניך וגו' ומה שפירש\"י אם אמת שמצאתי חן וכו' (עיין לעיל קושיא כ\"ג וכ\"ד) דהנה מצינו שאמר יעקב אבינו ע\"ה ואתה אמרת היטב אוטב עמך וגו' ואעפ\"כ הי' מתיירא שמא יגרום החטא, ואמרז\"ל במדרש ופ' ע\"ו סי' ב') מכאן שאין הבטחה לצדיקים, כי כן דרך הצדיקים שמתויראים תמיד פן יגרום החטא בעתיד למנוע קיום ההבטחה, וכ\"כ הרמב\"ן ז\"ל באברהם אע\"ה שאמר במה אדע כי אירשנה, אף שהבטיח לו השי\"ת הי' מתיירא מגרמת החטא, וכמו\"כ אפ\"ל בטענת מרע\"ה שאמר ואתה אמרת ידעתיך בשם וגם מצאתי חן בעיניך וכבר יש לי הבטחה מאתך ית' ועתה אם נא מצאתי חן בעיניך, ר\"ל אם גם עתה יש לי מציאת חן הודיעני נא את דרכך, ולא שהי' ח\"ו מסופק בהבטחת השי\"ת, אלא שהי' מתיירא אם כח ההבטחה קיימת עדיין, ולא גרם החטא למנעו, וזה שפירש\"י אם אמת שמצאתי חן בעיניך. עפימ\"ש הרמב\"ן ז\"ל בפרשת וישלח עה\"פ קטנתי מכל החסדים ומכל האמת וגו', דאמת היינו דבר המתקיים ע\"ד אומרם ז\"ל ושבת דף ק\"ד ע\"א) קושעא קאי, וחסדים המתקוומים נקראו אמת עיי\"ש, וז\"ש מרע\"ה אם אמת שמצאתי חן בעיניך, דהיינו שעדיין החסד והמציאות חן קיימת ומתקיימת לעולם ע\"כ הודיעני נא את דרכך שנזכה להתגלות הידיעה והשגה, ואדעך למען אמצא חן בעיניך עד סוף כל הדורות, ויתקיים מציאות החן לעולם, ולא ימנע ההבטחה הזאת ע\"י גרמת החטא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 86,
      "char_length": 1157,
      "timestamp": "2025-02-06T19:34:01.387990"
    },
    {
      "id": "ki sisa_p87",
      "text": "וא\"ש מה שכפל עוה\"פ לומר למען אמצא חן בעיניך והרי כבר אמר ועתה אם נא מצאתי חן וגו' (עיין קושיא כ\"ד), אבל בזה הי' בקשתו על מציאת חן והתגלות ידיעה בגלוי שכינתו ית' עלינו עד סוף כל הדורות, ואמר למען אמצא חן כי בהעלם הוא אתנו בכל דור ודור כמ\"ש בזוה\"ק והאריז\"לו אמנם ודע והשיג מרע\"ה שעתיד להיות מלאך בימי יהושע, כמ\"ש הרמב\"ן ז\"ל בפרשת משפטים שאז נתקיים דיבורו של הקב\"ה שאמר הנה אנכי שולח מלאך, ואיתא בתנחומא שא\"ל המלאך ליהושע עתה באתי אני הוא שבאתי בימי משה רבך ודחה אותי ולא רצה שאלך עמו ועתה באתי עיי\"ש, ע\"כ גם שהבטיחו השי\"ת פני ילכו וגו' שלא ישלח מלאך אלא הקב\"ה בעצמו ילך אתנו, בקש עוד מרע\"ה עד סוף כל הדורות ואמר אם אין פניך הולכים אף לעתיד אל תעלנו מזה ונתקבלה תפלתו, אלא שלעתיד יהי' בהסתר ובהעלם ולא בהתגלות כמו שהי' בימיו, ומתורץ בזה קושיא (כ\"ה) הנ\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 87,
      "char_length": 751,
      "timestamp": "2025-02-06T19:34:01.959582"
    },
    {
      "id": "ki sisa_p88",
      "text": "ואפ\"ל עוד רמז בזה עפימ\"ש רז\"ל במסכת קידושין ודף ס\"ט ע\"א) וקמת ועלית אל המקום אשר יבחר ה' אלקיך (דברים י\"ז), מלמד שבית המקדש גבוה מכל ארץ ישראל וארץ ישראל גבוה מכל הארצות וכו' דכתיב (ירמי' כ\"ג) לכן הנה ימים באים נאם ה' ולא יאמרו עוד חי ה' אשר העלה את בני ישראל מארץ מצרים, כי אם חי ה' אשר העלה ואשר הביא את בני ישראל מארץ צפון ומכל הארצות אשר הדחתים שם עכ\"ד הגמ', וכמו\"כ מ\"ש משרע\"ה אל תעלנו מזה, הכוונה לעליית א\"י, וזה הי' תפילתו של משה רבינו אם אין פניך הולכים אל תעלנו, שהבטחתנו להכניסנו לא\"י אבל אין אנו רוצים בזה רק באופן שיהי' שכינת כבודך ות' בתוכינו, ונהי' דבוקים בו ית' ובתורתו הקדושה ושלא לזוז אף תנועה קלה בלי רצון הבוי\"ת ושלא ברצון התוה\"ק, וזולת זה אל תעלנו מזה וטוב יותר שנשאר במדבר וזה הי' בקשה ותפלה עד סוף כל הדורות, ויתורץ קושיא (כ\"ז) הנ\"ל מ\"ש מרע\"ה ילך נא ה' בקרבנו כי עם קשה עורף הוא, ויובן הנתינת טעם כי עם קשה עורף הוא והשליח אין בידו למחול, וא\"א להתקיים ח\"ו בלי מחילת עונות, ע\"כ בקש ילך נא ה' בקרבנו וסלחת לעוונינו וגו'.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 88,
      "char_length": 939,
      "timestamp": "2025-02-06T19:34:02.363190"
    },
    {
      "id": "ki sisa_p89",
      "text": "ויובנו דברי היוב\"ע במ\"ש ארום לות אפשר שאיסלק שכינת יקרי מביניכון ברם לא יהא יקרי שרי במדור משריתכון, ואין בזה שני הפכיות ותרתי דסתרי, אלא שגם מתחילה כשא\"ל הקב\"ה ושלחתי לפניך מלאך, הבטיחו השי\"ת שיהי' שכינת כבודו ית' אתנו אלא שיהי' בהסתר, וז\"ש שלא יסתלק לגמרי, אבל לא יהי' עמכון באתגליא, וגם דברי התרגום אונקלוס מתפרש בדרך זה, מ\"ש ארי לא אסלק שכינתי מבינך ר\"ל שלא יהי' מסולקת ח\"ו לגמרי אלא שיהי' בהסתר, ולפי\"ז א\"ש מ\"ש הכתוב כי לא אעלה בקרבך, ולכאורה לפי דברי התרגום הול\"ל כי לא אעלה מקרבך כנ\"ל, ואפשר הכוונה שא\"ל ות' לא אסלק שכינתי אבל יהי' בהסתר ולכוונה זו אמר בקרבך, אבל מרע\"ה לא הסכים שיהא שכינתו ית' בתוכינו בהסתר לבד, וע\"כ ביקש עוד ואמר אם אין פניך הולכים באתגליא אל תעלינו מזה, ובזה יתבאר כל הענין.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 89,
      "char_length": 702,
      "timestamp": "2025-02-06T19:34:02.882259"
    },
    {
      "id": "ki sisa_p90",
      "text": "ועתה נבוא לבאר ענין השגגה במנין דוד המלך ע\"ה, (עיין לעיל קושיא ג') דהנה כתב האור החיים הק' שנתחייבו ישראל בחטאם, וע\"כ כשבא המספר בהם בלי רשיון מאדון הכל, שלע בהם הדין ונפרע בהם עונם עייש\"ד: ואעפ\"כ היתה הגזירה בחסד וברחמים כמשה\"כ וינחם ה' על הרעה ויאמר למלאך המשחית הרף ידך וגו'. כי כבר הי' מוכן ומתוקן הצלה לדורות ע\"ו תפלת מרע\"ה בחטא העגל להקל הפורעניות ושיתקבל התשובה ע\"י הכח שהכין מרע\"ה בזכותו הגדול אז בחטא העגל, ונ\"ל הערה בדרך אפשר דחלילה לחשוב שדוד המלך טעה, ופלא בעיני מ\"ש הרמב\"ן בפ' במדבר דשגגת דוד הי' שמנה את ישראל שלא לצורך עיי\"ש (הובא לעיל), והרמב\"ן ז\"ל בעצמו שם ופ' במדבר) כתב וז\"ל לא הבינותי טעם המצוה הזאת, למה צוה בה הקב\"ה שימנו משה ואהרן את ישראל, וידיעת המספר למה הי' צורך בו וכתב שם בטעם הדבר, כי הבא לפני אבי כל הנביאים ואחיו אהרן קדוש ה\"נ והוא נודע אליהם בשמו, יהי' לו בדבר הזה זכות וחיים, ולכל ישראל בא זכות ע\"י המספר שימנו ע\"י משה ואהרן, כי ישימו עליהם עינם לטובה ויבקשו רחמים עליהם, כאמרם ה' אלקי אבותיכם יוסף עליכם ככם אלף פעמים ויברך אתכם וגו' עכדה\"ק, ולפי\"ז הי' צורך גדול בדבר, וישועה בשמו ושם אביו. והשפועו חיים וברכה לכל או\"א מישראל שבאו לפניו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 90,
      "char_length": 1072,
      "timestamp": "2025-02-06T19:34:03.226966"
    },
    {
      "id": "ki sisa_p91",
      "text": "וכתב הרמ\"ע מפאנו זלה\"ה (הובא דבריו בילקוט ראובני) וז\"ל כו תשא את ראש בני ישראל מרע\"ה הי' צופה ברוה\"ק מנין טיפין שבראש כאו\"א וזהו לגלגלותם, וכו' שהי' מביט כמה דורות ואנשים יעמדו ממנו, ולא עוד אלא שהי' מביט כמה פעמים יתגלגל כאו\"א מישראל, וזהו רז נגלה במלת לגלגלותם מלשון עיבור וגלגול עכ\"ל, וכעי\"ז כתב בספה\"ק נועם אלימלך עיי\"ש, ולכאורה מה המקרא חסר ומי יימר לן שהטעם שכתב הרמב\"ן ז\"ל במנין משה, לאו היינו טעמא דדוד, ובוודאי שלתכלית זה מנה דוד המלך ע\"ה את ישראל, כי גם במספר שבחומש הפקודים חתר הרמב\"ן ז\"ל למצוא טעם לצורך המנין, וקשי' לי' דמה צורך הי' ידיעת המספר, כי לא היה שעת מלחמה וכו', וניחא לי' כי הי' צורך להזכיר כאו\"א מישראל בשמו לפני משה ואהרן, כדי שישפיעו עליהם זכות וחיים וכו', וה\"ט שייכא גם אצל דוד, ולכאורה א\"כ מדוע קראו חז\"ל המנין שבימי דוד שלא לצורך, ומדוע נענשו ישראל בדבר ר\"ל ע\"י המנין, ובוודאי לא עשה דוד אף תנועה קלה כ\"א לרצון הבוי\"ת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 91,
      "char_length": 847,
      "timestamp": "2025-02-06T19:34:03.741699"
    },
    {
      "id": "ki sisa_p92",
      "text": "אמנם איכא לחלק בין המנין שהי' על ידו משה ובין המנין שהי' ע\"י דוד: דאצל משרע\"ה הי' ציווי השי\"ת למנותם, וכל ישראל ידעו שוש תועלת במנינם, ואף אם לא ידע כאו\"א טעם המנין, אבל ידעו שרצון הבוי\"ת למנותם ויספיק ידיעה הכללית שהמנין הוא לתועלת ולצורך, אבל המנין שהי' עזי דוד, הצורך והתועלת שבו הי' בהסתר ובהעלם, וכל ישראל לא ידעו בצורך המנין, ומצינו שיואב שאל את דוד ואדוני המלך למה חפץ בדבר הזה ולא השיב לו דוד, ולא גילה לו טעם המנין, כי לא נצטוה מן השמים ולא ניתן לו רשות לגלות הצורך בו וזה הו' החסרון במנין דודו מפני שבעיני ישראל ולמראית העין הי' המנין שלא לצורך.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 92,
      "char_length": 555,
      "timestamp": "2025-02-06T19:34:04.158921"
    },
    {
      "id": "ki sisa_p93",
      "text": "ויובן בהקדם מ\"ש האוהחה\"ק ופ' ראה) עה\"פ שמור ושמעת, ע\"ד מ\"ש רז\"ל בגמ' חגיגה (דף ע\"ו ע\"ב) אשכחי' רבה בר שילא לאליהו א\"ל מאי קא עביד הקב\"ה, א\"ל קאמר שמעתא מפומייהו דכולהו רבנן ומפומי' דר\"מ לא קאמר, א\"ל אמאי משום דקא גמר שמעתא מפומי' דאחר, אמר לי' אמאי ר\"מ רמון מצא תוכו אכל קליפתו זרק, א\"ל השתא קאמר מאיר בני אומר עכ\"ד הגמ'. והקשה האוהחה\"ק וא\"ת הקב\"ה מתחלה מה סבר ולבסוף מה סבר, שאין לומר שנעלם מעיני ה' ח\"ו הטעם שאמר רבה ביר שילא ר\"מ רימון מצא, אמנם דע כו יקפיד ה' על האדם בעשותו דבר שלא יהי' נקי בו אלא מה' ולא בעיני האדם, ויחשוב לו לחטא עד שיהי' נקי מה' ומאדם, ולזה כשעשה ר\"מ מעשה זה שלמד תורה מאדם שאינו כמלאך, זה סבב שלא הי' הקב\"ה אומר שמועה מפיו להיותו חסר השלימות, ואחר שנאמר בישיבה של מעה טעם לשבח במעשיו, נכנס בגדר והייתם נקיים מה' ומישראל, ולזה תיכף ומיד חזר ואמר שמעתא משמו עיי\"ש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 93,
      "char_length": 788,
      "timestamp": "2025-02-06T19:34:04.437522"
    },
    {
      "id": "ki sisa_p94",
      "text": "וכמו\"כ במנין דוד לפי שלא ידעו ישראל בצורך המנין, ולמראות העין הי' המנין שלא לצורך ע\"כ הי' פגם וקטרוג דאסור למנות את ישראל שלא לצורך כמ\"ש חז\"ל, ונענשו ישראל במגפה בצירוף הטעמים שכתב האוהחה\"ק שהיו ישראל חייבים בשביל עונם, ונסתבב מעשה זו ונפרע ממנו עונם, ואולי שאם הי' מונה אותם ע\"ו מחצית השקל, לו יהי' שנתחייבו ישראל ר\"ל, אבל השקלים היו כופר נפשם לה', והוא מ\"ש ז\"ל שאם הו' דוד מונה אותם ע\"ו השקלים לא הי' בהם נגף, אבל שורש הפגם הוא שלמראית העין הי' המנין שלא לצורך, והוא מ\"ש בתנחומא שהמנין שבימי דוד הי' שלא לצורך והכוונה לדרכינו שהפגם שבו הי' מפני הקטרוג שמנה את ישראל שלא לצורך, אע\"פ שהאמת לא הי' כן אבל למראית העין הי' כן וזה גרם הקטרוג, אולם דוד המלך ע\"ה ראה גודל התועלת למנות את ישראל, ואין אנו משיגים אף קצת דרכיו, ובלי ספק שהי' תועלת גדול לישראל והי' כוונת דוד המלך לעשות טובה ותיקון לישראל במנין הזה עד סוף כל הדורות, ובאמת הי' עצה ותיקון לגלות הטעם והתועלת לעיני כל ישראל, ואז לא יהי' עוד פגם ועונש בדבר, אלא שנסתבב הדבר להיות בדרך פגם ועונש מפני שנתחייבו ישראל לעונש כנ\"ל, גם לטעם שאמרו חז\"ל שמן השמים הכשילוהו מפני שאמר אם ה' הסיתך בי אבל באמת דוד המלך לא חטא ולא טעה ח\"ו, וכל האומר דוד טעה אינו אלא טועה, והפסוק בעצמו מעיד ואומר ויסת את דוד בהם לאמר לך מנה את ישראל וגו', הרי ברור בלי ספק שמן השמים נסתבב לו לעשות כן, ועשה עפ\"י הלכה וכדת של תורה, רק שלא ניתנה להתגלות כי הי' עונש מן השמים עליו ועל ישראל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 94,
      "char_length": 1314,
      "timestamp": "2025-02-06T19:34:04.840367"
    },
    {
      "id": "ki sisa_p95",
      "text": "וז\"ש רז\"ל ונתנו איש כופר נפשו לה' בימי משה, ולא יהי' בהם נגף בימי דוד, ויובן עפ\"י דרכינו הנ\"ל דמשה רבינו הכין כח הזכות לישראל עד סוף כל הדורות, וכמו שהבטיחו הקב\"ה דבכל שנה ושנה אתה עומד וזוקף את ראשן, ובמנין שהי' בימיו לא שלט בהם הנגף ע\"י כוחו וזכותו וכמו\"כ הכין להם הזכות והכח הזה עד סוף כל הדורות, ובימי דוד אף שנענשו ישראל הי' הגזירה בחסד וברחמים, כמשה\"כ וינחם ה' על הרעה ויאמר למלאך המשחית הרף ידך וגו', ובהעלם מרע\"ה אתנו בכל דור ודור, והקב\"ה יעזור שיתגלה כח הידיעה שהתפלל משה רבינו ע\"ה, באמרו הודיעני נא את דרכיך, שבקש על הידיעה ודביקות בו ית', ונזכה להיות דבוקים בו ית' בידיעה והשגה אמיתית, ולראות ישועה בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו במהרה בימינו אמן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 95,
      "char_length": 679,
      "timestamp": "2025-02-06T19:34:05.506960"
    },
    {
      "id": "ki sisa_p96",
      "text": "עוד אפ\"ל בהסבר ענין השגגה במנין דוד המע\"ה, עפי\"ד אאמו\"ר זלה\"ה (בקדויו\"ט פ' זו) דאיתא בספה\"ק ישמח משה לאא\"ז זצוקלה\"ה בפ' תולדות עה\"פ ויברכהו ד', דהא דאין הברכה שורה בדבר המדוד, כו ההנהגה הסתמיות היא השגחה מסותרת בהטבע והטבע הוא השליח, וא\"כ בדבר המדוד שאין יכול להיות נסתר אין בו ברכה, לפי\"ז מובן דאם יתן השי\"ת ברכה בעצמו ולא ע\"י השליח היינו הטבע ואינו מכוסה כלל בהטבעג ודאי און שום דבר יכול לעכב על ידו ושורה בכל אף בדבר המדוד וז\"ש ויברכהו ד' דייקא ולא ע\"ו שליח עכדה\"ק יעיי\"ש, ממוצא הדבר מצינו למידין דבאומה הישראלית שהשגחתו ית\"ש עליהם למעלה מן הטבע ולמעלה מן המזל כידוע, בודאי אין שום מנין ומדוד יכול להזיק להם ח\"ו, וא\"כ יש להבין למה הי' מן הצורך למנותם ע\"ו השקלים, הלא הי' באפשרי למנותם לגלגלותם. ויתבאר לדעתי עפימ\"ש הרמב\"ם ז\"ל במורה דהשגחה סיבת הדביקות עיי\"ש, וע\"כ כ\"ז שאנו דבוקים בו ות' בכל לב ונפש השגחתו ית' עלינו בכל ענינים למעלה מן הטבע ולמעלה מן המזל, משא\"כ אם ח\"ו נחסר מהדביקות אליו ית\"ש אז ישראל נתונים קצת תחת הטבע וכו', וע\"י שחטאו ישראל בעגל וכו' לא היו דבוקים בו ית\"ש בכל לב ונפש וכו', ע\"כ אם יפקוד אותם בגלגלותם ח\"ו יהי' בהם נגף ע\"כ היתה הציווי למנותם ע\"י השקלים דייקא עכל\"ק.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 96,
      "char_length": 1089,
      "timestamp": "2025-02-06T19:34:05.848106"
    },
    {
      "id": "ki sisa_p97",
      "text": "ועד\"ז אפ\"ל לעניננו כי בדוד כתיב וד' עמו, והי' מושגח מאתו ות' בלא השליח, גם בחי' הדור הי' גדול וגבוה מאוד כמבואר בדרז\"ל, ע\"כ חשב דהמע\"ה שבכה\"ג אין צורך למנותם ע\"ו שקלים דייקא, ומה שהקשה האוה\"ח הק' מה נענה בסנהדרין ומה נענה בכל איש ישראל כשראו שבאו למנותם, הי' להם לחרוד חרדה גדולה ואימת מות יפלו עליהם ויצעקו על הדבר לפני יואב ולפני המלך וכו' בטענה הנשמעת ולא יהי' בהם נגף בפקוד אותם: אמנם קושיא זו לא קשה כ\"כ, כו הי' להם על מי שיסמוכו, וכל מעשיו הי' ברוה\"ק כמו שהעידו חז\"ל שהלכה כמותו בכל מקום, אלא שאעפ\"כ הי' איזה פגם ע\"ד וסביביו נשערה מאוד, וג\"ז הי' סיבה מן השמים להעלים ממנו בחי' זו. ועוד י\"ל שמן השמים העלימו מדהע\"ה שחטאו ישראל. וכבר אינם במדרגה גבוהה זו להיות נמנים בלא השקלים וכמ\"ש לעיל האה\"ח הקדוש שנתחייבו ישראל בחטאם ושלט בהם הנגף והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 97,
      "char_length": 745,
      "timestamp": "2025-02-06T19:34:06.374929"
    },
    {
      "id": "ki sisa_p98",
      "text": "וידבר ד' אל משה לאמר כי תשא את ראש בנ\"י לפקודיהם ונתנו איש כופר נפשו לד' בפקוד אותם ולא יהי' בהם נגף בפקוד אותם, יל\"ד על כפל אומרו בפקוד אותם ב\"פ, גם הרי כל המצות צריך לעשותן לשמו ית' שצונו במצותיו, ומה צורך לפרע במצוה זו שיתנו השקלים כופר נפשו לד'.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 98,
      "char_length": 249,
      "timestamp": "2025-02-06T19:34:06.774170"
    },
    {
      "id": "ki sisa_p99",
      "text": "ב) זה יתנו כל העובר על הפקודים וגו' יל\"ד דכבר אמור ונתנו איש כופר נפשו וגו', וכפל הנתינות למה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 99,
      "char_length": 94,
      "timestamp": "2025-02-06T19:34:06.947765"
    },
    {
      "id": "ki sisa_p100",
      "text": "ג) בירושלמי שקלים ופ\"א) כל העובר על הפקודים וגו' כל דעבר בימא יתן, וצ\"ב קישור מצות השקלים להעברת הים דייקא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 100,
      "char_length": 107,
      "timestamp": "2025-02-06T19:34:07.043544"
    },
    {
      "id": "ki sisa_p101",
      "text": "ד) במד\"ר (פרשה ל\"ט סי' א') א\"ל הקב\"ה חייבין לי ישראל מה שלוו הימני שנא' כי תשא כ\"ד כו תשה בריעך, אמור להם שיפרעו מה שהם חייבים לי וכו' ואשלמה להם שנא' (הושע ב) והי' מספר בנ\"י כחול הים עכ\"ד המדרש וצ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 101,
      "char_length": 200,
      "timestamp": "2025-02-06T19:34:07.148342"
    },
    {
      "id": "ki sisa_p102",
      "text": "ונל\"פ בהקדם דברי התנחומא (סי\"א) ונתנו איש כפר נפשו כיון ששמע משה אמר עור בעד עור וכל אשר לאיש ותן בעד נפשו (איוב ב) א\"ר יהודה בר אלעאי כששמע משה ורד להורות ואמר בלבו מצאנו שפדיון נפש אדם ככר כסף שנא' (מלכים א' כ') והיתה נפשך תחת נפשו או ככר כסף תשקול, כל או\"א מישראל יהא נותן ככר כסף איר יוחנן ממי למד ממוציא שם רע, אמר הכתוב וענשו אותו מאה כסף וגו' ואנו הוצאנו שם רע ואמרנו לעגל אלה אלהיך ישראל וכו' רשב\"ל אמר מן האונס למד משה שנא' ונתן האיש השוכב עמה לאבי הנערה חמשים כסף וכו', ר\"ו בר סימון אמר משור נגח למד שנא' כסף שלשים שקלים וכו' כל אחד ואחד ותן ל' שקלים, יודע הקב\"ה מה שבלבו של משה והראהו באצבעו וא\"ל משה זה יתנו כזה יתנו עכ\"ד המדרש ובילקוט (רמז שפ\"ו) הגירסא א\"ל הקב\"ה חייך לא ככר כסף ולא מאה כסף ולא חמשים שקלים ולא שלשים שקלים אלא זה יתנו וכו', וראוי להבין כיון שהי' סברת משרע\"ה להורות כן מדרשת הכתובים, בודאי הוא דעת תורה אמיתית, והי' ראוי ליתן ממון הרבה לפדיון נפש כמצות התוה\"ק בכל אלו, ומדוע לא הסכים השי\"ת לסברתו ובחר במיעוט מחצית השקל דייקא, גם היכן מרומז בקרא שרצה משרע\"ה לדון ולהורות כן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 102,
      "char_length": 1003,
      "timestamp": "2025-02-06T19:34:07.294019"
    },
    {
      "id": "ki sisa_p103",
      "text": "ויתבאר בהקדם מ\"ש בספה\"ק דברי יחזקאל עה\"ת (בהשמטות) לפרש הכתוב במספר ארבעים יכנו ודרשו ז\"ל ל\"ט, יש לדייק למה כתוב בתורה ארבעים אם די ל\"ט, אמנם איתא בש\"ס (ברכות ז' ע\"א) טובה מרדות אחת בלבו של אדם יותר ממאה מלקיות (פרש\"י ז\"ל מרדות אחת לשון רדוי והכנעה שאדם שם על לבו מאליו), ומובן אם האדם העובר ח\"ו לא תעשה, מיישב עצמו מה עשה שמרד נגד הבורא ית\"ש וכו', הלא כל נפשו אינו שוה אז בעיניו נגד העבירה שעשה וכו', ובעת שגמרו המלקות כאב לבו הכו בזה הצער שסבל בעת לקותו די להתכפר עונו שמרד נגד ממ\"ה הקב\"ה, מי יתן ועוד ילקו אותו יותר ויותר, מובן כי המרדות שיש בלבו אחר גמר המלקות פועל בלבו שפלות והכנעה יותר ממה שהי' לו בעת קבל המלקות, ובזה מיושב כי באמת יש כאן ארבעים, היינו ל\"ט מלקות שהלקו אותו, ואחל הכאה המרדות בלבו, שיש לו ממה שאין לוקין אותו יותר כראוי לאיש שמרד נגד ממ\"ה הקב\"ה עכ\"ל, ועד\"ז יובן לעניננו דלפי האמת הי' ראוי שיתנו ישראל לפדיון נפשם ככר כסף או מאה כסף וכו', כאשר רצה משרע\"ה להורות מן הכתובים וסברא אמיתית הוא ודעת תורה שלימה וברורה, אלא שהבוי\"ת בחר במיעוט שיתנו רק מחצית השקל בלבד, ועי\"ז יהי' לישראל הכנעה ושפלות וישימו על לבם שלא יצאו ודי חובתם כפי הצורך לכפרת נפשם, וזהו רצון הבוי\"ת ולב נשבר ונדכא אלקים לא תבזה, והוא חשובה יותר ממה שהאדם נותן בפועל ממש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 103,
      "char_length": 1160,
      "timestamp": "2025-02-06T19:34:07.787266"
    },
    {
      "id": "ki sisa_p104",
      "text": "וז\"פ הכתוב ונתנו איש כופר נפשו לד', ע\"ד שדרשו רז\"ל (שבועות ט' ע\"א) ושעיר עזים לחטאת לד', שהוא מכפרת על שאין בה ידיעה בתחלה ולא בסוף שאין מכיר בו אלא ד\"ג כמו\"כ יאמר הכתוב כאן ונתנו איש כופר נפשו לד\"נ ר\"ל עיקר הנתינה הוא מחשבת ההכנעה שאינו מכיר בו אלא ד', ואין הכוונה כאן על הנתינה בפועל, כו בתחלה מקדים הכתוב את העיקר, והוא מחשבת ההכנעה ואותה ותן האדם כופר נפשו לד' בפקוד אותם מלשון חסרון כמו ולא נפקד ממנו איש, ויחשוב בלבו חסרונו שמרד נגד ממ\"ה הקב\"ה, ויצטער שלא יוכל להרבות בפדיונו יותר ועי\"ז ולא יהי' בכם נגף בפקוד אותם, ואח\"כ אמר הכתוב זה יתנו כל העובר על הפקודים מחצית השקל וגו', ר\"ל שזה יתנו בפועל ממש, וא\"ש כפל הנתונות שבמקרא, כי מאמר ונתנו איש כופר נפשו לד' הכוונה בו על הנתינה במחשבה והוא העיקר ע\"כ הקדימו הכתוב ומ\"ש זה יתנו וגו' מחצית השקל, הציווי בזה על הנתינה בפועל והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 104,
      "char_length": 781,
      "timestamp": "2025-02-06T19:34:08.356488"
    },
    {
      "id": "ki sisa_p105",
      "text": "ועד\"ז אפ\"ל דברי הירושלמי זה יתנו כל העובר על הפקודים כל דעבר בימא ותן, עפימ\"ד במדרש תנחומא (פ' תרומה ס\"ה) וזאת התרומה אשר תקחו מאתם זהב, א\"ל הקב\"ה אין אתם מביאין משלכם אלא מביזת הים שנתתי לכם וכו', ועכ\"ז ירמוז הכתוב כאן כל דעבר בימא יתן, להגדיל הכנעתם שהוא עיקר כופר נפשם לד', שיתבוננו שאף אותה המעט מחצית השקל שנותנין בפועל לכפרת נפשם אינו משלהם אלא מביזת הים שנתן להם הקב\"ה, ועי\"ז יתרבה הכנעתם בידעם שאינם נותנים כלום.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 105,
      "char_length": 420,
      "timestamp": "2025-02-06T19:34:08.730316"
    },
    {
      "id": "ki sisa_p106",
      "text": "ובזה יובן דברי המדרש (לעיל קושיא ד') א\"ל הקב\"ה חייבין לי ישראל אמור להם שיפרעו וכו' ואשלמה להם שנא' והי' מספר בנ\"י כחול הים, הכוונה בזה לדרכנו שידעו ישראל כשיתנו מחצית השקל, שעדיין לא נתנו ידי חובתם, והי' ראוי שיתנו ככר כסף כסברת משרע\"ה, ועדיין הם חייבים, ובזה שיכנע לבם יפרעו מה שחייבין לי, כי אין חפץ לד' בכסף והכנעת הלב הוא העיקר, ואשלמה להם והי' מספר בנ\"י כחול הים: עפימ\"ש ק\"ז הישמח משה זלה\"ה (בפ' שמות) בשם המפרשים לתרץ סתירת המקראות דכתיב והי' מספר בנ\"י וגו' וכתיב אשר לא ימד ולא יספר, ותירצו דמצינו דא' שקול כנגד כמה וכמה, כמו משה שקול כנגד כל ישראל וכו' ובדור המדבר דרשו רז\"ל שכל א' מהן הי' שקול כאלף איש ומשה כנגד כולן ולפי\"ז אין ברי' יכולה לידע משקל החשיבות של איש ישראל, כי זה נשקל רק בדעתו של קל דיעות בזה עכ\"ד המפרשים, וז\"ש ואשלמה להם והי' מספר בנ\"י וגו', שע\"י שיפרעו לו במה שיתרבה הכנעתם כנ\"ל, בזה יתגדל חשיבותם עד למאוד, וכל א' שקול כנגד כמה וכמה, והי' מספר בנ\"י כחול הים, כי א\"א לעמוד על מספרם, דאין כל ברי' יכולה לידע משקל החשיבות של איש ישראל והבן. אל",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 106,
      "char_length": 969,
      "timestamp": "2025-02-06T19:34:08.954079"
    },
    {
      "id": "ki sisa_p107",
      "text": "וידבר ה' אל משה לאמר כו תשא את ראש וגו', במדרש (תנחומא סי' ג') אמר משה לפני הקב\"ה משאני מת אין אני נזכר, א\"ל הקב\"ה חייך כשם שאתה עומד עכשיו ונותן להם פ' שקלים, ואתה זוקף את ראשן, כך בכל שנה ושנה שקוראין אותה לפני כאלו אתה עומד שם וכו' וזוקף את ראשן עכ\"ד המדרש וצ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 107,
      "char_length": 265,
      "timestamp": "2025-02-06T19:34:09.431401"
    },
    {
      "id": "ki sisa_p108",
      "text": "ונל\"\"פ עפי\"ד הגמ' ערובין (דף נ\"ד ע\"א) א\"ר אלעזר מ\"ד חרות על הלוחות אלמלי לא נשתברו לוחות הראשונות, לא נשתכחה תורה מישראל, פירש\"י חרות משמע חקוק ואינו נמחק לעולם וכו' עיי\"ש, נמצא דע\"י חטא העגל שגרמה שבירת הלוחות נסתבב שכחת התורה, ולעתיד שיתוקן חטא העגל לא ישתכח התורה עולמית, והנה אף שפרה אדומה וכן השקלים באים לכפרה על עון העגל, מ\"מ לא נמחק העון לגמרי, ועדיין רושם החטא שמור לדורות עד לעתיד שיהי' עולם התיקון, וע\"כ עדיין השכחה שולטת בעולם אלא שאעפי\"כ מגין עלינו שלא תשתכח לגמרי ח\"ו, וכבר פירשתי דברי המדרש פליאה מה ראה קרח לחלוק על משה פרשת פרה אדומה ראה וצ\"ב, ואפ\"ל דזה היתה טענתו של קרח, דהנה אחר חטא העגל המליץ משרע\"ה זכות על ישראל, וטען ואמר לו צוית ולא להם שנא' אנכי ה' אלקיך, אמנם קרח טען ההיפך כפירש\"י ז\"ל עה\"פ כו כל העדה כולם קדושים כולם שמעו בסיני אנכו ה' אלקיך, א\"כ לפי טענתו נתעורר שוב חטא העגל, וז\"ש מה ראה קרח לחלוק על משה, ולעורר על טענת לי צוית ולא להם, ותירצו פרשת פרה אדומה ראה שאמרז\"ל (במדבר רבה י\"ע סי' ח') תבא אמה ותקנח צואת בנה, וחשב נתכפר חטא העגל ע\"ו הפרה, וע\"כ חזר לטעון כל העדה שמעו אנכי ה' אלקיך, אבל באמת טעה, דעדיין לא נתכפר לגמרי ורושם החטא עדיין שמור לדורות, והנה כ\"ז שהי' משרע\"ה קיים הגין על ישראל בגודל קדושתו שינצלו משכחת התורה, אמנם חשש שמא משאנו מת אין אני נזכר שיבואו לידי שכחת התורה ח\"ו ולא יהי' נזכר עוד ע\"ו שמועותיו ניחמו הקב\"ה וא\"ל כשם שאתה עומד עכשיו ונותן להם פ' שקלים ואתה זוקף את ראשן, כך בכל שנה ושנה שקוראין אותה לפני כאלו אתה עומד שם וזוקף את ראשן, שאותן שקלים הם מכפרים לדורות עולם, כמ\"ש הכתוב והי' לבני ישראל לזכרון לפני ה' לכפר על נפשותיכם, ומצינו בגמ' (ברכות דף ס\"ב ע\"ב) שהי' נגף בימי דוד על שמנה את ישראל, ודרשו ז\"ל הפסוק ובהשחית ראה ה' וינחם, מאי ראה, ר' יצחק נפחא אמר כסף כפורים ראה, פירש\"י כדכתיב והי' לבנ\"י לזכרון לכפר וכו' ובכח הקריאה נתעורר זכותו וכאלו עומד שם וזוקף את ראשינו להצילנו משכחת התורה, וה' יאיר עינינו בתוה\"ק אכיה\"ר.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 108,
      "char_length": 1786,
      "timestamp": "2025-02-06T19:34:09.600077"
    },
    {
      "id": "ki sisa_p109",
      "text": "עוד אפ\"ל בביאור דברי המדרש הנ\"ל, עפימ\"ש האלשיך בשם הר\"ש אלקביץ זלה\"ה בטעם הרמז של מחצית השקל שהוא להורות את ישראל יחס אחדותם, בל יעלה על לב איש מהם שהוא נפרד מחבירו, כי אם כאלו כל אחד חצי, ובהתחברו עם כל או\"א מישראל נעשה אחד שלם, ע\"כ כל אחד יביאה מחצית עיי\"ש, והנה אמרז\"ל (סוטה דף י\"ד ע\"א) מפני מה נתאוה משה להכנס לארץ, וכי לאכול מפרי' הוא צריך. אלא שנשתוקק לקיים מצות התלויות בארץ וע\"כ חשש משרע\"ה שמא משאני מת און אני נזכר, רי\"ל מאחר שנגזר עליו מיתה ולא יכנס לארץ לא יהי' נזכר שמו במצוות התלויות לפי שלא זכה לקיימם בפועל בארץ, לזה נוחמו השי\"ת במצות מחצית השקל שרומז על ההתחברות, ובצירוף כל ישראל, כאו\"א יש לו חלק גם במצות חבירו, ומכ\"ש משרע\"ה שהוריד התורה ומסרה לישראל, הוא היסוד והגורם לקיום התוה\"ק, ויזכר שמו על ידי מצותם והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 109,
      "char_length": 729,
      "timestamp": "2025-02-06T19:34:10.476905"
    },
    {
      "id": "ki sisa_p110",
      "text": "כי תשא את ראש בנ\"י וגו', במדרש (תנחומא סי' ה') ר' יונה פתח כי אלקים שופט זה ישפיל וזה ירום (תהלים ע\"ה) וכו', וצ\"ב הקישור.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 110,
      "char_length": 121,
      "timestamp": "2025-02-06T19:34:10.867703"
    },
    {
      "id": "ki sisa_p111",
      "text": "ונל\"פ עפימ\"ש האלשיך בשם הר\"ש אלקביץ זלה\"ה בטעם הרמז של מחצית השקל שהוא להורות את וחס אחדותם, בל יעלה על לב איש שהוא נפרד מחבירו, כי אם כאלו כל אחד חצי, ובהתחברו עם כל אחד ואחד מישראל נעשה שלם, ע\"כ כל אחד יביאה מחצית עכ\"ד ז\"ל, והנה אם הצדיק מתחבר אל הפשוטי עם, הרי זה הורדה אליו, שצריך להוריד עצמו מקדושתו, אבל זהו הרמה לגבי פשוטי העם, שהצדיק בהתחברותו מעלה ומגביה אותם משפלותם, וזהו תכלית ההתחברות ורצון הבוית\"ש, ויש לרמוז זה בדברי המדרש זה ישפיל וזה ירום. שע\"י ההתחברות הנרמז במצות מחצית השקל, צריך הצדיק להשפיל עצמו ולהרים הפשוטו עם, ובאמת הורדה זו לצדיק צורך עלי' הוא, שאם משפיל עצמו בשביל להעלות הפשוטי עם ממדריגתם, השי\"ת נותן לו התרוממות, וזה שכרו שנתעלה במדריגתו עוד יותר, ויש לו חלק ונחלה גם בעבודתם שנתעלו על ידו, ויהי' הפי' זה ישפיל וזה ירום שניהם בנושא א\"נ דע\"י שהצדיק משפיל עצמו, זה ירום ע\"י זוכה להתרוממות יותר .",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 111,
      "char_length": 824,
      "timestamp": "2025-02-06T19:34:10.971257"
    },
    {
      "id": "ki sisa_p112",
      "text": "כי תשא את ראש בני ישראל לפקודיהם וגו' ולא יהי' בהם נגף בפקוד אותם, במדרש (תנחומא סי' ה') כו תשא את ראש, ר' יונה פתח כו אלקים שופט זה ישפיל וזה ירום וכו', וצ\"ב הקישור.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 112,
      "char_length": 166,
      "timestamp": "2025-02-06T19:34:11.397695"
    },
    {
      "id": "ki sisa_p113",
      "text": "ויתבאר בהקדם לפרש מקראות דלהלן אנא חטא העם הזה חטאה גדולה וגו' ועתה אם תשא חטאתם וגו', יל\"ד דאדרבה הי' לו להקטון מדת החטא ולא להגדילו כ\"כ לומר חטא העם הזה חטאה גדולה, גם צ\"ב וכי בשביל שחטאו חטאה גדולה יתחייב שישא השם את חטאתם ומה טעם בטענה זו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 113,
      "char_length": 243,
      "timestamp": "2025-02-06T19:34:11.526499"
    },
    {
      "id": "ki sisa_p114",
      "text": "ב) להלן ויאמר אם נא מצאתי חן בעיניך ילך נא ה' בקרבנו כי עם קשה עורף הוא וסלחת וגו' צ\"ב מאו נתינת טעם הוא זה כי עם קשה עורף הוא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 114,
      "char_length": 127,
      "timestamp": "2025-02-06T19:34:11.676585"
    },
    {
      "id": "ki sisa_p115",
      "text": "ונל\"\"פ דהנה איתא בגמ' וע\"ז דף ד' ע\"ב) לא היו ישראל ראויים לאותו מעשה אלא בשביל להורות תשובה לרבים וכו', והנה מצינו בדרז\"ל כשישראל אינם ברום המעלה ח\"ו מעמיד הקב\"ה עליהם מלך קשה כהמן לעוררם לתשובה, אמנם בדור שפל כדורינו לא יועיל מלך קשה לעורר לבבות בנו ישראל, כי מחמת גודל חשכת הצרות אשר כבר סבלנו בעוה\"ר לבותינו אטומים וסתומים כאבן, ואדרבה יקלקל מלך קשה כמ\"ש ולא שמעו אל משה מקוצר רוח, והנה בימי מרדכי הי' מועיל להם מלך קשה כמ\"ש רז\"ל מגילה י\"ד ע\"א) גדולה הסרת טבעת וכו' דהם היו קדושים וטהורים לה', רק התרחקו קצת בחטא קל כמו שאמרו בגמ' משום שנהנו מסעודתו של אותו רשע ולא הי' החשכות גדול כל כך, ע\"כ הועיל להם מלך קשה לעורר לבבם, אבל כעת שלבבינו רחוקים מה' מחמת גודל החטאים ופשעים עוד יקלקל מלך קשה ואין עצה אחרת רק שיאיר ה' לבבות בני ישראל ואז נעשה תשובה מגודל השגת האור הגדול. ועד\"ז טען משה רבינו ע\"ה אנא חטא העם הזה חטאה גדולה, ומחמת גודל החטא, נתרחק לבבם מהבוית\"ש, אם כן אינו מועיל מלך קשה ואין עצה רק ילך נא ה' בקרבינו ויאיר לבבינו, וזה טעם הכתוב ילך נא ה' בקרבנו כי עם קשה עורף הוא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 115,
      "char_length": 984,
      "timestamp": "2025-02-06T19:34:11.782322"
    },
    {
      "id": "ki sisa_p116",
      "text": "ועד\"ז יל\"פ הפסוק כי תשא את ראש בני ישראל לפקודיהם מלשון חסרון כמו ולא נפקד ממנו איש ור\"ל דמחמת חסרונם הגדול ראוי להיות להם נשיאות ראש, ולא יהי' בהם נגף בפקוד אותם, וזה ביאור דברי המדרש זה ישפיל וזה ירום ר\"ל מחמת גודל שפלותם זה ירום ראוי להיות להם הרמת ראש וה' ירום קרן עמו ברחמים וחסדים, ונזכה כלנו יחד לראות בשמחת כל ישראל וישועתן אכיה\"ר.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 116,
      "char_length": 339,
      "timestamp": "2025-02-06T19:34:12.338736"
    },
    {
      "id": "ki sisa_p117",
      "text": "כי תשא את ראש בנ\"י לפקודיהם וגו', איתא בגמ' מגילה (דף י\"ג ע\"ב) אמר ר\"ל גלוי וידוע לפני מו שאמר והי' העולם, שעתיד המן לשקול שקלים על ישראל, לפיכך הקדים שקליהן לשקליו וכו', יל\"ד הכוונה במ\"ש האי לישנא מי שאמר והי' העולם ולא א' משאר שמותיו או כנויו ית', גם הלשון הקדים צ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 117,
      "char_length": 269,
      "timestamp": "2025-02-06T19:34:12.526942"
    },
    {
      "id": "ki sisa_p118",
      "text": "ואפ\"ל בהקדם מ\"ש התוס' במגילה (דף ט\"ז ע\"א) ד\"ה ודחי עשרה אלפי ככרי כספא, וז\"ל שמעתי שעשרה אלפי ככרי כסף עולין חצי שקל לכל א' מישראל, שהיו שש מאות אלף כשיצאו ממצרים, ואמר שיתן לאחשורוש כל פדיונם ודוק ותשכח עכ\"ד התוס' וכבר צווחו בי' קמאי שדמי פדיונם לא יעלה כ\"א למאת ככר, ובהגהות הב\"ח תירץ דימי שנותינו בהם שבעים שנה, ומבן כ' ולמעלה נתנו כופר נפש, והמן נתן כופר נפש לכל א' מישראל על חמשים שנה מבן כ' עד שבעים עיי\"ש החשבון, אולם לפי\"ז לשון הקדים לא א\"ש שהרי המן נתן העשרת אלפים בבת אחת וישראל נתנו שקליהם בהמשך זמן של נ' שנה, ואפ\"ל דנחשב להם המחשבה כמעשה, ומשקבלו עליהם ישראל לקיים מצותו ית' ליתן מחצית השקל בכל שנה, הבוי\"ת מחשיבו להם כמעשה, ולפי\"ז כבר הקדימו ישראל שקליהם לשקליו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 118,
      "char_length": 676,
      "timestamp": "2025-02-06T19:34:12.712767"
    },
    {
      "id": "ki sisa_p119",
      "text": "והנה הך מלתא דמחשבה כמעשה נלמד מבריאת העולם, עפימ\"ש ז\"ל במס' ר\"ה (דף ל\"ב ע\"א) בי' מאמרות נברא העולם, והקשו ויאמר דבראשית ע' הוו, ותירצו דבראשית נמי מאמר דכתיב בדבר ה' שמים נעשו וגו', ומפורש בזוה\"ק דאמירה הראשונה דבראשית, הי' ברזא דמחשבה ולא בדיבור (עיין בדברינו פרשת בראשית עמוד פ'), ואמרז\"ל בגמ' שבת (דף קי\"ט ע\"ב) איר אלעזר מניין שהדיבור כמעשה שנאמר בדבר ה' שמים נעשו עכ\"ד הגמ' וכיון דבריאת שמים וארץ היתה ברזא דמחשבה כמבואר בזוה\"ק, א\"כ נשמע משם דמחשבה כמעשה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 119,
      "char_length": 460,
      "timestamp": "2025-02-06T19:34:13.081491"
    },
    {
      "id": "ki sisa_p120",
      "text": "ובזה אפ\"ל הכוונה בדברי הגמ' הנ\"ל גלוי וידוע לפני מי שאמר והי' העולם שעתיד המן לשקול שקלים על ישראל, ר\"ל שעתידין לשקול אף על העתיד, לפיכך הקדים שקליהם לשקליו, ע\"ו שקבל הבוי\"ת שכר המחשבה כמעשה, ולזה נקט מי שאמר והי' העולם, דממודה זו נלמד שהמחשבה כמעשה, ובערך זה קדמה שקליהם והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 120,
      "char_length": 277,
      "timestamp": "2025-02-06T19:34:13.318315"
    },
    {
      "id": "ki sisa_p121",
      "text": "בירושלמי שקלים ופ\"א) כל העובר על הפקודים וגו' כל דעבר בימא ותן, וצ\"ב מה ענין מצות שקלים אל העברת הים.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 121,
      "char_length": 101,
      "timestamp": "2025-02-06T19:34:13.481170"
    },
    {
      "id": "ki sisa_p122",
      "text": "ב) במדרש (הובא בישמח משה) הים ראה וינוס מה ראה ברייתא דר' ישמעאל ראה, עוד במדרש מה ראה ישראל באים ורכוש מצרים בידם וצ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 122,
      "char_length": 120,
      "timestamp": "2025-02-06T19:34:13.569200"
    },
    {
      "id": "ki sisa_p123",
      "text": "ונל\"פ עפימ\"ד במדרש (ילקוט ראובני) שהי' קטרוג גדול על ישראל בקרי\"ס, שטען ס\"מ ושר של מצרים הללו עובדי ע\"ז והללו וכו', ומבואר בדברי רז\"ל שניצולו ישראל ע\"ש זכות העתיד שעתידין לקבל התורה והמצות משא\"כ המצרים, ובעלה טענת מה בין אלו לאלו, עוד יש הבדל רב ביניהם לסתור טענת מה בין אלו לאלו, עפומ\"ד במכילתא (פ' משפטים) אם כופר יושת עליו ונתן פדיון נפשו, ר' ישמעאל אומר בא וראה רחמיו של מו שאמר והי' העולם וכו', שאדם קונה את עצמו בממון מידי שמים שנא' כו תשא את ראש בנ\"י לפקודיהם וכו', אומה\"ע אין להם פדיון שנא' (תהלים מ\"ז) אח לא פדה יפדה איש לא יתן לאלקים כפרו, חביבין היו ישראל המאמינים בהקב\"ה שנתן מצרים תחתיהם כפרה תחת נפשותם שנא' נתתי כפרך מצרים עכ\"ד המכילתא, ומבואר בגמ' (ב\"ב ו' ע\"ב) דזכות הצדקה אינו אלא לישראל, ודרשו כן מהפסוק (משלי י\"ד) צדקה תרומם גוי אלו ישראל, דכתיב ומי כעמך ישראל גוי אחד בארץ, וחסד לאומים חטאת כל צדקה וחסד שאומות עובדי כוכבים עושין חטא הוא להם, ובפר\"ד (דרוש י\"ז) האריך לבאר דמצות הצדקה אינו אלא בישראל לטעם שנקראו בנים למקום, אבל אומה\"ע שהם עבדים חטא הוא להם עיי\"ש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 123,
      "char_length": 983,
      "timestamp": "2025-02-06T19:34:13.669823"
    },
    {
      "id": "ki sisa_p124",
      "text": "ובזה יתבאר דברי הגמ' (שם) א\"ר אבהו אמר משה לפני הקב\"ה רבש\"ע במה תרום קרן ישראל, אמר לו בכו תשא (פרש\"י אם באת לשאת ראשם בהגבהה קח מהם כופר לצדקה) עכ\"ד הגמ', דהצדקה הוו כופר נפש להצילם מן הקטרוג והכלי' ח\"ו, וכמו\"כ השקלים הם כופר נפשם לד' שהיו ישראל חייבים לשמים לסיבת עון העגל, וע\"י השקלים בצירוף התשובה ניצולו מן הקטרוג, וכמו\"כ מצינו שניצולו ישראל מגזירת כלי' בימי המן ע\"ו זכות השקלים כמ\"ש ז\"ל (מגילה י\"ג ע\"ב) אמר ר\"ל גלוי וידוע לפני מי שאמר והי' העולם, שעתיד המן לשקול שקלים על ישראל, לפיכך הקדים שקליהן לשקליו וכו' עיי\"ש, וכמו\"כ בקרי\"ס נצולו מן הקטרוג מה\"ט, דהנה תשובה תפלה וצדקה מעבירין את רוע הגזירה, וישראל עשו תשובה וצעקו אל ה' והרבו תפלה, וצדקה עמדה להם זכות העתיד שעתידין לשקול שקלים ולהרבות צדקה שהוא כופר נפש לד' להצילם מן הכלי' ח\"ו, משא\"כ אומה\"ע דלא מהני להו תשובה וגם צדקה חטא הוא להם, ובעלה טענת מה בין אלו לאלו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 124,
      "char_length": 824,
      "timestamp": "2025-02-06T19:34:14.156503"
    },
    {
      "id": "ki sisa_p125",
      "text": "ובזה יתבאר דברי המדרש הים ראה וינוס מה ראה ברייתא דר' ישמעאל ראה, ר\"ל דברי ר' ישמעאל במכילתא הנ\"ל בא וראה רחמיו של מי שאמר והי' העולם, שאדם קונה את עצמו בממון מידי שמים וכו', ואומה\"ע אין להם פדיון וכו' ועי\"ז נעשו המצריים כפרם של ישראל ונתבטל טענת הללו והללו וע\"כ וינוס, ויבואר ג\"כ אידך המדרש ראה ישראל באים ורכוש מצרים בידם, ויש בידם ממון לפדות נפשם בצדקה ע\"כ וינוס, וא\"ש דברי המדרש כל דעבר בימא ותן, דבזכות השקלים נקרע להם הים, וע\"כ דין הוא דכל דעבר בימא יתן פדיון נפשו והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 125,
      "char_length": 476,
      "timestamp": "2025-02-06T19:34:14.559089"
    },
    {
      "id": "ki sisa_p126",
      "text": "העשיר לא ירבה והדל לא ימעיט ממחצית השקל לתת את תרומת ה' לכפר על נפשותיכם, יל\"ד מ\"ט הקדימו הכתוב לעשיר להזהירו בלאו דלא ירבה, הלא שניהם נותנים בשוה ושניהם באזהרה בלאו, ומה יתרונו של העשיר להקדימו בקרא לפני העני, גם דלעשיר בניקל לו לקיים ציווי השי\"ת שלא ירבה, משא\"כ העני שישתדל לקיים הציווי של לא ימעיט, לפעמים לא יעלה בידו כ\"כ בניקל ויצטרך לחסוך המאכל מפיו בכדי להשלים הסכום למחצית השקל ולא לעבור על הלאו של לא ימעיט נמצא מצותו גדולה דלפום צערא אגרא והי\"ל להקדים העני.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 126,
      "char_length": 467,
      "timestamp": "2025-02-06T19:34:14.803960"
    },
    {
      "id": "ki sisa_p127",
      "text": "ונל\"פ עפי\"ד הגמ' (זבחים דף פ' ע\"א) אם נתערב דם מתן ארבע בדם של מתנה אחת ר\"א אומר ינתנו במתן ארבע, ור\"י אומר ינתנו במתנה אחת, א\"ל ר\"א הרי הוא עובר על בל תגרע, אמר לו ר\"י הרי הוא עובר על בל תוסיף וכו' א\"ר יהושע כשנתת עברת על בל תוסיף ועשית מעשה בידך, כשלא נתת עברת על בל תגרע ולא עשית מעשה בידך, פירש\"י ואינו דומה עושה מעשה ליושב ואינו עושה ואיסור בא מאליו, וכמו\"כ לענינינו דהלאו שלא ירבה חמור יותר מהלאו שלא ימעיט, שהעשיר אם ירבה עובר בקום ועשה, משא\"כ העני אם ימעיט אינו עובר כ\"א בשב ואל תעשה, ואפשר דלטעם זה הקדימו הכתוב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 127,
      "char_length": 521,
      "timestamp": "2025-02-06T19:34:15.033934"
    },
    {
      "id": "ki sisa_p128",
      "text": "וידבר ה' אל משה לאמר ראה קראתי בשם בצלאל וגו', במד\"ר איתא (פרשה מ' סי' ב') קראתי בשם בצלאל אין כתיב כאן אלא ראה קראתי, אתה מוצא כשעלה משה למרום הראה לו הקב\"ה כל כלי המשכן ואמר לו כך וכך עשה וכו', בא משה לירד סבור שהוא עושה אותו, קרא לו הקב\"ה א\"ל משה מלך עשיתיך אין דרך המלך לעשות דבר, אלא גוזר ואחרים עושים, אף אתה אין לך רשות לעשות דבר אלא אמור להם והם עושין, ולא אמר למי יאמר, אמר משה למי אומר אמר לו ואני מראה לך, ומה עשה הקב\"ה הביא לו ספרו של אדם הראשון, והראה לו כל הדורות שהן עתידין לעמוד מבראשית עד תחיית המתים, דור ודור ומלכיול דור ודור ומנהיגיו, דור ודור ונביאיו. אמר לו כל אחד ואחד התקנתיו מאותה שעה, וכן בצלאל מאותה שעה התקנתיו הוי ראה קראתי בשם בצלאל, ד\"א ראה קראתי בשם בצלאל הה\"ד (קהלת ז') מה שהי' כבר נקרא שמו, אמר הקב\"ה מי שהתקנתיו מראש שיעשה המשכן כבר קראתי לו שם, מהו ונודע אשר הוא אדם, עד שאדם הראשון מועל גולם הראה לו הקב\"ה כל צדיק וצדיק שעתיד לעמוד ממנו וכו', הראה לו למשה מושח נביאים וכו', ליהושע מכניס ישראל לארץ, לדוד מייסד הבית, לשלמה בונהו וכו', נבוכדנצר מחריב הבית וכו', והראהו לבצלאל עושה המשכן הוו ראה קראתי בשם בצלאל עכ\"ד המדרש, ראוי להבין מה צורך בזה שהראה לו הקב\"ה ספרו של אדה\"ר שבצלאל עושה המשכן, וסגי גם באמירה לבד מבלי שיראהו, גם מדוע הקדים להראות לו בנין וחורבן הבית, הו\"ל להקדים בצלאל עושה המשכן שהוא קדום בזמן לפי סדר הדורות.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 128,
      "char_length": 1262,
      "timestamp": "2025-02-06T19:34:15.308648"
    },
    {
      "id": "ki sisa_p129",
      "text": "ב) ככלתו פי' רש\"י ז\"ל ככלתו כתיב חסר, שנמסרה לו תורה במתנה ככלה לחתן, שלא הי' יכול ללמוד כולה בזמן מועט כזה, ובמד\"ר ופ' מ\"א סי' ו') מבואר יותר וז\"ל כל מ' יום שעשה משה למעלה הי' לומד תורה ושוכח. א\"ל רבון העולם יש לו מ' יום ואיני יודע דבר, מה עשה הקב\"ה משהשלים מ' יום נתן לו הקב\"ה את התורה מתנה עכ\"ד המדרש, ולכאורה יקשה ע\"ז ממה דאיתא במד\"ר שה\"ש (עה\"פ ישקני מנשיקות פיהו), בשעה ששמעו ישראל אנכי ה' אלקיך נתקע ת\"ת בלבם והיו למדים ולא היו משכחום, באו אצל משה ואמרו וכו' דבר אתה עמנו וכו' חזרו להיות למדים ושוכחים, אמרו מה משה בשר ודם עובר אף תלמודו עובר מיד חזרו וכו', מבואר שמה ששמעו מפי הגבורה לא היו משכחין. א\"כ מדוע הי' משה לומד מתחלה ושוכח מה שלמד מפי הגבורה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 129,
      "char_length": 659,
      "timestamp": "2025-02-06T19:34:15.956227"
    },
    {
      "id": "ki sisa_p130",
      "text": "ונל\"פ בהקדם דברי הגמ' (מנחות צ\"ט ע\"א) מעלין בקודש ואין מורידין וכו' מנ\"ל דאין מורידין אמר רבי דאמר קרא ויקם משה את המשכן ויתן את אדניו וגו', פירש\"י ז\"ל ולא סייעוהו אחיו הכהנים בהקמת העמודים והאדנים, ש\"מ אין מורידין לפיכך לא נתעסקו בו אחרים עכ\"ל, ולכאורה אם כך הקפיד המקום בהקמת המשכן שלא יגע בו זר אלא משרע\"ה אם כן טעמא בעי מדוע לא היתה אלא הקמת המשכן ע\"ו משה רבינו ולא עשית המשכן והכלים והרי ודאי שהיתה חשיבות יותר גדולה אל המשכן וכליו אילו כוננוהו ידי משה, ואף שחקר אלהי מו ימצא וכך גזרה חכמתו ית' מתחלת הבריאה שבצלאל יעשה המשכן, מ\"מ ניתן לנו רשות למצוא טעם בדרשת הכתובים עד מקום ששכלנו מגעת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 130,
      "char_length": 594,
      "timestamp": "2025-02-06T19:34:16.317182"
    },
    {
      "id": "ki sisa_p131",
      "text": "ואפ\"ל בהקדם דברי ק\"ז הישמח משה זלה\"ה אפ' תרומה אופן ג') דלכאורה קשה למה צריך הקב\"ה לנדבת ישראל לביתו ולמשכנו, הלא לי הכסף ולו הזהב נאום ה' צבאות, ואם הקב\"ה גילה למשה באהלו מחצב של סנפרינון לצורך הלוחות, ככה הי' יכול לגלות אוצרות של כסף וזהב וכו', ותו\"ד ז\"ל לתרץ עפ\"י אמרם ז\"ל (תנחומא תזריע) אלמלי לא שפך חמתו על עצים ואבנים לא נשתייר משונאיהם של ישראל שריד ופליט, והנה קדושת המשכן שנעשה ע\"ו משרע\"ה נעתק לבנין המקדש כמו המעתיק מכתב הנארג בלשון ומליצה נפלאה, דכל השבח הוא להכותב הראשון, ולכך רמזו חז\"ל משכן משכן שנתמשכן ב' פעמים. אף שהמשכן שעשה משרע\"ה לא נתמשכן אלא נגנז, אבל נעתק קדושתו במקדש והבן, והנה אם לא היה נעשה משל ישראל כלל לא היה יכול להתמשכן בעוונותיהם, כמו דהמקדש דלעתיד דאין לבשר ודם חלק בו לא יחרב, וא\"כ אף המקדשים דנעתקו מהמשכן לא היו יכולין ליחרב והי' נתקעקע ביצתן של ישראל בעונותיהם, לכך רצה השי\"ת שיבנהו משל ישראל כדי שיתמשכן בעונותיהם כי נעשה משלהם עכ\"ד ז\"ל, ולפי\"ז אפשר למצוא טעם דע\"כ גזרה חכמתו ית' שלא יהי' בנין המשכן מעשה ידיו של משה רבינו בעצמו, דאמרז\"ל בגמ' (סוטה דף ע' ע\"א) שלא שלטו האויבים במעשה ידיו, וא\"כ אף המקדש שנעתקה קדושת המשכן בו לא הי' יכול ליחרב מה\"ע, והי' ח\"ו סכנת כלי' על ישראל, ומה\"ט נעשה ע\"ו בצלאל ולא ע\"י משרע\"ה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 131,
      "char_length": 1153,
      "timestamp": "2025-02-06T19:34:16.636912"
    },
    {
      "id": "ki sisa_p132",
      "text": "ובזה יבואר הטעם שהראה לו הקב\"ה בספרו של אדה\"ר שבצלאל עושה המשכן, ולא הודיעו בדיבור ואמירה, כי הסיבה לזה הוא החורבן המעותד בעונותיהם של ישראל, ודבר זה עדיין תליא בבחירה שאם יזכו ישראל לא יחרב ביהמ\"ק, וידוע דדיבורו ות' מכריח הבחירה משא\"כ ראי', ובזה יובן דברי המדרש הנ\"ל ולא אמר לו הקב\"ה למי יאמר, אמר משה למי אומר, אמר לו ואני מראה לך וכו' הביא לו ספרו של אדה\"ר וכו', והטעם כי מילתא דתליא בבחירה לא ניתן להאמר בבחי' דבור כנ\"ל, ומה\"ט הקדים הבוי\"ת להראות לו נבוכדנצר מחריב הבית וכו' ואח\"כ הראה לו שבצלאל עושה המשכן אף דזה קדים בזמן. אלא דיש בזה נתינת טעם להבינהו שא\"א שיעשה המשכן על ידי משרע\"ה מטעם החורבן המעותד וע\"כ בצלאל עושה המשכן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 132,
      "char_length": 631,
      "timestamp": "2025-02-06T19:34:17.221021"
    },
    {
      "id": "ki sisa_p133",
      "text": "ועד\"ז יתבאר אידך דברי המדרש שהי' משה לומד ושוכח עד שנתן לו הקב\"ה את התורה במתנה (עיין לעיל קושיא ב') בהקדם דברי המדרש (הובא ברש\"י ז\"ל) ויתן אל משה ככלתו, אמר רשב\"ל מה כלה זו מקושטת בכ\"ד מיני תכשיטין, כך ת\"ח צריך להיות זריז בכ\"ד ספרים, והנה אמרז\"ל בגמ' נדרים (דף כ\"ב ע\"ב) אלמלא חטאו ישראל לא ניתן להם אלא חמשה חומשי תורה וספר יהושע בלבד מפני שערכה של א\"י הוא, שנא' (קהלת א') כי ברוב חכמה רב כעס. פירש\"י ברוב דברי חכמות הנביאים יש סימן לרוב כעס שהכעיסו ישראל להקב\"ה, עכ\"ד הגמ' וממדרש הנ\"ל מוכח שכבר ניתנו לו למשרע\"ה בלוחות הראשונות הכ\"ד ספרים, שהרי דרשו זאת עה\"פ ויתן אל משה ככלתו, ועדיין הי' תליא בבחירתם של ישראל ואולי לא יבואו לידי חטא, ואפשר דספרי הנביאים לא ניתנו לו בבחי' דיבור כ\"א בראי' שכלית שאינו מכריח הבחירה, ומעתה אפ\"ל דמ\"ש במדרש הנ\"ל שהי' משה לומד ושוכח הכוונה על ספרי הנביאים שניתנו לו בראי', אבל כל התורה שלמד מפי הגבורה כמ\"ש רז\"ל במד\"ר ופ' מ\"א סי' ג') ויתן אל משה הה\"ד (משלי ב') כי ה' יתן חכמה מפיו דעת ותבונה שנתנה לו התורה מפיו של הקב\"ה, בזה לא שלטה השכחה, וכמו ישראל מה ששמעו מפי הקב\"ה לא היו משכחין וא\"ש דברי המדרש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 133,
      "char_length": 1033,
      "timestamp": "2025-02-06T19:34:17.556667"
    },
    {
      "id": "ki sisa_p134",
      "text": "ויאמר ד' אל משה לאמר ואתה דבר אל בנ\"י לאמר אך את שבתתי תשמרו וגו' יל\"ד על כפל מלת לאמר ב' פעמים.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 134,
      "char_length": 96,
      "timestamp": "2025-02-06T19:34:18.071513"
    },
    {
      "id": "ki sisa_p135",
      "text": "ב) אומרו ואתה דבר צ\"ב, כי בכל המצות נאמר לו דבר אל בנ\"י ולא אמר אתה דבר, ומלת אתה מיותר הוא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 135,
      "char_length": 92,
      "timestamp": "2025-02-06T19:34:18.162676"
    },
    {
      "id": "ki sisa_p136",
      "text": "ג) במכילתא דרשו ואתה דבר לא ע\"י מלאך ולא ע\"ו שליח צ\"ב דמהיכי תיתי שיאמר ע\"י מלאך או ע\"י שליח, ומדוע הי' הצורך לכתוב מיעוטא דואתה במצוה זו למעט שליח, ולא הוצרך הכתוב למעט שליח בשאר דברות.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 136,
      "char_length": 186,
      "timestamp": "2025-02-06T19:34:18.263590"
    },
    {
      "id": "ki sisa_p137",
      "text": "ד) ואתה דבר אל בנ\"י, פרש\"י ואתה אעפ\"י שהפקדתיך לצוותם על מלאכת המשכן, אל יקל בעיניך לדחות את השבת מפני אותה מלאכה, וצ\"ב מה נתינת טעם הוא זו, שאע\"פ שהפקדתיך על המשכן. אל יקל בעיניך לדחות את השבת, הרי כמו\"כ נצטו' גם על השבת, ומאי אולמא דהאי מהאי, ומה\"ת שיקל בעיניו לדחות את השבת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 137,
      "char_length": 277,
      "timestamp": "2025-02-06T19:34:18.399106"
    },
    {
      "id": "ki sisa_p138",
      "text": "ה) אך את שבתתי תשמרו, פרש\"י אע\"פ שתהיו רדופין וזריזין בזריזות המלאכה, שבת אל תדחה מפני', ראוי להבין איזה צד היתר יש בזה, וכי בשביל שרדופין וזריזין במלאכה, הו\"א שידחה מלאכת המשכן את השבת, וממנ\"פ אם בנין המשכן דוחה שבת עפ\"י הלכה, גם בלי טעמא דזריזין ידחה, ואם אין דוחה את השבת, טעמא דזריזין לא מהני כלום, ואין נפק\"מ בדחיית שבת אם זריזין או לא ולא תליא בזה כלל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 138,
      "char_length": 358,
      "timestamp": "2025-02-06T19:34:18.584684"
    },
    {
      "id": "ki sisa_p139",
      "text": "ו) ועוד כתב רש\"י ז\"ל כל אכין ורקין מעוטין. למעט שבת ממלאכת המשכן, והקשה הרמב\"ן ז\"ל דמיעוטא דאך הי' צריך להיות אצל מלאכת המשכן ואז הוי ממעטינן מלאכת המשכן דלא תיעשה בשבת, אבל עכשיו דנכתב המיעוט אצל שבת, אדרבה בא למעט שבת דתדחה מפני מלאכת המשכן, כי המיעוט בכ\"מ ומעע בדבר המצוו' בו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 139,
      "char_length": 279,
      "timestamp": "2025-02-06T19:34:18.807026"
    },
    {
      "id": "ki sisa_p140",
      "text": "ז) אך את שבתתי תשמרו צ\"ב דאת רבוי' הוא בכ\"מ ומהו אתי לרבות כאן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 140,
      "char_length": 63,
      "timestamp": "2025-02-06T19:34:18.984460"
    },
    {
      "id": "ki sisa_p141",
      "text": "ח) הקשה המזרחי ז\"ל בפ' קדושים ל\"ל קרא דאין מלאכת המשכן דוחה שבת, הרי שבת עשה ול\"ת ומלאכת המשכן עשה, וקיי\"ל דאין עשה דוחה ל\"ת ועשה, וכן הקשה הגו\"א בפ' ויקהל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 141,
      "char_length": 156,
      "timestamp": "2025-02-06T19:34:19.072586"
    },
    {
      "id": "ki sisa_p142",
      "text": "ט) הקשה המהרש\"א ז\"ל במס' נדה (ל\"ח) על הא דאמרי' בפרק כ\"כ (שבת קי\"ח ע\"ב) אלמלי שמרו ישראל ב' שבתות מיד נגאלין שנא' כה אמר ד' לסריסים אשר ישמרו את שבתתי וכו', אם דקדקו לדרוש כן מלשון שבתתי לשון רבים. ומיעוט רבים שנים, א\"כ יקשה מהא דכתיב אך את שבתתי תשמרו, דע\"כ א\"א לדרוש כאן על ב' שבתות דהתוה\"ק הזהירה בזה לשמור שבתות כל ימי עולם עכת\"ד ז\"ל, וצ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 142,
      "char_length": 344,
      "timestamp": "2025-02-06T19:34:19.194629"
    },
    {
      "id": "ki sisa_p143",
      "text": "ואפ\"ל בהקדם דברי המכילתא (פרשה זו) וז\"ל אך את שבתתי תשמרו למה נאמר, לפי שהוא אומר לא תעשה כל מלאכה, אין לו אלא דברים שהם משום מלאכה, משום שבות מנין. ת\"ל את שבתתי להביא דברים שהם משום שבות ע\"כ, וכתב הרמב\"ן ז\"ל בפ' בא (עה\"פ כל מלאכה לא יעשה בהם) דאין זה אלא אסמכתא בעלמא, דחכמים אסרו שבות לשבת וסמכו אותה למקרא הזה, וא\"א לומר דהפסוק אתי' לרבות שבות, שלא אסרתו תורה מעולם, וברייתות כאלו מטעות ואין ראוי לכותבן כפשוטו וישבנו פו' נכון עוד אדבר עליו בע\"ה עכת\"ד ז\"ל והרמב\"ן ז\"ל בפ' אמור (פר' י\"ח פסוק כ\"ד) הביא ברייתא אחרת ממכילתא וז\"ל ושמרתם את היום הזה למה נאמר, והלא כבר נאמר כל מלאכה לא יעשה בהם, און לי אלא דברים שהן משום מלאכה, דברים שהם משום שבות מנין, ת\"ל ושמרתם את היום הזה להביא דברים שהן משום שבות, והקשה הרמב\"ן שאם תאמר שהוא בדרך אסמכתא על שבות דרבנן. איך יתכן לומר, דברים שהם אסורין משום שבות של דבריהם מנין שיהיו אסורין מן התורה. ונ\"ל שהמדרש בא לומר שנצטוינו מן התורה להיות לנו מנוחה בשבת ויו\"ט אפי' מדברים שאינן מלאכה, לא שיטרח כל היום למדוד התבואות ולמלא החביות יין, ולפנות הכלים והאבנים מבית לבית וממקום למקום, וכו' ויהי' החנות פתוחה והחנוני מקיף וכו' וכל משא יביאו, יכל אלו הדברים אין בהם משום מלאכה דאורייתא, לכך אמרה תורה שבתון שיהי' יום שביתה ומנוחה, לא יום טורח ממלאכה עכת\"ד ז\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 143,
      "char_length": 1194,
      "timestamp": "2025-02-06T19:34:19.411119"
    },
    {
      "id": "ki sisa_p144",
      "text": "ואפשר לתרץ דברי המכילתא, דל\"ק מ\"ש דברים שהם משום שבות מנין: אפי' אם נימא שכוונו כאן על שבות שהוא מדבריהם כמ\"ש הרמב\"ן ז\"ל בפ' באל ויובן עפימ\"ש הריטב\"א ז\"ל בר\"ה (דף ט\"ז) וז\"ל כל מה שוש לו אסמכתא מן הפסוק, העיד הקב\"ה שראוי לעשות כן אלא שלא קבעו חובה ומסרו לחכמים, וזה דבר ברור ואמת, ולא כדברי המפורשים האסמכתות, שהוא כדרך סימן שנתנו חכמים, ולא שכוונת התורה לכך ח\"ו, ישתקע הדבר ולא יאמר שזו דעת מינות אבל התורה העירה בכך ומסרה חיוב הדבר לקבעו לחכמים אם ירצו, ולפיכך תמצא החכמים נותנין בכ\"מ ראי' או אסמכתא לדבריהם מן התורה, כלומר שאינם מחדשים דבר מלבם, וכל תורה שבע\"פ רמוזה בתושב\"כ שהוא תמימה, וח\"ו שהוא חסירה כלום עכלה\"ק, ולפי\"ז א\"ש דברי המכילתא מ\"ש דברים שהן משום שבות מנין ת\"ל את שבתתי להביא דברים שהן משום שבות, שאע\"פ ששבותום הם רק מדרבנן, אבל כוונת הכתוב לכך היתה, אלא שלא קבעו הכתוב חובה ומסרו לחכמים כמ\"ש הריטב\"א ז\"ל ול\"ק קושית הרמב\"ן ז\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 144,
      "char_length": 841,
      "timestamp": "2025-02-06T19:34:19.984650"
    },
    {
      "id": "ki sisa_p145",
      "text": "ולפי\"ז מתורץ קושית המזרחי והגו\"א הנ\"ל, דלא אתי' מיעוטא דאת שבתתי למעט דאין מלאכת המשכן דוחה שבת במלאכה דאורייתא, דלא צריך קרא ע\"ז דאין עשה דמשכן דוחה עשה ול\"ת דשבת, אמנם בא הכתוב למעט דלא דחיא שבת אפי' במלאכות דרבנן שהם משום שבות דס\"ד לומר דמלאכת המשכן כבר נצטוו ישראל בו, ושבותין דרבנן עדיין לא קבעו הכתוב חובה, אלא שמסרה לחכמים לקבעו לאח\"ז ומן הראוי דדבר שהוא מצוה ועומד ידחה את שאינו מצו' עלי', ע\"כ כתבה תורה מיעוטא דאך את שבתתי, להביא דברים שהם משום שבות, דלא נדחו מפני מלאכת המשכן ואפשר הטעם דהי' רצון התוה\"ק למנוע אותנו מלקבוע יסוד להשראת השכינה בדבר שעתידין חכמים לאסרו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 145,
      "char_length": 577,
      "timestamp": "2025-02-06T19:34:20.399697"
    },
    {
      "id": "ki sisa_p146",
      "text": "ומעתה יובנו דברי רש\"י ז\"ל כמין חומר, מ\"ש ואתה דבר אל בנ\"י, ואתה אע\"פ שהפקדתיך נצוותם על מלאכת המשכן, אל יקל בעיניך לדחות את השבת מפני אותה מלאכה, ר\"ל דהו' ס\"ד לומר לפי שהפקדתוך לצוותם על מלאכת המשכן, והרי הם מצווים ועומדים במצו' זו, ובשבותו שבת עדיין לא נצטוו עלי', הו\"א שידחה בנין המשכן מלאכת שבת שהם משום שבות, ע\"כ כתבה התורה מיעוטא דאך שלא תדחה מטעם הנ\"ל, ולפי\"ז יתורץ קושית המהרש\"א הנ\"ל דלכאורה כיון שהיו ישראל משתוקקים לבנין המשכן, ושיזכו מיד להשראת השכינה על ידו כמבואר בדברי חז\"ל, א\"כ הי' להם עצה לבנות המשכן גם בשבת, באופן שלא יעברו על איסור מלאכת שבת, ויעשו כל מלאכה ע\"י שנים או רבים ואיפסק הלכתא כת\"ק דמתני' (שבת צ\"ב) דזה יכול וזה יכול שניהם פטורים. הגם דמדרבנן אסור כמו כל פטורי דשבת, שהוא פטור אבל אסור מדרבנן, אבל אז בשעת בנין המשכן, לא הי' עדיין גזירת חכמים קיימת א\"כ הי' ס\"ד לומר שיותר לכתחילה באופן זה, ואפשר דע\"כ כתבה תורה את שבתתי תשמרו, ומיעוט רבים שנים לאסור שנים שעשאו' במלאכת המשכן, ורמז הכתוב זה במלת שבתתי כו באופן זה ידחו ב' שבתות כאחד, והטעם כנ\"ל דלא רצה הקב\"ה, שיסוד השראת השכינה יהי' נמשך ע\"י מעשה שעתידין חכמים לאסרו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 146,
      "char_length": 1046,
      "timestamp": "2025-02-06T19:34:20.692946"
    },
    {
      "id": "ki sisa_p147",
      "text": "והנה עוד יש סברא לומר דלא יאסרו שבות במלאכת המשכן, דהרי אמרו ז\"ל (פסחים דף ס\"ה ע\"א) דאין שבות במקדש, והטעם משום דכהנים זריזין הם, ולא יבואו לימשך עי\"ז לעבור על איסור תורה וכמו כן נימא דגם בבנין המשכן דכל ישראל היו זריזים במלאכתה, ובמקום זריזות לא חשו חכמים לאסור שבות, ע\"כ כתבה תוה\"ק מיעוטא דאך את שבתתי לאסור דברים שהן משום שבות, דלא דחיא מלאכת המשכן אף את אלו, ואפשר דלא התירו חכמים שבות במקדש אלא בעבודת הקרבנות וכדומה, אבל בבנינה גנאי הוא שיהא היסוד של השראת השכינה, נקבע ע\"ו מעשה שאסרו חכמים, ובזה יובנו דברי רש\"י ז\"ל במ\"ש אעפ\"י שתהיו רדופין וזריזין בזריזות המלאכה, שבת אל תדחה מפני', דהי' סברא לומר מפני שרדופין וזריזין במלאכת המשכן, יהי' מלאכת המשכן דוחה שבת בשבותו דרבנן, כמו שהתירו חכמים לדורות שבות במקדש מהאי טעמא, ע\"כ כתבה תורה מיעוטא דלא דחיא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 147,
      "char_length": 756,
      "timestamp": "2025-02-06T19:34:21.203694"
    },
    {
      "id": "ki sisa_p148",
      "text": "ובזה יתבארו דברי המכילתא הנ\"ל במ\"ש ואתה דבר אל בנ\"י, לא ע\"ו מלאך ולא ע\"י שליח ויובן עפ\"י דרכנו הנ\"ל, דכאן נצטו' משה רבינו להזהיר את ישראל על שמירת השבות במלאכת המשכן, וענין השבות לא אסרתו תורה אלא מסרו לחכמים לקבעו חובה, כדברי הריטב\"א הנ\"ל, א\"כ הי' ס\"ד לומר, שדיבור וצווי זו יאמרנה משה ע\"י שליח, ולא יאמרה בעצמו, לפי שמשרע\"ה הי' עצם התורה ושכינה מדברת מתוך גרונו, ואם ידבר הוא אל בנ\"י, א\"כ הו' כגופא של תורה, וגם שבות דעלמא שאינו בבנין המשכן יאסור מן התורה כיון שנצטוו עלי' מפי משרע\"ה, ע\"כ כתבה תוה\"ק ואתה דבר אל בנ\"י לא ע\"ו מלאך ולא ע\"ו שליח. אלא אתה בעצמך, אבל תפרש להם דשבותו שבת דעלמא לא נאסרו עדיין מן התורה, אלא שמסרו הכתוב לחכמים לקבעו חובה, והתוה\"ק אסרה כאן רק בבנין המשכן מטעם הנ\"ל ובזה מתורץ מה שכפל הכתוב מלת לאמר ב\"פ, דלאמר הב' בא ללמד שלא אסרה תורה שבותי שבת, אלא שמסרתו לחכמים שהם ידונו בדבר, והם עתידין לומר הצווי לבנ\"י, וז\"ש ויאמר ד' אל משה לאמר, שיאמר אל בנ\"י צווי זה ואתה דבר אל בנ\"י לאמר, שאיסור שבותים יאמר להם לעתיד ע\"י החכמים, שמסרה התורה להם וא\"ש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 148,
      "char_length": 970,
      "timestamp": "2025-02-06T19:34:21.578672"
    },
    {
      "id": "ki sisa_p149",
      "text": "ואפ\"ל עוד באופן אחר עפימ\"ש הרמב\"ן ז\"ל בפ' אמור הנ\"ל, לפרש דברי המכילתא שם שאמרו, שהכתוב בא לרבות דברים שהן משום שבות, היינו שנצטווינו מן התורה להיות לנו מנוחה בשבת ויו\"ט אפי' מדברים שאינן מלאכה והעמל והטורח אסורים בשבת מן התורה, א\"כ כמו\"כ יתפרשו דברי המכילתא כאן מה שאמרו את שבתתי תשמרו להביא דברים שהם משום שבות, היינו שאסרה תורה מלאכת המשכן בשבת, אפי' בדברים שאין בהם משום מלאכה, אלא טורח ועמל בלבד דלכאורה הי' סברא להתיר הטורח והעמל במלאכת המשכן, עפומ\"ד בש\"ע חו\"מ (סי' של\"ה ס\"א) דהשוכר את הפועל למלאכה ידועה, ונשלמה המלאכה בחצי היום, ואין לו מלאכה כיו\"ב ליתן לו, נותן בעה\"ב לפועל שכרו כפועל בטל, פי' שמין כמה אדם רוצה לפחות משכרו לישב בטל, וכן ינכה לו משכרו, אבל במלמד שחלה התלמיד מקום שהוא פסידא דבע\"ה, כתב הרמ\"א ז\"ל שצריך ליתן לו שכרו משלם. ואין יכול לנכות לו שכר הטורח והעמל שהוא בטל מהם, דאי לא עבדי חלשי, ואינו נהנה בזה שהוא בטל אדרבה צער היא לו, וכתב הסמ\"ע דפקודי ד' ישרים משמחי לב, וע\"כ צער היא לוא ואינו נהנה במה שאינו עמל עיי\"ש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 149,
      "char_length": 940,
      "timestamp": "2025-02-06T19:34:22.116452"
    },
    {
      "id": "ki sisa_p150",
      "text": "ועפי\"ז יתפרשו דברי רשיז\"ל כאן אך את שבתתי תשמרו, אע\"פ שתהיו רדופין וזריזין בזריזות מלאכת המשכן שבת אל תדחה מפני' דהנה היו ישראל מתאוים להשראת השכינה שיחול עלהם ע\"י המשכן, גם שנתכפר להם על ידו מעשה העגל, א\"כ הו\"א שלא יאסור העמל והטורח במלאכת המשכן, במקום שאין בה משום מלאכה, כיון שאין זה עמל וטורח, אדרבה המניעה ממנו צער היא להם, קמ\"ל קרא לרבות דברים שהן משום שבות דהיינו עמל וטורח דאסירי במלאכת המשכן ומתורץ ג\"כ קושית הרמב\"ן ז\"ל (לעיל קושיא ו') וא\"ש דכתבה תורה מיעוטא דאך גבו שבת, דנתמעט שבת לענין עונג במה שאסרה תורה להם העמל במלאכת המשכן, דמה שהם בעלים ממלאכת המשכן לצער ומ\"ש תורה את לרבות, אתי' לרבוי שגם במלאכת המשכן נוהג איסור העמל והטורח, והרבוי והמיעוט שניהם לענין שבת נאמרו דהרבוי מרבה שבת לענין איסור עמל והטורח אף במלאכת המשכן, והמיעוט בא למעט שבת לענין עונג, דע\"י שנאסרה בו מלאכת המשכן יתמעט אצלם ממצות עונג, לרוב השתוקקותם למלאכת המשכן ולהשראת השכינה כנ\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 150,
      "char_length": 868,
      "timestamp": "2025-02-06T19:34:22.628430"
    },
    {
      "id": "ki sisa_p151",
      "text": "באופן אחר יתבארו הדקדוקים הנ\"ל, בהקדם דברי המכילתא (הובא בילקוט) ושמרו בני ישראל את השבת לעשות את השבת וגו' ר' אליעזר אומר לעשות את השבת דבר שהברית כרותה לו ואיזו זו מילה, ופי' הזית רענן דכתיב לדורותם ברית עולם זו מילה שמותר לעשותו בשבת, וקשה דכאן הפליג הכתוב באזהרת השבת שגם בנין המשכן לא ידחה אותה ומה שייכות להכא להודיע שמילה דוחה את השבת, והוא כמעשה לסתור, והרא\"ם בר\"פ ויקהל הקשה למה צריך קרא דאין בנין המשכן דוחה את השבת, גם בלאו קרא לא ידחה שהרי בנין המשכן רק עשה ושבת ל\"ת ועשה, ואין עשה דוחה את ל\"ת ועשה, והאלשיך הק' הקשה להיפך למה לא ידחה בנין המשכן את השבת, וכמו שכל קרבנות ציבור דוחין את השבת כן ידחה בנין המשכן ג\"כ שהוא לצורך קרבנות ציבור.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 151,
      "char_length": 650,
      "timestamp": "2025-02-06T19:34:23.090184"
    },
    {
      "id": "ki sisa_p152",
      "text": "ונל\"פ בהקדם דברי הגמרא (ביצה דף כ' ע\"ב) דפליגי בית שמאי ובית הלל אי מביאין עולת ראי' ביו\"ט, ב\"ש סברי דאין מביאין כיון שאין בה אכילת אדם וב\"ה סברי מביאין, אמרו להם ביה לב\"ש ומה במקום שאסור להדיוט מותר לגבוה, (שבת שאסור לעשות להדיוט כלום מותר לגבוה תמידין ומוספין), מקום שמותר להדיוט אינו דין שמותר לגבוה, (כל צורכי אכילת מזבח ואפילו עולת ראי') אמרו להם ב\"ש נדרים ונדבות יוכיחו שמותר להדיוט ואסור לגבוה, אמרו להם ב\"ה מה לנדרים ונדבות שאין קבוע להם זמן, תאמר בעולת ראי' שקבוע לה זמן. אמרו להם ב\"ש אף זו אין קבוע לה זמן דתנן מי שלא חג ביו\"ט הראשון של חג חוגג והולך כל היו\"ט כולו, אמרו להם ב\"ה אף זו קבוע לה זמן דתנן עבר הרגל ולא חג אינו חייב באחריותו, פירש\"י ויש לחוש שמא יפשע או יאנס בשאר ימי המועד ולא יביא, מבואר שהקבוע לה זמן דוחה משא\"כ שאינו קבוע לה זמן. ובזה מתורץ קושית האלשיך הק' מ\"ש בנין המשכן מקרבנות ציבור שדוחין את השבת, כי קרבנות ציבור קבוע להם זמן וע\"כ דוחין את השבת, משא\"כ בנין המשכן אין קבוע לה זמן אינה דוחה שבת אך לפי מ\"ש רש\"י ז\"ל שעולת ראי' דוחה יו\"ט לדברי ב\"ה אף שאין קבוע זמנה, על יום זה דייקא, כי יש לחוש שמא יפשע או יאנס בשאר ימי המועד כמו\"כ י\"ל בבנין המשכן דיש לחוש שמא יפשעו בבנינה ויתעכבו מלהקריב בה קרבנות, ולזה הי' ס\"ד דהוי כדבר הקבוע לה זמן וידחה את השבת, לזה הוצרך הכתוב למעט שאינה דוחה את השבת, ומיושב קושית הרא\"ם ז\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 152,
      "char_length": 1245,
      "timestamp": "2025-02-06T19:34:23.427815"
    },
    {
      "id": "ki sisa_p153",
      "text": "אמנם עדיין אין זה מספיק עפימ\"ד בפסיקתא (הובא במדרש ילקוט מלכים א' ו') בכ\"ה בכסלו נגמר מלאכת המשכן, ועשה מקופל עד א' בניסן וכו' והקב\"ה חשב לערב שמחת המשכן בחודש שנולד בו יצחק וכו', הרי שלאחר שנגמרה בנינו לא הקריבו בו קרבנות עד ניסן א\"כ איך סליק אדעתן שידחה את השבת בשביל למהר הקרבת הקרבנות דבלאו הכי לא הקריבו עד ניסן והדרא קושיא לדוכתא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 153,
      "char_length": 336,
      "timestamp": "2025-02-06T19:34:24.049912"
    },
    {
      "id": "ki sisa_p154",
      "text": "אך נראה שמה שהמתין הקב\"ה בהקמת המשכן עד ניסן הי' מטעם שלא הי' בישראל זכותים כ\"כ, והיו צריכין לצירוף זכותו של יצחק, אבל אלמלי היו ישראל זוכין מצד מעשיהם הטובים לא היו צריכים להמתין, רק מיד שנגמר בנינו היו מקריבין בו קרבנות, וממילא הוי ס\"ד שידחה בנינו את השבת למהר הקרבת הקרבנות, ובזה יובנו דברי רש\"י ז\"ל אעפ\"י שתהיו רדופין וזריזין בזריזות המלאכה, וזה יהי' לכם לתוספת זכות שעל ידה תזכו להקים את המשכן תיכף אחר גמר בנינה והוי ס\"ד שתדחה את השבת, ע\"כ בא הכתוב למעט שאין בנינה דוחה שבת, ומתורץ קושית הרא\"ם והאלשיך ז\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 154,
      "char_length": 512,
      "timestamp": "2025-02-06T19:34:24.232365"
    },
    {
      "id": "ki sisa_p155",
      "text": "והנה איתא במכילתא (פרשת יתרו) ששת ימים תעבוד ועשית כל מלאכתך, וכי אפשר לאדם לעשות כל מלאכתו בששה ימים, אלא שבות כאילו כל מלאכתך עשוי' ופירשו הטעם בזה כי אם לא יחשוב כן שכל מלאכתו עשוי', יהי' לו בשבת צער וביטול עונג ממה שלא נגמר מלאכתו, אך בבנין המשכן לא היו יכולין לחשוב כן כאילו כבר נגמר הבנין דהלא כל ישראל השתוקקו לגמר בנינו ויקריבו בו קרבנות ותשרה השכינה ביניהם, גם לכפר עליהם עון העגל ולא היו יכולין להסיח דעתם מבנינו, נמצא שאם לא יבנו גם בשבת יהי' להם ביטול עונג שבת ואעפי\"כ גזרה חכמתו ית' שאין בנין המשכן דוחה את השבת, ולזה אמר הפסוק אך את שבתותי תשמרו למעט שבת ממלאכת המשכן דזה הוי מיעוט אצל השבת, מה שאין עוסקין במלאכת המשכן, שהרי ימעטו בעונג שבת עי\"ז, ושפיר נכתב תיבת אך למעט אצל שבת, כו מה שאין עוסקין במלאכת המשכן הוי מיעוט אצל השבת, ותיבת את בא לרבות, כי אעפי\"כ עצם הענין שאין בנין המשכן דוחה שבת הוי ריבוי וחשיבות לשבת, שאפילו דבר חשוב כבנין המשכן אינו דוחה את השבת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 155,
      "char_length": 880,
      "timestamp": "2025-02-06T19:34:24.484937"
    },
    {
      "id": "ki sisa_p156",
      "text": "או י\"ל בתיבת את לרבות, עפי\"מ שכתב קיז זלה\"ה הישמח משה בפרשת ויקהל (באופן ג') לפרש דברי המדרש (ר\"פ עקב) שמא תאמרו לרעתכם נתתי לכם את השבת הא לא נתתי לכם אלא לטובתכם עפי\"מ שכתבתי הטעם על שלעתיד יהי' יום שכולו שבת עפימ\"ש התוספות וכו' וכ\"ת א\"כ מאי רבותי' דשבת כיון שיהי' יום שכולו שבת, לז\"א וביום השביעי יהי' לכם קודש וכו' שבת שבתון לה' ר\"ל שבת של כל ומי השבוע, וז\"פ המדרש שמא תאמר לרעתכם נתתי את השבת ר\"ל אם אתם רעים ומותרים במלאכה אז השביעי קודש, משא\"כ אם אתם טובים ותהיו תמיד אסורים במלאכה א\"כ מה יום ביומים, לכך אמר לא נתתי אותה אלא לטובתכם ע\"ד שתהיו טובים וכו', ואף דלענין מלאכה אין נפקותא מ\"מ כל מילי דשבת היא גבוה מעל גבוה וכו' עכלה\"ק, מבואר שגם לעתיד לבוא שיהי' יום שכולו שבת אבל קדושת השבת יתעלה יותר, והדרך לזכות אל הגאולה העתידה היא ע\"י שמירת שבת קודש כאמרז\"ל (שבת דף קי\"ח ע\"ב) אלמלי משמרין ישראל שתי שבתות כהלכתן מיד נגאלין. נמצא שע\"י שמירת שבת זוכין לשמור את השבת דלעתיד בבחינה גבוה יותר, וזה שרמז בתיבת אאת\" לרבות, דבמה שאין בונין את המשכן בשבת ושומרין את השבת כהלכתה יש ריבוי לשבת, כי על ידה יזכו לגאולה וישמרו את השבת באופן יותר נעלה ממה ששומרין עכשיו בשביתה ממלאכה לבד.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 156,
      "char_length": 1082,
      "timestamp": "2025-02-06T19:34:24.907689"
    },
    {
      "id": "ki sisa_p157",
      "text": "ואיתא במכילתא (פרשה זו) כתיב ששת ימים יעשה מלאכה (משמע ע\"ו אחרים) וכתוב אחד אומר ששת ימים תעבוד ועשית כל מלאכתך, כיצד יתקיימו שני כתובים הללו אלא בזמן שישראל עושים רצונו של מקום מלאכתם נעשית ע\"י אחרים, וכשאין עושין רצונו של מקום מלאכתן נעשית ע\"ו עצמם שנא' ועשית כל מלאכתך ע\"כ, ולזה יזכו ישראל לעתיד לבוא שאז יעשו רצונו של מקום בשלימות ויהי' מלאכתן נעשית ע\"י אחרים, וכבר נתבאר שזה הוא עזו שמירת שתי שבתות שבזכותה ישראל נגאלין.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 157,
      "char_length": 425,
      "timestamp": "2025-02-06T19:34:25.422033"
    },
    {
      "id": "ki sisa_p158",
      "text": "ויתורץ קושית המהרש\"א ז\"ל (לעיל בדרוש הקדום) על הא דאמרז\"ל (שבת קי\"ח) אלמלי שמרו ישראל שתו שבתות מיד נגאלין שנא' כה אמר ה' לסריסים אשר ישמרו את שבתותי וכו' ודרשו כן ממלת שבתותי לשון רבים, ומיעוט רבים שנים, א\"כ יקשה מהא דכתיב אך את שבתותי תשמרו, דע\"כ א\"א לדרוש כאן על ב' שבתות, דהתוה\"ק הזהירה בזה לשמור שבתות כל ומי עולם עכ\"ד ז\"ל, ולדרכינו אפ\"ל הכוונה על שמירת שתו שבתות כמבואר בגמ' הנ\"ל שעי\"ז יזכו ישראל לגאולה, וע\"כ מסיים הכתוב ששת ימים יעשה מלאכה וע\"ו אחרים) וביום השביעי שבת שבתון קודש לה' שזו בחי' העתיד ויזכו ישראל אלי' ע\"י שמירת ב' שבתות, ויובן בזה דברי המכילתא אך את שבתותי תשמרו וגו' לדעת כי אני ה' מקדשכם לעוה\"ב וכו', וכן הוא אומר מזמור שיר ליום השבת ליום שכולו שבת, כי ע\"ו שמירת ב' שבתות יתעלה קדושתם של ישראל לעוה\"ב ויזכו ליום שכולו שבת, ולבחי' שבת שבתון בשבת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 158,
      "char_length": 770,
      "timestamp": "2025-02-06T19:34:25.635922"
    },
    {
      "id": "ki sisa_p159",
      "text": "והנה בגמרא (יומא דף פ\"ה ע\"ב) למדו רז\"ל שפיקוח נפש דוחה שבת בק\"ו ממילה, ומה מולה שהיא א' מרמ\"ח איברים שבאדם דוחה את השבת, ק\"ו לכל גופו שדוחה את השבת, פירש\"י מה מילה שהיא תיקון א' מאיבריו של אדם דוחה את השבת, לפי שחייבין עלי' כרת לאחר זמן כך שנוי בתוספתא, והקשו המפורשים דלפי טעם זה גם מילה שלא בזמנה ידחה את השבת, כי שמא יפשע וימנע אח\"כ ויתחייב כרת, ואנן קיי\"ל דמילה שלא בזמנה אינה דוחה שבת, ואפ\"ל דדוקא מילה בזמנה כיון דקביע לי' זימנא יש לחוש שמא אם יעבור הזמן ידחה לגמרי ויתחייב כרת לאחר זמן, שיום זה הקבוע למצותו מהקב\"ה מסוגל יותר לקיום המצוה, וע\"כ יש לחוש אם יעבור יום זה ידחה עוד, משא\"כ מילה שלא בזמנה דבלא\"ה עבר הזמן אין לחוש בה כ\"כ שמא יפשע, כי מה לי יום זה מיום אחר, ושניהם אינם קבועים, ואין לחוש על יום מחרת שיפשע בו יותר מיום זה ע\"כ אינה דוחה את השבת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 159,
      "char_length": 760,
      "timestamp": "2025-02-06T19:34:26.007334"
    },
    {
      "id": "ki sisa_p160",
      "text": "וכמו\"כ לענין בנין המשכן שלא הי' זמן קבוע וע\"כ לא דחה בנינו את השבת כמו מילה שלא בזמנה ואינו דומה לעולת ראי' לדברי ב\"ה, דהתם כל המועד זמן מצותו וע\"כ יש לחוש בו שמא יפשע, ובזה יבואר דברי הילקוט הנ\"ל דהנה אזהרת שמירת שבת כ\"כ בתורה במקומות הרבה, וכאן בא הכתוב ללמדנו דאף בנין המשכן דאיכא למיחש שמא יתאחר וידחה והו\"ל כקבוע זמן מ\"מ לא דחו את השבת, ודבר זה ילפינן ממילה כנ\"ל, וז\"ש ר' אליעזר לעשות את השבת דבר שהברית כרותה לו זה המילה, ואפ\"ה לא דחי כ\"א בזמנו הקבוע למצותו דייקא: ומה\"ט בנין המשכן אינו דוחה והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 160,
      "char_length": 503,
      "timestamp": "2025-02-06T19:34:26.392222"
    },
    {
      "id": "ki sisa_p161",
      "text": "באופן אחר אפ\"ל קושית הרמב\"ן ז\"ל על פירש\"י ז\"ל דתיבת אך את שבתתי תשמרו אתי למעט שבת ממלאכת המשכן. והקשה שהרי זה מיעוט אצל מלאכת המשכן ולא לגבי שבת, וא\"כ מדוע כתיב מיעוטא גבו שבת. גם תיבת מאתא שבתותי צריך ביאור, דבכ\"מ אמרינן אאת\" ריבויא היא, ומאי מרבינ מיניה הכא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 161,
      "char_length": 261,
      "timestamp": "2025-02-06T19:34:26.650717"
    },
    {
      "id": "ki sisa_p162",
      "text": "ונראה בהקדם לתרץ קושית האלשיך ז\"ל מדוע לא והא בנין המשכן דוחה שבת כמו כל קרבנות צבור שהשבת נדחית מפניהם. ואפ\"ל עפ\"י הא דאיתא בסוכה (דף מ\"א ע\"א) התקין ריב\"ז וכו' שיהא יום הנף כולו אסור באכילת חדש, וטעמא משום שמא יבנה ביהמ\"ק בט\"ו בניסן ויתחייבו בהקרבת העומר. וכתב רש\"י ז\"ל שם ואו קשיא דאין בנין ביהמ\"ק בחמשה עשר בניסן דקיי\"ל (שבועות ט\"ו ע\"ב) אין בנין ביהמ\"ק דוחה יו\"ט, ה\"מ בנין הבנוי בידי אדם, אבל מקדש העתיד שאנו מצפים בנוי ומשוכלל הוא יגלה ויבא משמים שנא' מקדש ה' כוננו ידיך עכ\"ל. והנה אלמלי זכו ישראל היה התקון השלם מיד, ושוב לא היו צריכים למעשי בני אדם בבנין המשכן, אלא היה יורד להם בנוי ומשוכלל משמים כמבואר בזה\"ק פנחס (דף ר\"כ ורכ\"א) וכבר כתבו גורי האריז\"ל בשמו שכל הל\"ט מלאכות שנמצאו בכל מלאכת העבודה, כלם נתהוו מן הל\"ט קללות שנתקללו אדם וחוה והנחש שבזה נתקללה האדמה וכל צבאיה, שלא תוציא הארץ צמחה כ\"א ע\"ע המלאכות, וע\"כ החיוב בששת ימי המעשה לברר ענפי הקדושה מכל דבר בל\"ע מלאכות ולפיכך בעת שיהי' התיקון השלם לא יהיו צריכין עוד לשום מלאכה, כאמרז\"ל ושבת ל' ע\"ב) עתידה א\"י שתוציא גלוסקאות וכלי מילת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 162,
      "char_length": 999,
      "timestamp": "2025-02-06T19:34:26.812908"
    },
    {
      "id": "ki sisa_p163",
      "text": "ועפי\"ז פירש אאמו\"ר זלה\"ה ובפ' ויקהל) לשון המשנה (שבת ע\"ג ע\"א) אבות מלאכות מ' חסר אחת. והקשה בתוי\"ט מדוע לא ניחא ליה לתנא המספר כמו שהוא ל\"ט, ופירש שבא לרמוז שכל אלו המלאכות לא שייכי אלא כל זמן שעדיין חסר אחת\"בנ היינו שחסר שלימות אחדות שמו יתברך, אבל בזמן שיהי' התיקון השלם לא יצטרכו לשום מלאכה, כי כבר יהי' נתקן הפגם ותצא הארץ מקללותיה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 163,
      "char_length": 336,
      "timestamp": "2025-02-06T19:34:27.321813"
    },
    {
      "id": "ki sisa_p164",
      "text": "ובזה נבא ליישב קושית האלשיך ז\"ל, דהנה כתבו התוס' בעירובין (דף ק' ע\"א דיה מתן) דבעשה הבא ע\"ו פשיעה ואילולא הפשיעה היה יכול להתקיים בלא דחיית הלאו לא אמרינן עשה דוחה ל\"ת, ע\"כ. ולפי זה י\"ל טעם שאין מלאכות המשכ דוחין שבת, דלא דמיין לקרבנות צבור הדוחים שבת, דשאני בנין המשכן שכל מה שהוצרכו בו למעשי בני אדם הוא משום שלא תקנו ישראל עדיין חטא אדה\"ר, ואילולי היו מתקנים פגם זה בשלימות, היה יכול להיות בנין המשכן בשבת בלא שידחה השבת מפניו, וא\"כ יש לדמות בנין המשכן לעשה הבא ע\"ו פשיעה שאינו דוחה ל\"ת, וכמו כן מעשה המשכן בידי אדם בא ע\"ו פשיעה, שלא זכו לתקן חטא אדה\"ר, ומשו\"ה לא דמיא לקרבנות ציבור הדוחום שבת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 164,
      "char_length": 597,
      "timestamp": "2025-02-06T19:34:27.527697"
    },
    {
      "id": "ki sisa_p165",
      "text": "והשתא א\"ש מה דילפינן מדכתיב אך את שבתתי למעט שבת ממלאכת המשכן, דהנה אמרו ז\"ל (שבת קי\"ח ע\"ב) אלמלי שמרו ישראל ב' שבתות מיד נגאלין שנא' כה אמר ה' לסריסים אשר ישמרו את שבתתי וכתיב בתריה והביאותים אל הר קדשי ע\"כ. נמצא מכאן כי מה שנתמעט שבת ממלאכת המשכן הוא מפני שלא השלימו ישראל שמירת ב' שבתות כהלכתן. ולפיכך כתיב אך את שבתתי תשמרו, דמה שנתמעט שבת ממלאכת המשכן הרי זה מיעוע לגבי שבת, שהרי זה מוכיח שלא שמרו ישראל שתי שבתות כהלכתן. שאם היו זוכים לשמור שתו שבתות כהלכתן היו זוכים מיד אל התיקון השלם, והיה אפשר להיות בנין המשכן בשבת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 165,
      "char_length": 526,
      "timestamp": "2025-02-06T19:34:27.862842"
    },
    {
      "id": "ki sisa_p166",
      "text": "ובזה יובן נמי דכתיב אתי' שבתתי ואת ריבויא היא, דרמז לנו הכתוב שע\"י שמירת שתי שבתות כהלכתן יתרבה שבת למלאכת המשכן, שהרי לא יצטרכו למעשי בו\"ד בבנינו, וכי תימא דא\"כ במה יוודע איפה ההבדל בין שבת לימות החול, והרי לא יהי' שייך כלל ענין מלאכה גם בימות החול, לז\"א הכתוב כי אות הוא ביני וביניכם לדעת כו אני ה' מקדשכם, כלומר שביום השבת יתעלו ישראל לבחינה גבוהה יותר, ויתקדשו בו בקדושה עילאה, ויהי' ענין שמירת שבת בבחינה גבוה בכוונת מחשבת המצוה, אף שלא יהי' נוהג במעשה. והנה בחינת המחשבה אין יודע ומבחין בה אלא יודע תעלומות לבדו, וזאת רמז הכתוב באמרו כי אות הוא ביני וביניכם וגו' והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 166,
      "char_length": 574,
      "timestamp": "2025-02-06T19:34:28.132413"
    },
    {
      "id": "ki sisa_p167",
      "text": "באופן אחר אפ\"ל הדקדוקים הנ\"ל בהקדם דברי הירושלמי (שבת פ' כלל גדול ה\"ב) מה בנין היה במשכן שהיו נותנין קרשים ע\"ג אדנים, ולא לשעה היתה ופי' בק\"ע, ולא לשעה היתה בנין הקרשים ואמאי יהא חייב) ותירצו בירושלמי א\"ר יוסי מכיון שהיו חונים ונוסעים עפ\"י הדבור כמי שהוא לעולם א\"ר יוסי בי רבי בון מכיון שהבטיחן הקב\"ה שהוא מכניסן לארץ כמי שהוא לשעה (פירש בקרבן העדה ידעו שלא יהיה הבנין לעולם) הדא אמרה בנין לשעה בנין, עכ\"ד הירושלמי. ולכאורה יש להקשות על הך מ\"ד דס\"ל בנין לשעה בנין, דא\"כ כיצד היה משה רבינו ע\"ה מקים את המשכן בשבעת ימי המילואים ואין שבעה ימים בלא שבת, והרי בנין לשעה הוו בנין.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 167,
      "char_length": 574,
      "timestamp": "2025-02-06T19:34:28.415272"
    },
    {
      "id": "ki sisa_p168",
      "text": "ואפ\"ל דגם מ\"ד בנין לשעה בנין היינו דוקא בבנין העתיד לעמוד משך זמן מסויים דחשיב בנין קבוע, משא\"כ בנין העומד לסתור מיד ביומו לא חשיב בנין כללו וכדמות סברא זו כתב הפני יהושע במס' ביצה בסוגיא דמתוך, ליישב קושית המפרשים על הרמב\"ם דס\"ל הבונה ביו\"ט חייב וקשה דנימא מתוך שהותרה בנין במגבן לצורך אוכל נפש הותר נמי בנין בעלמא, כמ\"ש התוס' שם, ותירץ דהא דאמרינן מגבן חייב משום בונה היינו דוקא במגבן לאוצר לייבש להצניע ימים רבים, דבכה\"ג הוי כבנין למען יעמדו ימים רבים, משא\"כ עשיית גבינות שהותרה ביו\"ט ע\"כ היינו לאכול לאלתר, וא\"כ לא שייכא ביה בנין כללו ולא גרע מבונה על מנת לסתור דפטור, וא\"כ לפי\"ז לא מצאנו שהותר בנין לצורך ביו\"ט וכו'. עכ\"ד הפני יהושע ז\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 168,
      "char_length": 642,
      "timestamp": "2025-02-06T19:34:28.701108"
    },
    {
      "id": "ki sisa_p169",
      "text": "ולפי זה נמצא כי אילו זכו ישראל להכנס לארץ מיד היה מותר לבנות המשכן בשבת, דהוי כבנין העומד לסתור מיד, והא דקאמר בירושלמי מכיון שהבטיחן הקב\"ה שהוא מכניסן לארץ כמי שהוא לשעה ויליף מיניה דבנין לשעה חייב, כוונתו דע\"י שקלקלו מעשיהם נתאחרה כניסתם לארץ, והוצרכו להתעכב במדבר מ' שנה, ומשו\"ה חייבים על בנין לשעה כיוצ בזה, שהוא קבוע ועומד לזמן מסוים.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 169,
      "char_length": 339,
      "timestamp": "2025-02-06T19:34:29.003499"
    },
    {
      "id": "ki sisa_p170",
      "text": "והנה (בפ' דברים) עה\"פ אחד עשר יום מחורב וגו', פרש\"י ז\"ל א\"ל משה ראו מה גרמתם, אין לכם דרך קצרה מחורב לקדש ברנע כדרך הר שעיר, ואף זו מהלך י\"א יום ואתם הלכתם אותו בג' ימים וכו', וכ\"כ היתה שכינה מתלבעת בשבילכם למהר ביאתכם לארץ, ובשביל שקלקלתם הסב אתכם סביבות הר שעיר מ' שנה עכ\"ל, אמנם איתא במכילתא פ' בשלח, אמר הקב\"ה אם אני מביא עכשיו ישראל לארץ, מיד מחזיקים איש בשדהו ואדם בכרמו והם בעלים מן התורה, אלא אקופם במדבר מ' שנה שיהיו אוכלין מן ושותין מי באר והתורה נבללת בגופן משמע דאף לולא גרמת החטא היתה מתעכבת כניסתם לארץ בשביל שיהא התורה נבללת בגופן והוא סתירה לכאורה, אמנם קושיא זו ל\"ק דאיתא בגמ' (ברכות ל\"ה ע\"ב) בזמן שישראל עושין רצונו של מקום מלאכתן נעשית ע\"ו אחרים שנא' ועמדו זרים ורעו צאנכם וגו', ובזמן שאין ישראל עושים רצש\"מ מלאכתן נעשית ע\"י עצמן שנא' ואספת דגנך, נמצא דאילולי החטא לא הי' קיים חשש הזה דמחזיקים איש בשדהו ואד בכרמו ויהיו בעלים מן התורה, דבעושין רצונו של מקום מלאכתן נעשית ע\"ו אחרים, ולא הי' צורך להקיפם במדבר לטעם זה, אלא בשביל שקלקלו והוצרכו להיות מלאכתן נעשית ע\"י עצמן, ע\"כ נתעכבו במדבר שלא יהיו בעלים מן התורה וחדא טעמא לתרווייהו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 170,
      "char_length": 1051,
      "timestamp": "2025-02-06T19:34:29.178368"
    },
    {
      "id": "ki sisa_p171",
      "text": "ובזה יובנו דברי רש\"י ז\"ל עה\"פ אך את שבתתי תשמרו, אע\"פ שתהיו רדופין וזריזין בזריזות המלאכה, שבת אל תדחה מפני'. (והדקדוקים כבר נפרטו לעיל) אמנם המשכן בא לכפר על חטא העג כאמרז\"ל, מעתה היו ישראל יכולים לחשוב דע\"י בנין המשכן יחזרו להבחי' שהיו קודם החטא, ובעושים רצש\"מ מלאכתן נעשית ע\"ו אחרים ולא יצטרכו להתעכב מ' שנה במדבר. ושוב הו' המשכן בנין לשעה ומותר בשבת, לזה בא הכתוב להזהיר אך את שבתתי תשמרו אע\"פ שתהיו רדופין וזריזין במלאכת המשכן, שבת אל תדחה מפני', דאף שהמשכן מכפר על חטא העגל, אמנם לשלימות האמיתי בבחי' שהיו ישראל קודם החטא לא חזרו עד לעתיד שיתוקן העון לגמרי, ועכשיו עדיין רושם החטא קיימת ושוב הוי בנין קבוע ואינו דוחה את השבת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 171,
      "char_length": 631,
      "timestamp": "2025-02-06T19:34:29.683430"
    },
    {
      "id": "ki sisa_p172",
      "text": "ועתה נבוא לבאר דברי המכילתא (הובא לעיל בדרוש הקדום) וז\"ל אך את שבתתי תשמרו למה נאמר, לפי שהוא אומר לא תעשה כל מלאכה, אין לי אלא דברים שהם משום מלאכה, משום שבות מנין, ת\"ל את שבתתי תשמרו להביא דברים שהם משום שבות ע\"כ וכתב הרמב\"ן ז\"ל (בפ' בא) דאין זה אלא אסמכתא בעלמא, וא\"א לומר דהפסוק אתיא לרבות שבות שלא אסרתו תורה מעולם וכו' עייש\"ד אמנם בפ' אמור כתב הרמב\"ן ז\"ל בעצמו דא\"א לומר שהוא אסמכתא עיי\"ש (הו\"ד לעיל), ועכ\"פ צ\"ב ליישב תמיהת הרמב\"ן ז\"ל דאיך בא הכתוב לרבות שבות שלא אסרתו תורה מעולם, גם איך נלמוד מאת שבתתי תשמרו דמיירי בדברים שהן משום שבות דייקא, ונקדים מ\"ד בפסיקתא זכור את יום השבת וגו' אין זכור אלא לאוה\"ע ואין שמור אלא לישראל ע\"כ והוא תמוה דהרי נכרי ששבת חייב מיתה, והתורה ניתנה לישראל בלבד, ואיך יתפרש אין זכור אלא לאומה\"ע.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 172,
      "char_length": 732,
      "timestamp": "2025-02-06T19:34:30.002396"
    },
    {
      "id": "ki sisa_p173",
      "text": "ונל\"פ דהנה הסמ\"ג הביא מדברי המכילתא, כל מלאכה לא יעשה בו ע\"י אחרים והיינו אמירה לעכו\"ם ומסיק דדרשא גמורה הוא ולפי\"ד אסירא מדאורייתא, ולכאורה הוא נגד הש\"ס דילן דמבואר בכ\"מ דאמירה לעכו\"ם אינו אלא שבות מדבריהם אולם אפשר להשוות דבריהם עם שיטת הש\"ס דילן דלא פליגי, עפימ\"ש הגאון ר' יהושע העשיל זלה\"ה וכבר הובא כן בדברי האריז\"ל, לפרש הכתוב אך את שבתתי תשמרו דאזהרת התוה\"ק בכאן על שמירת שבת בדיבור, ולז\"א את שבתתי תשמרו ר\"ל שבתות שלי, דהבוי\"ת כביכול שבת בו מדיבור, כי בדבר ד' שמים נעשו, וכמו\"כ ישמרו ישראל את השבת מלעשות בו מלאכה ע\"י דבור ע\"כ תוכן דבה\"ק, אמנם לכאורה איכא לאקשויי דאצל הבוי\"ת הדיבור כמעשה, דהכל נברא במאמרו ית\"ש, ע\"כ יצדק שם שביתה גם על הדיבור בלבד, משא\"כ אצל בנ\"א לא הוי דיבורם מעשה כלל ואף אם מצוה בדיבורו לאחר לעשות מעשה, מ\"מ כיון שאין בכח דיבורו להכריח עשייתו, לא נחשב לו כמעשה וכמ\"ש הרא\"ש ז\"ל דהמשסה לכלב שינשך לא נחשב לו כמעשה רק גרמא בנזקין, מפני שאין הכלב מוכרח לצייתו, וכיון שדיבורו לא הוי מעשה איך יצדק עליו שם שביתה, ובודאי שלא יתכן לקראו בשם מלאכה וצ\"ב דברי המכילתא הנ\"ל דיליף מכל מלאכה לא יעשה בהם דאמירה לעכו\"ם דאורייתא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 173,
      "char_length": 1042,
      "timestamp": "2025-02-06T19:34:30.359801"
    },
    {
      "id": "ki sisa_p174",
      "text": "ואפשר לחלק דבעושין רצונו של מקום מלאכתן נעשית ע\"י אחרים, והוא מברכת יצחק אבינו יעבדוך עמים וגו', אז נחשב דיבורם למעשה, דהעכו\"ם מוכרח לציית ולעשות מלאכה עפ\"י דיבורו, אמנם ח\"ו באין עושים רצונו של מקום כתיב והי' כאשר תריד ופרקת עולו מעל צואריך, ואין בכח דיבורם להכריח העכו\"ם לעשייתו. בכה\"ג דיבורם לא הוו מעשה, ואפשר דהסמ\"ג והמכילתא מיירו בזמן שישראל עושים רצונו של מקום, ואז הוי אמירה לעכו\"ם מלאכה דאורייתא, ובש\"ס דילן מיירי באין עושין רצש\"מג ע\"כ אמירה לעכו\"ם רק שבות וא\"ש, ובזה יתבאר ג\"כ דברי המכילתא עה\"פ אך את שבתתי תשמרו, לפי שהוא אומר לא תעשה כל מלאכה, אין לי אלא דברים שהם משום מלאכה, משום שבות מנין, ת\"ל את שבתתי תשמרו להביא דברים שהם משום שבות, ולדרכינו אפשר שריבה הכתוב כאן אמירה לעכו\"ם, ונרמז במאמר את שבתתי תשמרו, ר\"ל שבתות שלי ששבת ית' מדיבור, ובזמן שישראל עושין רצש\"מ הוי מלאכה דאורייתא, וסרה תמיהת הרמב\"ן ז\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 174,
      "char_length": 820,
      "timestamp": "2025-02-06T19:34:30.854810"
    },
    {
      "id": "ki sisa_p175",
      "text": "ולדרכינו יבוארו דברי הפסיקתא אין זכור אלא לאומה\"ע ואין שמור אלא לישראל, דהנה בדברות ראשונות כתיב זכור ובשני' שמור, ורז\"ל אמרו זכור ושמור בדיבור א' נאמרו, וכתב הרמב\"ן ז\"ל (בפ' יתרו) ואני תמה אם נאמר זכור ושמור מפי הגבורה למה לא נכתב בלוחות הראשונות גם שמור בפירוש עיי\"ש לדרכו, ואפ\"ל דהנה קבלו חז\"ל זכור בפה, והיינו שישמרו ישראל את השבת מלעשות מלאכה בדיבור, ומה שדרשו ז\"ל זכרהו על היין הוא רק אסמכתא, דעיקר מצות שמירת שבת הוא בשוא\"ת, שימנע את עצמו מלעשות מלאכה כידוע, והאיך אפשר לצוות על השמירה ממלאכה בפה, אם אין בכח דיבורו להכריח המלאכה בלא\"ה, אמנם זה נאמר בזמן שישראל עושין רצונו של מקום דהדיבור נחשב למעשה כנ\"ל, וע\"כ השביתה מדיבור הוי שמירה בשב ואל תעשה, והשתא א\"ש דבלוחות הראשונות שנתנו קודם החטא, ובעושון רצונו של מקום מלאכתן נעשית ע\"ו אחרים, והי' בכח דיבורם להכריח העכו\"ם על עשייתו, נמצא הי' מתקיימת שמירת שבת בשב ואל תעשה ע\"ו שביתה מדיבור, ע\"כ כתיב זכור בפה, ובאה הקבלה על שמור דבדיבור א' נאמרו, אבל לא נכתב בלוחות בפירוש, כי עיקר השמירה בפה הי', ולא הי' מלאכה נוהגת בעצמן כללו ובלוחות שניות אחר החטא לא הי' עוד בכח דיבורם להכריח ולא נחשב למעשה, א\"כ לא הי' אפשר לקיים מצות השביתה ממלאכה בפה, ע\"כ כתיב שמור שישמרוהו מעשיית מלאכה בפועל, וז\"פ דברי הפסיקתא אין זכור אלא לאומה\"ע, דלדרכנו אזהרת זכור על אמירה לעכו\"ם אתיא. ואין שמור אלא לישראל כשאין מלאכתן נעשית ע\"י אחרים, הוזהרו על השמירה והמניעה ממלאכת עצמם והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 175,
      "char_length": 1315,
      "timestamp": "2025-02-06T19:34:31.242966"
    },
    {
      "id": "ki sisa_p176",
      "text": "והנה אם ישראל הם בבחי' עושין רצש\"מ ודיבורם כמעשה, אזי נתוסף להם חלק גדול במצות שמירת השבת, דחוץ ממה ששובת במניעת מלאכה בעצמו, ניתוסף לו מצות השביתה במה שמונע א\"ע מלצוות לאחרים לעשות מלאכה, ובמציאות לצוות לאנשים הרבה על מלאכות הרבה בשבת א', וע\"י המניעה ניתוסף לו מצות שביתות הרבה, וכאילו שמר שבתות הרבה, מה שלא הי' במציאות להשיג ע\"י השביתה ממלאכת עצמו בשבת אחד, נמצא דבאין עושין רצש\"מ, ואין בכח דיבורם להכריח העכו\"ם לעשותו, נתמעט מצות השביתה אצלם, דא\"א לקיימה כ\"א בשביתת מלאכת עצמו והבן, ומזה דאין בנין המשכן דוחה את השבת, נשמע דמיירי באין עושין רצש\"מ ומלאכתן נעשית ע\"י עצמן, והיו מוכרחין להתעכב במדבר מטעם חששא דזה פונה לכרמו, נמצא הוי בנין קבוע ואינו דוחה שבת כנ\"ל, וזהו מיעוט לשבת שאבדו חלק גדול ממצות השביתה, ע\"ו שאין בכח דיבורם להכריח העכו\"ם על עשייתו, וז\"פ דברי רש\"י ז\"ל אך את\" שבתתי תשמרו, כל אכין ורקין מיעוטין, למעט שבת ממלאכת המשכן, דממה דלא הותר להם בנין המשכן נתמעט אצלם חלק גדול ממצות השביתה, מ\"מ לגבי עצם קדושת השבת הוי רבויא, דאינו נדחה אף מפני המשכן, ולזה אתי את\"צ לרבות (ומתורצין הקושות ו' ז' הנ\"ל).",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 176,
      "char_length": 1015,
      "timestamp": "2025-02-06T19:34:31.847325"
    },
    {
      "id": "ki sisa_p177",
      "text": "ובמדרש ילקוט ורמז ש\"צ) ויאמר ד' אל משה לאמר לא ע\"י מלאך ולא ע\"ו שליח, את שבתתי תשמרו וכו' אין לי אלא דברים שהם משום מלאכה, דברים שהן משום שבות מנין ת\"ל אך את שבתתי תשמרו להביא דברים שהן משום שבות, כי אות הוא ביני וביניכם ולא בינו לבין האומות, לדעת כי אני ד' מקדשכם לעוה\"ב עכ\"ד המדרש וכולו מוקשה, ולדרכינו יתבאר בטוטו\"ד דאומה\"ע אף אלמלי היו מקבלים את התורה, אבל לבחי' זה שיהי' כח דיבורם נחשב למעשה לא היו יכולים להגיע, דמתנה זו לא נתן הקב\"ה רק לישראל עם קרובו כשעושין רצש\"מ, וז\"פ אצלינו במאמר הכתוב מגיד דבריו ליעקב, ר\"ל דבריו של הקב\"ה שהוא כמעשה, בחי' זו המשיך הבוי\"ת רק לישראל ומגיד מלשון המשכה, לא עשה כן לכל גוו, דלא נתן להם הבוי\"ת מתנה זאת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 177,
      "char_length": 644,
      "timestamp": "2025-02-06T19:34:32.344152"
    },
    {
      "id": "ki sisa_p178",
      "text": "וז\"פ בדברי הילקוט כי אות הוא ביני וביניכם ולא ביני לבין האומות, היינו בחי' זו של שבתתי תשמרו דהדיבור כמעשה כאמור, הוא לאות ביני וביניכם דייקא, ולא לאומה\"ע אף אם היו מקבלים את התורה ומצות השבת, לא הי' ניתן להם בחי' זו, ובאמת אף ישראל לא זכו אלי' רק קודם החטא כנ\"ל, לז\"א לדעת כי אני ד' מקדשכם לעוה\"ב דאז יתוסף ויתרבה קדושתן של ישראל, ויחזרו לבחי' שהיו קודם החטא, וז\"פ ויאמר ד' אל משה לאמר לא ע\"י מלאך ולא ע\"ו שליח, דאף המלאכים לא הוי דיבורם כמעשה ואין בכח דיבורם להכריח, וזו הוא ממדת גדלו ית\"ש ומסרו רק לצדיקים עושים רצונו, ע\"כ כשגילה הקב\"ה בחי' זו למשרע\"ה בפ' זה מסר לו דבר זה בצנעא וז\"פ ויאמר ד' אל משה לא ע\"י מלאך ולא ע\"י שליח, כדי שלא יתקנאו המלאכים בנו, שגדולים ישראל יותר ממה\"ש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 178,
      "char_length": 682,
      "timestamp": "2025-02-06T19:34:32.702398"
    },
    {
      "id": "ki sisa_p179",
      "text": "עוד יתבאר בענין הנ\"ל, בהקדם מה שהקשינו לעיל מדוע נדחה בנין המשכן בשבת, והרי קיי\"ל שנים שעשאוהו פטורים, והי' אפשר שתיעשה כל מלאכת המשכן בצירוף רבים, ואף דבכה\"ג ג\"כ אסירא מדרבנן, אבל שבותי דרבנן עדיין לא ניתנה להם, גם דאין שבות במקדש ואפ\"ל עפ\"י הקדמת אאמו\"ר זלה\"ה בקדושת יו\"ט ופ' ויקהל) דמה שציותה התורה הקדושה, אף שבעצם איננו מלאכה כלל, מ\"מ מצות הבוב\"ה עושהו מלאכה ועשי', וכאשר נשובה ונחקורה אז נראה בעליל בכל תהלוכותנו שכן הואל ונחזי אנן כו טרחא גדולה הוא אצל כל איש ואיש שיהי' נעור כל הלילה ללמוד בתוה\"ק וכו', וכן אפי' מלאכה קטנה מזה כגון לילך אף דרך קצר בשביל איזה מצוה קשה מאוד בעיני כל איש ואיש, אמנם מלאכה זו אם ירצה לעשותה עבור עניני עוה\"ז, קרוב הדבר מאוד אצלו לעשותה, ויהי' נעור אף כמה וכמה לילות לא ועף ולא יגע בשביל איזה דבר קטן מצורכי פרנסתו ולא יהי' לו לטירחא כלל וכו' והנה ידוע דמלאכת המשכן נעשה מאליו בלו שום מלאכה כלל וכו', ובזוה\"ק (פקודי רכ\"ב) ביהמ\"ק מגרמא אותעבידת, ובמנורה כתיב תיעשה המנורה פרש\"י מאליה וכו', א\"כ לפי\"ז לא הי' שום מלאכה בעצם מלאכת המשכן, אך לפי האמור דמה שבא מציווו הבוב\"ה זהו נקרא מלאכה ועשי' אף שבעצם אינו מלאכה, א\"כ גם מלאכת המשכן שפיר נקרא מלאכה ועשי' שיש חילול שבת במלאכה דרחמנא אחשבי' עכדה\"ק, ועד\"ז יתבאר לעניננו דאף דבעלמא לא נחשב שנים שעשאוהו למלאכה כלל אבל במלאכת המשכן לגודל קדושת מצותו ג\"ז למלאכה יחשב דרחמנא אחשבי'.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 179,
      "char_length": 1260,
      "timestamp": "2025-02-06T19:34:33.093952"
    },
    {
      "id": "ki sisa_p180",
      "text": "אמנם סברא זו תצוייר רק לגבי פשוטי העם. שקשה עליהם להתגבר על יצרם במצות הבוית\"ש, ע\"כ אף נדנוד קל אם הוא מצוה נחשב בעיניהם למלאכה כבידה, משא\"כ בצדיקים ששים ושמחים לעשות רצון קונם, ולגודל תשוקתם המלאכה נעשית מאליה, ואין מרגישים שום טירחא בעשייתה, ולזה אחר שעשו ישראל תשובה ומחל להם הקב\"ה על עון העגל ונצטוו על עשיית המשכן, היו יכולים לחשוב שכבר חזרה עטרה ליושנה, ולגודל זריזותם ותשוקתם לבנין המשכן לא יהי' נחשב בעיניהם לטירחא מה שאינו מלאכה בעצם, וא\"כ אפשר שתיעשה מלאכת המשכן בשבת בצירוף שנים כנ\"ל, לזה בא הכתוב להזהיר אך את שבתתי תשמרו, וכפרש\"י אע\"פ שתהיו רדופין וזריזין בזריזות המלאכה, שבת אל תדחה מפני', והטעם כי לא חזרו ישראל אל בחי' שקודם החטא, וזה יהי' רק לעתיד כשיתוקן העון לגמרי, ולפי מדריגתם של עכשיו מצות הבוב\"ה מחשבה למלאכה אף מה שאינו מלאכה בעצם והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 180,
      "char_length": 760,
      "timestamp": "2025-02-06T19:34:33.735800"
    },
    {
      "id": "ki sisa_p181",
      "text": "ויאמר ה' אל משה לאמר ואתה דבר אל בני ישראל לאמר אך את שבתותי תשמרו וגו', יל\"ד אומרו ואתה שלא מצינו כן בשאר המצות, וגם בפרשת ואתה תצוה את בנ\"י נתקשו בו המפורשים, והרמב\"ן הק' פי' שם שהוא בעצמו יצוה להם ולא ע\"י שליח, ומה נדרוש כאן במלת ואתה שהוא מיותר, שהרי כל התורה כולה הי' משה רבינו המצווה לישראל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 181,
      "char_length": 297,
      "timestamp": "2025-02-06T19:34:34.098094"
    },
    {
      "id": "ki sisa_p182",
      "text": "ב) אך את שבתותי תשמרו פירש\"י ז\"ל אע\"פ שתהיו רדופין וזריזין בזריזות המלאכה, שבת אל תדחה מפניה, וקשה ממה נפשך אם בנין המשכן דוחה שבת, אם כן אפילו אין זריזין גם כן דוחה ואם אינו דוחה שבת מה יוסף תת מה שיהיו זריזין.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 182,
      "char_length": 211,
      "timestamp": "2025-02-06T19:34:34.269019"
    },
    {
      "id": "ki sisa_p183",
      "text": "ג) הקשה המזרחי מה ס\"ד שבנין המשכן ידחה שבת, הלא און עשה דוחה לא תעשה ועשה, ובנין המשכן הוא רק עשה ושבת לית ועשה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 183,
      "char_length": 112,
      "timestamp": "2025-02-06T19:34:34.416148"
    },
    {
      "id": "ki sisa_p184",
      "text": "ד) אד את שבתותי תשמרו, פירש\"י ז\"ל כל אכין ורקין מיעוטין למעט שבת ממלאכת המשכן, והקשה עליו הרמב\"ן הק' דזה שבנין המשכן אינו דוחה שבת הוא מיעוט לגבי המשכן ולא לגבי שבת, דאדרבה ריבוי הוא לגבי שבת שאינו נדחה מפני בנין המשכן והי' לו לכתוב מיעוטא זו לגבי בנין המשכן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 184,
      "char_length": 259,
      "timestamp": "2025-02-06T19:34:34.512052"
    },
    {
      "id": "ki sisa_p185",
      "text": "ה) גם יל\"ד דאתין וגמין רבויין הן. וכאן כתיב אך שהוא מיעוט וכתיב את לרבות, מה בא הכתוב למעט ומה בא לרבות.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 185,
      "char_length": 104,
      "timestamp": "2025-02-06T19:34:34.661206"
    },
    {
      "id": "ki sisa_p186",
      "text": "ו) קשה קושית המהרש\"א דמסכת נדה (דף ל\"ח) שהקשה על מה דאיתא בגמ' שבת (דף קי\"ח ע\"ב) אר\"י משום רשב\"י אלמלי משמרין ישראל שתי שבתות כהלכתן מיד נגאלין שנאמר כה אמר ה' לסריסים אשר ישמרו את שבתותי וגו', שדייק מלשון שבתותי שהוא שנים, והקשה המהרש\"א הרי כתיב בתורה אך את שבתותי תשמרו, ובוודאי הכוונה שישמרו ישראל כל שבתות ומי העולם לא רק שנים.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 186,
      "char_length": 331,
      "timestamp": "2025-02-06T19:34:34.758844"
    },
    {
      "id": "ki sisa_p187",
      "text": "ז) עוד יל\"ד שמבואר בתורה אזהרת שבת בדברות ראשונות ובדברות אחרונות ובפרשת אמור ועוד בכמה מקומות, אלא שרוצה הכתוב להודיענו שהעוסקים במלאכת המשכן לא יעסקו בשבת, א\"כ הי' לו לומר דבר אל העוסקים במלאכה אך את שבתותי תשמרו, ולא דבר אל בנו ישראל שכבר מבואר בתורה כמה פעמים לבני ישראל שישמרו שבת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 187,
      "char_length": 286,
      "timestamp": "2025-02-06T19:34:34.945927"
    },
    {
      "id": "ki sisa_p188",
      "text": "ונל\"פ בהקדם דברי אאמו\"ר זלה\"ה בקדושת יו\"ט פרשת ויקהל לתרץ קושית הרא\"ם זיל, עפומ\"ד בילקוט הוקם המשכן הוקם מאליו, וכן בזוהר פקודי (דף רכ\"ב) ביהמ\"ק מגרמא אותעבודת וכו', א\"כ לפי\"ז לא הי' מלאכה בעצם בעשיית המשכן, רק דמה שבא בציווי הקב\"ה זה נקרא מלאכה ועשי' מטעם אחשבי' (עיי\"ש שהרחיב הביאור בזה), אבל מ\"מ עשה דשבת שבתון הוא מקיים ואינו עובר עליו, כיון שגופו נייח ואינו עושה מלאכה בעצם, ומתורץ בזה קושית הרא\"ם ז\"ל, דהי' ס\"ד לומר דמלאכת המשכן ידחה את השבת, שבמלאכה זו ליכא אלא ל\"ת, ועשה דוחה ל\"ת לחודי', ע\"כ קמ\"ל קרא דאינו דוחה, והטעם דרחמנא אחשבי' למלאכה, והוי מלאכה וטירחא כמו שאר מלאכות ועובר על עשה ול\"ת בעשייתה ואינו דוחה את השבת. עכדה\"ק עיי\"ש בביאור יותר, וצ\"ל דהקמת המשכן שאני שנעשית ע\"ו הקב\"ה ומשרע\"ה הי' רק נראה כמסייע, וכעין זה כתב בספר תורת משה להחת\"ס זלה\"ה (פ' ויקהל) דבז' ימי מלואים הי' משרע\"ה מקים את המשכן, ואין ז' ימים בלא שבת, והותר לו משום שהקב\"ה הי' מקימו ומשרע\"ה הי' רק נראה כמסייע, כמ\"ש רש\"י ז\"ל פ' פקודי אמר משה לפני הקב\"ה איך אפשר הקמתו ע\"ו אדם, אמר לו עסוק אתה בידך נראה כמקימו והוא נזקף ועומד מאליו וכו' מדרש תנחומא ע\"כ, ומזה ראי' לדברי האחרונים שתירצו קושית הרא\"ש ז\"ל בערבי פסריר אי ס\"ד משרע\"ה מת בשבת איך כתב י\"ב סעניו תורות באותו היום, ותירצו שנכתבו מעצמם ע\"ו השבעות וכדומה ע\"כ הותר בשבת, ויש הכרח גדול לדין זה ממשכן שהועמד עצו משרע\"ה אף דאין בנין המשכן דוחה שבת, וע\"כ מה\"ט כיון שלא הי' בכח אדם כלל רק נראה כמקומו עכת\"ד החת\"ס ז\"ל, ובאמת אין ראי' זו מכרחת, דהרי פליגי בירושלמי שבת פרק כלל גדול (ה\"ב) אם בנין לשעה הוי בנין, ובז' ימי המלואים הי' הקמתו רק לשעה ובכל יום הי' מקימו ומפרקו ואולי דהותר מה\"ט ואין מזה ראי' על כתיבת ס\"ת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 188,
      "char_length": 1547,
      "timestamp": "2025-02-06T19:34:35.096012"
    },
    {
      "id": "ki sisa_p189",
      "text": "ונקדים עוד דברי הגמ' (סוכה מ\"א ע\"א) ושיהא יום הנף כולו אסור, מ\"ט מהרה יבנה ביהמ\"ק וכו' דאיבני אימת וכו' ותירצו סמוך לשקיעת החמה בחמיסר, והקשה רשיז\"ל הרי קיי\"ל דאין בנין בית המקדש דוחה יו\"ט, ותירץ דה\"מ בנין הבנוי בידי אדם, אבל מקדש העתיד שאנו מצפין, בנוי ומשוכלל הוא יגלה ויבא משמים שנאמר מקדש ה' כוננו ידיך עכ\"ל רשיז\"ל, וכ\"כ התוס' והרשב\"א והריטב\"א לתרץ קושיא זו עיי\"ש, ובספרי ויואל משה (מאמר א' סי' ס\"א) הארכתי בזה דישנם כמה ראיות שביהמ\"ק מ\"ק לעתיד יבנה בידי אדם, ובערוך לנר (שם סוכה דף מ\"א) הכריע דתרווייהו איתנייהו שקודם יבנו בנין ממש בידי אדם, ואח\"כ יבוא הביהמ\"ק של מעלה לתקן הבית כנשמה בתוך הגוף, וכמו שירד במשכן ובמקדש האש של מעלה בתוך האש של הדיוט הנבער בעצים, גם אא\"ז זלה\"ה ביוטב פנים כתב כעי\"ז עיי\"ש, אמנם זה מספיק רק לתרץ סתירת דרז\"ל הנ\"ל, אבל דעת רש\"י ותוס' א\"א ליישב בהכרעה זו, שהרי כתבו דבנין העתיד אפשר להיות בנינו ביו\"ט ובלילה, דמ\"ש חכז\"ל אין בנין ביהמ\"ק בלילה ואינו דוחה יו\"ט, ה\"מ בנין הבנוי בידי אדם, אבל מקדש העתיד בנוי ומשוכלל יבא מן השמים, ואי נימא דיהי' צורך בו גם בנין בידי אדם, א\"כ הדרא קושיא לדוכתי' האיך יהי' נבנה ביו\"ט אך לפי מ\"ש דמה\"ט הותרה הקמת המשכן בשבת, משום דבנין לשעה אינו בנין אפשר שגם לעתיד יהי' הבנין הבנוי בידי אדם רק לאותו היום בלבד, ביודעם שתיכף יבוא בית בנוי ומשוכלל, ולא יהי' בנינם אלא לשעה באופן שמותר בשבת ויו\"ט וכדרך שהי' במשכן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 189,
      "char_length": 1271,
      "timestamp": "2025-02-06T19:34:35.862445"
    },
    {
      "id": "ki sisa_p190",
      "text": "ואפ\"ל עוד עפ\"י המבואר בדרז\"ל דהעסק והלימוד בבנינו נחשב כאילו עוסקים בבנינו ממש, כדאיתא במדרש ילקוט (יחזקאל רמז שפ\"ב) בשעה שנגלה הקב\"ה והראה ליחזקאל צורת הבית ותכונתו ומוצאיו, אמר הקב\"ה הגד את בית ישראל את הבית, א\"ל יחזקאל מרי וכו עכשיו הם בונים שאמרת וישמרו את כל צורתו וגו' ועשו אותם, אמר לו לאו אע\"פ שאינם עושים אותו עכשיו, יהו קורים בצורת הבית ואני מעלה כאלו בבנינו עם עסוקים, ובפסיקתא שמואל אמר ואם נכלמו מכל אשר עשו צורת הבית, וכי יש צורת הבית, אלא אמר הקב\"ה הואיל ואתם מתעסקים בו כאלו אתם בונים בו עכ\"ל הפסיקתא, ודייק התויו\"ט דמשו\"ה אמר בונים בו (משמע מקצתו) ולא אמר בונים אותו ור\"ל כולו) בשביל שהרבה ענינים שבבנין זה סתומים בלתי מפורשים ואינם מובנים כלל, וכ\"כ הרמב\"ם ז\"ל בפ\"א מה' בית הבחירה וז\"ל, בנין העתיד להבנות אע\"פ שהוא כתוב ביחזקאל, אינו מפורש ומבורר, ואך אליהו ומשיח עתידים לבארו לנו כולו עכ\"ל, וא\"כ לעתיד אחר שיבואו אליהו ומשיח וילמדו לישראל להבין כל צורת הבנין מה שלא הבינו מקודם, ויעסקו בכולו בהבנה ובדקדוק היטב, הוי וודאי כבנאו כולו, אף שאח\"כ יבא מן השמים בנוי ומשוכלל, ולא יצטרכו לעשות עוד מאומה, מ\"מ יהא נקרא על שמם, שבנו ביהמ\"ק ע\"ו העסק שעסקו בהבנתו, שבכח זה יהא נמשך הבית מלמעלה על מכונו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 190,
      "char_length": 1110,
      "timestamp": "2025-02-06T19:34:36.449868"
    },
    {
      "id": "ki sisa_p191",
      "text": "עוד אמרז\"ל במדרש תהלים (ל') מזמור שיר חנוכת הבית לדוד, וכי דוד בנאו, אלא בשביל שחשב לבנות ביהמ\"ק אע\"פ שלא בנאו נכתב בשמו שנא' מזמור שיר חנוכת הבית לדוד, גם אפשר שיגבו מישראל נדבת לבם לבנין העתיד כמו שנעשה במשכן, ובזה וודאי נקראים בונים. אף שאח\"כ ירד הביהמ\"ק בנוי ומשוכלל מן השמים ויעשו מהמעות שאר צרכי הביהמ\"ק, כמו שנעשה מהמותר בנדבת המשכן, והרמב\"ם ז\"ל וסוף ה' מלכים) כתב דכל אלו הדברים שיהיו אחר ביאת המשיח לא נתגלו לנו איך שיהיו אלא צריך להאמין דרך כלל, אבל פרעי הענינים יתגלו לנו רק אחר ביאת המשיח עיי\"ש וא\"כ גם בזה לא נוכל לידע מה יעשו ישראל בבנין ביהמ\"ק שאינו נאסר בשבת, כי העיקר יבא מן השמים, ואעפ\"כ יהיו נקראים בונים, וכעין שאמרו בגמ' (שבת צ\"ב ע\"ב) בשנים שעשאוהו דילפינן מקרא דפטורי, ובזה יכול וזה אינו יכול, שאינו יכול פטור אף דעושה ג\"כ מעשה, מפני שאינו אלא כמסייע והרי גם בכתיבת ס\"ת שהביא החת\"ם בשם המפורשים דלכן הי' מותר לכותבה בשבת, יען שהי' הכתיבה מן השמים בלא כח אנושי, ואעפ\"כ מבואר בכ\"מ שמשה כתב התורה. וצ\"ל שבשביל שעשה איזה פעולה בהכתיבה שבזה המשיך האותיות מלמעלה, נקראת על שמו שהוא כתבה, וע\"ד שכתב רשיז\"ל עה\"פ עפ\"י ה' יסעו בני ישראל ועפ\"י ה' יחנו כיון שהיו ישראל חונים, עמוד ענן מתמר ועולה ונמשך ע\"ג בני יהודה כמין סוכה ולא הי' נפרש עד שאמר משה שובה ה' רבבות אלפי ישראל, הוי אומר עפ\"י ה' וביד משה עכ\"ל הרי דאף שהי' עפ\"י ה\"כ מ\"מ כיון שבא ע\"י דבורו של משה אמר הכתוב שהי' ביד משה, וא\"כ און שום קושיא מה שמבואר בכ\"מ בדברי רז\"ל שישראל יבנו ביהמ\"ק דלעתיד בידי אדם, אף שוודאי יבא הבית בנוי ומשוכלל מלמעלה, כי א\"א לידע מה יעשו ישראל אז בדיבור או במעשה להמשיך את ביהמ\"ק מלמעלה, ועי\"כ יהיו נקראים בונים אף שלא יעשו מלאכה הנאסרת בשבת, ויתבארו בזה דעת רש\"י והתוס' ז\"ל וסתירת דברי רז\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 191,
      "char_length": 1589,
      "timestamp": "2025-02-06T19:34:36.977408"
    },
    {
      "id": "ki sisa_p192",
      "text": "אולם כ\"ז רק בבנין העתיד, אבל אין לדמות לזה מלאכת המשכן, אף שהוקם מאליו מן השמים מ\"מ אינו דומה כלל לבנין העתיד, דמלבד שבבנין העתיד ובא הביהמ\"ק עם כל הכלים בנוי ומשוכלל, ובמשכן לא הי' אלא ההקמה בלבד שלא הי' משרע\"ה יכול להקימו בלא כח עליון, וגם המנורה שנתקשה בו משה כאמרז\"ל, אבל שאר המלאכות שבמשכן ובכליו שנעשה ע\"י החכמים עושי המלאכה, הי' נעשה בידי אדם לגמרי, דמשם ילפינן כל ל\"ט מלאכות שנאסרו בשבת, אלא אף הקמת המשכן שנעשה בכח עליון מ\"מ אין ראי' לדמותו לבנין העתיד שיבא לגמרי בנוי ומשוכלל מן השמים, ובהקמת המשכן יכול להיות שהי' הכרח גם למעשה ידיו של משרע\"ה, דהנה מבואר בזוה\"ק ופ' פנחס דף ר\"כ) דגם בית ראשון ושני הי' ראוי שירדו בנוי ומשוכלל מן השמים ולא מעשה ודי אדם, אלא מפני שגרם החטא ע\"כ נבנה בידי אדם ולא אתקיימוק ובנין העתיד יהי' ע\"ו הקב\"ה כביכול בעצמו וע\"כ יהי' בנינו נצחי ועומדת לעד, ומה\"ט אפ\"ל גם במשכן שהי' ההכרח לבנותו בידי אדם דייקא, על פימ\"ש ק\"ז הישמח משה זלה\"ה ובפ' תרומה) דלכאורה קשה למה צריך הקב\"ה לנדבת ישראל לבית ולמשכנו, הלא לו הכסף ולו הזהב נאום ה' צבאות וכו', אבל הענין הוא דכבר אמרו רז\"ל משכן משכן שנתמשכן ב' פעמים בשביל עונותיהם של ישראל, וכבר פירשתי דזה הכח שהי' במקדש לכפר עוונותיהם ויהי' שקול ככל ישראל וכו', משום שנעתק הקדושה של המשכן שעשה משה בו כמו המעתיק מכתב לכתב וכו', והנה אם לא הי' נעשה משל ישראל כלל, לא היה יכול להתמשכן בעונותיהם, כמו המקדש דלעתיד דאין לבשר ודם חלק בו לא יחרב, וא\"כ אף המקדשים דנעתקו מהמשכן לא היו יכולים ליחרב, והי' נתקעקע בוצתן של ישראל ח\"ו בעונותיהם, לכך רצה השי\"ת שיבנהו משל ישראל כדו שותמשכן בעונותיהם עכדה\"קל וכמו\"כ אפשר דמה\"ט הי' מוכרח שיהי' בנינו בידי אדם דייקא, כדי שיתמשכן בעונותנהם, משא\"כ בנין העשוי בידי שמים הוא נצחי לעד כמבואר בזוה\"ק הנ\"ל, וא\"כ אפשר שגם בהקמת המשכן שהוקם בכח עליון, מ\"מ לא בא הכח מלמעלה בכל היכולת באופן שלא יהי' צורך כלל למעשה ידי אדם, אלא בא לסייע למה שלא הי' אפשרות להקימו בידי אדם לבדו, אבל הי' צורך גם למעשה ידו אדם לא כמו בנין העתיד, דמה שיעשו ישראל אז בבנין ביהמ\"ק אינו אלא כדי לזכותם במצות הבנין, אבל עיקר הבנין יבא מן השמים ביכולת מספיק שאין בו צורך לשום סיוע בידי אדם, כדי שיהי' נצחית ולא יחרב, משא\"כ המשכן מוכרח שיהי' בו כח אדם, יען שנעתק אל המקדשות שנחרבו, נמצא לדעת שכ\"ז גרם החטא, שלא היו ראויים ישראל עדיין לגאולה השלימה כמו לעתיד שיהי' הכל נצחית, שאם היו ראויים אז לגאולה נצחית, הי' גם המשכן כילו בא מן השמים כמו בנין העתיד, שאפשר שיהי' נבנה בשבת יען שבא מן השמים ביכולת מספיק שיהא נצחית, ואף אלו הי' איזה עשי' בידי אדם הוי כמסייע שאין בו ממש, ואינו אלה לזכותם. אבל לא באופן שיהי' מלאכה הנאסרת בשבת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 192,
      "char_length": 2393,
      "timestamp": "2025-02-06T19:34:37.759035"
    },
    {
      "id": "ki sisa_p193",
      "text": "ואיתא בספה\"ק נועם מגדים ופ' אמור) שע\"כ צריך לומר שלא נשמר עדיין שבת כהלכתה בכלל כל ישראל על אופן הצריך. דאל\"כ תקשה קושיא חמורה שהרי אמרו חכז\"ל (שבת דף קי\"ח ע\"ב) אלמלי משמרין ישראל שתו שבתות מיד היו נגאלין, ואת זאת תדע ברור כשמש שגם בהיות ישראל שרויין על אדמתם בשלום ובהשקט ובגפו מרומי קרת אפי' בימי דוד ושלמה, היו צריכין אל הגאולה וביאת המשיח וכו', וא\"כ יקשה מדוע לא בא בן ישי בזמנים הללו שהיו ישראל בהשקט ובצדקות, ויקשה על דברי רז\"ל שע\"י שמירת שבת כהלכתו בא ובא משיח צדקינו וכו', וע\"כ דדבר זה שמירת שבת כהלכתו לכל ישראל או רובן הוא דבר יקר עד לאחת, ומי יודע מה הוא כהלכתו, עד כמה צריך להיות הדחילו ורחימו והחדוה שזכינו לשמירת שבת, באופן שהדבר יקר ונעלה כ\"כ עד שלא נעשה השמירה כאופנו מיום נתינת השבת עד הנה עכלה\"ק, נמצא מכ\"ז שאך בשביל שלא הי' אז השמירת שבת בכלל ישראל כראוי בכל אופניו שבשביל זה לא הי' אז גאולה שלימה כמו בביאת המשיח, לכן לא נבנה המשכן הכל בידי שמים כמו שיהי' בבנין העתיד באופן שלא יחרב, מפני שלא היו ראויים עדיין לכך, ואילו הי' השמירת שבת כראוי, הי' נבנה המשכן הכל בידי שמים, ולא הי' מקום להזהיר בבנין המשכן שאינו דוחה שבת, דהלא שפיר הי' נבנה אף בשבת כמו בבנין העתיד, יען שאין בעיקר הבנין מלאכת ידי אדם אלא לזכותם בסיוע שאין בו ממש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 193,
      "char_length": 1149,
      "timestamp": "2025-02-06T19:34:38.970377"
    },
    {
      "id": "ki sisa_p194",
      "text": "ובזה יתבאר לנו דברי רש\"י ז\"ל עה\"פ אך את שבתותי תשמרו: דאך הוא מיעוט לגבי שבת, למעט שבת ממלאכת המשכן, היינו מפני שנתמעט כבודה ולא שמרו ישראל שתו שבתות כהלכתן, ע\"כ לא הותר מלאכת המשכן לעשותה בשבת, ואלמלי שמרו ישראל שתו שבתות מיד היו נגאלין ואז יהי' הבנין נעשה אף בשבת, נמצא דמה שנתמעט מלאכת המשכן בשבת הוו מיעוטא לשבת ומתורץ קושית הרמב\"ן ז\"ל, ולא יקשה קושית המהרש\"א ז\"ל במס' נדה, דגם כאן נדרש במלת שבתותי ב' שבתות, כדרשת הגמ' שם והיינו מפני שנתמעט שמירת ב' שבתות כהלכתן ע\"כ אתיא קרא למעט מלאכת המשכן בשבת, ומ\"ש קרא את שבתותי, מלת את\" בא לרבות, דמ\"מ הוי ריבוי לגבי שבת, דמה שאין דוחה שבת מפני שבעצם קדושת שבת גדול יותר מבנין המשכן, רק שלעתיד מפני שיהי' בנינו בידי שמים לגמרי, אפשר שתהיה גם בשבת ויו\"ט, אבל בעצם קדושת השבת גדולה יותר מדאינו נדחה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 194,
      "char_length": 742,
      "timestamp": "2025-02-06T19:34:39.522549"
    },
    {
      "id": "ki sisa_p195",
      "text": "והנה המשכן בא לכפר עון העגל כפירש\"י ז\"ל (בפ' שמיני) שכל ז' ימי המילואים שהעמידו משה למשכן ושמש בו ופרקו בכל יום לא שרתה בו שכינה, והיו ישראל נכלמים ואומרים למשה, כל הטורח שטרחנו שתשרה שכינה בינינו ונדע שנתכפר לנו עון העגל לכך אמר להם זה הדבר אשר צוה ה' תעשו וגו' שע\"י קרבנותיו ועבודתו תשרה שכינה בכם עכ\"ד רש\"י ז\"ל, ואפשר שחשבו ישראל שאם יהיו בונים את המשכן בזריזות וחשק נפלאה, זה יכפר להם על כל עונותיהם, ויזכו עי\"ז להגאולה שלימה, ואז ממילא ידחה בנין המשכן את השבת, כמבואר לעיל כי לעתיד יהי' היתר לבנות ביהמ\"ק גם ביו\"ט, לפי שלא יהי' אלא בנין לשעה ומיד אחרי שיבנה בידי אדם ורד בנוי ומשוכלל משמים. ע\"כ אמר הקב\"ה אע\"פ שתהיו רדופין וזריזין בזריזות המלאכה לא תחשבו שבזה כבר ראויים אתם לכל השלימות, לא כן הוא, רק צריך שמירת שתו שבתות כהלכתן, ורק בזכות שמירת שני שבתות תוכלו לזכות אל התיקון השלם ולירידת משכן משמי מרום.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 195,
      "char_length": 812,
      "timestamp": "2025-02-06T19:34:39.885424"
    },
    {
      "id": "ki sisa_p196",
      "text": "והנה מבואר בזוה\"ק דגואל העתיד יהי' משרע\"ה, מה שהי' הוא שיהי' ר\"ת משה, מעתה הי' ס\"ד לחשוב מפני שנעשה המשכן עפ\"י הוראתו יהי' דוחה שבת כמו בבנין העתיד, ע\"כ אמה\"כ ואתה דבר אל בנ\"י אך את שבתותי תשמרו, ר\"ל אף שאתה המדבר ונעשה המשכן עפ\"י דבורך, מ\"מ נתמעט שבת ממלאכת המשכן שעדיין לא שמרו ישראל שתו שבתות כהלכתן, ומיושב שפיר מה שדקדקנו (קושיא ז') מה טעם נאמרה אזהרה זו לכל ישראל והרי לכאורה אין זו אלא ציווי לעושי המלאכה שלא יעסקו במשכן בשבת ולדברנו מובן הדבר היטב כי בא הציווי לכל ישראל שישמרו שתו שבתות כהלכתן וע\"י כך יזכו שיבנה בהמ\"ק בנוי ומשוכלל משמים. ויוכלו לבנותו גם בשבת כמבואר.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 196,
      "char_length": 577,
      "timestamp": "2025-02-06T19:34:40.271393"
    },
    {
      "id": "ki sisa_p197",
      "text": "ויאמר ה' אל משה לאמר ואתה דבר אל בני ישראל לאמר אך את שבתותי תשמורו וגו'. במכילתא (הובא בילקוט רמ\"ז ש\"צ) איתא ויאמר ה' אל משה לאמר לא ע\"ו מלאך ולא ע\"י שליח וכתב בזית רענן אפשר דדייק מדכתיב ויאמר ה' אל משה לאמר שאמר לו בעצמו וכו' ע\"כ. והוא תמוה שהרי כל התורה נאמרה למשה מפי הגבורה שלא באמצעות מלאך או שליח. ולמה רמז לנו הכתוב זאת במצות שבת דווקא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 197,
      "char_length": 345,
      "timestamp": "2025-02-06T19:34:40.556961"
    },
    {
      "id": "ki sisa_p198",
      "text": "ונראה לבאר דברי המכילתא בהקדם מה שכתב ק\"ז זלה\"ה בישמח משה פ' מטות עה\"פ וידבר משה אל ראשי המטות וגו' זה הדבר אשר צוה ה'. ואיתא בילקוט מגיד שכל הנביאים התנבאו בכה כך משה התנבא בכה מוסיף עליהם משה שהתנבא בזה הדבר וכו' ונראה בהקדם לפרש מאה\"כ (שמות ו\"ט) כה תאמר לבית יעקב ותגיד לבני ישראל אתם ראיתם וגו' ומסיים הכתוב אלה הדברים אשר תדבר אל בני ישראל. ויש להבין דפתח בכה וסיים באלה הדברים והוא כפל לשון, ותו דתחלה אמר לבית יעקב ומסיים אל בני ישראל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 198,
      "char_length": 442,
      "timestamp": "2025-02-06T19:34:40.755319"
    },
    {
      "id": "ki sisa_p199",
      "text": "ויתבאר דהנה איתא במדרש אין ישראל ניזונים אלא בזכות האמונה. וכתבו המפרשים דהנה לכאורה קשה על אמרם ז\"ל (עירובין כ\"ב ע\"א) אמר ריב\"ל מאי אשר אנכי מצוך היום לעשותם (דברים ז') וכו' היום לעשותם למחר לקבל שכרם משום דשכר מצוה בהאי עלמא ליכא ותימה שהרי הקב\"ה שומר משמרתה של תורה כדאיתא בירושלמי (ר\"ה פ\"א ה\"ג) ואמרה תורה ביומו תתן שכרו ולא תלין פעולת שכיר. ותירצו דקיי\"ל בחו\"מ (סי' של\"ט ס\"ז) האומר לשלוחו שכור לנו פועלים ושכרם ואמר להם שכרכם על בעל הבית אין שום אחד מהם עובר בבל תלין עיי\"ש. והנה ידוע (מכות כ\"ג ע\"ב) כי שאתורהזצ מנין תרי\"א צוה לנו משה ושתים מפי הגבורה שמענום. א\"כ על התרי\"א מצוות דהוו שכרן ע\"י שליח ליכא בל תלין, אבל על השתים ששמענו מפי הגבורה איכא בל תלין, ומגיע שכר בעוה\"ז, והם יסוד האמונה, וז\"ש אין ישראל ניזונים אלא בזכות האמונה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 199,
      "char_length": 738,
      "timestamp": "2025-02-06T19:34:41.004138"
    },
    {
      "id": "ki sisa_p200",
      "text": "ונקדים עוד מאמר הנ\"ל כל הנביאים נתנבאו בכה מוסיף עליהם משה שהתנבא בכה ובזה הדבר. ועתה נחזי אנן בעת שאמר בבחינת מכה בדבור של עצמו הוה ע\"ו שליח. אבל בעת שאמר בבחינת זה הדבר ששכינה היתה מדברת מתוך גרונו הו\"ל ע\"ו עצמו, והנה קיי\"ל דאין בעל הבית עובר משום בל תלין אא\"כ תבעו לא תבעו אינו עובר עליו (חו\"מ סי' של\"ט ס\"י) ולפי זה נראה דלבני העליה אמר משה בבחינת זה הדבר, ואי דהוה עזו עצמו וצריך ליתן להם שכר מיד וא\"כ לא ישאר להם לעוה\"ב, זה אינו אא\"כ תבעו, ובני העליה ודאי ידעו מעלת העוה\"ב ולא יחליפו עולם עומד נועם מתמיד לעדי עד, בעולם עובר הכלה והנפסד, ולא יתבעו חלקם בעוה\"ז, וא\"כ תו ליכא בל תלין אבל המון עם שאינם יודעים מעלת עוה\"ב יש לחוש פן יתבעו חלקם בפיהם לתת שכרם מיד בעוה\"ז, וצריך ליתן להם דבתבעו עובר משום בל תלין, וערום ישובו שמה לעוה\"ב מבלי כסות ושלמה, והקב\"ה חפץ חסד לתת להם שארית בארצות החיים בעוה\"ב. לזאת היתה מחכמתו יתברך להודיע דרכיו למשה לומר להם בבחינת שכה\" בדיבור של עצמו, ואז הוו שכרו עיזי שליח וליכא בל תלין, וזה אמרו יתברך למשה אכהז תאמר לבית יעקב היינו פחותי ערך המכונים בית יעקב, אלה הדברים אשר תדבר אל בנו ישראל שהם בני העליה, אליהם תאמר בבחינת אלה הדברים, דהוי כמו זה הדבר\", דבודאי יותר עדיף השומע בבחינת זה הדבר דהוי מפי השכינה, מהשומע בבחינת כה דהוי דבור של עצמו וכו', וזה כוונת המדרש וכו' כל הנביאים התנבאו בכה כך משה התנבא בכה מוסיף עליהם משה שהתנבא בזה הדבר, ר\"ל כי הוצרך לבחינת כה לפחותו ערך, ולבני עלייה הוצרך לבחינת זה הדבר דעדיף וכו', עכ\"ד ק\"ז הישמח משה ז\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 200,
      "char_length": 1382,
      "timestamp": "2025-02-06T19:34:41.368605"
    },
    {
      "id": "ki sisa_p201",
      "text": "ועל פו דברי קדשו נבא לביאור המכילתא הנ\"ל ויאמר ה' אל משה לאמר לא ע\"ו מלאך ולא ע\"י שליח. דהנה אמרו ז\"ל במס' שבת (דף קי\"ח ע\"א) א\"ר יוחנן משום ר' יוסי כל המענג את השבת נותנין לו נחלה בלי מצרים שנא' וכו' עוד איתא התם (וע\"ב) א\"ר יהודה אמר רב כל המענג את השבת נותנין לו משאלות לבו וכו' ע\"כ. הרי מבואר כמה גדול שכר השומר שבת כראוי לו, כי הנה שכרו אתו ופעולתו לפניו, ואעפ\"י שנותנין לו כל משאלות לבו בעוה\"ז, לא יגרע מאומה מחלקו המוכן לו לעוה\"ב, שהרי שכרו הרבה מאד על פי פעלו והבטיחה תורה שיזכה לנחלה בלי מצרים, ואין קץ לרב טוב הצפון לו לעוה\"ב בשכר מצות עונג שבת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 201,
      "char_length": 553,
      "timestamp": "2025-02-06T19:34:42.037543"
    },
    {
      "id": "ki sisa_p202",
      "text": "היוצא מזה הוא כי משונה מצות שבת משאר מצוות כי אין קץ לשכרה, ואף אם יהנה משכרו בעוה\"ז יזכה לרב טוב המתענג בה לחיי העוה\"ב. ולפי זה אף כי שאר מצוות התורה הוצרך משה לומר לבית יעקב הם פחותי העם בבחינת שכה\"ג כדי שיהי' שכרן ע\"י שליח, ולא יוכלו לתבוע שכרן בעוה\"ז, אמנם לא כן הדבר במצות שבת, שהיה יכול לאמרה גם לפחותו העם בבחינת זה הדבר, ואף אם יתבעו שכרם בעוה\"ז אין בכך כלום, כו חלק כחלק יאכלו גם בעוה\"ב, ואין נגרע מנחלתם דבר, כי היא נחלה בלי מצרים.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 202,
      "char_length": 441,
      "timestamp": "2025-02-06T19:34:42.336838"
    },
    {
      "id": "ki sisa_p203",
      "text": "ומה מאד ינעמו לנו עתה דברי המכילתא הנ\"ל ויאמר ה' אל משה לאמר לא ע\"ו מלאך ולא ע\"י שליח. דהנה תיבת לאמר פירושו בכל מקום שיאמרה לבני ישראל, וצוהו הקב\"ה שלא תהא האמירה לבני ישראל על ידו בבחינת מלאך ושליח כאשר הוא עושה בשאר מצוות, שלפשוטו העם הוא אומרם בבחינת שליח שאין שכינה מדברת מגרונו, כדי שלא יתבעו שכרם בעוה\"ז, אלא נשתנתה מצות שבת שאמרה לכל ישראל בבחינת שכינה מדברת מתוך גרונו, שהרי אף אם יתבעו שכרם בעוה\"ז עדיין יעלו שכרם משלם לעת\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 203,
      "char_length": 435,
      "timestamp": "2025-02-06T19:34:42.599550"
    },
    {
      "id": "ki sisa_p204",
      "text": "באופן אחר נראה לפרש דברי המכילתא ויאמר ה' אל משה לאמר וגו' לא ע\"ו מלאך ולא ע\"י שליח. גם יתיישב כפל תיבת לאמר דכתיב ויאמר ה' אל משה לאמר והדר כתיב ואתה דבר אל בני ישראל לאמר. גם תיבת אואתה\" יתירא לכאורה. ונוישב בדרך זו קושיית המהרש\"א ז\"ל במסכת נדה על הא דאיתא בגמרא ושבת קי\"ח ע\"ב) אר\"י משום רשב\"י אלמלי משמרין ישראל שתו שבתות כהלכתן מיד נגאלין שנא' (ישעי' נ\"ו) כה אמר ה' לסריסים אשר ישמרו את שבתותי וגו' (דדריש שבתותי שני שבתות במשמע) וכתיב בתריה והביאותים אל הר קדשי וגו', ע\"כ. והקשה המהרש\"א ז\"ל דלפי\"ז היאך יתפרשו דברי הכתוב אך את שבתותי תשמורו: דהכא ודאי ליכא לפרש ב' שבתות תשמרו, ותו לא, שהרי השבת הוא אות לעולמי עד בין הקב\"ה לבין בני ישראל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 204,
      "char_length": 644,
      "timestamp": "2025-02-06T19:34:42.827054"
    },
    {
      "id": "ki sisa_p205",
      "text": "ונראה לבאר הענין בהקדם הא דאיתא בילקוט פרשה זו (רמז שצ\"ב) וז\"ל ירד משה מן הרקיע והלוחות בידו וכו' אמר לו הקב\"ה משה לא היית מאמין לי שעשו ישראל את העגל סרו מהר מן הדרך אשר ציויתים שקד משה היאך לזכות את ישראל אמר לו רבש\"ע אנו נצטויתו שמא עברתי על הציווי הן לא נצטוו מה אמרת בסיני אנכי ה' אלקיכם לא אמרת אלא אנכי ה' אלקיך וכו' ע\"כ. והוא פלאי לכאורה איך לימד משה סניגוריא על ישראל באמרו כי הם לא נצטוו במצוות אנכי ולא יהי' לך. הלא גלוי לכל העמים שהיו היהודים עתידים ליום הזה, לקבל על עצמם תורה ומצוות, והכינו עצמם בהכנה דרבה שלשת ימים קודם קבלת התורה, ונצטוו כל העם להתקדש ולהטהר בקדושה עילאה, כדי להיות מוכנים ליום השלישי בהיות הבקר, לשמוע קול ה' חוצב להבות אש, וכו על מגן היו כל ההכנות הללו, ובסופו של דבר לא נצטווה אלא משרע\"ה אתמהה. וגם הלא מקרא מלא דבר הכתוב (דברים ה') פנים בפנים דבר ה' עמכם בהר מתוך האש וגו', הרי כי לכל ישראל נאמרו עשרת הדברות. ואיתא במד\"ר (שהש\"ר פ\"א י\"ג) עה\"פ ישקני מנשיקות פיהו א\"ר יוחנן מלאך היה מוציא הדיבור מלפני הקב\"ה על כל דיבור ודיבור ומחזירו על כל אחד ואחד מישראל ואומר לו מקבל אתה עליך את הדיבור הזה כך וכך דינין יש בו וכו' והיה אומר לו ישראל הן וכו' מיד היה נושקו על פיו ורבנן אמרין הדבור עצמו היה מחזיר על כל אחד ואחד מישראל ואומר לו מקבלנו אתה עליך וכו', עכ\"ל .",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 205,
      "char_length": 1194,
      "timestamp": "2025-02-06T19:34:43.187908"
    },
    {
      "id": "ki sisa_p206",
      "text": "ומקצת מן המפרשים ביארו מה שאמר משה לי ציוות ולא להם, דהכי פירושו שלא דבר הקב\"ה עם ישראל כמדבר לנוכח, שהרי לא אמר אנכי ה' אלקיכם, אלא שהיה הדבור מיוחד למשה לנוכח ועל ידו נצטוו ישראל. וזאת כוונת המדרש אלי ציוית\"ז לאמר להם ולא להס\" שלא נתייחד הדבור אליהם, כי אם אלי בלבד היו הדברים. ובזה המליץ משה טוב על ישראל שאין אשמתם גדולה כ\"כ, כיון שלא בא הדבור אליהם אלא באמצעות שליח.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 206,
      "char_length": 371,
      "timestamp": "2025-02-06T19:34:43.866849"
    },
    {
      "id": "ki sisa_p207",
      "text": "ובספה\"ק סידורו של שבת ושרש החמישי ענף ד' עלה ד') דרך בדרך המפרשים האלו בביאור דברי המדרש, והוסיף נופך מדיליה, ותו\"ד כי לפי מהות סוג בני ישראל בעת קבלת התורה לא היה מתפרש להם, ולא הבינו אז יותר לקבל, כי אם בבחינת עול מלכות שמים לבד, כדרך התחלת העבד הנקנה למלך. אכן אדון הנביאים משרע\"ה שהיה כחו יפה כעתה כן אז, והיה גם אז בדרגא ומשה עלה אל האלקים, ע\"כ היה מתפרש אליו הדבור של אנכי ה' אלקיך במעלה הגדולה סופא דכל דרגין וכו', ובזה המליץ משה מליצתו לפני הקב\"ה, הלא הבחינה הגדולה שאמרת אנכי ה' אלקיך עבור גודל קדושות וכו' עד שבזה אתה נקרא לנגדם בבחינת אלקיכם, זה לא היה אז בישראל, כי אם לי אמרת הדרגא הגדולה הזאת, וכן אנו על משמרתי אעמודה לשמור ולעשות הדבר, ולא להם היה פירוש אמירתך, כי אם בדרך הפשוט אנו הוא מלכיכם ואתם עבדי ומחויבים לעבוד עבודתי כחיוב עבודה וכו'. אשר על כן לא כ\"כ גדלה אשמתם וכו' ורק עברו על ציווייך לבד במצות עשה ול\"ת שאמרתי להם אני מלכיכם ולא יהי' לך וגו', וע\"ז עברו באמת, אבל לא נתגדל עונשם בזה לכלות אותם כרגע ח\"ו וכו', לכן נשאתי את לבי להמליץ בעדם לפניך. עכ\"ד הסש\"ש. אך גם לפי דברי המפרשים והסידורו של שבת אכתי לא נתיישבו דברי המדרש על מכונם, שהרי אפילו אם לא נאמרו הדברות לישראל אלא ע\"י שליח. וגם אם לא נאמרו להם מצוות אנכי ולא יהי' לך בדרגא הגדולה, מ\"מ עדיין אין מובנת מליצתו של משה לי ציוית ולא להם: שהרי כיון שהם מוזהרים על ע\"ז ועברו על ציווי השי\"ת ויעשו להם עגל מסכה, יש בזה כדי בזיון וקצף שעברו על ציווי המקום ועבדו ע\"ז, וטענת המקטרג חזקה, ובמה מצא משה ללמד סניגוריא על ישראל, ויהס קטיגור .",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 207,
      "char_length": 1414,
      "timestamp": "2025-02-06T19:34:44.094729"
    },
    {
      "id": "ki sisa_p208",
      "text": "ונל'\"פ דברי המדרש דהנה כל הראשונים ז\"ל נתנבאו בסגנון אחד, שלא יתכן לומר שהעגל נעשה לשם ע\"ז, אלא שרצו לעשות להם מנהיג, אשר ילך לפניהם, ויורה להם הדרך אשר ילכו בה על פי ה'. והרמב\"ן ז\"ל כתב בתוך דבריו כי ממה שאמרו ישראל אלהים אשר ילכו לפנינו נבין מחשבת עושוו, כי בידוע שלא היו ישראל סבורים שמשה הוא האלקים ושהוא בכוחו עשה להם את האותות והמופתים וכו', כי בפירוש אמרו אלהים אשר ילכו לפנינו. לא שיהיו נותנין להם חיים בעוה\"ז, או בעוה\"ב, אבל היו מבקשים משה אחר, אמרו משה שהורה לנו הדרך ממצרים ועד הנה, שהיו המסעות על פי ה' ביד משה, הנה אבד ממנו. נעשה לנו משה אחר שיורה הדרך לפנינו ועפ\"י ה' בידו. וזה טעם הזכירם משה האיש אשר העלנו, לא האל אשר העלם, כי יצטרכו לאיש אלקים וכו', עכ\"ד הרמב\"ן ז\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 208,
      "char_length": 683,
      "timestamp": "2025-02-06T19:34:44.810838"
    },
    {
      "id": "ki sisa_p209",
      "text": "תוכן הדברים הוא כי נתכוונו במעשה העגל לעשות להם מורה דרך שינהיגם על פי ה'. ואעפ\"י שלא היתה מחשבתם לעבודה זרה, מ\"מ היה פגם גדול בדבר. ויתבאר בהקדם מ\"ש ק\"ז זלה\"ה בספר תפלה למשה עה\"פ (תהלים קמ\"ד) אין פרץ ואין יוצאת ואין צוחה ברחובותינו וגו', ואיתא במדרש תהלים אין פרץ אין פרצה של גלות וכו' ואין יוצאת יציאה של גלות ואין צוחה צוחה של גלות וביאר עפ\"י מה שכתב בספר נצח ישראל למהר\"ל מפראג זלה\"ה פמ\"ח לפרש הא דאיתא במדרש (ילקוט ישעיה רמז תע\"ד) עה\"פ אנכי אנכי הוא מנחמכם (ישעי' נ\"א) א\"ר אבא בשם רשב\"ל משל למלך שכעס על מטרונה וטרדה והוציאה מתוך פלטין שלו לאחר ימים בקש להחזירה אמרה יכפיל כתובתי ואח\"כ הוא מחזירני כך אמר הקב\"ה לישראל בני בסיני אמרתי לכם פעם אחת אנכי ה' אלקיך בירושלים לעת\"ל אנו אומר לכם שנו פעמים אנכי אנכי הוא מנחמכם. וביאר דתיבת אנכי מורה על עצמו של המדבר, כאלו אמר אני עצמי, אבל תיבת אני מורה על המדבר בעדו. והוא היפך מלת אתה, אבל אנכי אין נגדו נוכח וכו' וכאשר אמר אנכי ה' אלקיך כאלו אמר אני עצמי אלקיך ולא מסרתיך לשרים עליונים, והוא הכתובה שכתב לישראל שהוא בעצמו אלקיהם, ולא נאמר אנכי רק פעם אחת, וזה מפני שעוד לא היה זה שהוא בעצמו אלקיהם מחיוב מוכרח ולפיכך יש שינוי לדבר זה, וכאלו נפרד מהם ומסרם בגלות תחת שרי מעלה, אבל לעתיד כתיב אנכי אנכי שנו פעמים, וזה הכתובה הכפולה המורה שהוא דבר מחויב ומוכרח שכך יהי', כמו שאמרו ז\"ל שנה עליה הכתוב לעכב (יומא נ\"א ע\"ב), הרי כי הכפל לחזק שכך יהי' עכ\"ד המהר\"ל ז\"ל הנחמדים. ועפ\"י זה מפרש ק\"ז זלה\"ה דברי המדרש תהלים הנ\"ל דהנה איתא בקידושין (דף י\"ד ע\"א) דתיבת חככה\" עיכובא הוא. ועפ\"י זה מבואר אין פרץ של גלות וכו', ואעפ\"כ רק בזה אשרי העם שככה\" לול (היינו מה שיכפול השי\"ת אנכי' שהוא עיכובא כתיבת ככה) ומפרש מה הוא, אשרי העם שה' אלקוו\", היינו אנכי ה' אלקיך שלעתיד יכפול אותו אנכי וכו' עכ\"ד הקדושים ז\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 209,
      "char_length": 1644,
      "timestamp": "2025-02-06T19:34:45.183969"
    },
    {
      "id": "ki sisa_p210",
      "text": "היוצא מדבריו כי תיבת אנכי מורה על שהשי\"ת עצמו אלקינו, ולא מסרנו תחת שרי מעלה. וע\"ד זה פירשתי דברי המדרש פליאה (הביאו א\"א זלה\"ה בספר קדושת יו\"ט) כששמע משה מפי הקב\"ה אנכי ה' אלקיך פתח ואמר ברוך שלא עשני גוי, ע\"כ. וה\"פ כששמע משה אנכי ה' אלקיך. ומשמעות תיבת אנכי מורה על עצמותו יתברך, שהוא לבדו אלקינו ואין אנחנו מסורים תחת רשות שרי מעלה, פתח ואמר ברוך שלא עשני גוי, כי לנו נאה לברך על שאנחנו עם סגולתו, והננו מושגחים ממנו יתברך בלבד, ולא מסר אותנו השי\"ת לשלטון השרים העליונים כאשר עשה לשאר האומות.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 210,
      "char_length": 494,
      "timestamp": "2025-02-06T19:34:46.006373"
    },
    {
      "id": "ki sisa_p211",
      "text": "ברם אכתי דברי המהר\"ל זלה\"ה טעונים ביאור, שהרי לפי דבריו נמצא כי מאמרו יתברך אנכי ה' אלקיך הוא הבעחה מאת הקב\"ה לישראל שהנם תחת ממשלתו בלבד, ולא מסרם לשליטת שרי מעלה, והוא הכתובה שכתב הקב\"ה לישראל כמבואר במדרש הנ\"ל. ואם כן קשה שהרי הרמב\"ם ז\"ל בספר המצות מונה מאמר אנכי ה\"א במנין התרי\"ג מצוות, הרי דאנכי הוא ציווי לישראל ולא הבטחה. ונראה לומר ששניהם צדקו יחדיו. כו הוא הבטחה מאת השי\"ת שהוא בלבדו מושל על ישראל ומנהיג אותם, כדברי המהר\"ל ז\"ל, וכמו כן הוא ציווי לישראל, שיקבלו על עצמם עול מלכותו יתברך ומצוותיו, וע\"י כך יהיו נתונים תחת ממשלתו בלבד, כי חלק ה' עמו ואין עמו אל נכר ואם ישראל חוטאים ומשתעבדים לרשות שרי מעלה, הרי עברו על מצות אנכי ה' אלקיך שענינה הוא כי ה' בדד ינחנו: ולא מסרנו תחת רשות השרים המושלים על אוה\"ע.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 211,
      "char_length": 717,
      "timestamp": "2025-02-06T19:34:46.265892"
    },
    {
      "id": "ki sisa_p212",
      "text": "ובדרך זה יתבאר אומרם ז\"ל (כתובות ק\"י ע\"ב) כל הדר בחוץ לארץ כאילו עובד ע\"ז וכן בדוד הוא אומר (ש\"א כ\"ו) כי גרשוני היום מהסתפח בנחלת ה' לאמר לך עבוד אלהים אחרים וכי מי אמר לדוד לך עבוד אלהים אחרים אלא לומר לך וכו'. (פירש\"י בפירושו לנביאים דהיוצא מארץ ישראל לחוץ לארץ בזמן הבית כאילו עובד עבודת גילולים וי\"ת אזיל דוד ביני עממיא פלחי טעוותא ע\"כ). והרי\"ף בע\"י פירש דהדר בחו\"ל דומה כמי שאין לו אלוה כיון שהוא יושב תחת ממשלת שרי מעלה, וז\"ש דוד כו גרשוני היום מהסתפח בנחלת ה' לאמר לך עבוד אלהים אחרים, ר\"ל השרים, ולא להיות תחת יד אלקים חיים ומלך עולם, אבל הדר בא\"י הוא תחת ממשלתו יתברך בלבד, ואין לשרים אתו חלק בא\"י ע\"כ דומה לכל העולם שיש לו אלוקי המשגיח עליו בפרטיות, והוא יושב תחת הנהגתו והשגחתו יתברך, עכ\"ד. וכ\"כ הרמב\"ן ז\"ל בפרשת אחרי לפרש אומרם ז\"ל הדר בחו\"ל דומה כמי שאין לו אלוקי שהטעם הוא לפי שא\"י אינה תחת שליטת שרי מעלה והדר בחו\"ל הרי הוא משועבד לממשלת השרים עיי\"ש. ועל פי דברינו מבואר מה שאמרו ז\"ל כאילו אין לו אלוה כו ע\"י ששעבד עצמו תחת ממשלת שרי מעלה הריהו עובר על מצות אנכי ה' אלקיך ולפיכך דומה כמי שאין לו אלוה. וכבר הארכנו בענין זה (עיין בדברנו בס' ויואל משה מאמר ישוב א\"ו מסי' כ\"ז עד סו' ל\"א) כו עיקר הטעם שהדר בחו\"ל כאילו אין לו אלוקי הוא כמ\"ש רש\"י ז\"ל שם עה\"פ כו גרשוני היום וגו' שתרגם יונתן אזל דוד ביני עממיא פלחי טעוותא. הרי שהטעם הוא בשביל שיצא ממלכות קדושה של שאול המלך. אל מלכות ע\"ז של אכיש מלך גת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 212,
      "char_length": 1313,
      "timestamp": "2025-02-06T19:34:46.622715"
    },
    {
      "id": "ki sisa_p213",
      "text": "וכמו\"כ כתב רש\"י ז\"ל בפרשת ואתחנן עה\"פ ועבדתם שם אלהים אחרים וגו' וז\"ל כתרגומו משאתם עובדים לעובדיהם כאילו אתם עובדים להם. הרי מבואר שמחמת זה נקראים ההולכים בגולה בין האומות כאילו עבדו ע\"ז, יען שהם משתעבדים לעובדי ע\"ז ולפיכך לא שייך לומר כן אלא בזמן שישראל היו שרויים על אדמתם, והיתה שמה ממשלת המאמינים בה', ומשו\"ה היוצא מתחת ממשלה כזו ומשעבד עצמו לממשלת עובדי ע\"ז הרי הוא כאילו עוע\"ז. ואין דבר זה שייך בזמה\"ז שכל השלטון בא\"י הוא בידי מינים ואפיקורסים, הגרועים מע\"ז, א\"כ אין שייך לומר שהיוצא משם כעוע\"ז, כו בא\"י הנו נמצא תחת ממשלת מינים ואפיקורסים. ואפילו לטעם הרמב\"ן ז\"ל הנ\"ל שהיוצא מא\"י לחו\"ל הריהו כעוע\"ז משום שבחו\"ל הוא תחת ממשלת שרו מעלה, מ\"מ ע\"כ לומר שגם הוא מודה שעיקר הטעם הוא כדברי רש\"י והתרגום שהיוצא לחו\"ל הוא עוע\"ז משום שנעשה משועבד תחת ממשלת ע\"ז, שהרי לא יתכן שיחלוק על דברי התרגומים אלא שהוסיף נופך לדבריהם שהיוצא לחו\"ל הוא תחת שלטון שרי מעלה. ועוד שאפילו טעם הרמב\"ן נמי אינו שייך אלא בזמן שא\"י נמצאת תחת מלכות קדושה, אזו הוא מושגחת מהשי\"ת לבדו. כמאה\"כ ארץ אשר ה' אלקיך דורש אותה תמיד עיני ה' אלקיך בה וגו', ולא כן היא בזמן שארץ נמסרה ביד זדים מרשיעי ברית, שהמה שלוחי הס\"מ וגונדא דיליה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 213,
      "char_length": 1099,
      "timestamp": "2025-02-06T19:34:47.269208"
    },
    {
      "id": "ki sisa_p214",
      "text": "ועל פי כל האמור נבא לבאר ענין הפגם בחטא העגל כו הנה נתבאר שלא היתה כוונתם אלא לעשות להם מנהיג, להורות להם דרך ילכו בה, ולהיות עומד בין ה' וביניהם. כאשר היה משרע\"ה. אמנם טעו בכך, אשר כח העגל היה משונה להבדיל מכחו של משרע\"ה, כי הנה משרע\"ה היה עבד הקב\"ה לבדו ושכינה היתה מדברת מתוך גרונו, ולא קבל השפעתו ע\"י ממוצע, אך העגל קבל כוחו והנהגתו מממשלת שרי מעלה, ונמצא כי ע\"י שעשו את העגל להיות להם לראש ולמנהיג. המה כרעו ונפלו תחת שליטת שרי מעלה, ומשום כך נחשב להם כאילו עבדו ע\"ז. כי הפקיעו עצמם מתחת הנהגתו של משרע\"ה, שהיא ממשלת הקדוש ב\"ה בעצמו, ושעבדו עצמם לממשלת שרי מעלה. והוא דוגמת מה שאמרו זיל בגמרא כתובות הנ\"ל שהיוצא מא\"י לחו\"ל כאילו עובד ע\"ז, וכמו שנתבאר שהוא בזמן שיש בא\"י מלכות קדושה, וכמו כן המה יצאו מממשלתו הקדושה של משרע\"ה לרשות שרי מעלה, ונחשב להם כאילו עבדו ע\"ז.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 214,
      "char_length": 771,
      "timestamp": "2025-02-06T19:34:47.802539"
    },
    {
      "id": "ki sisa_p215",
      "text": "ועפ\"י זה נבא לבאר טענת משרע\"ה לפני הקב\"ה לי ציוות ולא להם. בהקדם הא דאיתא במדרש ולקוט (פ' יתרו רמז רפ\"ו) א\"ר יוסי בר חנינא לפי כחו של כל אחד ואחד היה הדבור מדבר עמו ואל תתמה המן שהיה יורד לישראל כל אחד ואחד היה טועמו לפי כחו התינוקות לפי כוחן וכו' הבחורים לפי כחן וכו' ומה אם המן כל אחד ואחד היה טועם לפי כחו הדבור על אחת כמה וכמה אמר דוד (תהלים כ\"ט) קול ה' בכח בכחו אין כתיב כאן אלא בכח בכחו של כל אחד ואחד, ע\"כ. ולכאורה מה ענין כח לקבלת הדברות, ונראה לומר שהכוונה היא שכל אחד קיבל את עשרת הדברות לשמור ולעשות, לפום מדרגת השגתו, והבחינה שהוא עומד בה, וכמבואר לעיל בשם ספה\"ק סידורו של שבת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 215,
      "char_length": 589,
      "timestamp": "2025-02-06T19:34:48.200112"
    },
    {
      "id": "ki sisa_p216",
      "text": "והנה בשעה שעמדו ישראל על הר סיני פסקה זוהמתן והיו במדרגה גבוהה מאד כאמרם ז\"ל (שהש\"ר פ\"ח ג) חרות על הלוחות אל תיקרי חרות אלא חירות חירות ממלה\"מ חירות משיעבוד מלכיות. ואמנם לפי גודל מדרגת השגתם באותה שעה נחשב למו חטא העגל לפגם נורא מאד, כי לפי שהמה היו בבחינה גבוהה נאמרה להם מצות אנכי ה' אלקיך לפי כחם והשגתם הגדולה, דהיינו שנצטוו להיות משועבדים בלתי לה' לבדו, והוזהרו מהיותם משועבדים לרשות שרי מעלה. אך לא ארכו הימים ונפלו ממדרגתם, ונולדו בהם תכונות רעות, ולפי מדרגתם הפחותה באותה עת שוב לא היה בכחם לקבל ציווי אנכי ה' אלקיך בבחינה שנצטוו בה בהר סיני, שהרי לצד מדרגתם הפחותה כבר היו משועבדים תחת השגחת שרי מעלה, ובדבר הזה מצא משרע\"ה מקום ללמד עליהם זכות על מעשה העגל, באמרו לי ציוות ולא להם, כלומר לפי שהמה אבדו זה מכבר את מדרגתם הגדולה שעמדו בה בעת מתן תורה, א\"כ אין להענישם כ\"כ על מעשה העגל, כי שוב אין הם מצווים ועומדים לקיים מצות אנכי ה\"א בבחינתה הגבוהה, שהרי כבר הנם משועבדים לרשות שרי מעלה, ולפיכך אין עוונם גדול כ\"כ, שהרי כל חטאם היה שקבלו עליהם את העגל למנהיג, והשתעבדו לרשות שרי מעלה, ולא שמרו ברית ה\"א אשר כרת אתם בחורב לאמר אנכי ה\"א, שפירושו שאנחנו תחת ממשלתו יתברך לבד, ואסור לנו לשעבד עצמנו לשרי מעלה, והמה המרו בעצתם לעשות להם מנהיג אשר השפעתו משרי מעלה, וכיון שעוד בטרם מעשה העגל כבר היו נתונים תחת רשות שרי מעלה, ממילא כבר לא הוו שייכא גבייהו מצות אנכי ה\"א בבחינה זו שנצטוו בה בעת מ\"ת, כאשר נתבאר דכל חד וחד נצטוה במצוה זו לפי כוחו ומדרגתו שהוא עומד בהק ולעת כזאת הרי הם מצווים במצוה זו כפשוטה, לבלתי עבוד אלהים אחרים, והמכשלה הזאת לא יצאה מתחת ודם, שהרי לא עשו את העגל לשם ע\"ז, אלא להיות להם לקצין וראש.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 216,
      "char_length": 1520,
      "timestamp": "2025-02-06T19:34:48.531779"
    },
    {
      "id": "ki sisa_p217",
      "text": "וזאת היתה טענת משרע\"ה לפני המקום לי ציוות ולא להם, ולא נתכווין לומר שאין ישראל מצווים במצות אנכי ה' אלקיך כלל, שהרי ודאי כולם נצטוו בה בהר סיני, אלא שלימד עליהם זכות שלא יחשוב להם ה' את מעשה העגל לחטא גדול כ\"כ, משום שבשעת מעשה כבר לא היו מצוים במצות אנכי ה\"א בדרגה הגבוהה שנצטוו עליה בשעת מ\"ת, ורק אלי ציוית\"נ כלומר שרק אני בלבד שייך עדיין במצוה זו בבחינתה הגבוהה, לפי שלא נשתעבדתו לשלוטת השרים, ושייך לצוות עלי שלא אעשה פעולות להכניס עצמי לרשות שרי מעלה, ולא להס\"מ, שהם כבר לא שייכו בבחינה זו, שהרי כבר המה נתונים נתונים תחת שליטת שרי מעלה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 217,
      "char_length": 541,
      "timestamp": "2025-02-06T19:34:49.289048"
    },
    {
      "id": "ki sisa_p218",
      "text": "ועל פי כל האמור נבוא לביאור הילקוט הנ\"ל ויאמר ה' אל משה לאמר וגו' לא ע\"י מלאך ולא ע\"י שליח. וגם תתיישב קושית המהרש\"א ז\"ל דהיאך יתפרש מאה\"כ אך את שבתותי תשמרו על שמירת שנו שבתות בלבד, ונראה כי הן בעת ההיא נפלו ישראל ממדרגתם הגבוהה ונשתעבדו לממשלת שרי מעלה, וגם כי אח\"כ נכנסו לארץ ישראל וחזרו להיות תחת רשות הקב\"ה, מ\"מ לא ארכו ימי שלותן, והן בעוונות נחרבה עירנו וגלינו לבין אומות העולם וחזרנו להיות משועבדים לממשלת השרים.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 218,
      "char_length": 419,
      "timestamp": "2025-02-06T19:34:49.595151"
    },
    {
      "id": "ki sisa_p219",
      "text": "ועל כן רמז לנו הכתוב כי מועל עלינו לחזור ולהשיג מדרגה זו שנהי' משועבדים אך להשי\"ת לבדו, כי הוא אלקינו ואנחנו עם מרעיתו וצאן ידו. וכיצד ניתן להשיג מדרגה זו, ע\"י שמירת ב' שבתות כהלכתן. כאמרז\"ל אלמלי שמרו ישראל ב' שבתות כהלכתן מיד היו נגאלין. וזאת כוונת המדרש ויאמר ה' אל משה לאמר וגו' לא ע\"י מלאך ולא ע\"ו שליח פירוש שנצטוו בני ישראל להוציא עצמם משעבוד שרי מעלה, שכל זמן שהם משועבדים תחתיהם באה אליהם ההשפעה ע\"ו מלאך ושליח, ולא מאת השי\"ת לבדו. ומבאר הכתוב איך ניתן להשיג מדרגה זאת להיות משועבדים בלתי לה' לבדו, על כן אמר אך את שבתותי תשמרו. ושבתתי שני שבתות במשמע, כי בזכות שמירת שני שבתות כהלכתן נזכה אל הגאולה השלמה, ונגלה כבוד ה' וראו כל בשר יחדיו כי פי ה' דבר. ו הנה מבואר בזוה\"ק כו משרע\"ה יהי' הגואל גם לעתיד, כנרמז בשמו דמשה הוא ר\"ת מה שהי' הוא שיהי'. וידוע מה שכתב האוה\"ח הקדוש בפרשת ויחי עה\"פ אוסרי לגפן עירה על דברי הזה\"ק שהרי מבואר וזה\"ק פ' לך פ\"ד ע\"ב ירושלמי ברכות פ\"ב האד ועי' סנהדרין צ\"ח ע\"ב) שמשיח צדקינו יהי' מזרע דוד המלך וי\"א כי דוד עצמו יהי' מלך המשיח דכתיב (יחזקאל ל\"ו) ודוד עבדי נשיא להם לעולם וא\"כ היאך אנו אומרים שהמשיח הוא משה. יש לך לדעת כו בחינת נשמת משה רבינו ע\"ה היא כלולה מי\"ב שבעי ישראל, שהוא היה כולל כל הענפים שבקדושה, ולעתיד לבא תתגלה בעולם שורש המלכות שבמשה, שהוא עצמו מלך המשיח, והוא דוד והוא ינון ושילה, עכ\"ד הקדושים ז\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 219,
      "char_length": 1253,
      "timestamp": "2025-02-06T19:34:49.808553"
    },
    {
      "id": "ki sisa_p220",
      "text": "וזאת אפ\"ל בפירוש תיבת ואתה\" דבר אל בני ישראל דלכאורה יתירא היא, אלא שרמוז בזה אשר גם לעתוד ידבר משה אל בני ישראל, ולא יהיו נתונים להשפעת ממשלת שרי מעלה, כי אם על פי ה' ביד משה ששכינה מדברת מתוך גרונו. ואפ\"ל שע\"כ כתיב מואתה\" בתוספת וא\"ו, לרמוז על כך שלעתיד יהיו כלולים במלך המשיח נשמת משה ודוד גם יחד .",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 220,
      "char_length": 301,
      "timestamp": "2025-02-06T19:34:50.410332"
    },
    {
      "id": "ki sisa_p221",
      "text": "ושמרו בני ישראל את השבת לעשות את השבת וגו', במכילתא לעשות את השבת, ר' אליעזר אומר דבר שהברית כרותה לו ואיזו זו מילה עכ\"ד המכילתא (הובא בילקו\"ש רמז שצ\"א) ופי' בזית רענן לדורותם ברית עולם זו מילה, וע\"ז קאי לעשות את השבת, דמילה מותר לעשותה בשבת עכ\"ד. ותמהו המפורשים ז\"ל דאיך יליף לי' מלעשות את השבת, וה\"ז דחי' לשבת ולא עשי', וכבר ביארנו בזה ועוד לאלקי מילין.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 221,
      "char_length": 355,
      "timestamp": "2025-02-06T19:34:50.583980"
    },
    {
      "id": "ki sisa_p222",
      "text": "ונל\"פ בהקדם דברי האוהחה\"ק ופ' זו) ושמרו בנ\"י את השבת לעשות את השבת, ירצה לומר כי משונית שמירה זו מכל שאר שמירות המצות כו שמירה זו נחשבת בגדר עשי', והוא אומרו ושמרו בנ\"י וגו' לעשות את השבת, הרי שלך לפניך שקורא לשמירה עשי', ואולי כי הטעם הוא עפ\"י דבריהם ז\"ל שאמרו ישב אדם ולא עבר עבירה נותנין לו שכר כעושה מצוה. והעמידוה בגמ' בבאה עבירה לידו ולא עבר ע\"כ, וכמו\"כ ביום המקודש אין לך באה עבירה לידו של מלאכות כזה, כי בכל עת מזדמנים לפניו מלאכת הרבה מהארבעים ותולדותיהם וכו', שהאדם רגיל בהם כל יום וכו' והוא נשמר מהם, לזה יחשב להם כעושה מצוה עכדה\"ק, וצריך פי' לפירושו דהרי כמו\"כ בכל המצות כן הוא, בבאה עבירה לידו ולא עבר נותנין לו שכר כעושה מצוה, והגם כי בשבת מזדמן ומצוי יותר, מ\"מ לא צריך קרא ללמדנו על זה והוא מובן מאליו דבכל עת שיזדמן לפניו ולא עבר יתגדל ויתרבה שכרו גם דהרי בגמ' לא אמרו אלא שנותנין לו שכר כעושה מצוה, אבל מ\"מ אין זה בגדר עשי' ממשל והלשון לעשות את השבת עדיין צ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 222,
      "char_length": 877,
      "timestamp": "2025-02-06T19:34:50.775441"
    },
    {
      "id": "ki sisa_p223",
      "text": "ויתבאר עפ\"י דברי האוה\"ח הק' (בפ' בראשית על הפסוק ויכל אלקים ביום השביעי וגו', נראה שיכוין הכתוב ע\"ד אומרם ז\"ל כי העולם הי' רופף ורועדו עד שבא שבת ונתקיים העולם ונתייסד, והכוונה הוא כו ביום השבת ברא ה' נפש העולם, והוא סוד אמרו וביום השביעי שבת וינפש וכו', פי' נשפע שפע חיוני בכל הנבראים עכ\"ד, ולהלן עה\"פ כי בו שבת וגו' הרחיב הביאור בזה וז\"ל מצינו כי הקב\"ה גילה הדבר במ\"ש בעשרת הדברות כי ששת ימים עשה ה' את השמים וגו', הרי גילה כו בשעת הבריאה לא ברא ה' כח בעולם זולת לעמוד ששת ימים לטעם הנודע לו וכו', ונתחכם ה' וברא יום א' הוא יודע לה', ובו ביום חוזר ה' ומשפיע נפש לעולם, שיעור המקיים עוד ששה ימים, וכן עז\"ה וזולת זה היום הי' העולם חרב בגמר ששת ימים וחוזר לתהו ובוהו וכו' ובאמצעות השבת עומד וכו', ולפי פירושנו זה מצאנו נחת רוח במ\"ש רז\"ל (שבת דף קי\"ט) כל המקדש וכו' ואומר ויכולו כאילו נעשה שותף להקב\"ה במעשה בראשית ע\"כ. ודבריהם רחוקים ודחוקים לפי הנראה, מי שמע כזאת שיבא אדם וישתתף בדבר שכבר נגמרה מלאכתו וכו', ועוד לו יהי' שמעשה זו גדול עד מאוד, מנין להם דבר זה שהוא נעשה שותף וכו', ולמה שפירשתי אמת יהגה חכם וכו' בטעם צודק כי להיות שהשבת הוא המקיים העולם כל ששת ימים, ואחר עבור ששת ימים יבוא שבת אחרת ויחייהו ויקיימהו עוד ששת ימים אחרים, ולך לדעת כי מציאות השבת בעולם היא קיומו שמקיימים אותו, כי אם אין מקיימים שבת אין שבת וכו', ולז\"א כל המקדש את השבת וכו' פירוש מקיים ושומר קדושתו, באמצעות זה ישנו לשבת ובאמצעותו מתקיים העולם, הראת לדעת כו הוא המקיים העולם, ואין לך שותף גדול מזה כדון וכהלכה, ולך לדעת כי מיום ברא אלקים אדם, לא חסר מעולם דבר המעמיד צדיק יסוד עולם שהוא שומר שבת, כי אדה\"ר שומר שבת הי' וכו' נח שם אברהם וכו' ומשם לא פסקה שמירת שבת מישראל ואפי' במצרים וכו' עכ\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 223,
      "char_length": 1577,
      "timestamp": "2025-02-06T19:34:51.223357"
    },
    {
      "id": "ki sisa_p224",
      "text": "ובבחינה זו פי' האוהחה\"ק ור\"פ תזריע) מאמר רז\"ל למה התינוק נימול לח', שקנה ה' רחמים עליו עד שיהי' בו כח וכשם שרחמיו על האדם, כך רחמיו על הבהמה שנא' מיום השמיני והלאה ירצה עכ\"ל, וצריך לדעת מי גילה סוד זה כי בח' ימים יהי' בו כח לא פחות ולא יותר, ונראה כי כח האמור בדבריהם הוא מ\"ש בזוהר, כדי שיעבור עליו שבת ותגועהו נפש החיונית הנשפעת בעולם ביום השבת כידוע ואז יהי' בן קיימא וכו' תמצא שאמרז\"ל שקודם שבא שבת הי' העולם רופף ורועד, כיון שבא שבת נתחזק ונח ע\"כ, והוא מ\"ש כדי שיהי' בו כח עכלה\"ק.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 224,
      "char_length": 484,
      "timestamp": "2025-02-06T19:34:51.998384"
    },
    {
      "id": "ki sisa_p225",
      "text": "ובזה יתבאר מאמה\"כ ושמרו בנ\"י את השבת לעשות את השבת, כי שמירה זו נחשבת בגדר עשי' וכדברי האוהחה\"ק, כי מציאות השבת בעולם הוא קיומו שמקיימים אותו, ובאמצעות זה נשפע שפע חיוני בכל הנבראים להתקיים עוד, ועי\"ז נעשה שותף במע\"ב, ואין לך עשי' גדולה מזו, ויובן בזה דברי המכילתא לעשות את השבת ר' אליעזר אומר דבר שהברית כרותה לו ואיזו זו מילה, כי ע\"ו עשיית השבת נשפע שפע חיוני בנבראים, ועי\"ז מתקיים ברית המילה להיות בן קיימא ולא יסתכן. וכ\"ז נכלל בגדר עשי' שנכלל במצות השמירה והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 225,
      "char_length": 465,
      "timestamp": "2025-02-06T19:34:52.270424"
    },
    {
      "id": "ki sisa_p226",
      "text": "ואפשר לרמוז עוד עפי\"ד המד\"ר (דברים פרשה א' סי' כ\"א) אריב\"ח כותי ששמר את השבת עד שלא קבל את המילה חייב מיתה, למה שלא נצטוה עלי', ומה ראית לומר עכו\"ם ששמר את השבת חייב מיתה, א\"ר חייא בר אבא א\"ר יוחנן בנוהג שבעולם מלך ומטרונא שיושבין ומסיחין זה עם זה, מי שבא ומכניס עצמו ביניהם אינו חייב מיתה, כך השבת הזו אות בין הקב\"ה ובין ישראל שנא' ביני ובין בני ישראל אות היא לפיכך כותי שבא ומכניס עצמו ביניהם עד שלא קבל עליו לימול חייב מיתה עכ\"ד המדרש, מבואר דשמירת שבת תליא במצות מילה, ואפשר דאף המל ולא טבל לשם גרות ג\"כ ישנו בכלל שמירת שבת, דלפי הטעם שנתנו רז\"ל, להיות השבת אות ברית בין הקב\"ה ובין בנ\"י, ע\"כ עכו\"ם שאינו בברית ה\"ה זר ואין לו להכניס עצמו ביניהם, אמנם הנימול בגופו לשמו ית' כבר נכנס בברית ע\"ו המילה שנקרא אות וברית, ונכרתו עלי' י\"ג בריתות, אפשר דישנו בשמירת השבת, ושמעתי שכבר הי' בזה מחלוקת בין הגדולים בגר שמל לשם גרות, ומחמת סיבה עבר זמן ולא טבל לגרותו, אם מותר בתוך זמן זה לשמור את השבת, ויש אוסרים ויש מתירים, ומדברי המדרש נראה כמו שכתבתי, ובזה יתיישב למה נקט עד שלא קבל עליו לימול, הרי לגרות צריך גם טבילה וקבלת מצות, הי' לו לומר עד שלא נתגייר, ואפ\"ל טעם כי מה שצונו ית' על המילה מוכיח כי בנים למקום אנחנו, כי זהו ממצות האב על הבן, וע\"כ ישראל ישנם בשמירת השבת, כי בן מותר לו להשתמש בשרביעו של אביו, משא\"כ עכו\"ם שלא נצטוו במילה מוכרח שהם בבחי' עבדים, ולא יתייחס בהם בחי' בנים כלל מפני שאין נמולים וממצות האב למול את בנו, וע\"כ אינם בשמירה, כי השבת הוא שרביטו ית' כי בו שבת וגו' והמשתמש בשרביטו של מלך חייב מיתה, ובזה יתבאר דברי המכילתא ושמרו בנ\"י לעשות את השבת ר\"א אומר דבר שהברית כרותה לו ואיזו זו המילה, ר\"ל שבאמצעות המילה שהברית כרותה לו, ישנם ישראל בכלל השמירה ועשיית השבת כמו שמפרש הכתוב להלן לדורותם ברית עולם ביני ובין בני ישראל אות הוא לעולם מפני שנכנסו דורותם בברית, ע\"כ ישנם באות השבת, משא\"כ עכו\"ם אם משתמש בשרביטו ות' חייב מיתה כנ\"ל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 226,
      "char_length": 1749,
      "timestamp": "2025-02-06T19:34:52.512008"
    },
    {
      "id": "ki sisa_p227",
      "text": "ויתן אל משה ככלתו וגו' במד\"ר (פרשה מ\"א סי' א') כך פתח ר' תנחומא בר אבא דניאל ע') לך ה' הצדקה ולנו בושת הפנים וכו' א\"ר נחמי' אפי' בשעה שאנו מביטים במעשינו יש לנו בושת פנים כיצד הוא הדבר, אלא בנוהג שבעולם אדם נותן שדהו לאריסות והוא נותן זרע ונותן פעולה והוא חולק עמו בשוה, אבל הקב\"ה ישתבח שמו ויתעלה זכרו אינו כן. אלא העולם וכל אשר בו שלו וכו' והוא עושה כל דבר וכו' הוי לך ה' הצדקה ולנו בושת הפנים, ד\"א א\"ר לוי ישראל עומדין למטה וחוקקים ע\"ז וכו', והקב\"ה יושב למעלן וחוקק להם לוחות לתת להם חיים שנאמר ויתן אל משה ככלתו הוי לך ה' הצדקה עכ\"ד המדרש וצ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 227,
      "char_length": 548,
      "timestamp": "2025-02-06T19:34:53.416961"
    },
    {
      "id": "ki sisa_p228",
      "text": "ב) בגמרא ור\"ה דף י\"ז ע\"ב) ה' ה' אנו הוא קודם שיחטא האדם, ואני הוא לאחר שיחטא האדם ויעשה תשובה, הקשה הרא\"ש למה צריך רחמים קודם שיחטא, וי\"ל שגלוי וידוע לפניו שסופו לחטוא אעפ\"כ מתנהג עמו במדת רחמים באשר הוא שם, או נמי קודם שיחטא בע\"ז, ואף שכבר חשב לעובדה ומחשבת ע\"ז הקב\"ה מצרפה למעשה, אפ\"ה מתנהג עמו במדת הרחמים קודם שיחטא וכו': והאוהחה\"ק דוחה שני התירוצים, כו אם יבוא ה' להעניש על מה שעתיד, נאמר לפניו ג\"כ למה בראת אותו, כיון שאתה יודע שיחטא וידין אותו על העתיד וכו', ומ\"ש בחושב בע\"ז ועדיין לא עשה, קשה כי זה יקרא אחר מעשה, כי הגם שלא עבד, חטא המחשבה נתפס עליו וכו', והוא ז\"ל מתרץ באופן אחר עיי\"ש, ועדיין צ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 228,
      "char_length": 607,
      "timestamp": "2025-02-06T19:34:53.706144"
    },
    {
      "id": "ki sisa_p229",
      "text": "והנ\"ל בהקדם דברי ק\"ז זלה\"ה הישמח משה (פ' חיו שרה) לפרש דברי המדרש כד דמיך ר' אבהו אחזו לי' תלת עשרי נהרי אפרסמון, א\"ל אילין דמאן. א\"ל דידך, א\"ל אילין לר' אבהו ואני אמרתי לריק יגעתי, לתהו והבל כחי כליתי, אכן משפטי את הי, ותמהו המפרשים איך פה קדוש יאמר דבר זה, לחשוב שיהי' יגיעו לריק ח\"ו, והנ\"ל עפי\"מ שפירשתי הפסוק אחת דבר אלקים שתים זו שמעתי כי עוז לאלקים ולך ה' החסד כי אתה תשלם לאיש כמעשהו, דכולו מוקשה דמה היא האחת אשר דבר, ומה הם השתים אשר שמענו, ואיך נמשך לזה כי עוז לאלקים, ואיך נמשך עוד לזה ולך ה' החסד, גם מה שנתקשו מכבר דמה הוא החסד שמשלם כמעשהו, והנ\"ל כי בכל הדברים יש ג' חלקים ראש תוך וסוף, והמתחול הוא עיקר גדול וכו' והמסוים ג\"כ עיקר גדול וכו' והאמצעי הוא רק מסייע, וקיי\"ל מסייע אין בו ממש, וכן נוהגין בשכר שדכנות וסרסרות, והנה בכל דבר הוא ית\"ש המתחיל כמ\"ש מי הקדימני ואשלם, והמסיים וגומר ג\"כ הוא ית\"ש כמ\"ש רז\"ל (קידושין דף ל' ע\"ב) אלמלא הקב\"ה עוזרו לא הי' יכול לו. וא\"כ האדם אינו רק קצת ממוצע בבחירתו וכו', רק ע\"צ החסד משלם השי\"ת לאדם כאילו הוא הי' עושה כולה, וז\"פ הפסוק אחת דבר אלקים, ר\"ל כל מה שדבר אלקים לנו בתוה\"ק, רק על חלק אחת דבר היינו חלק האמצעי, שתים ר\"ל שתי החלקים האחרים דהיינו ראש וסוף זו שמענו, ר\"ל זה אנו מבינים (ע\"ד כי שומע יוסף שהוא לשון הבנה) כי עוז לאלקים פי' כי היכולת על אלו שני החלקים היא רק לאלקים ולא לאדם, ושמא תאמר מפני מה יקבל שכר לז\"א ולך ה' החסד כי אתה תשלם לאיש כמעשהו, ר\"ל כאילו הי' מעשהו וכו' כיון שהאדם עושה מה שבכוחו בבחירתו ולא הוי נהמא דכסופא כלל, ובזה פי' הפסוק אני בצדק אחזה פניך. כי בנהמא דכסופא מתבייש למיחמי אפין באפין אבל אני בצדק ר\"ל אף שאני מקבל צדקה מהשי\"ת, כמ\"ש ולך ה' החסד וגו' מ\"מ אחזה פניך דלא יהי' נהמא דכסופא כלל, וז\"ש ר' אבהו אני אמרתי לריק יגעתי, כו לא נצחתי ביגיעי, רק יד ה' עשתה זאת א\"כ עדיין יש נהמא דכסופא וקבלת שכר רק בצדקה, אכן משפטי את ה' ופעולתי את אלקי, שפעולתו עם פעולת אלקי הכל נחשב פעולתי עכת\"ד הק'.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 229,
      "char_length": 1775,
      "timestamp": "2025-02-06T19:34:54.083595"
    },
    {
      "id": "ki sisa_p230",
      "text": "ובזה יובן אמרם ז\"ל (סוכה דף נ\"ב ע\"ב) יצרו של אדם מתגבר עליו בכל יום וכו' ואלמלא הקב\"ה שעוזר לו אינו יכול לו, דהנה כח גדול זה ניתן ליצה\"ר מאת הקב\"ה וקשה אפוכי מערתא למה לי, לא יתן לו הקב\"ה כח רק לפי מה שבכח האדם להתגבר עליו ולא יותר ולמה ינתן לו מתחלה כח גדול כ\"כ כדי שלא יוכל האדם להתגבר עליו רק בסייעתא דשמיא, אולם לפי דברי ק\"ז הישמח משה זלה\"ה מתורץ, שזה טובה גדולה לבני אדם להגדיל שכרן, שאם מתגברין על היצה\"ר אעפ\"י שאינו רק כמסייע והכל נעשה בעזר אלקי, עכ\"ז נחשב להאדם כאילו הוא עושה הכל כיון שעושה מה שביכלתו, ובזה נתגדל שכרו עד און חקר, משא\"כ אם לא הי' נותן להיצה\"ר כח רק לפי כח האדם, אז גם בשכר הי' מוגבל לפי כח התגברותו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 230,
      "char_length": 625,
      "timestamp": "2025-02-06T19:34:55.040162"
    },
    {
      "id": "ki sisa_p231",
      "text": "ובזה יתבאר דברי הגמ' ר\"ה הנ\"ל, ויתורץ קושית הרא\"ש ז\"ל, דגם קודם שיחטא צריך האדם לרחמים, דלולא עזר אלקי לא הי' יכול להתגבר על יצרו כלל, וזהו ממדת רחמיו ית' שמסייע בידו להנצל מן החטא, ועוד שמשלם לו כמעשהו, כאילו הי' עושה הכל בעצמו, ואחר שיחטא: הקב\"ה מרחם עליו לפתוח לו שערי תשובה כאמרז\"ל (שבת דף ק\"ד ע\"א) הבא לטהר מסייעין אותו. ומקבל תשובתו שזה ג\"כ רק מצד מדת החסד, ועד\"ז יובן אמרם ז\"ל (ע\"ז דף ד' ע\"ב) לא היו ישראל ראויין לאותו מעשה אלא כדי להורות תשובה לרבים, וצ\"ב דבוודאי לא יתכן דבשביל להורות תשובה הזמינו לידם מן השמים חטא חמור כזה, אמנם הכוונה כו מבלעדי עזר השי\"ת א\"א לאדם להתגבר על יצרו, וזהו ממדת רחמיו ית' שהוא המתחיל והמסוים כנ\"ל, אלא שבענין הזה נשארו ישראל על עצם בחירתם ונכשלו, וג\"ז הי' לטובתם כדי להורות תשובה לרבים והוכן להם כח התשובה לדורות .",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 231,
      "char_length": 754,
      "timestamp": "2025-02-06T19:34:55.379297"
    },
    {
      "id": "ki sisa_p232",
      "text": "ויתבאר בזה דברי המדרש הנ\"ל (בקושיא א') ויתן אל משה ככלתו וגו', ודרשו רז\"ל ויתן מלשון מתנה שניתנה לנו התורה במתנה, לרמוז שאילולא עזר אלקי אינו במציאות לבשר ודם לזכות לשמירת התורה ומצותי\", והנה כח התשובה הכרחית לקיום התוה\"ק, כמ\"ש הבני יששכר זלה\"ה מאמר ימי הגבלה בביאור קושית הקדמונים, דמדוע לא מהני תשובה רק לישראל ולא לאוה\"ע וכי משוא פנים יש (עיי\"ש בכמה אנפין) ובאופן ג' הביא בשם הרב לימודי ה', היות שהשי\"ת הרבה לישראל התורה והמצות, דקדוקי המצות וענפיהן לאין משער, בכדי לקדש כל איבריהן וגידיהן וכוחות גופותיהם עד שיהיו כמלאכי קודש, והנה האדם יצור חומר תכבד עליו משא מלאכת הקודש, ואין צדיק בארץ אשר יעשה טוב ולא יחטא, ע\"כ חשובים כאנוסים, משא\"כ הגוים המעט מצות הניתן להם אם לא ישמרו מזידים הם נגד כבוד המלך, ומלך שמחל על כבודו אין כבודו מחול עכדה\"ק, מבואר כי התשובה הכרחית לישראל, דבלא זה אין להתוה\"ק קיום ח\"ו, והנה בהלוחות היו כלולים כל התורה ומצותי\"ן וכתב בספר עשרה מאמרות להרמ\"ע זלה\"ה שכל העוסק בתורה לשמה, מה שמחדש נחקק על הלוחות עיי\"ש, ובוודאי כי התשובה שהוא קיום התוה\"ק חרות על הלוחות, ונסבב להם ע\"י חטא העגל להורות תשובה כאמרז\"ל .",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 232,
      "char_length": 1034,
      "timestamp": "2025-02-06T19:34:55.750245"
    },
    {
      "id": "ki sisa_p233",
      "text": "וז\"פ דברי המדרש ישראל עומדין למטה וחוקקים ע\"ז וכו', והקב\"ה יושב למעלן וחוקק להם לוחות לתת להם חיים שנא' ויתן אל משה ככלתו, דאילולא התשובה לא הי' התורה הק' מתקיים אצלם ח\"ו, וכל זה צדקה מאתו ית' כי לולא עזר אלקי אין בכוחינו לעשות תשובה ולא שום דבר, ולזה הסמיכו במדרש כך פתח ר' תנחומא בר אבא לך ה' הצדקה ולנו בושת הפנים וכו' א\"ר נחמי' אפי' בשעה שאנו מביטים במעשינו, יש לנו בושת הפנים וכו' כיצד הוא הדבר, בנוהג שבעולם אדם נותן שדהו לאריסות והוא נותן זרע ונותן פעולה והוא חולק עמו שוה בשוה, אבל הקב\"ה ישתבח שמו וכו' העולם וכל אשר בו שלו והוא עושה כל דבר הוי לך ה' הצדקה ולנו בושת הפנים, והנה לפי\"ז השכר הוא נהמא דכיסופא, אלא שהבוי\"ת בחסדו הגדול משלם לאיש כמעשהו, כאלו הוא הי' העושה, וזהו מתנה מאתו ית', ולזה דרשו רז\"ל ויתן אל משה ככלתו שניתנה לנו התוה\"ק מתנה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 233,
      "char_length": 754,
      "timestamp": "2025-02-06T19:34:56.233587"
    },
    {
      "id": "ki sisa_p234",
      "text": "ויתן אל משה ככלותו, במד\"ר (פרשה מ\"א סי' א') כך פתח ר' תנחומא בר אבא דניאל ט') לך ה' הצדקה ולנו בושת הפנים מהו כן וכו', א\"ר שמואל בר נחמן נאה הי' לאבותינו לקבל את התורה ולומר כל אשר דבר ה' נעשה ונשמע, שמא נאה הי' להם לומר אלה אלהיך ישראל אתמהא וכו' עכ\"ד המדרש וצ\"ב כוונת הדמיון והקישור, ומאי ס\"ד להיות נאה ח\"ו, ומדוע אמר שמא נאה הי' בלשון ספק.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 234,
      "char_length": 342,
      "timestamp": "2025-02-06T19:34:56.605223"
    },
    {
      "id": "ki sisa_p235",
      "text": "ונל\"פ בהקדם לבאר ענין חטא העגל שהאריכו בו מפורשו התורה כל א' לפי דרכו, וכולם הסכימו שהעגל לא נעשה לשם ע\"ז, והראב\"ע ז\"ל כתב חלילה חלילה שעשה אהרן ע\"ז, גם ישראל לא בקשו ע\"ז, רק חשבו שמת משה וכו' וככה אמרו אשר ילכו לפנינו וכו' והנה לכבוד השם נעשה, על כן בנה אהרן מזבח לפניו, והכריז שיזבחו מחר לכבוד השמר וכן עשו כאשר צום, וזו תשובת אהרן וכו', ואתה ידעת את העם כי ברע הוא, כי אנו לא עשיתי רע להם, כי לא בקשו רק אשר ילך לפניהם ולכבוד השם עשיתיו, רק בעבור שישראל הוו מעורבים עם ערב רב וכו', וחשבו מעטים מישראל שהיתה ע\"ז, והביאו זבחים והשתחוו לו ואמרו אלה אלהיך ישראל וכו' עכ\"ד, גם הרמב\"ן הק' כתב כי בידוע שלא היו סבורים שמשה הוא האלקים, ושהוא בכוחו עשה להם האותות והמופתים, וזה טעם שיאמרו כיון שהלך משה ממנו נעשה אלקים וכו' אבל היו מבקשין משה אחר וכו' ועפ\"י ה' שיורה הדרך לפנינו וע\"פ ה' בידו, וזה טעם הזכירם משה האיש אשר העלנו לא הקל אשר העלם וכו' עיי\"ש באורך.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 235,
      "char_length": 854,
      "timestamp": "2025-02-06T19:34:56.809779"
    },
    {
      "id": "ki sisa_p236",
      "text": "והאוהחה\"ק כתב שלעולם לא מרדו בסיבה ראשונה אלא שרצו באמצעי, ואולי שחשבו שלא צוה ה' על איסור האמצעי אלא כל עוד שיהי' משה וכו', ומה שאמרו אלה אלהיך ישראל וגו' בדבריהם אלו גילו דעתם שאינם משתחוים ועושים אלו' אלא להמוציאם מארץ מצרים, ונתכוונו בדיבור זה להכין בו בחינת האלהות שהוא המוציא וכו', ונתחכמו לעשות הדבר להמשיך כח עליון בדבר המתקיים, ויהי' מצוי תמיד לפניהם, ולעולם לא עקרו אנכי ה' וגו' אשר הוצאתיך מארץ מצרים אלא אמרו אלה, ואולי כי לזה אמר העלוך לשון רבים לרמוז לכח תחתון כעליון ח\"ו, ובאמצעות זה פגמו פגמים רבים ועשה ה' בהם שפטים וכו', ורז\"ל אמרו שערב רב שעלו עם ישראל הם העושים, ובהכרח לומר כי ישראל לא הסכימו בשעת מעשה, שאם הסכימו הרי גם המה עשו, שהמחשבות פועלות בע\"ז עכ\"ד האוהחה\"ק, ועד\"ז פירשו הכלי יקר ורוב המפרשים ז\"ל, מבואר מדבריהם שרוב מישראל הי' כוונתם לש\"ש, והכשלון הי' מה שהשתתפו עם הע\"ר והם עשו לשם ע\"ז, ובעוה\"ר גם בדורינו נכשלנו בדומה לו ועוד חמור ממנו, כי הסיבה אז הי' כמאמה\"כ וירא העם כי בשש משה, ורז\"ל אמרו באו שש ועדיין לא בא, ועי\"ז מצאו הערב רב אמתלא למרוד, וישראל הכשרים טעו ונשתתפו עמהם, ועי\"ז וצא הקצף על הכלל כולו, ונשארה פקידה לדורות, ובעוה\"ר כזה קרה לנו גם בימינו, שקמו כת העיר ואמרו באו שש רוב אלף השישי ועדיין לא נושענו, ועשו את העגל הקמת המדינה להרוס כל התורה הק', ויש בו ע\"ז ג\"ע ושפכ\"ד, וגרוע יותר מהעגל הראשון שלא הי' ע\"ז ממש, ובעוה\"ר כמו אז גם עכשיו המשיכו לדעתם רוב גדול מישראל, השי\"ת יצילנו מהם ומהמונם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 236,
      "char_length": 1337,
      "timestamp": "2025-02-06T19:34:57.237092"
    },
    {
      "id": "ki sisa_p237",
      "text": "ובזה נבוא לביאור דברי המדרש הנ\"ל נאה הי' לאבותינו לקבל את התורה ולומר כל אשר דבר ה' נעשה ונשמע וכו', שנתאחדו כל ישראל וכולם לש\"ש נתכוונו, כמ\"ש ויחן שם ישראל נגד ההר ודרשו רז\"ל כאיש א' בלב א', וכתיב ויענו כל העם יחדו כל אשר דבר ה' נעשה ונשמע, שמא נאה הי' להם לומר אלה אלהיך ישראל, ואין הכוונה על הע\"ר שעשאוה לשם ע\"ז, אלא על רוב הכשרים שנתכוונו לש\"ש. ומתרעם המדרש כי אף שהיתה כוונתם לשמים באמרם אלה אלהיך ישראל כמבואר, מ\"מ כיון שגם הע\"ר נשתתפו עמהם וכוונתם היתה לע\"ז, אסור היה לכשרים שבישראל להיות בעצה אחת אתם עמם, אף אם כוונתם היתה לשמים, וז\"ש המדרש נאה היה לאבותינו וכו' לומר כל אשר דבר ה' נעשה ונשמע כי אז היו כל ישראל קדושים וטהורים, וקבלו על עצמם עול מלכותו יתברך בלב שלם לעשות רצונו ולעבדו שכם אחד, אבל שמא נאה הי' לומר אלה אלהיך, כלומר שהמדרש מתמה על הכשרים שבישראל שהתחברו עם הע\"ר במעשה העגל, ואף שהיתה כוונתם לשמים אבל לא נאה היה להם להשתתף עם העזר אשר נתכוונו לע\"ז. כו במקום שמשתתפום אנשי רשע אין ליראי ה' לקחת חלק עמהם אף אם המה מתכוונים לש\"ש, ופוק חזי מה עלתה בידם ומה הגיע אליהם, אשר מהתחברות עם אנשי רשע המה הע\"ר יצא העגל הזה אשר עברתו שמורה לנצח.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 237,
      "char_length": 1060,
      "timestamp": "2025-02-06T19:34:57.919558"
    },
    {
      "id": "ki sisa_p238",
      "text": "ובדרך אגב נל\"פ מ\"ש בעה\"ת עה\"פ ויקהל העם על אהרן ויאמרו אליו קום עשה לנו אלהים וגו', לא לשם ע\"ז נתכוונו כי אם להיות שופט במקומו של משה וכו', והא דכתיב וישתחוו לו לכבוד הי' ולא לשם ע\"ז, אהרן לש\"ש נתכוון. אמר אם אומר להם כלב או נחשון יהי' ראש עליכם, אם ימליכוהו עליהם, כשיבא משה אם וורידוהו מגדולתו תרבה קטטה ביניהם ויבואו לידי שפיכת דמים, ואם אומר לא אתן ראש עליהם הם יתנו מעצמם ויהי' קטטה, ואם אומר אני אהי' ראש עליהם, שמא יקשה בעיני משה, אעסוקם בדברים שאין להם ממש וכו' ולכאורה יש להבין דאם אהרן הי' רואה מקום להצילם עי\"ז שהוא יהי' המנהיג, איך חשש שמא יקשה בעיני משה, לו יהא שיקשה בעיניו ויזיק לו הקפדת משה רבינו ע\"ה, הלא בשביל זה לא הי' נמנע אהרן להציל את ישראל מחטא גדול כזה, ובודאי הי' מוסר נפשו בשביל טובת ישראל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 238,
      "char_length": 716,
      "timestamp": "2025-02-06T19:34:58.464801"
    },
    {
      "id": "ki sisa_p239",
      "text": "ונל\"\"פ עפי\"מ דאיתא בשו\"ע יו\"ד (סי' י\"ח סעיף י\"ז) עבח שלא הראה סכינו לחכם (ונמצא יפה) היו מנדין אותו, ובהג\"ה שם ובנמצא ופה יכול החכם למחול ואין צריך לנדותו ע\"כ, וכתב הש\"ך (בס\"ק כ\"ח) שהרמב\"ם (ספ\"א מה' שחיטה) כתב הטעם דהיו מנדין, לפי שיסמוך על שחיטתו פעם אחרת ותהי' פגומה וישחוט בה עכ\"ל, ולפי\"ז אפשר דאין החכם יכול למחול, ובאמת דברי הרמב\"ם עצמם קשה להולמם דבגמרא אמרו דראיית סכין לחכם הוא מפני כבודו של חכם, והרמב\"ם נתן טעם מפני חשש איסור, ובכו\"פ מתרץ דס\"ל להרמב\"ם הא דאמרינן בגמ' דאו לא הראה לת\"ח הסכין מנדין אותו אי נימא הטעם משום זלזול כבודו של ת\"ח, מה קמ\"ל ידענו גם ידענו המזלזל בכבוד ת\"ח חייב נידוי, וע\"כ דכוונת הנידוי מחשש איסור, וס\"ל לרמב\"ם כמ\"ש במורה הלכה בפני רבו דלא מסתייע מילתא להורות כהלכה, ואפילו ת\"ח מוחל לא מהני כמ\"ש התוס' דהא מורה שלא כדין, כמו\"כ השוחט בסכין ולא הראהו לחכם לא אסתייע מילתא ולא ירגיש בפגימה, שזה צריך התבוננות יותר מהוראה, ולכך מנדין אותו דהואיל דפקר יכשל בסכין שיש בו פגימה ע\"כ.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 239,
      "char_length": 909,
      "timestamp": "2025-02-06T19:34:58.836668"
    },
    {
      "id": "ki sisa_p240",
      "text": "ואפשר דעד\"ז הי' אהרן מתיירא להיות מנהיג דמפני זלזול כבודו של חכם לא מסתייע מילתא לכוין אל האמת ואף אם לא יוקשה בעיני משה לא יהי' לו סייעתא דשמיא שהרי הוא מורה הלכה בפני רבו, וח\"ו גם הוא יכשל ליפול ברשתם, ע\"כ בחר יותר לעשות העגל והי' מצפה שיבוא משרע\"ה מיד ויבטלהו, גם כי מנהיג שלא מנוהו מן השמים אינו טובי וכמ\"ש חכז\"ל (ברכות דף נ\"ח ע\"א) דאפילו ריש גרגותא מן שמיא מנו לי\"ל ופירשתי דברי המסורה הובא בבעה\"ט (פ' במדבר) עה\"פ ואתה הפקד את הלוים, ב' במסורה, דין ואידך הפקד עליו רשע, וזהו שאמרו אין אדם נעשה שוטר מלמטה אלא אם כן נעשה רשע מלמעלה ע\"כ, וצ\"ב דאדרבה השופטים והשוטרים הם המעמידים חומת הדת על תלה ומצוה מן התורה למנות שופטים ושוטרים, ויתבאר עפי\"מ דאיתא בגמרא (יבמות דף ס\"א ע\"א) מעשה ביהושע בן גמלא שקידש למרתא בת ביתוס ומינהו המלך להיות כהן גדול וכו', מינהו אין נתמנה לא (פירש\"י מינהו אין, כלומר מינהו המלך וכו', נתמנה לא קתני דהוי משמע דראוי הי' לכך) דאמר רב אסי תרקבא דדינרי עיילה לי' מרתא בת ביתוס לינאי מלכא, עד דמוקי ליהושע בן גמלא בכהנא רברבא ע\"כ, וז\"ש אין אדם נעשה שוטר מלמטה וכו' ר\"ל אם מן השמים אינו ראוי לכך, ורק מלמטה נעשה שוטר, אז באמת נעשה רשע מלמעלה, ומה\"ט לא רצה אהרן למנות שום אחד למנהיג, ואף בעצמו לא רצה להיות מנהיג כו רצון הבוות\"ש הי' שמשה רבינו יהי' המנהיג.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 240,
      "char_length": 1178,
      "timestamp": "2025-02-06T19:34:59.269318"
    },
    {
      "id": "ki sisa_p241",
      "text": "במסיבה להחזקת התאחדות הרבנים וירא העם כי בשש משה לרדת מן ההר ויקהל העם על אהרן ויאמרו אליו קום עשה לנו אלהים וגו', ויאמר אליהם אהרן פרקו נזמי הזהב אשר באזני נשיכם בניכם ובנותיכם והביאו אלי, פירש\"י אמר אהרן בלבו הנשים והילדים חסים בתכשיעיהן הן, שמא יתעכב הדבר ובתוך כך ובא משה והם לא המתינו ופרקו מעל עצמן עכ\"ל, והנה בוודאי אהרן הכהן לטב אתכוין, אך בכ\"ז תמי' כי אהרן קדוש ה' כל דיבוריו היו בקדושה נפלאה ושפתי כהן ישמרו דעת, ואיך יוציא בשפתיו דיבור כזה פרקו נזמי הזהב, שמזה נסתבב להם חטא העגל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 241,
      "char_length": 491,
      "timestamp": "2025-02-06T19:34:59.860685"
    },
    {
      "id": "ki sisa_p242",
      "text": "ב) להלן בהתנצלותו אל משה ואמר להם למי זהב התפרקו ויתנו לי ואשלכהו באש ויצא העגל הזה וצ\"ב כוונת ההתנצלות מהו, ואין זה אלא סיפור הענין דברים כהוייתן, ואין בזה מענה על שאלת משרע\"ה מה עשה לך העם הזה כי הבאת עליו חטאה גדולה, גם צ\"ב הלשון למי זהב התפרקוג ובוודאי שלא יתן כ\"א מי שיש לו ולא זולתו, גם מ\"ש ויצא העגל הזה צ\"ב כי הזה מיעוטא הוא זה ולא אחר, כמו שדרשו רז\"ל בכ\"מ, ומהו הכוונה למעט הכא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 242,
      "char_length": 387,
      "timestamp": "2025-02-06T19:35:00.135414"
    },
    {
      "id": "ki sisa_p243",
      "text": "ונל\"פ עפימ\"ד במד\"ר תרומה וריש פ' ל\"ה) אמר רשב\"ל לא הי' העולם ראוי להשתמש בזהב ולמה נברא בשביל המשכן ובשביל בית המקדש וכו' ובמד\"ר פ' ויקהל (סו\"פ מ\"ח) כשעשו העגל אמר הקב\"ה למשה ועתה הניחה לי וגו': אמר לו בדוק אותן שיעשו את המשכן מה כתיב באותו קלקלה פרקו נזמי הזהב, ומה הביאו נזמים, וכשעשו המשכן עשו אותו נדבה, ומה כתיב כל נדיב לב הביאו חח ונזם טבעת וכומז בנזמים חטאו ובנזמים נתרצה להם, ורוה\"ק צווחת ע\"י הושע (שם ב') והי' במקום אשר יאמר להם לא עמו אתם יאמר להם בני אל חי עכ\"ד המדרש, ופי' היפ\"ת דעד\"ז היתה המלצת משרע\"ה עליהם בדוק אותן שיעשו את המשכן, אע\"ג שהרבו לחטוא ונתנו זהב היקר בעיני כל אדם לעגל אבל המה הלא יתנו גם למשכן ואמרז\"ל בפ\"ק דשקלים יבוא זהב שבמשכן ויכפר על זהב שבעגל עכ\"ד.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 243,
      "char_length": 683,
      "timestamp": "2025-02-06T19:35:00.369381"
    },
    {
      "id": "ki sisa_p244",
      "text": "ועד\"ז אפ\"ל בדיבורו של אהרן. כי השיג ברוה\"ק שאם יכשלו בחטא העגל יהי' תקונם שיתנו זהב לדבר שבקדושה: דעי\"ז נבחנו ונמצאו שלימים כמ\"ש משרע\"ה בדוק אותן שיעשו את המשכן. ע\"כ רצה אהרן הכהן להקדים פני הרעה ואמר פרקו נזמי הזהב וגו' והביאו אלי, ובוודאי לא לצורך העגל ביקש מאתם ח\"ו, רק אמר והביאו אלי ר\"ל על דעתו להעלותו לקדושה עליונה, אלא שמכשפי ערב רב שעלו עמהם עשאוהו בכשפים, ומ\"מ דיבורו של אהרן הכניס בהם רושם, שאח\"כ כשבקשו מהם זהב למשכן, הביאו כולם כלי חמדתם תנופת זהב לה' וכ\"ז הי' מכח דיבורו של אהרן, ועד\"ז יתפרש ואומר להם למי זהב, ר\"ל שרמז להם בשאלה זו לאיזה צורך נברא הזהב, והרי לא הי' העולם ראוי להשתמש בו, ואין זה כ\"א בשביל המשכן והמקדש, ע\"כ התפרקו ויתנו לי ר\"ל על דעתו להעלותו אל הקדושה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 244,
      "char_length": 685,
      "timestamp": "2025-02-06T19:35:00.728872"
    },
    {
      "id": "ki sisa_p245",
      "text": "ומ\"ש ויצא העגל הזה, דמשמע מיעוטא הזה ולא אחרת, אפ\"ל עפי\"ד בעה\"ת כו לא לשם ע\"ז נתכוונו, כי אם להיות שופט במקומו של משה וכו' ובחר אהרן יותר בזה, מלעשות להם מנהיג אשר לא צוה ה\"ג (עיין בדברינו לעיל) כי מנהיג שלא מנוהו מן השמים תקלה גדולה לישראל ח\"ו. ופירשנו בזה דברי המדרש (והוא ממס' סופרים) אין אדם נעשה שוטר מלמטה אא\"כ נעשה רשע מלמעלה עיי\"ש, והעגל נתבטל ממציאותו ע\"ו משרע\"ה ונטחן לעפר, אבל אם יעשה מנהיג, אם יבוא משה ויורידוהו מגדולתו תרבה הקטטה ויתפרדו לכתות הרבה, וזהו תקלה גדולה יותר מהעגל, וזהו טעם התנצלותו אל משרע\"ה ויצא העגל הזה, הזה מיעוטא ולא אחר, דע\"י מנהיגים לא טובים נתחדש בכל יום עגל אחר וע\"ז בצורה אחרת, ועכ\"פ יש בזה קצת בחי' נחמה והתנצלות שלא נתתי להם מנהיג כאשר בקשו, דזהו גרוע הרבה יותר והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 245,
      "char_length": 707,
      "timestamp": "2025-02-06T19:35:01.072982"
    },
    {
      "id": "ki sisa_p246",
      "text": "ויהי כאשר קרב אל המחנה וירא את העגל ומחולות ויחר אף משה וישלך מידיו את הלוחות וישבר אותם וגו', בגמ' (יבמות ס\"ב ע\"א, שבת פ\"ז ע\"א) שיבר את הלוחות מאי דרש, אמר ומה פסח שהוא א' מתרי\"ג מצות. אמרה תורה כל בן נכר לא יאכל בו, התורה כולה וישראל מומרים עאכו\"כ, ובמהרש\"א שם בח\"א הביא קושיא בשם הר\"פ, דמאי ק\"ו הוא זה, אימא דיו לבא מן הדין להיות כנדון. דאמרי' בפ' תמיד נשחט, שחט למולין ולערלים כשר, הכא נמי הרי היו שבט לוי שלא טעו בעגל עיי\"ש תירוצו, ועוד לאלקי מילין.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 246,
      "char_length": 454,
      "timestamp": "2025-02-06T19:35:01.448816"
    },
    {
      "id": "ki sisa_p247",
      "text": "ב) עוד הקשה במהרש\"א שם למה לא הי' דן משרע\"ה ק\"ו זה מיד כשא\"ל הקב\"ה לך רד כי שחת עמך וגו', ורק כאשר קרב אל המחנה וירא במו עיניו את העגל ומחולות וישבר אותם מיד, ולא עשה כן בראשונה כאשר נאמרה לו מפי הגבורה, אלא ויחל משה את פני ה' וגו', ובמדרש הקשו כן אפשר שלא הי' משה מאמין בהקב\"ה שא\"ל כו שחת עמך וכו' אלא הודיע לישראל שאפי' יהי' אדם שומע מפי יחידי נאמן אסור לקבל עדותו ולעשות דבר על פיו, ובעל העקרים תירץ שהדבר הנראה לעינים מצער האדם צער גדול יותר מהודיעה, שהאדם מתפעל מהמורגש בחוש יותר ממה שותפעל מהנודע באמיתת וכו' עיי\"ש, אמנם דברי בעל העיקרים עדיין צריך הסבר, דאם נאמר דק\"ו מעליא הוא מ\"ט הורידם משה מן ההר, וכבר ידע מפי הגבורה שאינם ראויים ישראל לקבלם, גם כי בוודאי נצטער משרע\"ה צער גדול כאשר שמע מפי ה\"נ וראוי שותפעל יותר מראי' מוחשית וצ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 247,
      "char_length": 742,
      "timestamp": "2025-02-06T19:35:01.694308"
    },
    {
      "id": "ki sisa_p248",
      "text": "ובספר תורת משה מהחתם סופר זלה\"ה פי' עה\"פ ויאמר אל משה קול מלחמה במחנה, דגם יהושע הבין שהוא קול ענות, רק שהסברא נותן שא\"א שישתקו הצדיקים למעשה הזה ויש מלחמה במחנה, וגם משה חשב ג\"כ זה דמה\"ט הביא הלוחות ולא הניחם למעלה או שברם למעלה, כי חשב שוש בהם צדיקים, רק כאשר בא הרגיש שאין כאן מלחמה רק קול ענות, וא\"כ הי' ראוי לשבר תיכף הלוחות, אלא שאין לדון עפ\"י אומדנא וכו' ע\"כ המתין עד שראה בעיניו וכו', כדי ללמוד לדורות שאין לדון עד שיראה הדיין בעיניו כדאיתא במדרש עכת\"ד ז\"ל, ועפי\"ד הקדושים אפשר לתרץ קצת קושית המהרש\"א ז\"ל בשם הר\"פ, דשחטו למולין ולערלים, עכ\"פ ראוי' הוא למולין וע\"כ הפסח כשר דה\"ה ראוי' למנויו, משא\"כ הכא אף שחלק מישראל לא טעו אחריו מ\"מ מפני שלא היו מוחין ולוחמום לעומתם כלל, הרי כולם משותפים בה קצת ואינו ראוי' להם כלל, ע\"כ כאשר קרב משה אל המחנה, וראה שאין שם מלחמה שברם מיד מכח הק\"ו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 248,
      "char_length": 790,
      "timestamp": "2025-02-06T19:35:02.060888"
    },
    {
      "id": "ki sisa_p249",
      "text": "ואפ\"ל עוד דהנה מהראוי להתבונן במה שהפליגה התוה\"ק בחומר חטא העגל, עד שכל חטאת האדם אשר יעשה יש בו משורש אותו העון, והלא כ\"כ הראשונים שלא לשם ע\"ז נתכוונו, כ\"א להיות מורה דרך במקומו של משה, והראב\"ע ז\"ל כתב דלכבוד השם עשאום, ומעטום היו שחשבו אותו לשם ע\"ז, כמשה\"כ ויפול מן העם כשלשת אלפי איש, והוא חלק מאתים מישראל, וכל אלו נהרגו כאמרז\"ל (יומא ס\"ו ע\"ב) ג' מיתות נדונו שם, עדים והתראה בסייף עדים שלא בהתראה במגפה וכו', א\"כ לא נשארו רק בנ\"י הכשרים שלא כרעו לע\"ז, גם העגל עצמו נשרף ווטחן עד אשר דק ויזר ע\"פ המים, ונאבד זכרו ומדוע נשאר רושם החטא שמור לדורות ונכלל בכל החטאים וצ\"ב.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 249,
      "char_length": 571,
      "timestamp": "2025-02-06T19:35:02.444122"
    },
    {
      "id": "ki sisa_p250",
      "text": "ונל\"פ דלכאורה יפלא איך יכלו לומר אלה אלהיך אשר העלוך מאמ\"צ על עגל אשר הם עשו בעצמם מהזהב אשר באזניהם, וכ\"כ הרמב\"ן ז\"ל בענין דור הפלגה שרשעים היו ולא טפשים, עיי\"ש שהרחיב הענין לבאר טעותם וסברתם, ומכ\"ש בדור דיעה א\"א לומר שעשו מעשה שוטים בלי דעת, ועכ\"פ צריך למצוא הסבר שבו נתלה טעותם, ויתבאר בהקדם דברי הגמ' ברכות (דף ל\"ח ע\"א) רבנן סברי המוציא דאפיק משמע וכו', הכי קאמר להו הקב\"ה לישראל כד מפיקנא לכו עבידנא לכו מילתא, כי היכי דידעיתו דאנא הוא דאפוקת יתכון ממצרים וכו' עכ\"ד הגמ' וביארתי עפי\"ד הרמב\"ם ז\"ל (הלכות יסוה\"ת פ\"ח) וז\"ל משה רבינו לא האמינו בו ישראל מפני האותות, שהמאמין עפ\"י אותות יש בלבו דופי, שאפשר שיעשה האות בלט ובכישוף וכו', ובמה האמינו בו במעמד הר סיני שעינינו ראו ולא זר ואזנינו שמעו משה לך אמור להם וכו', ומנין שמעמד הר סיני לבדו היא הראי' לנבואתו שהוא אמת שאין בו דופי, שנאמר בעבור ישמע העם בדברי עמך וגם בך יאמינו לעולם, מכלל שקודם זה לא האמינו בו נאמנות שהיא עומדת לעד אלא נאמנות שוש אחרי' הרהור ומחשבה עכ\"ל, ולפי\"ד יתפרש אומרם ז\"ל כד אפוקנא לכו עבידנא לכו מילתא, כו היכי דודעותו דאנא הוא דאפוקת יתכון ממצרים, הכוונה על מ\"ת, ועד אז לא נתברר להם לישראל בירור גמור על יצי\"מ וכל האותות והמופתים שהם מהקב\"ה (עיין בדברינו בקו' על הגאולה ועל התמורה סי' ל\"א ביתר ביאור ועיין גם בדברנו לעיל פ' יתרו באורך), והנה השטן ושלוחיו זה דרכם להראות נסים מדומים ומזוויפים, ולהכחיש בנסים אמיתיים יסודי האמונה, ועכשיו בהעגל הזה שנתלבש בו השטן, כמ\"ש בתרגום יוב\"ע ושטנא הוה בגווי' וכו', ע\"כ אמרו הערב רב לישראל אלה אלהיך אשר העלוך מארץ מצרים, ולא על הזהב אשר מהנזמים אמרו כן, כ\"א על השטן אשר נתלבש בו, ולפי שהע\"ר היו גרועים ומושחתום ולא האמינו בכל לבם באמיתת הנס של יצי\"מ, אם הו' מהקב\"ה או בכח הכשפים ח\"ו, ע\"כ מצאו כאן מקום לחזור ולעורר בלבות בני ישראל פקפוקים בעיקרי האמונה, שח\"ו בכח השטן והכשפים נעשה מה שנעשה, ועל השטן שבו אמרו אשר הוצאתיך מארץ מצרים.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 250,
      "char_length": 1748,
      "timestamp": "2025-02-06T19:35:02.741445"
    },
    {
      "id": "ki sisa_p251",
      "text": "ומעתה נבין בטעמו מדוע לא שבר משה את הלוחות כשא\"ל הקב\"ה כי שחת עמך עשו להם עגל מסכה וגו', כ\"א אחר שראה העגל בעצמו, כי הבוי\"ת לא גילה לו עוצם החטא, שהשטן אשר נתלבש בו אליו השתחוו ואמרו אשר הוצאתיך מארץ מצרים, רק אמר לו שעשו עגל מסכה של זהב, ומזה לא הי' משרע\"ה מתיירא כ\"כ, כי הי' בידו לפררו ובעל כוחו, וגם בנ\"י לא יטעו אחריו כ\"כ, אבל כאשר ראה העגל וסטנא בגווה כמ\"ש בתיוב\"ע עה\"פ וירא את העגל, ע\"כ מזה נתפעל יותר, דכח השטן אשר בו לא יוכל לאבד ולפרר, עד שיגיע זמנו לעתיד ויעבירו הקב\"ה מן העולם, ומכל חטא ועון ניתוסף ונתחזק כוחו, ואף שמעטים היו שחשבו אותו לשם ע\"ז ורק הערב רב, אבל מ\"מ גם בנ\"י הכשרים הרהרו בלבם ופגמו בעיקרי האמונה ועי\"ז נתחזק כח השטן, ומיד שברם לעיניהם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 251,
      "char_length": 663,
      "timestamp": "2025-02-06T19:35:03.654473"
    },
    {
      "id": "ki sisa_p252",
      "text": "ובזה יתבאר מדוע רושם החטא שמור לדורות ונכלל בכל החטאים, דהנה כל החטאים הם בכוחו של השטן המפתה ומסמא העינים ומסיתו לחטוא, ובמעמד הנבחר פסקה זוהמתם ונתבטל כוחו של מלאך המות והשטן, כמ\"ש רז\"ל עה\"פ אני אמרתי אלקים אתם אכן כאדם תמותון, וע\"י העגל נתחזק כחו וזהו שורש כל החטאים ע\"כ נכלל רושמו בכל החטאים והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 252,
      "char_length": 301,
      "timestamp": "2025-02-06T19:35:04.012856"
    },
    {
      "id": "ki sisa_p253",
      "text": "ויאמר משה אל אהרן מה עשה לך העם הזה כי הבאת עליו חטאה גדולה, ויאמר אהרן אל יחר אף אדוני אתה ידעת את העם כי ברע הוא ויאמרו לי וגו' ואומר להם למי זהב וגו' ויצא העגל הזה, הקשו המפורשים דאהרן לא השיב בזה על שאלת משה מה עשה לך העם הזה כו הבאת עליו חטאה גדולה, רק סיפר לו המעשה כהויתו ואין בסיפור זה התנצלות למה עשה אותו, גם יל\"ד אומרו אתה ידעת את העם וגו' הלא אליו דיבר ויספיק לומר אל יחר אף אדוני ידעת את העם כי ברע הוא ותיבת אתה מיותר.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 253,
      "char_length": 432,
      "timestamp": "2025-02-06T19:35:04.230440"
    },
    {
      "id": "ki sisa_p254",
      "text": "ב) במדרש (הובא ברש\"י ז\"ל) אמר אהרן מוטב שיתלה החסרון בי ולא בהם, וצ\"ב דאם הוא עשה העגל והם ישתחוו לו, יהי' נתלה החטא בו ובהם, ומה זה שאמר בו ולא בהם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 254,
      "char_length": 149,
      "timestamp": "2025-02-06T19:35:04.484553"
    },
    {
      "id": "ki sisa_p255",
      "text": "ג) בזוה\"ק ויקח מידם ויצר אותו בחרט, אתא קרא לאוכחא מלה דאהרן לא ידע לאסתמרא, אלו כד נטל מידיהון הוה שדי לארעא, ואע\"ג דיטול לי' לבתר לא הוה אצלח עובדא בישא דא, אבל בכולא סיועא בישא הוה, דנקיט דהבא וכו' בעוד דאיהו לקח מידם, אינהו הוו עבדי חרשייהו ומלחשי בפומייהו וכו' עיי\"ש, ולכאורה יש להבין איך טעה בזה אהרן ולא ידע להזהר שלא ליקח מידם אתמהה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 255,
      "char_length": 341,
      "timestamp": "2025-02-06T19:35:04.605313"
    },
    {
      "id": "ki sisa_p256",
      "text": "ד) וישמע יהושע את קול העם ברעה ויאמר אל משה קול מלחמה במחנה וגו', בירושלמי מס' תענית (פ\"ד ה\"ה וכ\"ה בקהלת רבתי פ\"ט י\"א) אמר לו משה אדם שעתיד להנהיג שררה על ס' רבוא ישראל לא יוכל להבחין בין הקולות וכו' ראוי להבין טעם טענה זו, דמפני שעתיד להנהיג שררה על ס' רבוא צריך להבחין בין הקולות.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 256,
      "char_length": 282,
      "timestamp": "2025-02-06T19:35:04.803403"
    },
    {
      "id": "ki sisa_p257",
      "text": "ונל\"פ עפימ\"ש הראשונים שהעגל לא נעשה לשם ע\"ז וח\"ו לא עלתה על דעתם של ישראל כך, רק בקשו להם מנהיג במקום משה, וכל החטא הי' רק בשביל שימשכו על ידה לע\"ז וכמ\"ש הרמב\"ן ז\"ל עה\"פ לשמצה בקמיהם ובת\"א לאפקא שום ביש בדריהוןן כי העגל אשר עשו יהי' שמץ רעה בדורות ישראל, כי יאמרו לא לחנם עשו אבותינו את העגל ועבדוהו, רק שידעו בו כו הוא אשר העלם מארץ מצרים, ומצאו בעבודתו תועלת להם, ואף אנחנו נעשה כן כו טוב לנו לעבדו וכו' ע\"כ, אמנם כ\"ז רק בבני ישראל הכשרים שהם וודאי לא נתכוונו לשם ע\"ז, אבל בין הע\"ר היו הרבה שמקורם הי' רע גמור שהיו ביניהם מחרטומי מצרים כמובא במדרשים ובזוה\"ק, והם נתכוונו בעשיית העגל לשם ע\"ז גמורה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 257,
      "char_length": 599,
      "timestamp": "2025-02-06T19:35:04.971926"
    },
    {
      "id": "ki sisa_p258",
      "text": "והנה האוהחה\"ק פי' עה\"פ לא יהי' לך אלהים אחרים על פני וז\"ל כל ע\"ז שבעולם אין פעולת העובד פועלת הדרגה בנעבד לעשותו אלהים, כאשר תעשינה פעולת איש ישראל, כי נותן כח גדול בבחינת הרע, וכופה ח\"ו בחינת המעולה לפני בחינת הרע רח\"ל, והוא אומרו לא יהי' לך אלהים, פי' הוי' שלך תעשנו אלהים. עוד ירצה כי באמצעות העובד הוא ממציא הוי' אחר שהוא אלהים, מה שלא הי' כן קודם עכלה\"ק, והאמת הוא שיציאת העגל הי' דבר נפלא חוץ לדרך הטבע שהי' העגל רוקד והשטן בתוכו וכמ\"ש בתרגום יונתן והוה כד קריב משה למשריתא וחמא ות עיגלא וחנגין בידיהון דרשיעיא מחנגין ומגחנין קדמוי וסטנא הוה בגוי' מטפז ומשוור קדם עמא וכו', וניתן לו כח זה ע\"י הע\"ר שעבדו אותו לשם ע\"ז ונתנו בו כח להראות אותות ומופתים ועי\"ז נמשכו הרבה מישראל אחריו לחשוב שיש בו איזה ממש, משא\"כ אם לא הי' מי שיעבוד אותו לשם ע\"ז לא הי' יוצא באופן זה רק הי' פגר מובס חתיכת זהב בלו שום חיות ורק ע\"י שעשו אותו לע\"ז נעשה לו הוי' להיות ע\"ז ולהמשיך אליו הרבה מישראל, שהרי גם העיר עמדו במעמד הנבחר ואמרו נעשה ונשמע ונתגיירו כדין והי' להם דין ישראל גמור שקבלו על עצמם עול מלכות שמים עד חטא העגל וע\"כ ע\"ו שהם עשו העגל לשם ע\"ז נתנו לו כח גדול בבחינת הרע.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 258,
      "char_length": 1063,
      "timestamp": "2025-02-06T19:35:05.284928"
    },
    {
      "id": "ki sisa_p259",
      "text": "והנה למשה רבינו מסר מהקב\"ה כח ההנהגה ומנהיג ישראל צריך להיות יורד לחדרי בטן של כל אחד ואחד לידע פנימיותו של כאו\"א. משא\"כ אהרן לא נמסר לו עבודה זו, ומדתו הי' אוהב שלו' ורודף שלו' אוהב את הבריות ומקרבן לתורה, ע\"כ לא ראה בחי' הרע בשום אדם רק הטוב שבו, דהנה מדריגת איש המעולה שלא לראות בזולתו בחי' הרע רק טוב וכמו שפי' הבעש\"ט הק' כל הנגעים אדם רואה חוץ פו' בזולתו, זה מנגעי עצמו, אמנם מנהיג ישראל צריך לראות הכל, כדי לגדור גדר ולעמוד בפרץ, אלא שלאהרן הכהן לא נמסר לו עבודה זו דזה נמסר למרע\"ה ע\"כ כשבאו אצל אהרן ואמרו לו קום עשה לנו מנהיג במקום משה ולא הזכירו אף ברמז שכוונתם לע\"ז, לא חקר פנימיות מחשבתם שכוונתם לרע וע\"כ שמע לדבריהם כדי להעסיקם בדברים ובתוך כך יבוא משה כפירש\"י ז\"ל, דאלמלי הי' האמת כן שלא כוונו לשם ע\"ז, לא הי' להעגל כח כמ\"ש האוהחה\"ק ואז לא הי' פגם כ\"כ בעשיית העגל, וזה לא הי' בחי' של אהרן לירד בפנימיותו של כל אחד ואחד ולבחון מחשבתו, גם שהי' הרצון מן השמים להעלים ממנו וע\"ד שאמרו חכז\"ל (ע\"ז דף ד' ע\"ב) לא היו ישראל ראויין לאותו מעשה אלא כדו להורות תשובה לרבים, אבל משה רבינו שהי' מנהיג ישראל ודע בחינת נפשו של כאו\"א וראה גם כוחות הרע של כאו\"א.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 259,
      "char_length": 1056,
      "timestamp": "2025-02-06T19:35:05.850743"
    },
    {
      "id": "ki sisa_p260",
      "text": "וזה שהשיב לו אהרן למשה אל יחר אף אדוני אתה ידעת את העם כי ברע הואל כלומר דבר זה נמסר אליך לדעת גם רעת העם, שאתה מנהיגן של ישראל ואליך נמסר כח ההנהגה, ואם הייתי אני יודע מה שאתה יודע לבחון כי רעה כוונתם, גם אני לא הייתי עושה את העגל דאני לא חשבתי שום רעה כשבאו לשאול מנהיג במקום משה, ורק אח\"כ כשהשלכתוי הזהב לתוך האש ויצא העגל הזה בכח גדול עם השטן בתוכו, אז נתוודע לי שהי' בין ישראל גם אנשים כאלו שכוונתם לע\"ז והם נתנו בו כח להיות עגל כזה, אבל מעיקרא לא הי' לי לחשוב ככה דדבר זה נוגע אליך שאתה מנהיג ישראל, ובזה התנצל אהרן עצמו לפני משה. ו בזה נבין דברי הירושלמי הנ\"ל (קושיא ד') עפימ\"ש החתם סופר זלה\"ה עה\"פ ויאמר אל משה קול מלחמה במחנה, דגם יהושע הבין שהוא קול ענות, רק שהסברא הוא נותן שאי אפשר שישתקו הצדיקים למעשה הזה ויש מלחמה במחנה, וגם משה חשב ג\"כ זה דמהאי טעמא הביא הלוחות ולא הניחם למעלה או שברם למעלה, כי חשב שיש בהם צדיקים, רק כשבא הרגיש שאין מלחמה רק קול ענות עכ\"ד ז\"ל, אבל יהושע לא חשד את ישראל כ\"כ לרעה שלא ימצא ביניהם התנגדות לחטא העגל ע\"כ אמר בוודאי גם קול מלחמה במחנה, וזה שאמר לו מרע\"ה אמת שהוא דבר טוב שלא לראות עמל בישראל, אבל אם תרצה להיות מנהיג ישראל אין לך לילך בדרך זה רק צריך שתהי' מבין גם על הרעות ולהבחין בין הקולות איזה הוא מן הסט\"א ואיזה הוא מסטרא דקדושה, וז\"ש אדם שעתיד להנהיג שררה על ס' רבוא לא יוכל להבחין בין הקולות דמי שהוא מנהיג ישראל מוכרח להבחין בין הקולות שהוא הכרח לצורך הנהגת ישראל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 260,
      "char_length": 1319,
      "timestamp": "2025-02-06T19:35:06.377458"
    },
    {
      "id": "ki sisa_p261",
      "text": "ובזה יתבארו דברי הזוה\"ק הנ\"ל (קושיא ג') דלכאורה איך טעה אהרן בזה ולא ידע להזהר שלא ליקח מידם אך יובן בטענה זו שטען אהרן אתה ידעת את העם כי ברע הואל דהנה את העזר הוציא משה רבינו ע\"ה ממצרים עם ישראל והכיר רוע מעשיהם גם שהי' מנהיג ישראל וצריך לדעת מעשה כל אחד ואחד, משא\"כ אהרן לא הכירם כל כך ולא ידע להשמר מהם, וזה שטען למרע\"ה אתה ידעת את העם כי ברע הוא, אבל אני לא ידעתי להזהר מהם ויתנו לי ואשליכהו באש ויצא העגל הזה וכפירש\"י ז\"ל ולא ידעתי שיצא העגל הזה ויצא, כי הוא לא ודע שהם רעים כ\"כ שע\"י שיטול מידם יצא העגל הזה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 261,
      "char_length": 514,
      "timestamp": "2025-02-06T19:35:07.049400"
    },
    {
      "id": "ki sisa_p262",
      "text": "באופן אחר אפ\"ל הקושיות הנ\"ל וא' ב' ג') בשנאמר כי גם אהרן ידע מצב העם ומעמדו אלא שחשב אהרן שאם הוא יעשהו בעצמו יחליש קצת כחם הרע ולולא זאת מי יודע מה רעה הי' נצמח מזה, דלכאורה ראוי להתבונן מדוע באמת רצו שאהרן יעשה את העגל, הלא גם הם יכלו לעשותו, אלא שחשבו שאם אהרן יעשה את העגל ימשכו אחריו כל ישראל לעבדו ח\"ו, אבל אהרן חשב שאם הוא לא יעשנו אז יעשו הם בעצמם ויהי' התקלה גדולה יותר, וכמו שכתבו בעלי התוספות שאהרן כל כוונתו היתה לשם שמים כדו להחליש כוחו גם יתעצל בעשייתו עד שיבוא משרע\"ה, והכתוב משבחו כי שפתי כהן ישמרו דעת וכתיב ורבים השיב מעון זה עון העגל וכו' ע\"כ.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 262,
      "char_length": 562,
      "timestamp": "2025-02-06T19:35:07.322170"
    },
    {
      "id": "ki sisa_p263",
      "text": "ואיתא בגמרא סנהדרין לדף ס\"ג ע\"א) א\"ר יוחנן אלמלא וי\"ו שבהעלוך לא נשתייר משונאיהם של ישראל שריד ופליט, פירש\"י דהשתא לא כפר בהקב\"ה לגמרי אלא ששתפוהו בדבר אחר ע\"כ, ואפשר שאלמלי הם עשאוהו היו אומרים העלך בלא וא\"ו, ויתבאר דברי המדרש הנ\"ל (בקושיא ב') שאמר אהרן מוטב שיתלה הסרחון בי ולא בהם, ולכאורה מה בכך שהוא יעשהו, אם עובדים אליו יהי' נתלה החסרון בו ובהם ומה זה שאמר ולא בהם, ולדרכינו הכוונה בזה שחשב אהרן אם אני אעשה העגל לא יהי' בו כח כ\"כ ולא ימשכו אבתרי', שאהרן הכהן ע\"ה בגודל קדושתו יבטלו במקצת וכשיבוא מרע\"ה ובטלו לגמרי, משא\"כ אם הם יעשו העגל, ימשיכו אחריו רוב ישראל ח\"ו כאשר רואין בעוה\"ר בדורות הללו דמה שהטמאים עושין יש לו כח גדול מאוד והנועלים חלק במעשיהם ועונים אחריהם מקודש המה מגבורום ומחזקים את הוית כח הטומאה וכמ\"ש האוהחה\"ק עה\"כ לא יהי' לך אלהים אחרים כו באמצעות העובד נעשה לה הוי' וקיום, ולטעם זה עשאו אהרן ואמר מוטב יתלה הסרחון בי ולא בהם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 263,
      "char_length": 851,
      "timestamp": "2025-02-06T19:35:07.617760"
    },
    {
      "id": "ki sisa_p264",
      "text": "אך אעפי\"כ פגם הי' עפי\"ד התוס' וב\"ק צ\"א ע\"ב ד\"ה אלא) וז\"ל לכאורה משמע דבנזיר טהור נמי קאמר דנקרא חוטא וכו' ותימא וכו' ואור\"ת דהא דקאמר דלא הוי חוטא היינו שמצוה גדולה מן העבירה דמצוה לדור כדאמר אריש סוטה) הרואה סוטה בקלקולה יזיר עצמו מן היין ומכל מקום קצת יש חטא, מידי דהוי אמתענה תענית חלום בשבת שקורעין לו גזר דינו ונפרעין ממנו תענית של שבת מאי תקנתי' ליתב תענית לתעניתא שהמצוה גדולה מן העבירה וכו' ע\"כ, ופירשתי בזה הרבה ענינים (עיין בדברינו פ' וישב עמוד רל\"ד), וכמו\"כ באהרן שעשה מצוה גדולה להציל את ישראל מע\"ז וכלי', אמנם אף כשהמצוה גדולה מן העבירה צריך לתקן את הפגם שנעשה ע\"ו העבירה, אבל קמי שמיא גליא שהיתה כוונתו רק לש\"ש וזה לא הי' אפשר שיעשה רק אהרן הכהן בגודל קדושתו והוא ידע בבירור שמרע\"ה יחזור מיד.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 264,
      "char_length": 706,
      "timestamp": "2025-02-06T19:35:08.041463"
    },
    {
      "id": "ki sisa_p265",
      "text": "ובזה נתיישב מה שהקשו המפורשים שלא השיב אהרן על שאלת משה אליו, אלא חזר לספר באריכות דברים כל פרטי המעשה ועי' קושיא א') ולדברנו א\"ש כו אכן היו דברי אהרן התנצלות על מעשהו, כי ההכרח אילצהו לכך, מחמת גודל רעת העם, ואילו היו המה עושים את העגל היה הדבר גרוע באלפי מונים, וזה שהשיב אהרן למשה אתה ידעת את העם כי ברע הוא ועד כמה הי' גודל הקלקול אם הם עצמם היו עושים את העגל, ומה\"ט ואומר להם למו זהב התפרקו ויתנו לי' כדי שאחליש כוחם הרע ואני בעצמי אשלוכהו באש ויצא העגל הזה, דלולא זאת הי' גרוע יותר והיו אומרים העלך ע\"ז גמור בלא שיתוף ולא הי' נשאר ח\"ו משונאיהם של ישראל שריד ופליט וע\"כ התפלל עליו מרע\"ה שלא יזיק לו הפגם הזה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 265,
      "char_length": 613,
      "timestamp": "2025-02-06T19:35:08.381765"
    },
    {
      "id": "ki sisa_p266",
      "text": "ויאמר משה אל אהרן מה עשה לך העם הזה כי הבאת עליו חטאה גדולה, ויאמר אהרן אל יחר אף אדוני אתה ידעת את העם כי ברע הוא ויאמרו לי וגו' ואומר להם למי' זהב וגו' ויצא העגל הזה פירש\"י ולא ידעתי שיצא העגל, וכתב עליו הרא\"ם פי' ויצא העגל מבלתי שיצור אותו בחרט, דאל\"כ מאי ויצא העגל הזה, מאחר שהשליך אותו באש והתוך אותו בחרט שצר בו צורת העגל, בהכרח הוא שיצא העגל הזה, אבל ממה שהעיד עליו הכתוב שאמר אהרן פרקו נזמי וגו', וכתיב ויצר אותו בחרט וגו' וא\"כ איך אמר אהרן וכו' ואשלוכהו באש וגו' דמשמע שמעצמו יצא, הא הוא לקח את הזהב וצר אותו בחרט ויעשהו עגל מסכה, נראה שמפני יראתו של משה הוציא שקר מפיו עכ\"ל, והוא תמי' לומר כן שח\"ו הוציא שקר מפיו ובפרט במילתא דעבידא לגלוי' לכלל ישראל.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 266,
      "char_length": 661,
      "timestamp": "2025-02-06T19:35:08.714305"
    },
    {
      "id": "ki sisa_p267",
      "text": "ב) ועתה אם תשא חטאתם, פירש\"י הרי טובל איני אומר לך מחני ואם אין מחני וזה מקרא קצר וכן הרבה עכ\"ל, ולכאורה טעמא בעו מדוע קיצר הכתוב באופן ההן, הגם שישנם הרבה מקראות קצרים, אבל בכ\"מ טעמא בעי, ועוד שהוא מיותר לגמרי, דלמה הוצרך לומר אם תשא חטאתם הרי טוב הלא מובן ממילא שיהי' טוב אם ימחול ה' את העון והעיקר מה שרצה לומר ההיפך אם אין מחני נא, והול\"ל אם לא תשא חטאתם מחני נא, ואף אם הי' כתוב מפורש בפסוק אם תשא חטאתם הרי טעובנ ג\"כ קשה מה צורך להקדמה זו כו הוא מובן מאליו, וביותר עכשיו שלא פורש בקרא אופן ההן א\"כ מה צורך למאמר זה אם תשא חטאתם, גם מלת ועתה מיותר.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 267,
      "char_length": 553,
      "timestamp": "2025-02-06T19:35:09.069393"
    },
    {
      "id": "ki sisa_p268",
      "text": "ולבאר הענין נקדים מאמרם ז\"ל (ע\"ז דף ד' ע\"ב) א\"ר יהושע בן לוי לא עשו ישראל את העגל אלא ליתן פתחון פה לבעלי תשובה, שנאמר (דברים ה') מו ותן והי' לבבם זה ליראה אותי כל הימים וגו', והיינו דאר\"י משום רשב\"י לא דוד ראוי לאותו מעשה (דבת שבעל רש\"י) ולא ישראל ראויין לאותו מעשה וכו' אלא למה עשו לומר לך שאם חטא יחיד אומרים לו כלך אצל יחיד: ואם חטאו ציבור אומרים להו לכו אצל צבור וצריכא וכו', פירשיז\"ל לא עשו ישראל את העגל כלומר גבורים ושלוטים ביצרם היו ולא הי' ראוי להתגבר יצרם עליהם, אלא גזירת מלך היתה לשלוט בם, כדי ליתן פתחון פה לבעלי תשובה, שאם יאמר החוטא לא אשוב שלא יקבלני, אומרים לו צא ולמד ממעשה העגל שכפרו ונתקבלו בתשובה, מי ותן והי' לבבם זה וגו' בסיני נאמר אלמא גבורים ואמיצי לבב בוראתם היו עכ\"ל רש\"י ז\"ל, ותמהו המפורשים על מאמר זה. איך אפשר לומר שכך היתה גזירת מלך לשלוט בם. ואם נמנעה הבחירה מהם א\"כ אין עוד חטא, ובמהרש\"א פי' דהיו ישראל ראויים שהקב\"ה יצילם מחטא גדול כזה, דאע\"ג דהכל בידי שמים חוץ מיראת שמים, מ\"מ בדרך שאדם רוצה לילך מוליכין אותו, ועוד אמרינן דהתורה מצלת מן החטא וכו' והיו ראויים להצילם מן החטא גדול כזה, אלא למה עשו ולא נצולו מעשיית החטא לומר לך וכו' עכ\"ל, מ\"מ עדיין צ\"ב דאם נאמר שנמנע מהם העזר וסייעתא דשמיא, א\"כ בהכרח נכשלו בחטא וכבר אמרו ז\"ל (קידושין דף ל' ע\"ב) אלמלא הקב\"ה עוזרו לא יכול לו, וא\"כ הדרא קושיא לדוכתי' שלא הי' כאן חטא כלל שהרי אנוסים היו ואין הקב\"ה בא בטרוניא עם בריותיו ואין כאן הוראת תשובה לרבים כיון שלא הי' שם חטא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 268,
      "char_length": 1352,
      "timestamp": "2025-02-06T19:35:09.366915"
    },
    {
      "id": "ki sisa_p269",
      "text": "ונל\"פ בהקדם דברי הגמ' (מגילה דף כ\"ה ע\"ב) תניא ר\"ש בן אלעזר אומר לעולם יהא אדם זהיר בתשובותיו שמתוך תשובה שהשיבו אהרן למשה פקרו המערערים, שנאמר ואשליכהו באש ויצא העגל הזה, פירש\"י פקרו המומרים העיזו פניהם לומר יש ממש בע\"ז עכ\"ל, והנה באמת העגל לא נעשה בדרך הטבע, כדאיתא בתרגום יוביע עה\"פ ויצא העגל הזה, שנכנס השטן בתוכו ויצא ממנו דמות עגל, עוד שם עה\"פ וירא את העגל ומחולות, וסטנא הוה בגוי' מטפז ומשוור קדם עמא, ולזה טעו אחריו לומר יש ממש בע\"ז, מפני שהי' בו כח עצום עזו השטן שנכנס לתוכה, ואלמלי הי' צורת עגל של זהב בלי חיות בוודאי לא היו טועין אחריו ומן השמים ניתן כח להשען כדי לנסות את ישראל, ומזה לא ודע אהרן שיצא עגל כזה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 269,
      "char_length": 620,
      "timestamp": "2025-02-06T19:35:10.037308"
    },
    {
      "id": "ki sisa_p270",
      "text": "ומעתה מתורץ קושית הרא\"ם ז\"ל שהקשה דמאחר שצר בו צורת העגל, בהכרח הוא שיצא העגל הזה, א\"כ מה טעם ההתנצלות ואשליכהו באש ויצא העגל הזה, אמנם אהרן כל כוונתו הי' לש\"ש, כמ\"ש בעה\"ת שהי' עושה בו צורות כדי לאחר ולהשהות עד שיבוא משה, אבל חשב שאף אם וצא העגל של זהב לא יטעו אחריו ישראל, ולא ידע שיכנס השטן לתוכו, וזה טעם התנצלותו למשרע\"ה ואשליכהו באש ויצא העגל הזה וכפירש\"י ולא ידעתי שיצא העגל הזה ויצא, ר\"ל עם כח כזה, וכנים הדברים ואמיתיים ולא הוציא ח\"ו שקר מפיו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 270,
      "char_length": 451,
      "timestamp": "2025-02-06T19:35:10.363719"
    },
    {
      "id": "ki sisa_p271",
      "text": "והנה ענין הנסיון מבואר בפרשת ראה כי יקום בקרבך נביא או חולם חלום ונתן אליך אות או מופת ובא האות והמופת אשר דיבר אליך נלכה אחרי אלהים אחרים וגו', לא תשמע אל דברי הנביא ההוא וגו' כי מנסה ה\"א אתכם וגו' ופירש\"י וא\"ת מפני מה נותן לו הקב\"ה ממשלה לעשות אות, כי מנסה ה' אלקיכם אתכם עכ\"ד רשיז\"ל, והראב\"ע כתב כי מנסה ה' וגו' בעבור שעזבו ולא המיתו עכ\"ל, ביאור דבריו שהוא ע\"צ העונש להביאם לידי נסיון הוא בעבור שהניחו ישראל את נביא השקר ולא המיתוהו, אבל אלמלי לא היו ישראל ראויין לעונש, לא הי' ניתן לנביא שקר זה הכח לעשות אות, והנה ישראל בדור דעה במדבר לא היו ראויין לנסיון כזה, כמו שהעידו חכז\"ל לא היו ישראל ראויין לאותו מעשה, וא\"כ מדוע ניתן לשטן כח גדול כזה, שיצא עג מטפז ומשוור והשטן בגוי') גם הראה להם השען כמין דמות משה שנושאים אותו באויר רקיע השמים כפירש\"י עה\"כ כו זה משה האיש וגו' והשטן התגבר בכל כוחו להראות להם אותות ומופתים כדי לפתותם לע\"ז וכמו שפי' הגר\"א בפ' ראה מופת הוא לשון פתוי. שהמופת מפתה לב האדם כי שינוי הטבע מפתה לב האדם להאמין בדבר המפליא לעשות.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 271,
      "char_length": 953,
      "timestamp": "2025-02-06T19:35:10.614437"
    },
    {
      "id": "ki sisa_p272",
      "text": "והנה הכח הזה ניתן להם מהשי\"ת דאין עוד מלבדו וכמ\"ש רז\"ל (סנהדרין ס\"ז ע\"ב) א\"ר יוחנן למה נקרא שמן כשפים שמכחישין פמליא של מעלה, אין עוד מלבדו א\"ר חנינא אפי' לדבר כשפים, פירש\"י אין בהן כח לפני גזירתו שאין כח מלבדו, נמצא שבאותו מעשה העגל שהי' מופת מהשטן ניתן לו הכח מהשי\"ת כדי לנסות את ישראל כי אין עוד מלבדו כתיב, ואולי זהו כוונת אומרם ז\"ל לא היו ישראל ראויין לאותו מעשה, דזה העונש לנסותם הוא רק אם קדם להם איזה חטא בענין האמונה ח\"ו כמ\"ש הראב\"ע זלה\"ה בשביל שהניחו הנביא שקר לא המיתוהו וישראל באותה שעה לא היו ראויין לאותו מעשה, אלא למה הגיע להם כך. בשביל להורות תשובה לרבים, שאם יארע להם כך בדורות אחרים ויבואו לידי נסיון ויכשלו ח\"ו, יהיו יודעין שמועיל תשובה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 272,
      "char_length": 656,
      "timestamp": "2025-02-06T19:35:11.104361"
    },
    {
      "id": "ki sisa_p273",
      "text": "ומיושב בזה לשון רש\"י ז\"ל שכתב שגזירת מלך היתה לשלוט בם כדי ליתן פ\"פ לבעלי תשובה, הכוונה דמה שנעשה מופת גדול כזה וניתן כח גדול להשטן גזירת מלך הי' דלולא זאת לא הי' להם כח כזה דאין עוד מלבדו כתיב, ואין הכוונה שנלקח מהם הבחירה, כי אז לא היו ראויין לעונש כי אנוסים הם, אך גזירת מלך הי' ליתן להם כח עצום כזה כדו לנסותם ועי\"ז באו לידי טעות, וכל זה הי' כדי ליתן פ\"פ לבעלי תשובה, שאם יאמר החוטא לא אשוב שלא יקבלנו אומרים לו צא ולמד ממעשה העגל שכפרו ונתקבלו בתשובה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 273,
      "char_length": 456,
      "timestamp": "2025-02-06T19:35:11.445506"
    },
    {
      "id": "ki sisa_p274",
      "text": "ואפשר לומר עוד רמז במ\"ש להורות תשובה לרבים, כי רואין בעוה\"ר איך שרוב הדור נכשלין בדעות נפסדות, ובפרט בענין הגאולה שלקחו ממשלה לעצמם ורבים חללים הפילה ונפלו ברשתם ברשת המינות ר\"ל, ובדבר שרבים נכשלים נעשה החטא קל בעיניהם, בחשבם מאחר שרבים הם העומדים לצדם אין החטא גדול כ\"כ, ולכן להוציא מלבם של אלו אמרו חכז\"ל שכן הי' במעשה העגל שהיו רבים הנכשלום בה ואעפי\"כ היו מוכרחים לעשות תשובה ואין זה אמתלא לומר מאחר שרבים הם און החטא גדול אלא גם רבים צריכים לעשות תשובה, וזה שרמזו לנו חכז\"ל שישראל באותו הזמן לא היו ראויין לאותו מעשה אלא להורות תשובה לרבים שאף רבים צריכים לעשות תשובה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 274,
      "char_length": 572,
      "timestamp": "2025-02-06T19:35:11.705420"
    },
    {
      "id": "ki sisa_p275",
      "text": "והנה אמרז\"ל במד\"ר (בראשית פכ\"א סי' ו') ועתה פן ישלח ידו אר\"א ב\"כ מלמד שפתח לו הקב\"ה פתח של תשובה, ועתה אין ועתה אלא תשובה שנאמר ועתה ישראל מה ה\"א וכו' עכ\"ד המדרש, ועיי\"ש ביפ\"ת ונזה\"ק איך שנרמז במלת ועתה תשובה עיי\"ש, ובזה יתבאר טענת המלצת מרע\"ה לפני השי\"ת אנא חטא העם הזה חטאה גדולה, פי' שנסיון כזה לא הי' ראוי להם לפי מדריגתם ומדוע בא זאת להם ועל כרחך כדי להורות תשובה וז\"ש ועתה אין ועתה אלא תשובה שסיבת החטא הוא כדי להורות תשובה והוא רק אם תשא חטאתם, אז יתקיים הכוונה להורות תשובה לרבים, ואם אין שלא תמחול להם, א\"כ אין כאן להורות תשובה, ומדוע באו לחטא גדול כזה, ומשה רבינו לגודל ענותנותו תלה הדבר בעצמו שהוא הגורם ח\"ו לחטא הדור, שכן דרך הצדיקים שתולין הקלקלה בעצמם וז\"ש ואם אין שאם לא תסלח להם, א\"כ אין כאן להורות תשובה ומסתמא אני הגורם לזה, ולכך מחני נא מספרך אשר כתבת, ולפי\"ז אין הכרח לומר שהמקרא קצר גם אינו מיותר, שגם אופן ההן מבואר טעמו בכתוב שהוא להמליץ על ישראל שיקבל הקב\"ה תשובתם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 275,
      "char_length": 889,
      "timestamp": "2025-02-06T19:35:11.977538"
    },
    {
      "id": "ki sisa_p276",
      "text": "במסיבה להחזקת התאחדות הרבנים ויאמר ה' אל משה פסל לך שני לוחות אבנים וגו', בגמ' (נדרים ל\"ח ע\"א) א\"ר חמא בר' חנינא לא העשיר משה אלא מפסולתן של לוחות שנאמר פסל לך שני לוחות אבנים כראשונים, פסולתן שלך יהא וכו', א\"ר יוחנן אין הקב\"ה משרה שכינתו אלא על גבור ועשיר וחכם ועניו וכולן ממשה וכו', עשיר פסל לך פסולתן שלך יהא עכ\"ד הגמ', ובמד\"ר פרשה זו (מ\"ו סי' ב') פסל לך הפסולת שלך. משם העשיר משה. אמר הקב\"ה דין הוא שיטול אותן פסולת משה, למה אלא ישראל שלא נתעסקו במצות נתתי להן כל טוב ארץ מצרים שנאמר וה' נתן את חן העם והעשירו, ומשה שעסק בעצמותיו של יוסף יהא עני, אתן לו הפסולת שיעשיר עכ\"ד המדרש, וראוי להבין מדוע נתעכב שכרו מקריעת ים סוף עד אחר שעשו ישראל העגל ונשתברו הלוחות. ועד אותה שעה עני הי' כמבואר במדרש ובגמ' ולא העשיר משה אלא מפסולתן של לוחות), וממנ\"פ אם מגיע לו בשכרו על שעסק בעצמותיו של יוסף מ\"ט לא ניתן לו מיד בקרי\"ס.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 276,
      "char_length": 817,
      "timestamp": "2025-02-06T19:35:12.407399"
    },
    {
      "id": "ki sisa_p277",
      "text": "ב) גם צ\"ב דבגמ' למדו ממשה רבינו דאין הקב\"ה משרה שכינתו אלא על עשיר, ואדרבה משם ראי' להיפך. שהרי כבר השרה הקב\"ה שכינתו ית' על משרע\"ה בנתינת לוחות הראשונות וקודם לה, ועדיין ענו הי' באותה שעה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 277,
      "char_length": 189,
      "timestamp": "2025-02-06T19:35:12.824520"
    },
    {
      "id": "ki sisa_p278",
      "text": "ג) גם צ\"ב הלשון הפסולת שלך, דאמרז\"ל (הובא ברש\"י עה\"ת) הראהו הקב\"ה מחצב סנפירינון בתוך אהלו, ואמר לו הפסולת יהא שלך, ומשם נתעשר משה הרבה, ולא יצדק שם פסולת על דבר יקר וחשוב כזה שממנו נתעשר הרבה. וביותר לא יתכן לכנות פסולת על דבר שנברא בדרך נס וממנו נחצבו הלוחות והול\"ל השירים שלך יהא.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 278,
      "char_length": 283,
      "timestamp": "2025-02-06T19:35:12.953443"
    },
    {
      "id": "ki sisa_p279",
      "text": "ולבאר הענין נקדים בביאור הכתובים (בפרשת יתרו) ואתה תחזה מכל העם אנשי חיל יראי אלקים אנשי אמת שונא בצע, פירש\"י ז\"ל אנשי חיל עשירים שאין צריכין להחניף ולהכיר פנים, ראוי להבין דאם יושלמו כל התנאים יראי אלקים אנשי אמת שונאי בצע, מה צורך עוד לתנאי עשירות ובלא\"ה מי שיש בו כל המעלות הנ\"ל, ראוי שימנע מלהחניף ולהכיר פנים, גם מה צורך לתנאי הזה שיבחור עשירים דייקא והלא בני ישראל במדבר כולם עשירים היו, כאמרז\"ל (בכורות דף ה' ע\"ב) אין לך כל אחד ואחד מישראל שלא היו לו צ' חמורים וכו' טעונים מכספם וזהבם של מצרים, ורק משרע\"ה לבדו שעסק בעצמות יוסף ולא לקח מהביזה הי' עני עד שנתעשר מפסולתן של לוחות, אבל כל ישראל כולן עסקו בביזה כמבואר בדרז\"ל וכולם עשירים היו. ואפשר דבחעא העגל הרבה מהם נתרוקנו ויצאו נקיים מנכסיהם, שכ\"כ היתה תקיפא יצרא דע\"ז עד שפרקו כל זהבם לעגל ונעשו עניים, וכמו שרואין בימינו דהנותן לצדקה ולדבר טוב נותן במדה, וגמירי דצדקה לא מעני והשי\"ת מחזיר לו בכפליים, אבל הנותן להשלים עצת היצה\"ר, מטעהו ליתן אף יותר מיכולתו ולפעמים אף נעשה עני עי\"ז, ואפשר דלזה הי' צורך התנאי במינוי הדיינים שיהיו אנשי חיל עשירים, דזהו סימן שלא נשתתפו בעגל כלל, כי אלמלי היו נותנין לעגל היו מתרוששיםל והנותן לדבר שבקדושה גמירי דלא מיעני (כמבואר ביו\"ד ריש הלכות צדקה).",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 279,
      "char_length": 1144,
      "timestamp": "2025-02-06T19:35:13.136994"
    },
    {
      "id": "ki sisa_p280",
      "text": "אמנם אף בלא\"ה הי' הכרח לתנאי העשירות, שלא יהיו צריכין להחניף ולהכיר פנים, כי אם יהי' מצבו דחוק, יוכל להיות שע\"י שישתוקק להשיג דברים הנצרכים אליו, יהי' משוחד אל הרצון ההוא, כי אין לך משוחד יותר ממי שמשוחד אל רצונותיו ואף שלא נחשדו יראי אלקים ואנשי אמת להחניף ולהכיר פנים ברצון לבם, אבל השוחד יעוור עיני חכמים, ומעלים ומכסה אור האמת, ויוכל להלכד בעצת היצר להחניף ולהכיר פנים אף בלא דעת, וע\"כ לא סגי בלא\"ה והי' להכרח לתנאי עשירות נוסף על הדרגות יראי אלקים ואנשי אמת וכו', וככה אנו רואין בדורינו שבעוה\"ר רבים מבנ\"י נתקלקלו והושחתו ביסודות האמונה, ונתפסו למינות וכפירה ר\"ל, ושורש הדבר שיצרא דמינות נתגברה מאוד בימינו, וכמו שהי' יצרא דע\"ז בימי חכמי הש\"ס, ועוד סיבה כי רובם נעשו משוחדים אלי' בשביל קריבות הנאת ממון או מפחד זרם העולם, ובפרט מנהיגי העם החפצים בקרבת העם ובטובת הנאתם, לצורך עצמם או לפעמים בשביל הרבצת התורה וחיזוק היהדות, ועי\"ז נעשו משוחדים אל הרצון ההוא, ונמשכים אחריהם מבלי דעת, כי השוחד מעוור ומעלים אור האמת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 280,
      "char_length": 919,
      "timestamp": "2025-02-06T19:35:13.686169"
    },
    {
      "id": "ki sisa_p281",
      "text": "עוד י\"ל טעם שהי' צורך במינוי הדיינים לתנאי העשירות, כו על ידי זה יהיו דבריהם נשמעים לבריות יותר, ובגמ' (חולין דף קל\"ד ע\"ב) והכהן הגדול מאחיו שיהא גדול מאחיו בנוי בחכמה ובעושר, אחרים אומרים מנין שאם אין לו שאחיו הכהנים מגדלין אותו. ת\"ל והכהן הגדול מאחיו גדלהו משל אחיו, עיין רש\"י שם דכמו\"כ ממונה וראש הישיבה החיוב לגדלו ולהעשירו אף משלו, וכן מבואר בגמ' שם שהביאו דרשא זו על עובדא דר' אמי עיי\"ש, ואפשר הטעם דעי\"ז דבריהם נשמעים ומתקבלים על לב הבריות יותר. אמנם כ\"ז לאחר חטא העגל שנתלכלכו בחטא ונתגשמו קצת, מאז התחילה העשירות להיות נחשב למעלה ויתרון בעיני הבריות וע\"כ הוכרח למנהיג בישראל להיות לו מעלת העשירות לטעמים הנ\"ל, אבל בלוחות הראשונות שהיו ישראל כמלאכי השרת כאמרז\"ל בפרדר\"א לא הי' העשירות מעלה כלל ולא הוצרכו אלי', וא\"ש שלא נתעשר משרע\"ה אלא מפסולתן של לוחות שאז הי' צורך אליו בשביל הנהגת הדור, וע\"כ א\"ל השי\"ת כו לא יתכן שישאר עני, אתן לו הפסולת שיעשיר, אבל קודם לכן לא הי' רצונו בכך ולא הוצרך אליו, ויובן מ\"ש בגמ' נדרים הנ\"ל וכולן ממשה, דמשם ראי' מדלא נתעשר קודם לכן, וע\"כ שלאחר חטא העגל יש הכרח לתנאי העשירות והבן.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 281,
      "char_length": 1019,
      "timestamp": "2025-02-06T19:35:14.156317"
    },
    {
      "id": "ki sisa_p282",
      "text": "ונבא לענינינו הנה ביארנו עד כמה נחוצה ומוכרחת הוא מעלת העשירות למען קיום והחזקת דבר טוב מכל הלין טעמי דאמרן ועל כן עלינו מועלת החובה לתמוך ולהחזיק את התאחדות הרבנים, ואין צורך להסביר גודל התועלת בקיום התאחדות הרבנים, כי גלוי וידוע לכל כי זולת התאחדות הרבנים אין שום חבורה מאוחדת של רבנים שתצא בגלוי ללחום נגד ההירוס הגדול ביותר בעולם, ואין כוונתי בזה על אותם שהם הולכים וד ביד עם המהרסים, אלא אפילו אותם שאינם עמהם כאחד מ\"מ נשטפים עם הזרם ומסכימים להם, ועאכ\"ו שיראים לגלות דעתם בפומבי כנגדם. ולזאת הכרח הוא שתהיה חבורת רבנים מאוחדת היטב כדי שיהי' בידנו כח לפעול לחזוק התורה והיהדות וללחום נגד המסיתים והמדיחים, וח\"ו אם לא יעלה בידינו להיות מאוחדים היטב, אזי כבודה מושפל ביותר, כאמרם ז\"ל בעוקבתא דמשיחא יראי חטא ימאסו וסר מרע משתולל על הבריות, וכדי להבטיח קיום להתאחדות זו עלינו לעשות לה יסוד ובסיס חזק ולתת לכסף מוצא, כי בלא ממון אין אפשרות לפעול כלום, כאשר נתבאר כי מאז חטא העגל מעלת העשירות היא הכרחית לצורך הנהגת הדור, ומה\"ט אמר הקב\"ה למשה הפסולת שלך תהא, ואין אנו מבקשים עשירות אלא שלא יהיה ח\"ו ההיפך הוא דחקות ועניות.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 282,
      "char_length": 1022,
      "timestamp": "2025-02-06T19:35:14.678488"
    },
    {
      "id": "ki sisa_p283",
      "text": "ובעוה\"ר אנו נתונים היום במלחמה כבדה עם מהרסו הדת, והמלחמה נטושה פנים ואחור, ואנחנו מועטים מזעיר נגדם, אמנם זאת נחמתי בעניי, כי עדיין נמצאים עכ\"פ כמה אלפים מבני ישראל שידם ולבם לאל אמונה, ולא כרעו לבעל, וכבר היתה כזאת בישראל בימי גדעון שנותרו רק שלש מאות איש שלא כרעו לבעל. אך עלינו לחזק את עצמנו כדי שנוכל להחזיק מעמד נגדם, כי אנחנו המעט נגד כל הארגאניוזאצועס, וביותר התגברה בעולם הכת הציונית, ועוד בתחלת התיסדותה בדור הקודם התיצבו בחצופות נוראה על ה' ועל משיחו, וכבר נבאו לנו חז\"ל בסוף מסכת סועה גודל שפלות התורה בדור עיקבתא דמשיחא, וביותר מבואר בזוהר חדש שהעוסק בתורה יהי' נבזה וחדל אישים, ולכן עלינו להתחזק ביחד שאל\"כ יתכן שנוותר יחידים ממש, וכל זמן שאנחנו מתאחדים ומתחזקים יחד הרי זה כח נגדם, ואף אם חלושים אנחנו: מ\"מ יהי' לתועלת גדול שעדיין מאוחדים יחד יהודים המקבלים על עצמם עול מלכות שמים באמת ואין פונים אחרי עגל הזהב. וכתב החת\"ס ז\"ל בספרו תורת משה עה\"פ ויאמר אל משה קול מלחמה במחנה, דגם יהושע הבין שהוא קול ענות, רק שהסברא נותנת שא\"א שישתקו הצדיקים למעשה הזה, ויש מלחמה במחנה, כו הצדיקים מוחים כנגדם, וגם משה חשב כן מתחלה ומה\"ט הביא את הלוחות ולא שברם למעלה או הניחם למעלה,. אכן כאשר בא הרגיש שאין כאן מלחמה רק קול ענות ולפיכך הוצרך לשבור את הלוחות, כי ראה שפסו אמונים ואין גם לוחמים נגדה, עכת\"ד ז\"ל. ומשום כך חובה הוא לנו להתחזק וחד למען יוודע בעולם כולו שעדיין קיימת התאחדות רבנים אשר רק התורה נר לרגלה, ובדעת המינים והאפיקורסים לא יתחשבו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 283,
      "char_length": 1350,
      "timestamp": "2025-02-06T19:35:15.155243"
    },
    {
      "id": "ki sisa_p284",
      "text": "ויש לרמוז במ\"ש ז\"ל שא\"ל הקב\"ה למשה הפסולת תהא שלך (עיין קושיא ג) כי הנה איש ירא ה' אשר חננו ה' בעושר ובנכסים, יודע ומבין כי כל העושר אשר נתן לו אלקים עליו להשתמש בו למען הרבות כבוד שמים ולחזק היהדות, שהרי כל מה שהשי\"ת חונן בו את האדם, הן חכמה הן גבורה הן בריאות וכח והן ממון, תכליתם היא לפעול בהם למען כבוד שמו יתברך, ולחזק כל הענינים הרבים והנכבדים בתורה וביהדות הצריכים סיוע ותמיכה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 284,
      "char_length": 384,
      "timestamp": "2025-02-06T19:35:15.824882"
    },
    {
      "id": "ki sisa_p285",
      "text": "ומה מאד דואב הלב למראה אגרות הבאים בכל יום מהתם להכא, מעדי ראיה אשר עיניהם ראו ולא זר בשבר בת עמי, שנמצאים בא\"י יהודים שדרו שנים רבות תחת שלטון הקומוניסטען. ודורי דורות התנהגו בדרך התורה, וגם את בניהם אחריהם חנכו ברוח התורה, ועדיין היה צלם אלקים על פניהם ולמדו בת\"ת, ומיד שהובילו אותם למדינתם הקרוי' מדינת ישראל גזלו את הבנים מחיק אבותם והוליכו אותם למקומות הגרועים ביותר, אשר יהודים רבים לאין שיעור וערך נתהפכו שם לכופרים גמורים והאבות בוכים ומבכום את ימיהם, כי לא עלתה כזאת על דעתם, ובעל כרחם נעשתה התועבה הזאת, ובפרק זמן קצר נתהפכו הבנים לכופרים גמורים ושוב אינם חפצים לדעת דבר מאבותיהם, ונקל הדבר ביד המסיתים והמדיחים לבצע זממם, כי אם לוקחים את התינוק ומחנכים אותו בחינוך של כפירה ומפטמים אותו בנבלות וטרפות מה יעשה הבן שלא יחטא. ומה מאוד גדול הניאוץ נגד ה' ותורתו הקדושה, כו נמצאים כאלו הדוגלים בשם התורה, והמה רואים כל זאת במו עיניהם, ועם כל זאת המה מחרישים וסובלים כל זאת, ואינם פוצים פה כנגדם. הן זאת מלפנים בישראל אם נלקח לשמד תינוק יהודי אחד, ותהום כל העיר, ואילו המה מביטים על כל התועבות בסבלנות ושותקים, ורק דבר אחד בעולם יש אשר אין ביכולתם לסבול, והוא בעת אשר ישמעו אומרים דבר רע נגד הרשעים המעבורים על דת, לא יוכלו להתאפק ובשצף קצף מוחים כנגדם.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 285,
      "char_length": 1158,
      "timestamp": "2025-02-06T19:35:16.041609"
    },
    {
      "id": "ki sisa_p286",
      "text": "יהיה איך שיהי' כדי להחזיק יסודות היהדות צריכים לממון רב וכמו שרואים בעליל שגם אלו שבאמת רוצים להציל נפשות ישראל מכפירה אין בידם להציל מחמת חסרון ממון, ואילו היה ברשותם ממון די הצורך היה ניתן להציל הרבה מאד, ואין לשער כמה נפשות היה יכולת להציל לולא חוסר הממון.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 286,
      "char_length": 259,
      "timestamp": "2025-02-06T19:35:16.624686"
    },
    {
      "id": "ki sisa_p287",
      "text": "ובבחינה זו יתפרש מאמרז\"ל שהפסולת תהא שלך, כו האדם חייב לדעת שעיקר ממונו הוא מה שהוא מפזר לצדקה, ולהעמיד מבצרי התורה, ולהציל נפשות ישראל משמד וכפירה רח\"ל, ולכל עניני היהדות הצריכים חיזוק, כי זה חלקו מכל עמלו וצדקתו עומדת לעד. משא\"כ הממון שהוא משתמש בו לצורך עצמו הנו רק טפל ופסולת אל הממון החשוב והיקר ההוא שפזר ונתן לצדקה, וזאת רמז לו השי\"ת למשה באמרו פסל לך ודרשו ז\"ל הפסולת תהא שלך, דכיון שמן הנותר מן המחצב של סנפירינון נתעשר משה, הראהו השי\"ת לדעת כי מה שיקח לצורך עצמו מן הממון ההוא זה הוא רק פסולת וטפלה, וז\"ש הפסולת תהא שלך כלומר מה שתהא שלך שתקחנו לצורך עצמך יהא פסולת הממון, ועיקר חשיבות הוא באותו הממון שתהא מפרישו לצרכי שמים, כי ע\"ו שתתן אותו לחזוק התורה והיהדות הרי הוא ממון יקר וחשוב מאד וקדושה יש בו. ומסיים בגמרא ומשם נתעשר משה, כלומר שמדברים הללו שרמז לו הקב\"ה נעשה עשיר, כי בכל ממונו ועשרו פעל ועשה להרבות כבוד שמים, ולא עשה ממנו צרכי עצמו: וזהו העשירות של משה שנשאר כל ממונו שלם, ע\"ו שעשה ממנו צרכי שמים ולא נעשה ממנו כל פסולת.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 287,
      "char_length": 944,
      "timestamp": "2025-02-06T19:35:16.778071"
    },
    {
      "id": "ki sisa_p288",
      "text": "והשי\"ת יעזור שתהי' לנו התחזקות למען נוכל לפעול בעד כבוד השי\"ת ותורתו הקדושה, ונוכל להתחזק בדרכנו נגד רשעי הדור ולעשות רצון השי\"ת, והמחזיקים יתברכו בכל מיני ברכות וישועות שיזכו ליתן בהרחבה, ונזכה במהרה לקבל פני משיח צדקנו בשמחה ובנחת ולתקן את אשר פגמנו, יראו עינינו וישמח לבנו, בהתגלות כבוד שמים עלינו בב\"א.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 288,
      "char_length": 306,
      "timestamp": "2025-02-06T19:35:17.251511"
    },
    {
      "id": "ki sisa_p289",
      "text": "וימהר משה ויקוד ארצה וישתחו, ובגמ' סנהדרין (קי\"א ע\"א) מה ראה משה (פרש\"י מה ראה על איזה מידה של י\"ג מדות ראה והשתחוה) ר' חנינא בן גמליאל אמר ארך אפים ראה ורבנן אמרי אמת ראה, תניא כמ\"ד ארך אפים ראה, דתניא כשעלה משה למרום מצאו להקב\"ה שיושב וכותב ארך אפים, אמר לפניו רבש\"ע ארך אפים לצדיקים, אמר לו אף לרשעים א\"ל רשעים יאבדו, א\"ל השתא חזית מאי דמבעי' לך, כשחטאו ישראל בעגל אמר לו לא כך אמרת ארך אפים לצדיקים, אמר לפניו רבש\"ע ולא כך אמרת לי אף לרשעים, והיינו דכתיב ועתה יגדל נא כח ד' כאשר דברת לאמר עכ\"ד הגמ', הנה מאמר זה קשה להולמו, דהרי משרע\"ה המליץ טוב על בנ\"י בינו לבין קונו תמיד, ואיך כאן ביקש ואמר רשעים יאבדו, ומדוע אח\"כ חזר בו ואמר אף לרשעים ומעיקרא מאי סבור.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 289,
      "char_length": 661,
      "timestamp": "2025-02-06T19:35:17.421658"
    },
    {
      "id": "ki sisa_p290",
      "text": "ונל\"פ עפי\"ד הגמ' וב\"ק נ' ע\"א) מאי דכתיב ארך אפים ולא כתיב ארך אף, ארך אפים לצדיקים ולרשעים, פרש\"י לצדיקים מלשלם שכר עוב לאלתר, ולרשעים מלהפרע מהן לאלתר, ובתוס' שם כתבו, בפ' עושין פסין (ערובין כ\"ב ע\"א) משמע לרשעים להאבודם מן העוה\"ב, ובחלק (סנהדרין קי\"א ע\"א) משמע לטובה וי\"ל כשאין סופו לעשות תשובה הוא לרעה, אבל בסופו לעשות תשובה הוא לטובה עכ\"ד התוס', ובזה יבואר דהנה אמרז\"ל (ע\"ז ד' ע\"ב) לא היו ישראל ראויין לאותו מעשה אלא להורות תשובה לרבים, נמצא דקודם חטא העגל לא הי' ברור לחוטאים דמהני תשובה, וכשאין סופו לעשות תשובה הוי מדת ארך אפים לרעה לרשעים להאבידם מעוה\"ב כדברי התוס', וע\"כ ביקש משרע\"ה רשעים יאבדו, שלא ישתמש הקב\"ה במדת ארך אפים לגביהם, שרעה הוא לעומתם להאבידם מעוה\"ב, ויותר טוב שיאבדו מן העוה\"ז ולא יאריך להם הקב\"ה אף, בכדי שיזכו לעוה\"ב, אמנם כשחטאו ישראל בעגל, אז נתגלה כח התשובה לרבים, ואז הוי מדת ארך אפים לטובה אף לרשעים, ע\"כ חזר משרע\"ה מדבריו והתפלל על מדת ארך אפים אף לרשעים, אלא שהבוי\"ת אמר למשה לא כך אמרת ארך אפים לצדיקים, כדי שיחזור משה מדבריו הקודמים ויתפלל אף על הרשעים כשישובו.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 290,
      "char_length": 997,
      "timestamp": "2025-02-06T19:35:17.758690"
    },
    {
      "id": "ki sisa_p291",
      "text": "ואפשר שמה\"ט מדה זו של ארך אפים גדולה מאוד, מפני שהיא פעמים לטובה ופעמים לרעה, ותליא באם סופו לעשות תשובה או לאו, ע\"כ נמנעים המקטרגים מלקטרג, כי אינם יודעים עתידות אם סופו לעשות תשובה ורק הבוי\"ת יודע, ע\"כ חדל המסטין מלקטרג כי אולי הוא לרעתו ח\"ו כשאין סופו לעשות תשובה, וע\"כ כשראה משרע\"ה מדת ארך אפים וימהר משה ויקוד ארצה וישתחו, ובמדה זו חיים וקיימים והבוי\"ת יודע ועד שסוף סוף יעשו ישראל תשובה, ומדת ארך אפים להם לטובה.",
      "source_file": "Ki Sisa.txt",
      "chumash": "שמות",
      "parsha": "ki sisa",
      "paragraph_index": 291,
      "char_length": 418,
      "timestamp": "2025-02-06T19:35:18.251392"
    }
  ],
  "shape": [
    292,
    768
  ],
  "created_at": "2025-02-06T19:35:18.475864"
}