{
  "paragraphs": [
    {
      "id": "beshalach1_p0",
      "text": "ויהי בשלח פרעה את העם ולא נחם אלקים דרך ארץ פלשתים כי קרוב הוא כי אמר אלקים פן ינחם העם וגו' ושבו מצרימה, במד\"ר (פ' כ' סימן ט') ויהי בשלח פרעה מי צווח ווי פרעה, משל לאחד שמצא צרור של מרגליות ולא הי' יודע מה בידו וכו', כשנודע לו שווי' קרע את בגדיו, אמר כל העושר הזה בידי הי' וחנם הוצאתי מידי, אוי לו לאותו האיש שכך הוציא מידו, כך הי' פרעה, הצרור של מרגליות אלו ישראל וכו' כשראה פרעה כל האוכלסין התחיל צווח ווי עכ\"ד המדרש, ולכאורה הול\"ל דרשא זו לעיל בפ' בא עה\"פ קומי צאו מתוך עמי וגו' או אצל ויהי בעצם היום הזה יצאו כל צבאות ד' מאמ\"צ, דשם עיקר סיפור היציאה, וכאן לא נכתב אלא אגב גררא להורות דרך נסיעתם במדבר.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 0,
      "char_length": 606,
      "timestamp": "2025-02-06T19:21:20.831542"
    },
    {
      "id": "beshalach1_p1",
      "text": "ב) גם ראוי להבין דהרי בשעת יציאתם שמחו המצרים., כמשה\"כ שמח מצרים בצאתם כי נפל פחדם עליהם, ומדוע נתהפכה שמחתם לתוגה ואיך אזדה הפחד מנהו לגמרי.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 1,
      "char_length": 141,
      "timestamp": "2025-02-06T19:21:21.157655"
    },
    {
      "id": "beshalach1_p2",
      "text": "ג) עוד איתא במדרש (פרשה כ' סימן ח') ויהי בשלח פרעה מי אמר ווי, משה אמר ווי וכו', אמר משה צועק אני שנתיגעתי להוציא את ישראל ממצרים ואיני נכנס עמהם לארץ ע\"כ, וצ\"ב דהול\"ל דרשא זו לעיל בפ' בא עה\"פ יצאו כל צבאות ד' מאמ\"צ כי שם הוא עיקר סיפור היציאה, ולפי שראה שמוציאם ואין סופו להכניסם ע\"כ צווח ווי, אבל אין לו קישור למה ששלח פרעה את העם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 2,
      "char_length": 333,
      "timestamp": "2025-02-06T19:21:21.279182"
    },
    {
      "id": "beshalach1_p3",
      "text": "ד) וע\"ק ממ\"ש להלן בפ' שירה תביאמו ותטעמו בהר נחלתך פרש\"י נתנבא משה שלא יכנס לארץ, לכך לא נאמר תביאנו ולא כלל את עצמו עמהן, והקשו המפרשים הא עדיין לא נגזרה הגזירה כמ\"ש רש\"י (בפ' בהעלותך) עה\"פ נוסעים אנחנו אל המקום וגו', ששיתף עצמו עמהם מפני שעדיין לא נגזרה הגזירה עליו וכסבור הי' שנכנס, ומצינו שהתפלל אח\"כ לבטל הגזירה, והי' סבור עדיין שיכנס, ואיך אפשר שהתנבא כאן שלא יכנס לארץ, ותירץ הרא\"ם ז\"ל שזה שאמר תביאמו הי' בבחי' ניבא ולא ידע מה ניבא, שבאמת לא הי' עדיין הגזירה, או אפשר שהי' סבור שלא יכניסם כמו מנהיג, אבל יכנס גם הוא עמהם כשאר העם עיי\"ש, וכמו\"כ יקשה גם כאן על מה שדרשו ז\"ל דמשה צווח ווי שלא יכנס עמהם לארץ, הרי עדיין לא נגזרה הגזירה, ומדוע לא הקשו המפרשים כמו\"כ הכא וצ\"ב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 3,
      "char_length": 678,
      "timestamp": "2025-02-06T19:21:21.481202"
    },
    {
      "id": "beshalach1_p4",
      "text": "ה) גם קשה למה צריך הכתוב לחזור ולכפול ויהי בשלח פרעה את העם הרי כבר אמור לעיל (בפ' בא) שאמר פרעה קומו צאו מתוך עמי וגו' ותחזק מצרים על העם למהר לשלחם מן הארץ וגו', ואם בשביל להודיע שלא נחם אלקים דרך ארץ פלשתים אלא דרך המדבר, הול\"ל הודעה זו בלבד ולא לחזור על הראשונות, כי אין לה קישור מוחלט עם שליחות פרעה, כי הטעם שנתן הכתוב פן ינחם העם וגו' שייך אף אם הי' היציאה באופן אחר שלא בשליחות פרעה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 4,
      "char_length": 391,
      "timestamp": "2025-02-06T19:21:21.827329"
    },
    {
      "id": "beshalach1_p5",
      "text": "ו) גם צ\"ב אריכות הלשון כי קרוב הוא כי אמר אלקים פן ינחם העם. וממנ\"פ אם חדא טעמא הוא. דלפי שקרוב הדרך ונוח לשוב ע\"כ אמר אלקים פן ינחם העם וגו', א\"כ תרי זמני כי למה, הול\"ל כי קרוב הוא ואמר אלקים פן ינחם העם וגו' ואם תרי טעמי נינהו א\"כ אינו מובן הטעם כי קרוב הוא, אדרבה קירוב הדרך בכל מקום היא סיבה ללכת בה, ולא סיבת המניעה מלילך בה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 5,
      "char_length": 330,
      "timestamp": "2025-02-06T19:21:22.039545"
    },
    {
      "id": "beshalach1_p6",
      "text": "ז) ומדברי רש\"י ז\"ל נראה דחד טעמא הוא, דפי' כי קרוב הוא ונוח לשוב באותו דרך למצרים, כי אמר אלקים פן ינחם העם וגו', אם הלכו דרך ישר היו חוזרים, ומה אם כשהקיפם דרך מעוקם אמרו ניתנה ראש ונשובה מצרימה, אם הולכים בפשוטה עאכו\"כ עכ\"ל, ויש להבין דהרי גם כשהקיפם דרך מעוקם רצו לחזור ולשוב, אבל מן השמים עיכבו בידם, ולא ניתן להם הרשות והיכולת לחזור ולשוב, גם בני לוי רדפו אחריהם והחזירום כדברי רז\"ל, ואצלו ית' אין נפקמ\"נ בין דרך קרוב לרחוק, וגם בדרך קרוב לא הי' היכולת בידם לשוב נגד רצונו ית' וכמ\"ש הרא\"ם ז\"ל דאין ללמוד מהק\"ו, אלא שאם הוליכן בפשוטה עאכו\"כ שהיו אומרים ניתנה ראש, אבל חזרה לא שמענו מהק\"ו, דלא באו לכלל חזרה מעולם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 6,
      "char_length": 617,
      "timestamp": "2025-02-06T19:21:22.237620"
    },
    {
      "id": "beshalach1_p7",
      "text": "ח) עו\"ק מ\"ש הכתוב הטעם כי קרוב הוא, פן ינחם העם וגו' ושבו מצרימה, והרי עוד בעמדם על ים סוף התחרטו על שיצאו, והתרעמו על משה מה זאת עשית לנו להוציאנו ממצרים, והיו קרובים אז עדיין למצרים, וא\"כ אף שהלכו דרך המדבר עדיין החששא במקומה עומדת פן ינחם העם ושבו מצרימה, ועוד דארץ ישראל קרובה מאוד למצרים, ועיקר מלחמת ל\"א מלכים היתה בא\"י, וא\"כ כמו\"כ הי' אפשר לחשוש, שבבואם לא\"י ויראו מלחמת ל\"א מלכים, פן ינחם העם ושבו מצרימה, ומה יועיל הליכתם דרך המדבר ודרך מעוקם, אם אחר שיצאו מן המדבר ויתקרבו לארץ ישראל שהוא קרובה למצרים חזרה החששא למקומה פן ינחם העם וגו' ושבו מצרימה, ורש\"י פי' בראותם מלחמה כגון מלחמת וירד העמלקי והכנעני וגו', והרי מורא זה הי\"ל גם בכניסה לארץ שנאמר עמלק יושב בארץ הנגב: ומה הועיל הליכתם דרך המדבר.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 7,
      "char_length": 707,
      "timestamp": "2025-02-06T19:21:22.559175"
    },
    {
      "id": "beshalach1_p8",
      "text": "ט) בראותם מלחמה פי' רש\"י בשם המכילתא זו מלחמת וירד העמלקי והכנעני האמור במעשה מרגלים והקשו המפרשים מדוע לא נקט ויבא עמלק שהי' מיד סמוך ליציאתם, ותירץ המהרש\"ל משום דבאותה מלחמה נצחו ישראל את עמלק, ולא הי' לחוש כ\"כ שיתנו לב לשוב, אבל גבי וירד העמלקי כתיב ויכום ויכתום, יש מקום לחוש יותר שיתנו לב לשוב, אמנם קשה דאדרבה מזו דויבא עמלק הי\"ל לירא יותר, דשם בא עמלק מארצו ונלחם בהם לשנאתו אותם, ולא הי' מקום להיות נשמר ממנו, אלא שניצולו בדרך נס, אבל שם הי' מקום להיות ניצל ממנו, שהזהירם הקב\"ה לא תעלו ולא תלחמו ולא תנגפו לפני אויביכם, וא\"כ אין מקום לחשוש כ\"כ פן ישובו מיראתו למצרים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 8,
      "char_length": 575,
      "timestamp": "2025-02-06T19:21:22.927635"
    },
    {
      "id": "beshalach1_p9",
      "text": "י) איתא במכילתא לא הביאן הקב\"ה דרך פשוטה לארץ ישראל אלא דרך המדבר, אמר הקב\"ה אם אני מביא עכשיו ישראל לארץ מיד מחזיקים אדם בשדהו ואדם בכרמו והן בטלים מן התורה, אלא אקיפם במדבר מ' שנה, שיהיו אוכלין מן ושותין מי הבאר והתורה נבללת בגופן, מכאן הי' ר' שמעון אומר לא ניתנה תורה לדרוש אלא לאוכלי המן, ושניים להם אוכלי תרומה ע\"כ, וצ\"ב דאין זה הטעם המבואר בכתוב, דהתוה\"ק נתנה טעם פן ינחם העם בראותם מלחמה וגו', ולמה נטו חז\"ל בדרשתם ליתן טעם חדש שונה מהמפורש בפסוק, ופרשתי כבר דטעם המכילתא נכלל בטעם המבואר בפסוק, דאמרו חז\"ל (ברכות דף ל\"ה ע\"ב) בזמן שישראל עושין רצונו של מקום מלאכתן נעשית ע\"י אחרים, וא\"כ אילו היו ישראל עושין רצונו של מקום לא הי' צורך להקיפם במדבר, דבלא\"ה לא יצטרכו להיות בטלים מדברי תורה ע\"י עבודת שדה וכרם, דהי' נתקיים בהם הבטחת הכתוב ועמדו זרים ורעו צאנכם וגו'. אלא מפני כי אמר אלקים פן ינחם העם וגו', ופן לא יהיו עושין רצונו של מקום, ע\"כ לא הכניסם מיד כדי שלא יהיו בעלים מדברי תורה ונמצא דהא בהא תליא, אולם אעפ\"כ עיקר חסר מן הספר, ולא נרמז בכתוב טעם המכילתא כלל ומאין למדו חז\"ל לומר כן.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 9,
      "char_length": 996,
      "timestamp": "2025-02-06T19:21:23.258124"
    },
    {
      "id": "beshalach1_p10",
      "text": "יא) ועוד קשה לפי טעם המכילתא הנ\"ל דהי' הכרח שיתעכבו ישראל ארבעים שנה במדבר, כדי שיהי' התורה נבללת בגופן, דלא ניתנה תורה אלא לאוכלי המן ושני' להם אוכלי תרומה. דא\"כ איפוא יהי' תקנתן של דורות הבאים שלא יהיו אוכלי המן, ואוכלי תרומה מועטין הם, ואיך יכנס התורה בגופן, ואכתי איכא חששא זו אצלן דזה פונה לכרמו וכו' ותורה מה תהא עלי'. ואף בדור המדבר ודור באי הארץ עצמן, אותן שנולדו לסוף הארבעים ונכנסו לארץ ישראל כשהיו קטנים ולא הגיעו לכלל דעת, ולא נשלמה קנין התורה בגופן בעודן במדבר, דאין אדם עומד על דעת רבו עד ארבעין שנין, וכיון דלא ניתנה תורה אלא לאוכלי המן. איך יהי' התורה נבללת בגופן, והדרא החששא לדוכתי' דזה פונה לכרמו וכו' ותורה מה תהא עלי' ונמצא שלא היה תקנה זו אלא לזקנים שבדור, והיתכן אחרי שהוא חששא קרובה, למה לא חש הקב\"ה לעשות תקנה לכל ישראל וגם לדורות הבאים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 10,
      "char_length": 762,
      "timestamp": "2025-02-06T19:21:23.746065"
    },
    {
      "id": "beshalach1_p11",
      "text": "יב) פן ינחם העם בראותם מלחמה ושבו מצרימה, יל\"ד דהול\"ל לשוב מצרימה, דכונת הכתוב שיתנו לב לשוב. ובאמרו ושבו משמע שישובו בפועל, וזה א\"א דכיון שאין רצון הבוי\"ת שישובו: אין מציאות בעולם שישובו, ובאמת לא שבו אלא רצו לשוב שאמרו נתנה ראש ונשובה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 11,
      "char_length": 237,
      "timestamp": "2025-02-06T19:21:24.110711"
    },
    {
      "id": "beshalach1_p12",
      "text": "יג) בילקוט (רמז רכ\"ו) ולא נחם אלקים דרך ארץ פלשתים כי קרוב הוא שנא' (תהלים קמ\"ח) לבני ישראל עם קרובו, והובא בבעלי התוס' וז\"ל, כלומר העם קרוב של הקב\"ה וכו' ולכך לא הנהיגם כמנהגו של עולם, וצ\"ב נתינת טעם זו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 12,
      "char_length": 204,
      "timestamp": "2025-02-06T19:21:24.257128"
    },
    {
      "id": "beshalach1_p13",
      "text": "יד) ויהפך לבב פרעה ועבדיו ויאמרו מה זאת עשינו כי שלחנו את ישראל מעבדינו וגו' הקשה האוהחה\"ק דמשמע שנתחרטו על הדבר אשר עשוהו, והדברים תמוהים וכי לרצונם עשו, והלא הוכו מכות גדולות עד אשר כמעט ספו תמו ובעכ\"ח שלחום, ואיך נהפך לבם בדבר שלא הי' רצונם בו מתחלה, ורצונם עתה כרצונם מאז, ולא הי' כאן שינוי והתהפכות ברצון לבם כלל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 13,
      "char_length": 318,
      "timestamp": "2025-02-06T19:21:24.396875"
    },
    {
      "id": "beshalach1_p14",
      "text": "טו) גם יל\"ד מ\"ש מה זאת עשינו כי שלחנו את ישראל מעבדינו, משמע שהם ב' דברים העשי' לבד והשליחות לבד, ובאמת לא הי' כאן עשי' אחרת אלא ששלחו את ישראל, והול\"ל מה זאת שלחנו את ישראל וגו'. וגם מ\"ש כי שלחנו וגו' משמע שזה טעם ופירוש על תמיהתם באמירת מה זאת עשינו, ובאמת היינו הך ואינו אלא חדא ולמ\"ל להזכירו בב' לשונות עשי' ושליחות ויספיק באחד מהם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 14,
      "char_length": 336,
      "timestamp": "2025-02-06T19:21:24.584499"
    },
    {
      "id": "beshalach1_p15",
      "text": "טז) כי כאשר ראיתם את מצרים היום לא תספו לראותם עוד עד עולם, ופליגי בזה מוני המצות אם פסוק זה מצות לא תעשה לדורות או הבטחה בלבד, ועוד נבאר בזה להלן, אבל בכל אופן קשה מ\"ש כי כאשר ראיתם את מצרים היום, ובתרגום ארי כמא די חזיתון ית מצראי יומא דין לא תוספון למחזיהן וכו', מדוע תלה הכתוב מאמר לא תוסיפו במה שראו המצרים היום, ומאי נפק\"מ אם כמא דחזיתון או באופן אחר, והול\"ל לא תוסיפו לראותם וגו' ודי בזה ומאמר כאשר ראיתם מיותר.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 15,
      "char_length": 418,
      "timestamp": "2025-02-06T19:21:24.777258"
    },
    {
      "id": "beshalach1_p16",
      "text": "יז) בזוה\"ק הקשה ר' ייסא שאיל ואמר כתיב וירא ישראל את מצרים מת וגו' וכתיב לא תוסיפו לראותם עוד עד עולם א\"ר יוסי מתין חמו להו: כלומר דמה דכתיב לא תוסיפו לראותם היינו בחייהון, וק\"ז היש\"מ זלל\"ה מביא קושיא בשם תשו' בית יעקב (סימן ו') מהא דאיתא בכתובות (פ\"ג ע\"א) ר\"י אמר לעולם הוא אוכל פרי פירות וכו' עד שיכתוב לה דין ודברים אין לי בנכסיך ובפרותיהן וכו' עד עולם, וכתבו התוס' שם דעד עולם פירושו שלא יאכל בין בחיי' ובין במותה, א\"כ ה\"נ כיון דכתיב כאן לא תוסיפו לראותם עוד עד עולם משמעו בין בחייהון ובין במיתתם א\"כ הדרא קושית הזוה\"ק לדוכתי', על מה דכתיב וירא ישראל את מצרים מת על שפת הים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 16,
      "char_length": 578,
      "timestamp": "2025-02-06T19:21:25.008133"
    },
    {
      "id": "beshalach1_p17",
      "text": "יח) אז ישיר משה ובנ\"י את השירה הזאת לד' ויאמרו לאמר וגו' פרש\"י אז כשראה הנס עלה בלבו שישיר שירה ע\"כ, והוכרח לומר כן דקשיא לי' דאז לשון עבר הוא וישיר משמע לעתיד והול\"ל אז שר, ע\"כ פירש דישיר קאי על המחשבה, והרמב\"ן ז\"ל הקשה עליו עיי\"ש, והגו\"א הקשה ג\"כ על פרש\"י דלמה לי' למימר שעלה בלבו שישיר הרי מבואר בכתוב ששר שנא' ויאמרו לאמר, ובודאי שעלה בלבו קודם, ולמ\"ל להאריך ולכתוב תרווייהו שעלה בלבו וגם שר. וחז\"ל דרשו (במס' סנהדרין צ\"א) ר' מאיר אומר מנין לתחיית המתים מן התורה שנא' אז ישיר משה, שר לא נאמר אלא ישיר, אולם לפי פשוטו שפרש\"י ז\"ל קשה כנ\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 17,
      "char_length": 541,
      "timestamp": "2025-02-06T19:21:25.313311"
    },
    {
      "id": "beshalach1_p18",
      "text": "יט) כל המחלה אשר שמתי במצרים לא אשים עליך כי אני ד' רופאך, וקשה דאם לא ישים רפואה למה, וכן הקשה ר' יצחק במכילתא אם אין בהם מחלה מפני מה הם צריכים רפואה. ופרש\"י לתרץ זה דהכוונה לא אשים ואם אשים ה\"ה כלא הושמה, כי אני ד' רופאך והם דברי ר' יהושע במכילתא, אולם קשה ע\"ז דהרי לא כתיב אם אשים, ומשמעות הכתוב מורה דלא אשים כלל, וא\"כ רפואה למה, ע\"כ פרש\"י עוד דלפי פשוטו של מקרא, כי אני ד' רופאך מלמדך תורה ומצות למען תנצל מחולאים, כרופא הזה המזהיר לאדם שלא יאכל דברים המזיקים ומביאים אותו לידי חולי, אולם גם לפירוש זה קשה, כי אחרי שהתוה\"ק מלמדו שלא יבוא לידי חולי, א\"כ לא יצטרך לרפואה, ולמה כתיב כי אני ד' רופאך.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 18,
      "char_length": 602,
      "timestamp": "2025-02-06T19:21:25.645342"
    },
    {
      "id": "beshalach1_p19",
      "text": "כ) להלן בסוף הפרשה ויבא עמלק וילחם בישראל וגו' הקשה הגו\"א דהול\"ל ויצא עמלק כדכתיב ויצא סיחון, ויצא אדום ובכל מלחמה דרך הכתוב לומר כך, ולמה כתיב כאן ויבא. ובמכילתא דרשו ר' אליעזר אומר ויבא עמלק שבא בגלוי פנים, לפי שכל הביאות שבא לא בא אלא במטמוניות וכו', אבל ביאה זו לא בא אלא בגלוי פנים, לכך נאמר ויבא עמלק שבא בגלוי פנים ר' נתן אומר לא בא אלא מהררי שעיר, ד' מאות פרסה פסע עמלק ובא ונלחם עם ישראל. וראוי להבין מה הי' תכלית ביאתו במטמוניות, והאיך נלחם בסתר, גם לא מצינו בשום מקום שבא עמלק להלחם עם ישראל במטמוניות וצ\"ב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 19,
      "char_length": 518,
      "timestamp": "2025-02-06T19:21:25.973406"
    },
    {
      "id": "beshalach1_p20",
      "text": "ולבאר הענין נקדים מה דאיתא בגמ' סנהדרין (דף ק\"י ע\"ב) ת\"ר דור המדבר אין להם חלק לעוה\"ב, שנא' במדבר הזה יתמו ושם ימותו, יתמו בעוה\"ז ושם ימותו לעוה\"ב, ואומר אשר נשבעתי באפי אם יבואון אל מנוחתי (דרשוהו על מנוחת עוה\"ב עי' במהרש\"א) דברי ר\"ע ר' אליעזר אומר באים הם לעוה\"ב שנא' אספו לי חסידי כורתי בריתי עלי זבח, אמר רבב\"ח א\"ר יוחנן שבקיה ר\"ע לחסידותיה שנאמר (ירמי' ב') הלוך וקראת באזני ירושלים לאמר זכרתי לך חסד נעוריך וגו' לכתך אחרי במדבר בארץ לא זרועה, ומה אחרים באים בזכותם הם עצמן לא כ\"ש. וכתב העיון יעקב דר\"ע לא יקשה עליו מהאי קרא דזכרתי לך חסד נעוריך, דסבירא לי' דהאי קרא מיירי באותן שהיו פחותין מבן כ' ויתרים על בן ס' שלא היו בכלל גזירת המרגלים כדאיתא בב\"ב עיי\"ש.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 20,
      "char_length": 663,
      "timestamp": "2025-02-06T19:21:26.238520"
    },
    {
      "id": "beshalach1_p21",
      "text": "ולכאורה אינו מתיישב בתירוצו של העיון יעקב, ועדיין יקשה לר\"ע מק\"ו הנ\"ל, עפי\"מ דאיתא במכילתא (פ' בא) וגם צדה לא עשו להם, להודיע שבחן של ישראל שלא אמרו למשה האיך נצא למדבר ואין לנו צדה לדרך, אלא האמינו והלכו אחר משה, ועליהם מפורש בקבלה הלוך וקראת באזני ירושלים לאמר זכרתי לך חסד נעוריך וגו' לכתך אחרי במדבר בארץ לא זרועה, מה שכר נטלו על כך קדש ישראל לד' ראשית תבואתו כל אכליו יאשמו רעה תבוא אליהם נאם ד', וכן איתא במכילתא פ' בשלח ובתנחומא פ' בא, מבואר דזכות דור המדבר והאמונה שהאמינו בו ית', והלכו אחרי דיבורו ביד משה למדבר לא זרועה, הקב\"ה זוכר לנו זכות הזה עד סוף כל הדורות, ונקראו ישראל קודש בשכר זה, וכל אכליו יאשמו כמאה\"כ, וא\"כ אכתי יקשה לר\"ע דזכות אמונה זו הי' לכל דור המדבר, ואף לאלו שהיו בכלל הגזרה, ולומר שאבדו זכות האמונה ע\"י העון של מרגלים, בודאי לא ניחא למרייהו לומר עלייהו הכי, והרי כללא הוא דאין עבירה מכבה מצו', וא\"א לומר על דור קדוש כזה שאבדו זכותם לגמרי, וא\"כ כח הק\"ו חזקה הוא, דאם כל הדורות יהנו בזכותן, דור המדבר עצמן לא כ\"ש שיזכו לעוה\"ב, וצ\"ב דברי ר\"ע במ\"ש דור המדבר אין להם חלק לעוה\"ב",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 21,
      "char_length": 1001,
      "timestamp": "2025-02-06T19:21:26.570158"
    },
    {
      "id": "beshalach1_p22",
      "text": "ובאמת קשה להבין דברי ר\"ע בלא\"ה, אף לולי פירכת ר' יוחנן מכח הק\"ו, ממ\"ד בזוה\"ק פ' שלח (דף קס\"ג) זכאה דרא דא (דור המדבר) מכל דרין דעלמא: נפקי ממתיבתא דמשה ופרחי לגבי מתיבתא דרקיעא, ואותן שהיו ראוים פרחו לגבי מתיבתא עלאה, על ההוא דרא כתיב אשרי העם שככה לו אשרי העם שד' אלקיו. ואיתא במכילתא הנ\"ל דע\"י שאכלו מן ושתו מי באר נבללת התורה בגופן, ושמעו הדברות מפי הגבורה והיו מקור התורה לכל דורות ישראל, ובפרדר\"א (פרק מ') כל אותו דור ששמעו קולו של הקב\"ה בהר סיני זכו להיות כמלאכי השרת, לא ראו טיפת קרי מימיהם וכו' ובמותם לא שלטה בהם רמה ותולעה ע\"כ, (ובדפוסים שלנו נשמט המאמר לא ראו קרי מימיהם, אבל ברוב ספרים שהעתיקו דברי הפרדר\"א הנ\"ל הביאו בגרסתם מאמר זה, וכן בילקוט המכירי (תהלים קמ\"ד) והחיד\"א ז\"ל הביא גירסא זו ועוד בכ\"מ) נראה שזו גירסא האמיתית, עכ\"פ הי' להם מדריגות קדושות יותר מכל הדורות, ולא הי' כמותם ולא יהי' דור כזה עד ביאת המשיח, ומאמר זה דלא שלטה בהם רמה ותולעה נמצא בכל הספרים כן, ולמדריגה זו לא זכו כ\"א יחידי סגולה כמ\"ש במס' ב\"ב (דף י\"ז ע\"א) שבעה לא שלט בהם רמה ותולעה ואלו הן אברהם יצחק ויעקב משה ואהרן ומרים ובנימין בן יעקב, וי\"א אף דוד דכתיב אף בשרי ישכון לבטח, ואידך ההוא רחמי הוא דקא בעי.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 22,
      "char_length": 1095,
      "timestamp": "2025-02-06T19:21:27.065345"
    },
    {
      "id": "beshalach1_p23",
      "text": "ולפי\"ז הי' מדרגתם קרובה למדריגת האבות הק' ומשה ואהרן, וגודל מדריגתם אין לשער, ובפרט לגרסת הספרים שלא ראו קרי מימיהם, לא הי' מעולם דור כזה שיוכלו להתפאר במידה זאת, שכללות הדור לא ראו קרי מימיהם, ואיך יעלה על הדעת שלא יהי' להם חלק לעוה\"ב, ואיך אמר ר\"ע כן, והוא דבר מבהיל הרעיון דאם יהי' המציאות כן א\"כ לא שבקת חי לכל ברי' ונמצא נעילת דלת בפני השבין, דהנה ישראל עשו תשובה על חטא המרגלים שנא' וישכמו בבקר וכו' לאמר הננו ועלינו אל המקום אשר אמר ד' כי חטאנו ויתאבלו העם מאוד. ואיתא בתנדב\"א באותה שעה א\"ל הקב\"ה למשה, משה בוא ורצה אותם העניים שכבר יצא לבם מעליהם וכו', הרי ששבו בכל לבם, הגם שהי' פגם חטאם גדול מאוד בערך גודל מדריגת קדושתן ע\"ד וסביביו נשערה מאוד והיתה הגזירה מוחלטת שלא יכנסו כל אותו הדור לא\"י, כמ\"ש אשר נשבעתי באפי אם יבואון אל מנוחתי, ולא הועיל תשובתם להתיר להם כניסת הארץ, ובאמת הי' ההכרח כן שלא יכנסו לארץ ונתלה בהם העלילה בבחי' נורא עלילה על בנ\"א, כמו חטא אדה\"ר וחטא מכירת יוסף וכדאיתא בתנחומא פ' וישב. אבל טעם זה מספיק לענין שלא נתקבלה תשובתן להתיר להם כניסת הארץ אבל שלא יהא להם חלק לעוה\"ב, איך יעלה על הדעת לומר כן.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 23,
      "char_length": 1031,
      "timestamp": "2025-02-06T19:21:27.631529"
    },
    {
      "id": "beshalach1_p24",
      "text": "גם ראוי להבין דברי ר' יוחנן במ\"ש שבקי' ר\"ע לחסידותי', הרי טען והשיב על דברי ר\"ע לחלוק עליו מהוכחת הכתוב הלוך וקראת וגו' ומכח הק\"ו ור\"ע הביא ראי' לסברתו מקרא, ואין דבר זה תלוי בחסידות, אלא פלוגתתם תליא בדרשת הכתובים, ומדוע טען על ר\"ע דשבקי' לחסידותי' וצ\"ב הכוונה בזה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 24,
      "char_length": 266,
      "timestamp": "2025-02-06T19:21:28.116136"
    },
    {
      "id": "beshalach1_p25",
      "text": "עוד ראוי לדקדק בפסוק הנ\"ל זכרתי לך חסד נעוריך וגו' לכתך אחרי במדבר בארץ לא זרועה, שלכאורה הול\"ל במדבר לא זרועה. וכבר הזכיר מדבר ואין צורך במילת בארץ. ועוד דכל המאמר בארץ לא זרועה מיותר הוא, דכבר אמר הכתוב לכתך אחרי במדבר וידוע דמדבר לא זרועה הוא, והרד\"ק ז\"ל דקדק עוד במ\"ש חסד נעוריך, ומדוע כינה הכתוב לדור המדבר נעוריך, ופי' שימים הקדמונים נקראים ימי הנעורים בדרך שאלה ומשל, כמו שימי הנעורים קודמים לימי הזקנה עיי\"ש, ולכאורה עדיין צ\"ב הכוונה דהרי מפורש דמיירי בדור המדבר ובימים הקדמונים כמ\"ש לכתך אחרי במדבר ולמה יתאר אותם עוד בשם חסד נעוריך, ולמאי נפק\"מ אם הוא חסד נעוריך או לא",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 25,
      "char_length": 578,
      "timestamp": "2025-02-06T19:21:28.301503"
    },
    {
      "id": "beshalach1_p26",
      "text": "ואפ\"ל עוד כוונה בזה מלבד פשטות המשמעות, דלכאורה אין כ\"כ רבותא וחידוש על דור המדבר מה שהאמינו בד' ובמשה עבדו, והלכו במצותו בארץ לא זרועה, דאחרי שראו כל אותן הנסים והנפלאות שעשה ד' עמהם בהוציאם ממצרים, ונתאמת אצלם נבואת משרע\"ה בירור גמור ע\"י האותות, וע\"י הסימן של פקידה כפולה, (כמ\"ש בחידושינו פ' שמות) וראו שנתקיים כל הבטחתו שאמר להם בשליחות השי\"ת, ובפרט לפי ערך מדריגת הדור ההוא, אין חידוש כ\"כ שבטחו והאמינו בו ית' שגם לחם יוכל תת ויכין שאר לעמו, ויצאו עפ\"י ציוויו למדבר, ועוד דאלולי החטא היו נכנסין לא\"י מיד, ולא היו מתעכבים במדבר כ\"א זמן קצר, ועל דעת כן שיכנסו לא\"י מיד יצאו ממצרים בידים ריקנות, דעוגות שהוציאו ממצרים הי' מספיק להם על ל\"א יום כדאיתא במכילתא, ועוד דהרי הי' עמהם רכוש רב וכסף וזהב הרבה מרכוש מצרים, ותגרי האומות היו מביאים להם כל צרכיהם, אלא שהי' רצון השי\"ת שיתפרנסו מן המן לחם אבירים וישתו מי באר, ולפי\"ז לכאורה לא הי' הנסיון גדול כ\"כ, ואפשר שגם אנשים שאינם בערך מדריגתם היו עומדים בנסיון זה, וא\"כ צ\"ב להבין ענין הנסיון שהפליג הכתוב כ\"כ בשבחו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 26,
      "char_length": 960,
      "timestamp": "2025-02-06T19:21:28.597429"
    },
    {
      "id": "beshalach1_p27",
      "text": "אמנם נבאר להלן בע\"ה דאדרבה לצד גודל מדריגתן, והתיקון הגדול שנעשה על ידיהם, ע\"כ היתה הסתת היצר והתגברות כוחות החיצונים חזקה עליהם מאוד, והיתה נסיון גדול אצליהם לעמוד באמונתם ולהתגבר על כוחות היצר, וע\"כ זוכר הקב\"ה לדורות עולם החסד שעשו, כמ\"ש הכתוב זכרתי לך חסד נעוריך וגו' לכתך אחרי במדבר, ואחרים עומדים בזכותם כמ\"ש בגמ' הנ\"ל, דזכותם גדול מאוד, לפי שעמדו בנסיון נגד ההתגברות הנורא, ויבואר להלן באריכות אי\"ה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 27,
      "char_length": 405,
      "timestamp": "2025-02-06T19:21:29.045766"
    },
    {
      "id": "beshalach1_p28",
      "text": "אולם עוד דברים בגו, ואפשר שנרמז בכוונת הכתוב לבאר לנו גודל מדריגתן של דור המדבר בעבודת השי\"ת, עפ\"י מ\"ש בפרדר\"א הנ\"ל דכל אותו הדור ששמעו קולו של הקב\"ה וכו' זכו להיות כמלאכי השרת ולא ראו טיפת קרי מימיהם, והנה מצינו בדור המבול שאמרו רז\"ל שהי' חטאם בהשחתת זרע ר\"ל, כמ\"ש ברותחין קלקלו, וכן בער ואונן שחטאו בעון זה ר\"ל, הכתוב אומר ושחת \"ארצה\", ובדור המבול כתיב כי השחית כל בשר את דרכו על \"הארץ\", והטעם שייחס הכתוב השחתה זו אל הארץ, בעבור שהזרע הקודש הולך לאיבוד לאשפתות למקום יניקת החיצונים ר\"ל, ואפשר שירמוז כאן הכתוב לספר בשבח דור המדבר, שכל הדור ניצולו מן העון הנורא הזה, ולא נכשלו בה כל ימיהם. ואף שהי' התגברות הסתת היצר גדולה מאוד אצליהם לפי גודל מדריגתם כמו שיבואר להלן. וכמ\"ש ז\"ל (סוכה דף נ\"ב ע\"א) כל הגדול מחבירו יצרו גדול הימנו, אעפ\"כ ניצולו כולם מחטא זה, וז\"ש לכתך אחרי במדבר, שהלכו אחרי מצותיו ית' בארץ לא זרועה, ר\"ל שכל הדור הקדוש ניצולו מחטא הנורא ההוא כדברי הפרדר\"א הנ\"ל והעיד הכתוב ע\"ז שהיתה הארץ לא זרועה, ולא יצא הזרע למקום יניקת החיצונים ר\"ל כ\"א אל מקום הקדושה ואפשר שע\"כ קראם הכתוב חסד נעוריך, שהקב\"ה זוכר להם החסד והזכות הגדול של ימי נעוריהם, שהיו נקיים בלי שום פגם ועון, והי' כלו חסד וזכות, ויבואר עוד להלן.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 28,
      "char_length": 1122,
      "timestamp": "2025-02-06T19:21:29.255658"
    },
    {
      "id": "beshalach1_p29",
      "text": "ונקדים מ\"ש דוד המע\"ה נעים זמירות ישראל והכין ברוח קדשו תפלה זו לכל ישראל, (תהלים כ\"ה) חטאות נעורי ופשעי אל תזכור כחסדך זכר לי אתה למען טובך ה', ולכאורה צ\"ב הקישור ולמה תלה זכורת החסד, באי זכירת חטא ופשע, גם הול\"ל חסדך זכר לי, ולמה אמר כחסדך, משמע דקאי אדלעיל מני', וצ\"ב הכוונה בזה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 29,
      "char_length": 281,
      "timestamp": "2025-02-06T19:21:29.791495"
    },
    {
      "id": "beshalach1_p30",
      "text": "ואפ\"ל עפ\"י מ\"ש ז\"ל במס' חגיגה (י\"ב ע\"א) אמר ר\"ל כל העוסק תורה בלילה, הקב\"ה מושך עליו חוט של חסד ביום, שנא' יומם יצוה ד' חסדו, ומה טעם משום דבלילה שירה עמי עכ\"ד הגמרא, והנה כמו\"כ חלילה להפך. אם נכשל ח\"ו האדם במקרה לילה ר\"ל, נבראים מזה מזיקין וקליפות שמקטרגים וממשיכין עליו את הדין ח\"ו, אבל יש עצה ע\"ז להשקיט מעליו שליטת הדין, דע\"י לימוד תורה בלילה הקב\"ה מושך עליו חוט של חסד, וממילא נמתקים הדינים מעליו, הגם שכתב הרמב\"ם ז\"ל, וכעין זה איתא בזוה\"ק וכ\"כ כל חכמי האמת, דהמצות שעושין בעודו מלוכלך בעונות טורפין אותו בפניו, ומוסיפין עוד כח בהטומאה ח\"ו. (עיין בספר ויואל משה מאמר ב' סעיף מ\"ז שהארכתי בזה). אמנם הבאתי שם מספה\"ק דרך פקודיך ואגרא דכלה, שע\"י תשובה וביטול בלב דרכו הרעה וקבלה על להבא, יקובל לרצון לפני השי\"ת תורתו ותפלתו ויוסיף קדושה ע\"י עסק התורה, ויאיר ד' עיניו וילמדהו דעת לתקן מידותיו ולשוב תשובה הגונה עיי\"ש, ואפשר שזה תפלתינו ובקשתינו חטאות נעורי ופשעי אל תזכור, וכדי להשקיט מעלינו קטרוג הדין, ע\"כ אנו מבקשים כחסדך זכר לי אתה למען טובך ד', שתמשוך עלינו חוט של חסד ע\"י עסק התורה בלילה כמה שהבטחתני, ועי\"ז יומתקו שליטת הדינים וממילא לא יזכרו ולא יפקדו חטאות נעורים: וא\"ש הקישור דזכירת החסד הוא תיקון ועצה להעלמת הרושם והקטרוג של חטאות נעורים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 30,
      "char_length": 1150,
      "timestamp": "2025-02-06T19:21:29.959245"
    },
    {
      "id": "beshalach1_p31",
      "text": "ואפ\"ל עוד עפימ\"ש בספה\"ק ארץ החיים (תהלים כ\"ה) וז\"ל יש במדרש שלע\"ל יבא הקב\"ה ליתן שכר ועונש, ויקטרגו המקטריגים על ישראל ויסדרו עונותיהם, ויאמר הקב\"ה כי קטן יעקב ודל, וכל מה שהקטן עושה לא נחשב לו כי קטן הוא, ואח\"כ כשיבא הקב\"ה ליתן שכר לישראל, יאמר השטן ומה שכר תתן לישראל שהם קטנים בלתי שכל, ויאמר הקב\"ה בני בכורי ישראל עכ\"ד המדרש, ופי' בזה בספר הנ\"ל מאמה\"כ חטאות נעורי ופשעי אל תזכור, כי יש לימוד זכות עליהם לפניו ית' שמעשה נערות הם, וכל מה שהקטן עושה לא נחשב לו, אבל כחסדך זכר לי והטוב שעשיתי זכר לי, דלענין קיבול שכר לא תחשבינו לקטן ובבחינת נער, למען טובך ד' כי זו מידת טובך להתנהג עם ישראל לפנים משורת הדין עכת\"ד ז\"ל. ולכאורה ראוי להבין דברי המדרש הנ\"ל, דהו' תרתי מילי דסתרי אהדדי וכמזכה שטרי לבי תרי, דממנ\"פ אם הקב\"ה מחשיב ישראל בבחי' נער וקטן. אין להם גם שכר בעבודתם, ואם לאו מגיע להם ח\"ו גם עונש, ואיך יסתום בזה פי המקטרג, ואם אין הקב\"ה שומע לטענותיו לא הו\"ל להשיב כלל על דבריו. ואחרי שהשיב הקב\"ה על טענותיו, א\"כ צריך להשיב לו טענה הנשמעת ותשובה ניצחת, ואין בטענה זו לכאורה כדי לסתור את דבריו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 31,
      "char_length": 998,
      "timestamp": "2025-02-06T19:21:30.505589"
    },
    {
      "id": "beshalach1_p32",
      "text": "ואפשר להסביר טענה זו דתשובה ניצחת השיב הקב\"ה לשטן ושורת הדין כן הוא, ויובן עפי\"מ שפירשתי (בדברנו פ' שמות) דברי המדרש אבכיר הובא בילקוט פ' בשלח (רמז רל\"ד), שקטרג הס\"מ על ישראל בים סוף. שעבדו ע\"ז במצרים ואינם ראוים שיעשה הקב\"ה להם נס. והשיב לו הקב\"ה שוטה שבעולם וכי לדעתם עבדוה, והלא לא עבדו אלא מתוך טירוף הדעת, ואתה דן אונס כרצון וכו' ופרשתי עפימ\"ש חז\"ל אין אדם חוטא אלא א\"כ נכנס בו רוח שטות, והיצה\"ר מכניס בו רוח שטות המשטהו, ונאבד ממנו בחי' הדעת עד שאין בו כח ודעת לעמוד נגד יצרו ולהתגבר עליו ועי\"ז מתפתה בעצת יצרו, ונמצא דבשעת החטא כמעט אנוס הוא ואין לחייבו, דה\"ה כתינוק שאין בו דעת, ועיקר הפגם הוא מה שלא נשמר תחילה להתרחק מעצת היצה\"ר, וצריך שמירה יתירה והרחקה לזה, אבל בשעת החטא אין לחייבו עוד, דאז הוא בבחי' שוטה ונער (עיין בדברינו באריכות תקחנו משם) וא\"ש דברי המדרש הנ\"ל דהקב\"ה ילמד זכות על ישראל לע\"ל, דאין לחייבם על עונותיהם. שבשעת החטא הוא בבחי' נער וקטן, דע\"י גודל הסתת היצר המשטהו נאבדה ממנו בחינת הדעת. אולם אעפי\"כ מגיע להם שכר טוב על מעשה המצות מדינא, ולא נחשבו לקטן בלי דעת לענין זה, דבעשות מעשה המצו' מקבל ע\"י הארת המצוה השפעת דעת דקדושה, וכח המצו' מגין עליו ומביאו לכלל דעת, ואין שם כח היצר המשטהו, ונמצא ששורת הדין כן הוא ואין כאן תרתי דסתרי, וטענה זו צודקת, ותשובה ניצחת הוא לסתום פי המקטריגים וא\"ש.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 32,
      "char_length": 1218,
      "timestamp": "2025-02-06T19:21:31.115724"
    },
    {
      "id": "beshalach1_p33",
      "text": "ואפ\"ל עוד בכוונת הכתוב הנ\"ל, עפ\"י מ\"ש בספרים הקדושים וכן כתב הנועם אלימלך זלל\"ה בהנהגות האדם אשר איזן ותיקן, דחטאת נעורים של אדם מסמין עיניו ר\"ל, ומחשיכים בחי' הדעת ומבלבלים מחשבותיו מלעבוד עבודת תמה וישרה עיי\"ש, והנלכד בחטאים אלו חס ושלום אף אם נשמר מהם אחר כך לעת זקנתו, מ\"מ עד שלא שב עליהם כראוי וכ\"ז שרושם החטא קיים הם מונעים אותו מעבודתו ית', ואפי' כשעושה מעשה המצו' ודבר טוב אין המצו' בשלימות ומעורב בו חלק הרע ח\"ו, וזה לימוד זכות על ישראל, דהקב\"ה במדת טובו ית' מקבל מעשה המצות מאתנו לרצון כאלו הי' פעולה שלימה, ובבחי' חשב לעשות מצוה ונאנס מעלה עליו הכתוב כאלו עשאה, דרצוננו לעשות רצונו ית' בשלימות, והמניעה היא מפאת היצר ומסיבת החטאים הקודמין המסמין עיניו של אדם, ע\"כ הקב\"ה מחשבו לאונס ומלמד זכות על ישראל ואפשר שזה כוונת הכתוב, שאנו מבקשין ומתפללין לפניו ית' חטאות נעורי ופשעי אל תזכור לרעה ולענין העונש ח\"ו, כי יש לימוד זכות עליהם כי מעשה נערות הם ובבלי דעת, וכמעשה הקטן דמיא כמ\"ש במדרש הנ\"ל, אבל כחסדך זכר לי אתה, שלענין החסד והזכות תזכור לי חטאות נעורי ופשעי, כי בסבתם הוא המניעה מלעשות עבודתו ית' בשלימות, וכאנוס יחשבו ומגיע להם שכרן משלם, למען טובך ד', כי זו מדת טובו ית' שמטה ומכריע כלפי החסד.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 33,
      "char_length": 1107,
      "timestamp": "2025-02-06T19:21:31.718644"
    },
    {
      "id": "beshalach1_p34",
      "text": "ואפשר לפרש בזה הכוונה מה שאנו מתפללין בקדושה דסידרא, יה\"ר שנשמור חקיך בעוה\"ז ונזכה ונחי' ונראה ונירש טובה וברכה לשני ימות המשיח ולחיי העוה\"ב, וראוי להבין מהו ונראה דאינו מבואר על מה קאי, אם קאי על הטובה והברכה שנזכה לראותה א\"כ הול\"ל קודם ונירש טובה וברכה ואח\"כ ונראה, דקודם שנירש אין בה כדי ראי'. אמנם יובן עפ\"י מ\"ש לעיל דהיצה\"ר וחטאים הקודמין מסמין עיניו של אדם ומחשיכים בחי' הדעת, וקשה לראות האמת ודרך ישכון אור, ולפעמים החשכות גדול כ\"כ עד שרואין ההיפך ח\"ו, ומדמין לאור שהוא חושך ולחשך קרא אור, כמ\"ש בספה\"ק נועם אלימלך הנ\"ל, וכמ\"ש ז\"ל (בב\"ר פר' נ\"ג סי' י\"ד) הכל בחזקת סומין עד שהקב\"ה מאיר את עיניהם, ע\"כ אנו מבקשים שנשמור חקיך בעוה\"ז ונראה וכו' שיהי' לנו כח ראיה האמיתית, ונדע מה הן הדברים המביאים לידי ירושת עוה\"ב וימות המשיח בידיעה ברורה ואמיתית ולא מוטעת ח\"ו. או אפ\"ל עפ\"י מ\"ש בירושלמי (דערלה פ\"א ה\"ג) דאכיל דלאו דלי' בהית הסתכל בי', ע\"כ אנו מתפללין שנהיו ראוים אל הטובה והברכה בזכותינו ומשורת הדין, ונזכה לראות הטובה והברכה, ולא נבוש ולא נכלם מלהסתכל בה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 34,
      "char_length": 960,
      "timestamp": "2025-02-06T19:21:32.252859"
    },
    {
      "id": "beshalach1_p35",
      "text": "ויתבאר עוד עפימ\"ש בספה\"ק עבודת ישראל (פ' בלק) וז\"ל עפ\"י הקדמת הגאון החסיד מו\"ה לוי יצחק זלל\"ה בעל קדושת לוי זי\"ע, שאמר בפי' הפסוק וביום פקדי ופקדתי עליהם חטאתם וגו' אשר עשו את העגל, וקשה הנה אבינו אב הרחמן הסולח ומוחל ומעביר אשמתינו בכל שנה ושנה, ס\"ד שיכתוב בתורתו דבר קשה כזה, שיזכור לעולם את חטא העגל אפי' אחר שעשו ישראל תשובה, וגם קשה ממאמר חז\"ל במס' ברכות דא\"ר אושעי' גם אלה תשכחנה זה מעשה העגל, ואנכי לא אשכחך זה מעשה סיני, וזה היפך פסוק הנ\"ל, אלא יש לומר בכוונת הענין, דהנה לפי ראות עינינו, אם אחד מגזע טובים וישרים הולך בדרך תמים ועובד את יוצרו, אין זה דבר נפלא, כי התורה מחזרת על אכסניא שלה, משא\"כ אם פוחת והולך במעשיו ממעשה אבותיו, מום בו ויתגנה בו יותר, ממה שיעשה זה הרע אדם אשר הוא בא ממשפחה בזוי' ושפלה, כי לו יאתה השפלות מעון אבותיו. ואם אדם בזוי משפחה כזה, יעשה הטוב בעיני ד' ואנשים, אז יתהלל יותר מבן משפחה הנכבדת, בעבור עזבו דרכי אבותיו ונטה אל הטוב. והנה ישראל קדושים הם, הגם שקבלו את התורה במעמד הר סיני ואמרו נעשה ונשמע, לא הי' הדבר נפלא ומהולל, כי קדושת אבותיהם אשר הורישו לבניהם אחריהם, הוא הנותנת שיהיו עובדי ד', אבל כיון שעשו את העגל אח\"כ והעיזו את פניהם נגד יוצרם, ניכר שהי' בם איזה שורש רע שלא ניתקן עדיין עד שעשו תשובה אח\"כ, אז גדלה ונפלאה בעיני ד' מעלתם בקבלתם את התורה, כיון שהם עם קשה עורף בטבע, ויכלו לעשות אחרי מ' יום הדבר הרע הזה, א\"כ נראה שלא עשו גם הטוב מושרש בטבע להם מקדושת אבותיהם, רק שהם בעצמם בגודל בחירתם בחרו בטוב, ואח\"כ נפלו ובחרו ברע ועשו תשובה והם קודש ישראל לד'. וזה פירוש דברי רז\"ל גם אלה תשכחנה זה מעשה העגל, שיהי' נשכח לגמרי כיון שעשו תשובה, אבל ואנכי לא אשכחך זה מעשה סיני כלומר בעת שאני זוכר מעשה סיני, אז אזכור ג\"כ בחטא העגל, בגודל קשיות ערפם אשר להם, כדי להגדיל זכותם במה שעשו מלפנים במעמד הר סיני וז\"פ וביום פקדי כשאזכור בם להטיב להם, ופקדתי את העגל את כח הרע אשר בקרבם, ואז יגדיל ויאדיר זכותם במה שהם נוטים מהרע הזה לנטות אל הטוב ולשמור מצותיו כל הימים עכלה\"ק. ובזה פי' משה\"כ חטאות נעורי ופשעי אל תזכור, ור\"ל שלא יזכרו ולא יפקדו ע\"צ העונש, אבל כחסדך זכר לי, שיזכרו ע\"צ החסד ולענין קיבול שכר, ויגדל המצו' ויגדל השכר, כי ע\"י החטא נתברר שיש לו נטי' לרע וכח המנגד, וע\"כ לפום צערא אגרא, וזה למען טובך ד' כי ממדת טובו ית', דאע\"פ שאין מזכיר החטא ע\"צ העונש מזכירו ע\"צ החסד.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 35,
      "char_length": 2119,
      "timestamp": "2025-02-06T19:21:32.721045"
    },
    {
      "id": "beshalach1_p36",
      "text": "ולפי\"ז אפ\"ל ביאור הכתוב שאמר הקב\"ה על דור המדבר זכרתי לך חסד נעוריך, דאותן שנתגדלו במדבר היו נקיים ימי נערותם בלי שום פגם, ועלה זכרונם לפניו ית' כלו חסד ורחמים וא\"צ להעלים ימי נעוריהם מלזכרם, אדרבה מגיע להם החסד מצד הדין, ואחרים עומדין בזכותם כמ\"ש ז\"ל דכח זכותם יעמוד גם לדורות הבאים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 36,
      "char_length": 284,
      "timestamp": "2025-02-06T19:21:33.866376"
    },
    {
      "id": "beshalach1_p37",
      "text": "ועכשיו נבאר דברי המכילתא הנ\"ל דאלמלי נכנסו ישראל לא\"י מיד, הי' כל אחד פונה לכרמו ולשדהו והיו בטלים מד\"ת, ותורה מה תהא עלי', וכו' ולכאורה מדוע חש הקב\"ה לעשות תקנה זו לאותו הדור בלבד, ואף אם כבר ניתקן אותו הדור, עדיין קשה תורה מה תהא עלי' בדורות הבאים כקושיתינו לעיל, אמנם יבואר עפימ\"ש ז\"ל כל מה שתלמיד ותיק עתיד לחדש ניתנה למשה מסיני, ומבואר בספה\"ק דיש ס' רבוא אותיות לתורה וס' רבוא שרשי נשמות ישראל, ולכל א' מנשמת ישראל יש לו אחיזה באות אחד מתורתינו הקדושה, וכל החידושים והרמזים וסודות שיש באות זה, ראוי שיבואו לידי התגלות על ידו. לפי ששייכים אל שורש נשמתו וא\"א שיתגלו אורות אלו ע\"י אחר. וכ\"כ בילקוט הראובני פ' ואתחנן בשם מגלה עמוקות (אופן קצ\"ח) דיש לכל א' מישראל אות א' בתורה, נמצא שכ\"א מנשמות ישראל היא בת זוגו לאות אחד שבתורה וכו' עיי\"ש. וכתב הרמב\"ם בהקדמתו לס' זרעים, דע כי כל מצו' שנתן הקב\"ה למשה רבינו ע\"ה גילה לו פירושה וענינה וכל הכולל בה, ואמרינן במס' ערובין (דף נ\"ד ע\"ב) כיצד סדר משנה משה למד מפי הגבורה, נכנס אהרן ושנה לו משה פירקו וכו', עד שכל ישראל שמעו מפי משה רבינו המצו' ופירושה, וחזר אהרן לפרש המצו' ההוא לישראל וכו' נסתלק אהרן וחוזרין אלעזר ואיתמר ללמד המצו' ההוא לכל העם וכו' נסתלקו בניו שנו להן זקנים פירקן, ואח\"כ היו כל העם הולכים ללמד איש לאחיו מה ששמעו מפי משה וכו' עד שידעו בגרסא המצו' ההוא ולמדו פירושי' כפי הנתונה מאת השי\"ת, והיו כותבים המצו' ולומדים על פה הקבלה עכת\"ד הרמב\"ם ז\"ל, וכ\"כ הרבינו יונה ז\"ל בפירושו על מס' אבות, משה קבל תורה מסיני ומסרה ליהושע בין תושב\"כ ובין תושבע\"פ שהתורה בפירושה ניתנה, וכל דרשות חז\"ל וכל דיני התורה שיש לנו בחלק תושבע\"פ, כולם הי' קבלת משה רבינו בהר סיני וכל מימרות ושמועות תנאים ואמוראים וחכמי הדורות, כולם הם בקבלה איש מפי איש חכם מפי חכם, עד משה מפי הגבורה, וכל א' קבל כפי שורש נשמתו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 37,
      "char_length": 1644,
      "timestamp": "2025-02-06T19:21:34.035820"
    },
    {
      "id": "beshalach1_p38",
      "text": "נמצא לפי\"ז דדור המדבר שהי' כלול בהם ס' רבוא שרשי נשמת ישראל מכל הדורות, וקבלו את התורה ממשה רבינו, השיגו כל א' וא' החידושים וטעמי תורה ורזי סודותי' השייכים לשורש נשמתו, ובצירוף כל הדור השלם ההוא, השיגו כל התורה וכל מה שעתיד להתחדש בה עד סוף כל הדורות, חוץ מדברים פרטיים שנתחדשו בדורות הבאים כפי צורך השעה ולפי מצב הדור, והם בנויים על יסוד הקבלה שקבלו דור הראשון ממשה רבינו ע\"ה נמצא שכלליות התורה כבר נשלמה אז, ונתגלה להם כל התורה ופירושה, וכל חידושי דאורייתא וטעמי תורה, וע\"כ הי' צורך לעסק התורה של כאו\"א מדור המדבר, כדי שיתגלה על ידו חלקי התורה השייכים אל שורש נשמתו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 38,
      "char_length": 568,
      "timestamp": "2025-02-06T19:21:34.835017"
    },
    {
      "id": "beshalach1_p39",
      "text": "וע\"ד שפירשנו (בדברנו פ' תולדות עמוד תקנ\"א) מאמר הגמ' סנהדרין (דף ל\"ח ע\"א) אין אדם אחד דומה לחבירו, לפיכך כאו\"א חייב לומר בשבילי נברא העולם, הכוונה כי כ\"א נברא בכחות הנפש ודעת המסוגל לעבודתו, ומה שראוי לבוא להתגלות על ידו בתוה\"ק א\"א שיתגלה ע\"י אחר, ולכך מפני דאין אדם א' דומה לחבירו, ע\"כ חייב כאו\"א לומר בשבילי נברא העולם, כי יתחייב חלק עבודתו לשלימות התורה ולשלימות העולם, כי בחינת עבודתו וחלקו בתוה\"ק א\"א שיושלם ע\"י אחר כי אם על ידו, (עיי\"ש דברינו באריכות) ומעתה הי' צורך לעסק התורה של דור המדבר ס' רבוא ישראל שבאותו הדור, שעל ידם נתגלו יסודות התורה, וזכו להשגת כל חלקי התורה וחידושי', והם היו מקור התורה לכל דורות ישראל, וכל הדורות הבאים נמשכה קבלתם מן הדור ההוא ממה שקבלו ממרע\"ה כל מה שקבל בהר סיני. ומה שחידשו רבנן ותלמידיהון בפרטי הדברים שלא נתגלה מן ההעלם אל הגלוי אלא בדורות האחרונים, כולם הם בנויים על יסודות הקבלה שקבלו דור הראשון דור המדבר ממשה רבינו ע\"ה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 39,
      "char_length": 865,
      "timestamp": "2025-02-06T19:21:35.111947"
    },
    {
      "id": "beshalach1_p40",
      "text": "ומעתה יתבארו דברי המכילתא הנ\"ל, אמר הקב\"ה אם אני מכניסן לא\"י מיד מחזיקים איש בשדהו ואיש בכרמו והן בטלים מן התורה ותורה מה תהא עלי', כי היה הכרח שכל ס' רבוא ישראל שבאותו הדור יעסקו בתורה, כדי שיתגלה על ידם כל חלקי התורה, כל א' כפי חלקו וכפי שורש נשמתו, ואח\"כ למדו איש מאחיו מה שהשיגו בפירושי התורה, ונכנסה השגה זו בלימוד התורה ונמסרה בקבלה בע\"פ לדורות הבאים, אבל אלמלא נכנסו לא\"י מיד והיו מחזיקים איש בשדהו ואיש בכרמו, הי' נחסר חלק גדול מיסודות התורה, דא\"א שיתגלה חלק כאו\"א ע\"י אחר ולא ע\"י דור אחר, כי הי' זה חלקם בתורה, וראוי שיהי' ההתגלות על ידיהם דוקא, וע\"כ הי' ההכרח שכולם יעסקו בתורה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 40,
      "char_length": 588,
      "timestamp": "2025-02-06T19:21:35.526881"
    },
    {
      "id": "beshalach1_p41",
      "text": "אולם אחר שנתגלה כל חלקי יסודות התורה של הס' רבוא ישראל, ונמסרה בקבלה מדור לדור ומחכם לחכם, מעתה אף אחר שפסקה המן, אפשר שיתקיים הקבלה ע\"י עסק התורה של אוכלי תרומה, וע\"י אותם שתורתם אומנתם, וע\"י אותם שעוסקים במשא ומתן וקובעים עתים לתורה, כי כבר הקבלה מוכנת ומושלמת בידנו, ומבוררת מדור הראשון שקבלו ממרע\"ה, וכבר זכינו להתגלות ההשגה בכל חלקי התורה, וכדי שלא תשתכח מסורת הקבלה, יספיק בעסק התמידי של יחידי סגולה, מנהיגי ישראל ומורי הוראה, ועל ידם ימשך הקבלה מדור אל דור. ואפי' בדורינו היום שחשכו הרואות בארובות, ונשתכחה תורה מישראל ר\"ל, עכ\"פ יש לנו יסודות התורה שמסרו לנו חז\"ל, ודרשות ודיני התורה שנמצאו בתלמוד ומדרשים, ומסורת קבלה בידינו מהתנאים ואמוראים, שהיו כולם מקובלים דור אחר דור עד משרע\"ה, כמ\"ש רבינו יונה ז\"ל שכל תורתם הי' בקבלה איש מפי איש עד משה מפי הגבורה, וכמו שכתב הרמב\"ם ז\"ל בהקדמתו לס' היד מרב אשי עד משרע\"ה היו ארבעים דורות וכולם קבלו איש מפי איש, ומשה רבינו מפי הגבורה, נמצא שכולם מד' אלקי ישראל עיי\"ש. אבל בדור הראשון דור המדבר הי' ההכרח שיהי' התגלות כל חלקי תורה על ידיהם, דאלמלי הי' מחזיקים איש בשדהו וכרמו ובטלים מדברי תורה, הי' נחסר ח\"ו חלק גדול מהשגת חלקי התורה, שלא הי' יוצא להתגלות לעולם, ותורה מה תהא עלי', ע\"כ הקיפם הקב\"ה במדבר, כדי שיהי' הדור ההוא פנוי מכל עסק, ויתפרנסו ע\"י מן ובאר ויעסקו רק בתורה, ויתגלה על ידם כל חלקי התורה, ונתבארו בזה דברי המכילתא הנ\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 41,
      "char_length": 1282,
      "timestamp": "2025-02-06T19:21:35.856821"
    },
    {
      "id": "beshalach1_p42",
      "text": "יהיה איך שיהי' נתברר לנו בירור גמור שדור המדבר היו מקור התורה לכל דורות ישראל, וכח התורה ויסודותיה נשלמה ע\"י עסק התורה של הדור ההוא, ואפשר דע\"כ נחשב לנסיון גדול אצלם, והקב\"ה זוכר להם החסד והזכות של לכתך אחרי במדבר בארץ לא זרועה, דלכאורה בפשטות אחרי שראו כל אותן הניסים שעשה להם הקב\"ה במצרים, אין רבותא כ\"כ שבטחו והאמינו בו ית' ויצאו למדבר עפ\"י דיבורו ובמצותו, ואפי' אנשים שאינם בערך מדריגתם היו עומדים בנסיון זה, אחרי כל הנסים שכבר נעשה להם, אמנם יובן עפימ\"ש התוי\"ט (בפ\"ה דאבות) בפי' המשנה ולא אירע קרי לכוה\"ג ביוהכ\"פ, שהקשה דלכאורה אין זה בגדר נס אפי' לאדם פשוט, אחרי שהיו מזרזין אותו כל ז' הימים, ומשמרים אותו בטהרה, ומונעין ממנו דברים המביאין לידי טומאה ר\"ל, ולמה יארע לו קרי. ותירץ דהס\"מ התגבר עליו מאוד לטמאו ח\"ו, לפי שבכה\"ג הי' תלוי ניצחון המלחמה ומחילת עונות ישראל עכת\"ד ז\"ל. וכמו\"כ בדור המדבר הי' תלוי השלמת כל יסודות התורה, וע\"י שהלכו למדבר וניזונו ממן ובאר, היו פנוים מכל עסקים שבעולם ועסקו רק בתורה, ועי\"ז נשלמה אצלם השגה אמיתית בכל חלקי התורה, וקבלו ממשרע\"ה ומסרוהו לדורות הבאים אחריהם, ואלולא זאת היתה ח\"ו תפוג תורה ומשתכחת ח\"ו הקבלה שקבלו ממשרע\"ה, והי' נחסר ההשגה בהרבה מחלקי התורה שהי' ראוי לבוא להתגלות ע\"י נשמות אלו שבדור הזה דוקא, ע\"כ היתה התגברות היצר גדולה מאוד עליהם למנוע אותם מלילך המדבר, וזה הי' הנסיון הגדול שעמדו נגד ההתגברות הנורא, ולא נמנעו מלקיים מצותיו ית\"ש. וכעין זה יתפרש נסיון א\"א בעקידה, דבאמת אברהם אבינו הי' מבעל תמיד רצונו מפני רצון הבוי\"ת, ולא נחשב כ\"כ לנסיון אצלו העקידה, כי זה הי' דרך עבודתו תמיד, אמנם לגודל התגברות היצר והס\"מ עליו, למנוע אותו מעקידת יצחק, לפי שזכות זה יעמוד לישראל לכל הדורות, והס\"מ רצה למנוע ולעכב זאת, ע\"כ לגודל ההתגברות נחשב בגדר נסיון.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 42,
      "char_length": 1598,
      "timestamp": "2025-02-06T19:21:36.461067"
    },
    {
      "id": "beshalach1_p43",
      "text": "וכל זה נכלל במאמר השי\"ת זכרתי לך חסד נעוריך לכתך אחרי במדבר בארץ לא זרועה, דהחסד והזכות של ישראל כפולה ומכופלת, דע\"י שהלכו במדבר בארץ לא זרועה, היו פנוים לעסק התורה, ונשלמו על ידם יסודות התורה והתגלות כל חלקי התורה, והם היו מקור התורה לכל הדורות, הקב\"ה זוכר חסד זה לדורות עולם ואחרים עומדין בזכותן כדברי הגמ' הנ\"ל, ועוד אחרת הי' להם, דלפי שהיה השלמת יסודות התורה על ידיהם, ומעתה היתה התגברות היצר גדולה מאוד למנעם מזה, ע\"כ היתה עצם הליכתם במדבר בארץ לא זרועה נסיון גדול, וזכות וחסד גדול שעמדו בנסיון זה, והקב\"ה זוכר להם חסד זה עד סוף כל הדורות, ועוד נרמז כאן מדריגתם הגדולה בעבודת השי\"ת כמ\"ש לעיל, שהיו נקיים ימי נעוריהם ועמדו בנסיון נגד התגברות היצר, וכל הליכתם הי' בארץ לא זרועה כנ\"ל, וחסד נעוריהם הקב\"ה מזכיר להם ולדורות עולם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 43,
      "char_length": 729,
      "timestamp": "2025-02-06T19:21:37.198422"
    },
    {
      "id": "beshalach1_p44",
      "text": "ועתה נחזור לענין הנ\"ל לבאר דברי ר\"ע שאמר דור המדבר אין להם חלק לעוה\"ב שנאמר במדבר הזה יתמו ושם ימותו, יתמו בעוה\"ז ושם ימותו לעוה\"ב, ולכאורה איך אפשר לקרב אל השכל מאמר זה, והיתכן שלא הועיל ולא עמדה להם כל החסד והזכות שעשו, והנסיונות הגדולות שעמדו בהם, וכל התורה שלמדו בקדושה וטהרה, וגודל מדריגתן בעבודת השי\"ת שהי' עד אין חקר, והקב\"ה הבטיח שחסדם וזכותם יעמוד לדורות ישראל עד עולם, ואיך יסבור ר\"ע שאין להם חלק לעוה\"ב, ומה דיליף לי' מדכתיב ושם ימותו אדרבה הו\"ל לדרשו איפכא, כמ\"ש בספרי (ובמס' סוטה י\"ג) מוימת שם משה עבד ד', ויליף לי' מגז\"ש דשם שם דלא מת משה אלא עומד למעלה ומשמש, וגם כאן הו\"ל למידרש כן, ומהיכא למד ר\"ע לומר כן שלא יהי' להם חלק לעוה\"ב, אתמהה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 44,
      "char_length": 653,
      "timestamp": "2025-02-06T19:21:37.545720"
    },
    {
      "id": "beshalach1_p45",
      "text": "ואפשר לומר דבר חדש בזה, דהנה נמצא בדברי חז\"ל עוה\"ב בשני פנים: האחד כיונו חז\"ל על ג\"ע התחתון, שצדיקים יושבין ועטרותיהן בראשיהן ונהנין מזיו השכינה ומשכר טוב הצפון, ונפשותיהם צרורות בצרור החיים עם נשמותיהם של אברהם יצחק ויעקב בעולם הנשמות, וזה נקרא עוה\"ב בדברי חז\"ל עפ\"י הרוב, ועוד נמצא בדברי חז\"ל שכינו לימות המשיח בשם עוה\"ב, והיפה תואר בפ' בשלח (פר' י\"ב סימן ט') האריך בענין זה והביא חבל ראיות שגם ימות המשיח נקרא בלשון חז\"ל בשם עוה\"ב, והביא מ\"ש בעל העקרים (במ\"ד פל\"א) שכל שכר הבא אחר המות נקרא עוה\"ב, ומבואר בכ\"מ בש\"ס דגם ימות המשיח נקרא עוה\"ב, והוא מ\"ש במס' כתובות (דף קי\"א ע\"ב) לא כעוה\"ז העולם הבא, העוה\"ז יש בו צער לבצור ולדרוך, העולם הבא מביא ענבה אחת בקרון או בספינה וכו' ומספק ממנה כפטום גדול וכו' וברור שהכוונה שם על עוה\"ב דלימות המשיח, דבעולם, הנשמות אין שם בצירה ודריכה, וא\"צ לברכה ברבוי היין וכו', וכן מבואר מדברי הגמ' ב\"ב (דף קכ\"ב ע\"א) ממ\"ש שם לא כחלוקה של עוה\"ז חלוקה של עולם הבא, העוה\"ז אדם יש לו שדה לבן, אין לו שדה פרדס וכו' ועולם הבא אין לך כאו\"א שאין לו בהר ובשפלה ובעמק וכו' והקב\"ה מחלק להן בעצמו עכ\"ל, ואין ספק דהגמ' מיירי בעוה\"ב דלימות המשיח ולא בעולם הנשמות, ועוד ראיות הרבה נלאתי לפורטם כולם, עכ\"פ בירור גמור ששני העולמות הנזכרים לעיל יקראו עולם הבא בלשון רז\"ל, ודיברו חז\"ל בכל מקום לפי הענין, ופעם כוונו אל עולם הנשמות ופעם על ימות המשיח, ואפשר דמפני שיהיו ימות המשיח משונים בבחינתן מהעוה\"ז, ועמידת העולם יהי' בבחי' גבוה יותר, ע\"כ כינוהו חז\"ל בשם עולם הבא.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 45,
      "char_length": 1379,
      "timestamp": "2025-02-06T19:21:37.882470"
    },
    {
      "id": "beshalach1_p46",
      "text": "ומעתה נראה דלא כוונו חז\"ל בפלוגתתם כאן אל עוה\"ב שבעולם הנשמות. דלא עלה על הדעת לדחות אותם מעוה\"ב ח\"ו, ויסוד פלוגתתם בעוה\"ב לימות המשיח, וכן נראה מדברי ר' יוחנן שמביא ראי' דאחרים באים בזכותן לעוה\"ב מקרא דהלוך וקראת באזני ירושלים דמיירי בנחמת ציון וירושלים. וכן נראה ממ\"ש ז\"ל אשר נשבעתי באפי אם יבואון אל מנוחתי, למנוחה זו אינם באין, אבל באים למנוחה אחרת, וכיונו על בנין העתיד לימות המשיח, והפרשת דרכים (בדרך הקדש דרוש ב') פי' מאמר חז\"ל הנ\"ל עפ\"י דברי הריטב\"א ז\"ל דהאומר קונם לביתך או לביתי שאתה נכנס, אם נפל הבית וחזר ובנאו מותר ליכנס בו דכיון דנפל אזדה לי' הנדר עכ\"ד, ולפי\"ז בטענה זו באים דור המדבר לימות המשיח: משום דהשבועה הי' אם יבואון אל מנוחתי, וכיון דנחרב הבית נתבטל השבועה, ומפורש כן במדרש קהלת אם יבואון אל מנוחתי, למנוחה זו אינם באים, אבל באים הם למנוחה אחרת, א\"ר יהודה בשם ריב\"ל משל למלך שכעס על בנו, ודחפו והוציאו חוץ לפלטין שלו. ונשבע שלא יכנס בנו לפלטין. מה עשה סתרה ובנאה והכניסו, נמצא מכניס בנו ומקיים שבועתו ע\"כ, ופי' בזה הפר\"ד דברי המדרש וז\"ל מפני מה לא נכנס משה לא\"י כדי שיביא דור המדבר לע\"ל, ולפי הנ\"ל יבואר שפיר, שאין דור המדבר באין לע\"ל אלא בטענת למנוחה זו אינם באים אבל באים הם למנוחה אחרת, וכיון שנחרב הבית אזדה לה השבועה, אבל אלמלא הי' משה נכנס לא\"י לא הי' נחרב ביהמ\"ק ולא הי' אפשר לדור המדבר שיבואו לא\"י מפני השבועה, וז\"ש במדרש מפני מה לא נכנס משה לא\"י כדי שיביא עמו דור המדבר לע\"ל כי הא בהא תליא עכת\"ד ז\"ל, עכ\"פ מבואר מדברי מדרש הנ\"ל ומדברי הגמ' שם דיסוד פלוגתתם אם יזכו דור המדבר לעוה\"ב של ימות המשיח.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 46,
      "char_length": 1428,
      "timestamp": "2025-02-06T19:21:38.567393"
    },
    {
      "id": "beshalach1_p47",
      "text": "ולפי\"ז אפ\"ל דר\"ע דאמר דור המדבר אין להם חלק לעוה\"ב, הכוונה שלא יעמדו בתחי' לימות המשיח, דאחר התחי' לכ\"ע נקרא עוה\"ב כנ\"ל, ור\"ע ס\"ל דמדריגתם גדולה מאוד ואין צריכים לשלימות ימות המשיח, דתכלית ימות המשיח להשיג על ידה השלימות ולזכות על ידה לעוה\"ב שהוא עולם הנשמות, אבל דור המדבר לא יחסר להם השלימות ההוא, כי כבר נשלמה מדריגתן, והנשמה אין רצונה לירד מעולם העליון שמתענגת בנועם ד' מזיו השכינה, וע\"כ לא יעמדו בתחי' לימות המשיח גם לפי שמדריגת נשמתם גדולה מקדושת הארץ דלעתיד ואין צריכים אליו, וכמ\"ש המגלה עמוקות בפ' ואתחנן שא\"ל הקב\"ה למשה רבינו רב לך, שמדריגתך גדולה מקדושת הארץ, ונשמתך בעולם הנשמות בבחי' גבו' יותר, ואין קדושת הארץ כדאי לך, וכמו\"כ ס\"ל לר\"ע בדור המדבר שלא יבואו לימות המשיח מהאי טעמא, אבל לכ\"ע יהי' להם חלק לעוה\"ב שהוא עולם הנשמות, ולית מאן דפליג ע\"ז, ואפשר שר\"ע דורש ושם ימותו כמ\"ש ז\"ל במשה רבינו וימת שם משה, אבל למעלה עומד ומשמש, כמו\"כ דריש לי' ר\"ע ושם ימותו, אבל למעלה בעולם הנשמות יהיו בין הצדיקים היושבים ועטרותיהן בראשיהם ונהנין מזיו השכינה אלא שלא יבואו לימות המשיח, ולא ע\"צ העונש, אלא אדרבה לצד מעלתם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 47,
      "char_length": 1017,
      "timestamp": "2025-02-06T19:21:39.258789"
    },
    {
      "id": "beshalach1_p48",
      "text": "ומ\"ש ר' יוחנן שבקי' ר\"ע לחסידותיה, אפשר דכוונת טענתו עד\"ז, דאמת הדבר שמדריגתם גדולה מאוד, אבל דרך הצדיקים שמשתוקקים לסגל מצות ומע\"ט, כמ\"ש ז\"ל יפה שעה אחת בתשובה ומע\"ט בעוה\"ז יותר מכל חיי עוה\"ב, וכמ\"ש ק\"ז זלל\"ה בתפלה למשה (מזמור קמ\"ג) דצדיקים עובדים השי\"ת בבחינ' זו, שגם ואם ענוש יענש בגיהנם על קיום המצות, מ\"מ יעשה בחשקות גדול להשלים רצונו ית', עכת\"ד ז\"ל. וע\"כ אף דמדריגתם של דור המדבר גדולה מאוד בעולם הנשמות, אבל א\"א לסגל שם מצות ומע\"ט דבמתים חפשי, וע\"כ רצונם וחפצם של דור המדבר שיבואו לא\"י לימות המשיח, ויוכלו לקיים מצות התליות בארץ, ועיין בספרי ויואל משה (מאמר ב' סימן ח') שהבאתי מדברי התוס' פסחים (קי\"ג ע\"ב) ותוס' מנחות (מ\"א ע\"א) שיש לו לאדם לחזור להביא עצמו לידי חיוב, כדאשכחן במשה רבינו שהי' תאב ליכנס לארץ כדי לקיים מצות התליות בה. והא מילתא הוא בבחי' חסידות אצל דור המדבר, שאינם מחויבים במצות התליות בארץ, ורוצים להכניס עצמם לכלל החיוב, ומתחסדים עם קונם, ורצונם להרבות מצות ומע\"ט לימות המשיח, ואינם מסתפקים ברב טוב הצפון להם בעולם הנשמות, ואמר ר' יוחנן להשיב על דברי ר\"ע, דאה\"נ טענתך אמיתית הוא שמדריגתם גדולה מאוד, ולא נחסר לשלימותן שיבואו לימות המשיח דרב טוב צפון להם לעוה\"ב עבור החסד שעשו והנסיונות שעמדו בהן במדבר, אבל שבקי' ר\"ע לחסודותי', דלפי מדת חסידותי' של ר\"ע, לא הי\"ל למנוע את דור המדבר מחסידותם, שרצונם וחשקם להתחסד עם קונם, ולהביא עצמם לידי קיום מצות התליות בארץ שאין מחויבים בה, וזה א\"א להם לקיים לע\"ל בעולם הנשמות, וע\"כ אין למונעם מזה ויבואו לימות המשיח.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 48,
      "char_length": 1377,
      "timestamp": "2025-02-06T19:21:39.748773"
    },
    {
      "id": "beshalach1_p49",
      "text": "ועוד דאם אחרים באים בזכותם לימות המשיח הן עצמן לא כ\"ש, דמגיע להן בשכרן מדה כנגד מדה שגם הם ובואו לימות המשיח, מדמביאין אחרים בזכותן, ור\"ע ס\"ל דאחרים באים בזכותם לימות המשיח, לפי שעדיין חסר להם השלימות, כדי שיזכו על ידה לעוה\"ב, אבל הם לא נצרכו לזה לצד מעלתם כנ\"ל, אמנם נראה דמסקנת המדרשים ודעת חז\"ל דבאים הם לימות המשיח כר\"א וכר\"י, וכמ\"ש במדרש (פרשת ואתחנן פרשה ב' סימן ט') דע\"כ לא נכנס משה לא\"י כדי שיבואו עמו דור המדבר לימות המשיח, וכמ\"ש במד\"ר קהלת דעל כי נחרב הבית בטלה שבועה, וכן בכ\"מ במאמרי חז\"ל משמע דבאים הם לימות המשיח, ואין לגרע אותם מקיום מצות התליות בארץ, דאם אחרים יזכו בזכותן הם עצמן לא כ\"ש, ויבואר ג\"כ לדרכינו מה שהביא ר\"א ראי' מקרא דאספו לי חסידי וגו' דבאים הם לעוה\"ב, ולכאורה מנין לו דפסוק זה קאי על דור המדבר דוקא, וכל המפרשים פירשוהו על אסיפת גליות לימות המשיח. ואיך מרומז בה דור המדבר, ועיין במהרש\"א שכתב חסידי היינו דור המדבר, וע\"ש חסד נעוריך קראם הכתוב חסידי, ולדרכינו אפ\"ל דע\"כ קראם הכתוב חסידי, דזו הוא טענה להביאם לימות המשיח, כי רצונם להתחסד עם קונם, ולהביא את עצמם לקיום מצות ומע\"ט לימות המשיח, וע\"כ אין למנעם מהם. ומעתה מבואר קצת טעם פלוגתתם, ומעולם לא עלה על הדעת לדחותם מעוה\"ב שהוא עולם הנשמות, ולית מאן דס\"ל הכי וסרו כל הקשיות בענין הנ\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 49,
      "char_length": 1167,
      "timestamp": "2025-02-06T19:21:40.411544"
    },
    {
      "id": "beshalach1_p50",
      "text": "ועתה נבוא לתרץ דברי המדרשים שבפתח דברינו משה צווח ווי, ופרעה צווח ווי, וכל הדקדוקים שבענין בהקדם מ\"ש הרמב\"ם ז\"ל (בפ\"ה מה' מלכים ה\"ז) בשלשה מקומות הזהירה תורה שלא לשוב למצרים, שנא' לא תוסיפון לשוב בדרך הזה עוד לא תוסיף עוד לראותה, לא תוסיפו לראותם עוד עד עולם, והסמ\"ג וכל הפוסקים חתרו למצוא פשר דבר, דעל מה סמכו כמה קהלות השוכנים במצרים, וגם הרמב\"ם הלך שם לגור ועוד כמה גאוני ארץ, וכתבו לתרץ עפ\"י מה שכתב הרב ר\"א ממיץ בעל ספר יראים ז\"ל דלא אסרה תורה לשוב אלא בדרך הזה דהיינו מא\"י למצרים. אבל משאר ארצות מותר.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 50,
      "char_length": 507,
      "timestamp": "2025-02-06T19:21:41.003115"
    },
    {
      "id": "beshalach1_p51",
      "text": "והרדב\"ז הקשה דתינח בלאו דלא תוסיפון לשוב בדרך הזה איכא למימר הכי, אבל בהנך קראי דכתיב לא תוסיפו לראותם עוד, א\"כ האיסור בכל אופן מאי איכא למימר. אם לא שנאמר דס\"ל דלאו דלא תוסיפו לראותם אינו אלא אסמכתא ולא ללאו נאמרה. והנכון יותר מ\"ש הריטב\"א (ביומא ל\"ח) אחרי שחתר למצוא היתר על השוכנים במצרים בזמה\"ז, מסיק דהטעם היותר נכון, שאין האיסור ההוא אלא בזמן שישראל שרויין על אדמתם, אבל בזמן הזה שנגזר עלינו להיות נדחים בכל קצוי ארץ, כל חוץ לארץ אחד הוא, וגם מצרים הותרה כמו שאר ארצות הגלות עיי\"ש (והבאתי דבריו ז\"ל בספרי ויואל משה עיי\"ש) ומצאתי סמוכין לדברי הריטב\"א ז\"ל, ממ\"ש התוה\"ק בפ' תבא בתוכחה והפיצך ד' בכל העמים מקצה הארץ ועד קצה הארץ וגו' ואח\"כ כתוב והשיבך ד' מצרים באניות בדרך אשר אמרתי לא תוסיף עוד לראותה וגו' ובודאי לא ישתנו מצות התורה, והיתכן שהשי\"ת בעצמו יעבירנו על מה שצונו, ואין זה מדרך העונש, אלא ודאי שהצווי מעיקרא לא היתה על זמן הגלות כדברי הריטב\"א ז\"ל, וע\"כ אמר הכתוב שכאשר הפיצך ד' בכל העמים מקצה הארץ ועד קצהו, השיבך ד' גם למצרים בדרך אשר אמרתי לא תוסיף עוד לראותה, לפי דמעיקרא לא היתה האיסור על זמן הגלות.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 51,
      "char_length": 1016,
      "timestamp": "2025-02-06T19:21:41.302530"
    },
    {
      "id": "beshalach1_p52",
      "text": "ולפי\"ז יובן מאמה\"כ כי כאשר ראיתם את מצרים היום לא תוסיפו לראותם עוד עד עולם, ובתרגום כמא די חזיתון ית מצראי יומא דין וכו', ולכאורה מאי נפק\"מ אם כמא דחזיתון או באופן אחר, ולמה תלה הכתוב האיסור בכאשר ראיתם את מצרים היום כקושיתנו לעיל, ולדברי הריטב\"א א\"ש, דתנאי הי' באיסור, ולא אסרה תורה אלא בבחינת היום, שכבר יצאו מהגלות ומוכנים ליכנס לארץ. ובאופן זה מוזהרים על לא תוסיפו לראותם, אבל בזמן גזירת הגלות גם מצרים שוה לשאר ארצות וע\"כ כתבה תוה\"ק כאשר ראיתם את מצרים היום, בבחי' זו שאתם בני חורין, וכ\"כ התרגום כמא די חזיתון ית מצראי יומא דין לא תוסיפו לראותם וכו'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 52,
      "char_length": 556,
      "timestamp": "2025-02-06T19:21:41.784719"
    },
    {
      "id": "beshalach1_p53",
      "text": "ולפי\"ז לא יקשה קושית הבית יעקב על הזוה\"ק, דכיון דכתיב עד עולם א\"כ פירושו אפי' לאחר מיתתן, וא\"כ קשה מה דכתיב וירא ישראל את מצרים מת על שפת הים, והרי כתיב לא תוסיפו לראותם עוד עד עולם, ולדברינו ולדברי הריטב\"א ז\"ל א\"ש, דהכא ע\"כ תנאי יש בדבר כאשר ראיתם את מצרים היום, דרק בבחי' זו אתם מוזהרים בלא תוסיפי לראותם עד עולם, ובזמן הגלות הותרה לשוב מצרים, א\"כ הכא עכ\"ח עד עולם לאו לרבויי אתי הכל, וא\"ש דלא נאסרו לראותם רק בחייהם כמשה\"כ כאשר ראיתם את מצרים היום דהיינו בחייהון, וכמ\"ש המתרגם כמא די חזיתון, ובאופן זה אתם מוזהרין שלא לראותם עד עולם, אבל מתין חמו להון וא\"ש דברי הזוה\"ק.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 53,
      "char_length": 572,
      "timestamp": "2025-02-06T19:21:42.071789"
    },
    {
      "id": "beshalach1_p54",
      "text": "ועתה יבואר מאמה\"כ פן ינחם העם בראותם מלחמה ושבו מצרימה, ואין הכוונה שירצו לשוב מצרימה ע\"צ האיסור, דא\"א שישובו נגד רצונו ית', ואצלו ית' אין נפק\"מ למנוע אותם בין דרך קרוב או דרך רחוק אבל הכוונה דידע הקב\"ה שינחם העם בראותם מלחמה, ורש\"י פי' כגון מלחמת וירד עמלקי והכנעני האמור במרגלים, וחטאם יגרום עליהם גזירת הגלות, וכמ\"ש ז\"ל הם בכו בכי' של חנם ע\"כ נקבע להם בכי' לדורות, ואפשר עוד דכוונת הכתוב במ\"ש בראותם מלחמה, גם על מלחמת היצר והס\"מ דהוא עמלק, ויתעורר להחטיאם במדבר בכמה נסיונות, ורוה\"ק אומרת כן דינחם העם בראותם מלחמה, ויגרום מצבם גזירת הגלות וז\"ש ושבו מצרימה, ולא כתיב לשוב מצרימה, אלא שישובו באמת למצרים ע\"י גזירת הגלות, כמשאה\"כ והשיבך ד' מצרים באניות, ומעתה יצטרכו ישראל לזכות של דור המדבר כמשאה\"כ זכרתי לך חסד נעוריך לכתך אחרי במדבר, ובזכות זה יגאלם השי\"ת אף אם לא יהיו ראוים, ע\"כ הקדים השי\"ת הרפואה למכה, ולא נחם אלקים דרך ארץ פלשתים כי קרוב הוא, ואם הי' נכנסים לא\"י מיד בדרך הקרוב, ולא יעברו דרך המדבר לא יהי' להם זכות התורה, ולא היתה התורה נבללת בגופן כמ\"ש לעיל, גם לא הי' להם כל הנסיונות והזכותים של לכתך אחרי במדבר בארץ לא זרועה, ולא הי' להם ח\"ו מציאות להגאל בלי זכותם של דור המדבר, ע\"כ ויסב אלקים את העם דרך המדבר, כדי שיהי' להם זכות וחסד של דור המדבר, וכמ\"ש הכלי יקר עה\"פ וחמושים עלו בנ\"י מאמ\"צ, דירמוז על זכות התורה שהיא הי' כלי זיינם של ישראל, גם ירמוז על ה' חומשי תורה, עכ\"פ ע\"י שהקיפם הקב\"ה דרך המדבר הי' בידם זכות התורה, שהעמידו יסודות התורה, ואותו הדור הי' מקור התורה ומקור הקבלה לכל דורות ישראל כמ\"ש לעיל, ועמדו בנסיון דלכתך אחרי במדבר, ויעמוד להם זכות זה להגאל לעת קץ.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 54,
      "char_length": 1488,
      "timestamp": "2025-02-06T19:21:42.362088"
    },
    {
      "id": "beshalach1_p55",
      "text": "ומ\"ש הכתוב כי קרוב הוא כי אמר אלקים פן ינחם העם וגו', אינה סיבת הטעם דעל כי קרוב הוא ע\"כ אמר אלקים, דא\"כ למה כפל מילת כי תרי זמני, והול\"ל כי קרוב הוא ואמר אלקים, גם אצלו ית' אין נפק\"מ למנוע מדרך קרוב או רחוק, אבל הם ב' דברים נפרדים והא' משלים לחבירו, ור\"ל ולא נחם אלקים וגו' כי קרוב הוא, ולא יהי' להם הזכות והחסד של דור המדבר, כי אמר אלקים פן ינחם העם וגו' ושבו מצרימה וידע השי\"ת שיהי' עליהם גזירת הגלות ויצטרכו לזכות דור המדבר. ובאמת היתה לפניו ידיעה ברורה שעוד יהי' גזירת הגלות עליהם, והי' מוכן הגזירה שלא יכנסו לא\"י בבחינת נורא עלילה כמ\"ש לעיל וכדאיתא במדרש תנחומא, אלא שהכתוב אומר פן ינחם העם ע\"צ הספק, דאם יאמר הכתוב ע\"צ ודאי, שיתחרטו ולא יעמדו בנסיון אז יתבטל הבחירה מהם, כי הדיבור מכריח הבחירה, אבל ידע השי\"ת שיהי' כן, וע\"כ תיקן והקדים הרפואה לזה והכין להם זכות דור המדבר, ובזה יתבאר דברי הילקוט הנ\"ל (בקושיא י\"ג) כי קרוב הוא שנא' לבני ישראל עם קרובו וכו' עיי\"ש, ואפ\"ל לדרכנו דהנה דור המדבר נקראים חסידי כמו שדרשו ז\"ל מהאי קרא דאספו לי חסידי כנ\"ל, וביארנו לעיל דע\"כ הסיבן הקב\"ה דרך המדבר, כדי שיהי' זכותם של דור המדבר מגין על ישראל בגלותם, ובזכותם יתקרבו ישראל אל אביהם שבשמים, כמו שדרשו ז\"ל דאחרים באים בזכותן לעוה\"ב וכו' ובזה יתבאר קישור דברי הילקוט ולא נחם אלקים דרך ארץ פלשתים. אלא הקיפן דרך המדבר, והטעם כי קרוב הוא שנא' לבני ישראל עם קרובו, שעל ידם יתקרבו כל ישראל להיות עם קרובו של הקב\"ה. ובזה נתבאר הענין וסרו כל הקושיות הנ\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 55,
      "char_length": 1341,
      "timestamp": "2025-02-06T19:21:43.076787"
    },
    {
      "id": "beshalach1_p56",
      "text": "ועתה נבאר ענין ויבא עמלק והדקדוקים בענין שנפרטו לעיל, ונקדים מ\"ש הבעלי תוס' וז\"ל, תימה למה איחר להלחם עם ישראל עד עכשיו, ולא בא מיד בשעה שירדו למצרים שלא היו כ\"א שבעים נפש, י\"ל שא\"ל הקב\"ה לאברהם ועבדום וענו אותם, וכשמת אברהם אבינו ע\"ה הוטל החוב על יצחק, וכשמת יצחק הוטל על יעקב ובניו ועשו ובניו, ואמר עמלק הרשע, אם אכרית את יעקב וזרעו יהי' החוב מוטל עלי, שהי' בן אליפז בן עשו לכך המתין עד שיצאו ממצרים שכבר נפרע החוב, ואז בא להלחם עמהן עכ\"ד ז\"ל, אולם עדיין קשה למה לא בא מיד בצאתן ממצרים ולמה המתין עד רפידים, ואמרו חז\"ל במכילתא שפסע ד' מאות פרסה בכשפים עד שהגיע אצליהם, ולמה לא יצא מיד לקראתם ביציאתם ממצרים, והי' יכול להגיע עליהם בדרך הטבע במשך זמן קצר, ומדוע נתעורר בביאתו פתאום. גם יש להבין מ\"ש ז\"ל במכילתא שכל הביאות שבא עד הנה הי' במטמוניות, וביאה זו הי' בגלוי פנים, וראוי להבין הכונה היכן מצינו שבא במטמוניות.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 56,
      "char_length": 816,
      "timestamp": "2025-02-06T19:21:43.719650"
    },
    {
      "id": "beshalach1_p57",
      "text": "ונקדים מ\"ש רש\"י ז\"ל ויבא עמלק סמך פרשה זו למקרא זה, לפי שאמרו ישראל היש ד' בקרבנו אם אין לפיכך נזדמן להם עמלק משל לאדם וכו' והקשו המזרחי והגו\"א כי אין דרכו של רש\"י לדרוש סמוכין כי אם בסמיכות שאין שם מקומו, כי שם ניתן לדרוש אבל כאן הרי זה מקומו, שהרי ברפידים הי' שנא' וילחם עם ישראל ברפידים, ובהכרח שתסמוך פרשה זו לזו להיות שניהם במקום א' ובזמן א' ואיך ניתן לדרוש סמיכות זו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 57,
      "char_length": 373,
      "timestamp": "2025-02-06T19:21:44.124289"
    },
    {
      "id": "beshalach1_p58",
      "text": "אמנם יבואר הענין, דהנה רפידים היתה הנסיעה האחרונה לפני ביאתם למדבר סיני לקבל את התורה, וע\"כ הי' ההתגברות גדול מצד סטרא דעמלק דהוא הס\"מ למונעם מזה, וכמ\"ש בזוה\"ק דב' מלחמות היו כאן, דמשרע\"ה נלחם עם שרו של עמלק למעלה דהיינו הס\"מ, ויהושע זמין גרמי' למלחמה דלמטה עם עמלק עיי\"ש, ומקור המלחמה הי' עם הס\"מ, והוא גרם להם מה שאמרו היש ד' בקרבנו אם אין ומה שרפו ידיהם מן התורה, והכין כל זה בתחבולותיו כדי שיוכל לבוא ולהלחם עמהם ע\"י חיילותיו למטה, כי ידע כי זולת זה לא יוכל להלחם בהם כלל, ומעתה יבואר מ\"ש במכילתא הנ\"ל שכל הביאות שבא עד עכשיו הי' במטמונית, וביאה זו הי' בגלוי פנים ובא להלחם עמהם בגלוי. והכוונה על הס\"מ, שכן דרכו תמיד שבא במטמוניות ומתחיל במחשבות דקות, מלובש בכמה מלבושים עד שלא ידעו כלל להשמר ממנו, וכמו\"כ אירע לנו בעוה\"ר בימינו אלה, שחבורת רשעים אשר שמו למטרתם עקירת התוה\"ק והריסת הדת, התחילו מלאכתם כבר במטמוניות לפני מאה שנה בערך, והי' בהסתר ובמחשך מעשיהם בעצת הס\"מ, שחשב מחשבות להדיח ח\"ו את ישראל מאמונתם, והי' כ\"כ מלובש ומעוטף בלבושים שונים ובשמות נרדפים, עד שלא ידעו רובא דעלמא להשמר ממנו, וכ\"ז מתחבולות היצר שעשה הכנות ופעולות ומעשים רבים בסתר, עד שבא בגלוי פנים אל המלחמה הנוראה, ועכשיו נעשתה ע\"י שליחיו הריסת הדת בגלוי לעיני השמש, ובעו\"ה נחטפו על ידו רוב מנין ורוב בנין בית ישראל השם ירחם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 58,
      "char_length": 1202,
      "timestamp": "2025-02-06T19:21:44.330635"
    },
    {
      "id": "beshalach1_p59",
      "text": "וכמו\"כ הי' אז בביאת עמלק שעד עכשיו הי' כל ביאתו במטמוניות, והתגנב בתוך לבבות בנ\"י בהסתר ובלבושים, עד שהביאם למדריגה זו שאמרו היש ד' בקרבנו ורפו ידיהם מן התורה, ואז בא להלחם עמהם בגלוי עם חיילותיו, כי לא הי' לו שליטה עליהם רק ע\"י שפגמו באמונה ורפו ידיהם מן התורה, ולכך המתין עמלק ולא בא עד עכשיו, ומקודם עשה הכנות בסתר והזמינם לידי כך. ומעתה א\"ש הסמוכין שכתב רש\"י ז\"ל דבשביל שאמרו היש ד' בקרבנו ורפו ידיהם מן התורה ע\"כ בא עמלק, ואע\"ג דהכא מוכרח הסמוכין דכאן הי' מקומו כקושיתנו הנ\"ל, אולם מזה עצמו נלמד הסמוכין, דמדוע הי' כאן מקומו וזמנו, ולמה לא בא מיד ביציאתם ממצרים, אלא לצד שהמתין עד שרפו ידיהם מן התורה ומן האמונה כנ\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 59,
      "char_length": 622,
      "timestamp": "2025-02-06T19:21:44.911540"
    },
    {
      "id": "beshalach1_p60",
      "text": "עוד אפ\"ל ענין הנ\"ל באופן אחר דהנה בין הערב רב היו גם עמלקים, וכמו שכתב בזוה\"ק פ' בראשית (דף כ\"ה ע\"א) חמש מינין אינון בערב רב וא' מהם עמלקים, ועלייהו אתמר תמחה את זכר עמלק ומלחמה לד' בעמלק מדר דר עיי\"ש, עוד איתא בזוה\"ק בראשית (קס\"ט) תמחה את זכר עמלק אילין בכורי מצרים ערב רב מעורבים בישראל עכ\"ד, ובכל הדורות יש בינינו מן הערב רב הבאים ע\"י גלגול בזרע ישראל, ויש שנשמותיהם משורש עמלק, ובאותו הדור מבואר בזוה\"ק שהי' בהם מזרע עמלק ממש שנתגיירו ונכנסו עם הערב רב, והם שגרמו כל הצרות והכניסו בישראל חולשה באמונת השי\"ת עד שאמרו היש ד' בקרבנו וגרמו שרפו ידיהם מן התורה, והם שעשו את העגל והמתאוננים והמתלוננים הכל הי' ע\"י הערב רב ושורש עמלק אשר בקרבם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 60,
      "char_length": 641,
      "timestamp": "2025-02-06T19:21:45.226646"
    },
    {
      "id": "beshalach1_p61",
      "text": "והנה מעולם הי' קשה לי דמצינו בחלוקת הארץ שנתחלקה א\"י לשבטים לבד, כמ\"ש לרב תרבו נחלתו וגו', ולא תסוב נחלה ממטה למטה וגו' ולא מצינו שניתנה חלק בארץ גם לערב רב, והם היו הרבה יותר מישראל, ואפוא הי' מקום נחלתם בא\"י. אולם ראיתי באוהחה\"ק פ' תשא שכתב וז\"ל ונראה כי כל ערב רב שהיו אז בשעת העגל מתו בחרון אף, כי הסכים משה רבינו על כלותם, ולא בקש רחמים כ\"א על ישראל עיי\"ש, הגם שבזוה\"ק משמע שהיו עוד מהערב רב גם אחר מעשה העגל, אולם נצטרך לומר דמתו אח\"כ במ' שנה שהיו ישראל במדבר ולא באו לא\"י, כי לא מצינו שהיו בין באי הארץ.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 61,
      "char_length": 510,
      "timestamp": "2025-02-06T19:21:45.549698"
    },
    {
      "id": "beshalach1_p62",
      "text": "ונקדים עוד מ\"ש האוהחה\"ק בפ' תבא ויוציאנו ד' ממצרים ביד חזקה וגו' זו הצלת יצה\"ר וכוחותיו המצירים אותנו, ביד החזקה זו התורה עיי\"ש, ובזוה\"ק אמרו מצרים זו מצר ים, ומבואר בדברינו כ\"פ דמבלעדי נס היציאה, היתה עיקר הנס שהוציאנו השי\"ת מכוחות וקליפות מצרים, והוציא טומאת מצרים מתוך לבבות בנ\"י, ופירשתי בזה משה\"כ לקחת לו גוי מקרב גוי עיי\"ש, וכמו\"כ אפ\"ל דמ\"ש הכתוב ושבו מצרימה, אין הכוונה שישובו בפועל למצרים, כי א\"א שישובו נגד רצונו ית', אולם אפשר דכוונת הכתוב פן ינחם העם דהיינו הערב רב שנקראו עם. שהם יגרמו קלקול ויחטיאו את בנ\"י בעגל ושאר חטאים, ושבו מצרימה ר\"ל דעי\"ז ישובו את בנ\"י לטומאת מצרים, וכאשר כן הי' באמת. ובזה מתורץ דלכאורה לפי פשוטו הול\"ל ושבו למצרים, ולמה כתוב ושבו מצרימה, ורש\"י פי' בכ\"מ דה' בסוף התיבה במקום ל' בתחילתה, וכאלו כתיב ושבו למצרים, אבל מ\"מ טעמא בעי למה שינתה הכתוב לכתוב ה' במקום ל', ולדרכינו יתפרש שפיר כי אין הכוונה שישובו למצרים, אלא לבחינת מצרים, וז\"ש ושבו מצרימה היינו פנימיות בחי' מצרים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 62,
      "char_length": 910,
      "timestamp": "2025-02-06T19:21:45.828622"
    },
    {
      "id": "beshalach1_p63",
      "text": "ונקדים עוד מ\"ש הרמב\"ן ז\"ל בפ' וירא (עה\"פ ונדעה אותם) כי משפט סדום הי' למעלת א\"י, כי הוא מכלל נחלת ה', ואינה סובלת אנשי תועבות, וראה הקב\"ה שיהי' לאות לבני מרי לישראל העתידים ליורשה, כאשר התרה בהן גפרית ומלח שרפה כל ארצה, כמהפכת סדום ועמורה וגו' כי יש באומות רעים וחטאים מאוד ולא עשה להם ככה, אבל למעלת א\"י הי' כל זה, כי שם היכל ד' עכת\"ד, ומעתה יבואר מאה\"כ דאלו הלכו ישראל בדרך קרוב לא\"י ולא נשתהו במדבר ארבעים שנה, הי' באים גם הערב רב עמהם לא\"י, והיו עושים העגל בא\"י בהיכל ד', והעיקר הוא השורש והתחלה, ובפעם הראשונה שקלקלו בעגל אלמלי הי' החטא בא\"י הי' הפגם גדול מאוד, וע\"כ הסיבם ד' במדבר מ' שנה עד אשר תמו ונכרתו ונשארו הערב רב במדבר כנ\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 63,
      "char_length": 638,
      "timestamp": "2025-02-06T19:21:46.274731"
    },
    {
      "id": "beshalach1_p64",
      "text": "וז\"ש הכתוב ויהי בשלח פרעה את העם, ששלח עמם הערב רב הנקראים עם, ומה\"ט ולא נחם אלקים דרך ארץ פלשתים כי קרוב הוא, כי אמר אלקים פן ינחם העם וגו' ושבו מצרימה, שהערב רב יחטיאו אותם ויחזרו לטומאת מצרים, ואם יעשו זאת בא\"י יהי' הפגם גדול מאוד, ע\"כ ויסב אלקים את העם דרך המדבר וגו' וחמושים עלו בנ\"י, כמשפרש\"י שלא עלו אלא א' מחמושים ולפי פשוטו מזויינים, ואפשר דהכוונה על כח התורה שהוא כלי זיין להגין מפני היצה\"ר, כמ\"ש ז\"ל עה\"פ חגור חרבך על ירך, והכלי יקר פי' וחמושים רמז לחמשה חומשי תורה, ומעתה כח התורה יהי' מגין עליהם ממלחמת היצר. וכל הפגמים והתלונות והעגל שנעשה ע\"י הערב רב הי' הכל במדבר, ולא הי' הפגם גדול כ\"כ כאלו נעשתה בא\"י.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 64,
      "char_length": 619,
      "timestamp": "2025-02-06T19:21:46.605252"
    },
    {
      "id": "beshalach1_p65",
      "text": "ולדרכינו יתבאר הכתוב הנני ממטיר לכם לחם מן השמים ויצא העם ולקטו דבר יום ביומו למען אנסנו הילך בתורתי אם לא ולכאורה מה הי' הנסיון בזה, בתת להם לחם מן השמים דבר יום ביומו, וזה הי' חסד גדול ולא נסיון, אולם יתבאר לפי דברי המכילתא הנ\"ל דע\"כ הקיפם הקב\"ה במדבר ואכלו את המן ושתו מי באר כדי שיהי' התורה נבללת בגופן, דלא ניתנה תורה לדרוש אלא לאוכלי המן, ונתבאר בדברינו לעיל דהי' ההכרח כן שיהיו כל אותן הדור פנוים לעסק התורה, ויסודות התורה והקבלה בכל חלקי התורה נשלמה ע\"י דור ההוא, ונתגלה להם כל טעמי תורה ופירושה וכל מה שתלמיד ותיק עתיד לחדש, ואח\"כ מסרוה בקבלה מדור אל דור, וע\"כ כל מה שניתוסף מדריגתם בתורה נתוספת התגברות היצה\"ר עליהם, והיו נסיונות אותו הדור גדולים מאוד, וכמ\"ש ז\"ל (סוכה דף נ\"ב ע\"א) כל הגדול מחבירו יצרו גדול הימנו וכיו\"ב אמרו ז\"ל (שם) דיצה\"ר מניח כל האומות ואינו מתגרה אלא בישראל ובתלמידי חכמים יותר מכולם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 65,
      "char_length": 815,
      "timestamp": "2025-02-06T19:21:46.914909"
    },
    {
      "id": "beshalach1_p66",
      "text": "ופרשתי בזה דברי הגמ' במס' סוכה (נ\"ב ע\"א) לע\"ל צדיקים נדמה להם היצה\"ר כהר גבוה ורשעים נדמה להם כחוט השערה, הללו בוכין והללו בוכין, צדיקים בוכין ואומרים האיך יכולנו לכבוש הר גבו' כזה ורשעים בוכין ואומרים האיך לא יכולנו לכבוש את חוט השערה הזה וכו'. ולכאורה צ\"ב דממנ\"פ אם הוא כהר גדול איך נדמה לרשעים כחוט השערה, ואם הוא כחוט השערה איך ידמה לצדיקים כהר, ומאי נפק\"מ בדמיון אם האמת אינו כן. אולם שניהם אמת, דאצל הרשעים אין עליהם התגברות היצר רק כחוט השערה, כי לא צריך יצה\"ר להתגברות אחרי שהרשע שומע לו ואינו ממרה עצתו, אבל לצדיקים התגברות היצר גדול מאוד, ובאמת הוא כהר גדול ואלמלא הקב\"ה עזרו אינו יכול לו (וכעין זה ראיתי בגאון יעקב על העין יעקב שכ\"כ בשם חכמי ספרד).",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 66,
      "char_length": 659,
      "timestamp": "2025-02-06T19:21:47.308097"
    },
    {
      "id": "beshalach1_p67",
      "text": "וזשה\"כ שאמר הקב\"ה הנני ממטיר לכם לחם מן השמים ויצאו העם ולקטו דבר יום ביומו כדי שיהיו פנוים לעסק התורה ויתגדל מעלתם מאוד, אבל תדעו שגם הנסיונות יתגדלו עד מאוד, וז\"ש למען אנסנו הילך בתורתי אם לא, והסוף שעמדו דור המדבר בנסיונם, והי' מדריגתם גדולה מאוד כמשאה\"כ זכרתי לך חסד נעוריך, חוץ מפגמים אחדים שנכשלו בהם ועשו אח\"כ תשובה שלימה עליהם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 67,
      "char_length": 335,
      "timestamp": "2025-02-06T19:21:47.631419"
    },
    {
      "id": "beshalach1_p68",
      "text": "ועתה נבוא לביאור הכתוב כל המחלה אשר שמתי במצרים לא אשים עליך כי אני ד' רופאיך, ולכאורה א\"כ רפואה ל\"ל מאחר שלא ישימם עליך, עוד יל\"ד דלמה אמר הכתוב כל המחלה אשר שמתי במצרים הו\"ל לשלול כל המחלות, דגם אלו אשר לא היו במצרים לא אשימם עליך, ואם כל המחלות נכללו במכות מצרים. הול\"ל כל המחלה לא אשים עליך והכל בכלל, אולם יובן עפ\"י מ\"ד בירושלמי דמס' שבת (פי\"ד ה\"ג) והסיר ד' ממך כל חולי א\"ר אבון זה יצה\"ר דראשו מתוק וסופו מר ע\"כ. והנה מחלה זו מצוי בישראל יותר, כמ\"ש ז\"ל במס' סוכה (נ\"ב) שמניח יצה\"ר את כל האומות ואינו מתגרה אלא בישראל, וזה רצונו ית' כדי להגדיל שכרן אם יזכו לנצח אותו. ובחי' מחלה זו לא הי' במצרים, וזשה\"כ כל המחלה אשר שמתי במצרים לא אשים עליך, אבל יש בחי' מחלה שלא שמתי במצרים ואשימם עליך, ואין זה נכלל בכל המחלה אשר שמתי במצרים, ע\"ז באה ההבטחה כי אני ד' רופאיך ממחלה זו, כמ\"ש ז\"ל (קידושין דף ל' ע\"ב) אלמלא הקב\"ה עזרו לא יכול לו, וכשרוצים להתדבק בדרכיו ית' הקב\"ה עוזר ומושיע ומעלה ארוכה למחלה זו, וזהו קישור הכתוב אם שמוע תשמע לקול ד' אלקיך וגו' והאזנת למצותיו ושמרת כל חקיו, אז תנצל מכל המחלות, דכל המחלה אשר שמתי במצרים לא אשים עליך, ומן המחלה השכיח בישראל יותר מכל האומות אני ד' רופאיך.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 68,
      "char_length": 1092,
      "timestamp": "2025-02-06T19:21:47.819422"
    },
    {
      "id": "beshalach1_p69",
      "text": "ולדרכנו יבואר המדרש הנ\"ל דמשה צווח ווי שלא יכנס לארץ, ואפשר לדרכינו מפני שהשיג עכשיו בדיבורו של הקב\"ה פן ינחם העם וכו' ושבו מצרימה שנרמז בזה גזירת הגלות, כי א\"א שישובו מצרימה אלא ע\"י גזירת הגלות כמ\"ש והשיבך ד' מצרים באניות, גם הטעם שהסיבן הקב\"ה דרך המדבר הי' לטעם החורבן והגלות, כדי שיזכור להם הקב\"ה זכות דור המדבר וחסד נעוריך ובזכות זה יגאלו לימות המשיח, מזה ידע משרע\"ה שלא יכניסם לארץ ישראל, כמ\"ש ז\"ל דאלמלא נכנס משרע\"ה לא\"י לא הי' נחרב ביהמ\"ק ולא היתה אומה ולשון שולטת בישראל, והגם שלא נגזרה גזרה עדיין. אבל מציווי השי\"ת אל ישראל התבונן אל הגזירה המוכנת עליו שלא יכנס לארץ וע\"כ צוח וויי.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 69,
      "char_length": 590,
      "timestamp": "2025-02-06T19:21:48.380344"
    },
    {
      "id": "beshalach1_p70",
      "text": "ויבואר ג\"כ המדרש הנ\"ל ויהי בשלח פרעה וגו' מי צווח ווי פרעה צווח ווי, בהקדם מ\"ש האוהחה\"ק (פ' שמות) עה\"פ ואת צעקתם שמעתי מפני נגשיו, דלכאורה הול\"ל ואת צעקתם מפני נגשיו שמעתי, דהצעקה הי' מפני נגשיו ולא השמיעה. ותירץ דלישראל עדיין לא נשלם זמן הגלות, אלא מפני שנתמלא סאתם של מצרים ליפרע מהם, שהרעו ונגשו את ישראל יותר מהמדה, וע\"כ רשעת הגוים גרם שנגאלו ישראל לפני הזמן, ואלולא רשעתם של הנוגשים לא היו ישראל ראוים עדיין להגאל, וז\"ש ואת צעקתם שמעתי מפני נגשיו עיי\"ש, ואפשר שזה המכוון בדברי המדרש ויהי בשלח פרעה את העם ולא נחם אלקים וגו' ושבו מצרימה, ומזה שפט פרעה כי עוד יבואו ישראל בשאר גליות, כי א\"א שיתקיים ושבו מצרים אלא ע\"י הגלות כנ\"ל והבין מזה כי עדיין לא נשלמה זמן שעבודם במצרים ויושלם בשאר גליות, וע\"כ התחרט על שהי' נוגש בהם יותר מדאי, וגרם בזה שיגאלו לפני השלמת זמן שעבודם, וזה שאה\"כ ויהפך לבב פרעה וגו' ויאמרו מה זאת עשינו ר\"ל בנגישה יותר מדאי, ובזה גרמנו כי שלחנו את ישראל מעבדנו, כי לולי כן לא היו ישראל ראוים עדיין שיגאלו, וא\"ש מ\"ש במדרש פרעה צווח ווי, אע\"פ דשמחו מצרים בצאתם, אבל עכשיו שראו דעדיין לא נשלם זמן הגלות, ע\"כ התחרטו על מה שגרמו במעשיהם וע\"י אכזריותם שיגאלו לפני הזמן, וע\"כ דרשוהו חז\"ל כאן בפ' ויהי בשלח ולא דרשו כן לעיל בפ' בא בעיקר סיפור היציאה ממצרים, דשם לא צווח פרעה ווי, ואדרבה שמחו מצרים בצאתם כי נפל פחדם עליהם. אבל כאן נתעורר להתחרט, מפני שראה שלא נשלם גלותם עדיין, והוא סייע ליציאתם ע\"י מעשיו כנ\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 70,
      "char_length": 1325,
      "timestamp": "2025-02-06T19:21:48.675181"
    },
    {
      "id": "beshalach1_p71",
      "text": "ואפ\"ל עוד באופן אחר בהקדם מ\"ד במד\"ר (פר' כ\"ג סי\"ב) אז ישיר משה וגו' משל לאשה שהיתה נדה, השלימה ימי נידתה וטבלה, א\"ל בעלה מי מעיד עליך שטהרת, אמרת לו הרי שפחתי מעידה שטהרתי לפני' וטבלתי, לכך נאמר את השירה הזאת נאים אנו לומר שירה לפניך שאין בנו טומאה, והרי המילה העידה עלינו שאנו טהורים לכך נאמר את השירה הזאת ואין זאת אלא מילה שנא' זאת בריתי אשר תשמרו ע\"כ. וראוי להבין דאין המשל דומה לנמשל דשם שפחתה מעידה עלי' שטבלה לפני' וטיהרה מטומאתה, אבל איך יהי' המילה עדות שישראל טהורים הן, ומה צד עדות יש בה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 71,
      "char_length": 498,
      "timestamp": "2025-02-06T19:21:49.336844"
    },
    {
      "id": "beshalach1_p72",
      "text": "ויובן עפ\"י דברינו (בפ' ויגש עמוד תי\"ב) עה\"פ והנה עיניכם הרואות פרש\"י שאני אחיכם שאני מהול ככם, והקשה הרמב\"ן והגו\"א ומה ראי' הוא זו, ואפשר שיהי' ערבי מהול או מבני קטורה, ופירשנו עפ\"י מ\"ש בזוה\"ק דהנוטר בריתו שריא עלי' שם שי\"ן דל\"ת יו\"ד: והפוגם בריתו ח\"ו שריא עלי' ס\"מ, ע\"כ במה שהראה להם המילה ראו שהוא צדיק אמת עיי\"ש, וכמו\"כ ישראל במצרים שאמרו בזוה\"ק דאסתמרו מנדה ובת אל נכר והיו שמורים מעריות, וחלק גדול היו נוטרי ברית, וע\"כ היתה המילה עדות שהם טהורים, דהי' שם הקדוש שורה עליהם, וא\"ש מ\"ש במדרש אין זאת אלא המילה, והרי המילה מעידה עלינו שאנו טהורים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 72,
      "char_length": 547,
      "timestamp": "2025-02-06T19:21:49.605556"
    },
    {
      "id": "beshalach1_p73",
      "text": "ואפשר שזה הפשט בפסוק והי' כי תמצאן אותו רעות רבות וצרות וענתה השירה הזאת לפניו לעד, ר\"ל שיתרעמו ישראל על הצרות הבאות עליהם, יהי' הברית מילה עדות עליהם אם הם טהורים ואין זאת אלא המילה כמ\"ש במדרש הנ\"ל, ואיתא בזוה\"ק פ' שמות (דף ט\"ו ע\"א) אמר הקב\"ה דלמא ח\"ו יתערבון ישראל בשאר עממין וכו' מה עבד קב\"ה טלטל להו עד דנחתו למצרים, והמצריים היו מבזין אותם ולא רצו להתחתן בם, וחשיבו להון עבדים אנשים מאסו בהן ונשים מאסו בהן וכו', וכד נפקו נפקו זרעין קדישין דכתיב שבטי ד' עדות לישראל ע\"כ, נמצא דזה הי' לטובתם וחסד מהשי\"ת שמאסו בהם המצרים, כדי שלא יתערב זרע ישראל בעכו\"ם ח\"ו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 73,
      "char_length": 561,
      "timestamp": "2025-02-06T19:21:49.889878"
    },
    {
      "id": "beshalach1_p74",
      "text": "ואפשר שזה הפשט שהיו המצרים מתחרטים על שעזרו להם בשמירת הברית, ע\"י שהתרחקו מהם ומאסו אותם, וע\"י כן ניצולו ישראל ובזכות זה נגאלו כמ\"ש במדרש, וז\"ש ויהפך לבב פרעה ועבדיו ויאמרו מה \"זאת\" עשינו, ר\"ל שגרמנו ע\"י מעשינו שיש להם עדות המילה הנקראת זאת, כמ\"ש זאת בריתי אשר תשמרו, ובזה גרמנו כי שלחנו את ישראל מעבדנו, ולא על עצם השחרור התחרטו כי היו מוכרחים ע\"ז, אחרי שהוכו מכות גדולות, אבל התחרטו על שגרמו זאת במעשיהם ע\"י שמאסו בהון. ובזה יובן מה שדרשו במדרש כאן דפרעה צווח ווי, דמתחלה בשעת יציאתן שמחו המצרים, כמ\"ש שמח מצרים בצאתם כי נפל פחדם עליהם, אבל עתה ראה כי עדיין לא נשלמה זמן גלותם, ונגאלו רק ע\"י זכות שמירת הברית, כמ\"ש במדרש שזו א' מד' דברים שבזכותן נגאלו ישראל, והם גרמו זאת ע\"י שהיו מרוחקים מהם, ועי\"ז הי' להם כח לעמוד בנסיונות, והתחרט פרעה ע\"ז וצווח ווי.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 74,
      "char_length": 755,
      "timestamp": "2025-02-06T19:21:50.193260"
    },
    {
      "id": "beshalach1_p75",
      "text": "והנה אמרו ז\"ל במדרש ילקוט (רמז רמ\"א) מנין לתחה\"מ מן התורה שנא' אז ישיר שר לא נאמר אלא ישיר, וכן איתא בזוה\"ק אז ישיר שר מבעי' ליה, אלא מלה דא תליא וכו' ולזמנא דא זמינין ישראל לשבחא שירתא דא, תנינן משה זמין למימר שירתא לזימנא דאתי, דכתיב כימי צאתך מאמ\"צ אראנו נפלאות, אראנו כתיב למאן דחמו בקדמיתא יחמי לי' תנינות ע\"כ, מבואר דמשרע\"ה עתיד לומר שירה עם ישראל לע\"ל, ואפשר דע\"כ כתוב אז ישיר, דאז הוא לשון עבר וישיר לשון עתיד, לפי שמשרע\"ה בשעה שאמר שירה הי' מדבק עצמו בבוי\"ת, ואצלו ית' העבר וההו' והעתיד הכל ברגע א', וע\"כ אמר מיד שירה בבחי' דלעתיד, וא\"ש מ\"ש כאן לשון עבר ועתיד, כי השתמש משרע\"ה בב' הבחינות גם יחד, ואמרו חז\"ל במס' סנהדרין (צ\"ט ע\"א) כי יום נקם בלבי ושנת גאולי באה, א\"ר יוחנן ללבי גליתי לאבריי לא גליתי וכו' וחכמי אמת מפרשים דישנם נשמות צדיקים שהם בבחי' ליבא להם נתגלה סוד הגאולה, ואלו שהם בבחי' פומא לא נתגלה להם, ומשה רבינו השיג סוד הגאולה ובחינתו, וע\"כ אמר שירה בבחי' הגאולה העתידה, אבל בחי' זו עלה בלבו, שהכניס עצמו לבחי' ליבא להשיג בחינת הגאולה, וזה שפרש\"י אז כשראה הנס (השיג ג\"כ בחי' הנס דלעתיד בעת הגאולה), ועלה בלבו שישיר שירה מיד, בבחינת גאולה העתידה, וז\"ש במדרש מכאן לתחיית המתים מן התורה, דהשירה היתה גם אז בבחי' העתיד.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 75,
      "char_length": 1136,
      "timestamp": "2025-02-06T19:21:50.606882"
    },
    {
      "id": "beshalach1_p76",
      "text": "עוד אפ\"ל בביאור המדרשים והדקדוקים הנ\"ל בהקדם מ\"ד בילקוט (רמז רל\"ג) והוא במכילתא ובתרגום יוב\"ע, ד' כתות נעשו ישראל על הים, אחת אומרת נפול לים, וא' אומרת לחזור למצרים ואחת אומרת נעשה מלחמה כנגדן, וא' אומרת נצווח כנגדן, זו שאומרת נפול לים נאמר להם התיצבו וראו וגו' זו שאומרת נחזור למצרים נאמר להם כי כאשר ראיתם את מצרים היום לא תוסיפו לראותם וגו' וכו' עיי\"ש. לכאורה קשה להבין מה היתה סברת אותן שאמרו נחזור למצרים, וכי לא סבלו די צרות ושעבוד ומאסר כ\"ז היותם במצרים, ועכשיו שיצאו משם בנסי נסים מדוע רצו לחזור ומה ירויחו בזה. וכמו\"כ אותן שאמרו נפול לים מה ירויחו בזה, וכן ראוי להבין סברת האומרים נצווח קדמיהון, מה יועילו בצווחה נגד חיל כבד וגדול וצ\"ב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 76,
      "char_length": 645,
      "timestamp": "2025-02-06T19:21:51.211272"
    },
    {
      "id": "beshalach1_p77",
      "text": "ב) במדרש (הובא בישמח משה) ויאמר ד' מה תצעק אלי אמר הקב\"ה למשה הים סוער והשונא רודף ואתה עומד ומרבה בתפלה לפני, אמר לו משה מה לי לעשות, אמר לו ואתה הרם את מטך, באותה שעה אמרו ישראל ד' ימלוך לעולם ועד, עכ\"ד המדרש: והוא תמוה מאוד.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 77,
      "char_length": 227,
      "timestamp": "2025-02-06T19:21:51.610140"
    },
    {
      "id": "beshalach1_p78",
      "text": "ג) בילקוט (רמז רמ\"א) בשם מדרש אבכיר וירא ישראל את היד הגדולה וגו' בשעה שבקש הקב\"ה להטביע את מצרים עמד עוזא שר של מצרים לפני הקב\"ה, ואמר לפניו רבש\"ע נקראת צדיק וישר ואין לפניך לא עולה ולא משוא פנים ולא מקח שוחד למה אתה רוצה להטביע מצרים, כלום הטביעו בני מבניך או הרגום מהם, בשביל ששעבדו בהן אתה רוצה לטבען וכו' באותה שעה כנס הקב\"ה כל פמליא של מעלה ואמר להם הוו דנין ביני ובין עוזא שר של מצרים וכו', באו בני כגרים ושעבדו בהם שעבוד קשה וכו', שלחתי להם משה ואהרן עבדי וכו' והשיב לשלוחי לא ידעתי את ד' וגומר, כיון שכפר בי שלחתי לו עשר מכות ולא הועלתי, וכ\"כ כפר בו והוסיף לשעבד את בנו, ולאחר שהודעתי לו את כוחי וגבורתי שלח בעל כרחו ועכשיו רדף אחריהם להחזירם לשעבוד, מי עשה כזה ולא הבין אינו ראוי לטבעו בים הוא וכל חילו. השיבו לו כל פמליא של מעלה הדין עמך ועשה מה שאתה חפץ וכו' לכאורה קשה איך אפשר לטעון לפני הבוי\"ת שקר מוחלט כזה כלום טבעו בני מבניך, והלא מפורש בפסוק שגזרו כל הבן הילוד היאורה תשליכוהו, ומבואר במד\"ר פ' ויחי (פצ\"ז ס\"ה) ס' רבוא תינוקות עיברו נשותיהן של ישראל בלילה א' וכולן הושלכו ליאור וכו' וכן איתא בפרד\"א שהושלכו ליאור, והי' היאור פולט אותם למדבר בדרך נס. ולפי\"ז הי' מגיע להטביעם בים מדה כ\"מ, ואיך החציף לדבר טענה מזויפת כזה כלום טבעו בני מבניך, וביותר קשה מה שלא הכחיש הבוי\"ת טענתו המוכחשת, אלא השיב לו טענה אחרת לפי שכפר בי וכו' ורדף אחריהם להחזירם, מי עשה כזה ולא הבין אינו ראוי לטבעו בים הוא וכל חילו, וקשה וכי זו בלבד הי' בו שלא הבין, והרבה יותר מזה עשה שהטביע את ישראל, ומגיע לו עונשו מדה כנגד מדה וצ\"ב, וכבר ביארנו בזה (בדברנו פ' שמות) ועוד לאלקי מילין.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 78,
      "char_length": 1472,
      "timestamp": "2025-02-06T19:21:51.774506"
    },
    {
      "id": "beshalach1_p79",
      "text": "ואפ\"ל בהקדם מ\"ד במכילתא (והובא ברש\"י עה\"ת) עה\"פ ויקח שש מאות רכב בחור, משל מי היו הבהמות שהיו טוענות המרכבות, אם תאמר משל מצרים היו והלא כבר נאמר וימת כל מקנה מצרים, וא\"ת משל פרעה היו, והלא כבר נאמר הנה יד ד' הוי' במקנך וגומר, וא\"ת משל ישראל היו והלא כבר נאמר וגם מקננו ילך עמנו לא תשאר פרסה, אלא משל מי היו, של הירא את דבר ד', נמצינו למדין המקנה שהניס הירא את דבר ד' הם היו תקלה לישראל עכ\"ל המכילתא. נראה מזה שהירא את דבר ד' היו מרובים במספרם עד שהספיקו בבהמותם לכל חיל מצרים כל סוס רכב פרעה ופרשיו, ומבואר בזוה\"ק ויקח שש מאות רכב בחור לקבל מנינא דישראל, וכל רכב מצרים לקבל הטף, ובמכילתא איתא שהוציא פרעה ג' מאות מצרים למלחמה כנגד כל א' ואחד מישראל, הרי שהי' חיל כבד ורב מאוד, ולכולם הספיקו בהמותיהם של הירא דבר ד', שהרי ממקנה מצרים לא נשאר כלום, דכתיב וימת כל מקנה מצרים. וז\"ש במכילתא דהם היו תקלה לישראל, דאילולא הם לא היו יכולין המצרים להוציא מחשבתם הרעה אל הפועל ולרדוף אחרי בני ישראל, וגם זה מעצת ותחבולות השטן אשר זמם מתחילה להקים יראי ד' מהמצרים, ולהשתמש בהם אח\"כ לכלי מלחמתו לרדוף אחר בני ישראל, כדי להביאם לידי נסיון באמונתם, וכן אנו רואים בימינו אלה שמעמיד השטן כתות ומפלגות שונות, ובתוכם גם אלו שנראים ומתדמים ליראי ד', ואח\"כ מסתייע בהם ועל ידם לגמור דרכי הסתתו כנודע בעוה\"ר.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 79,
      "char_length": 1187,
      "timestamp": "2025-02-06T19:21:52.521142"
    },
    {
      "id": "beshalach1_p80",
      "text": "אמנם לכאורה קשה להבין מה היתה סברת אותן הירא דבר ד' שמלאה לבם להתחבר אל פרעה ומצרים לרדוף אחרי ישראל, והרי עכ\"פ הי' בהם איזה בחי' יראה חיצוניות מחמת יראת העונש, כמו שהעיד עליהם הכתוב לעיל בפ' וארא, הירא ואת דבר ד' מעבדי פרעה הניס את עבדיו ואת מקנהו וגו' ואשר לא שת לבו אל דבר ד' ויעזוב את עבדיו וגו', מכלל דאלו שתו לבם וכו'. ואם יראו למקניהם איך לא יראו לנפשותם לרדוף אחר בני ישראל, בידעם שמעשה זו נגד רצון הבוי\"ת, והתרה בהם ע\"י משה ואהרן בכמה התראות והכו במכות הרבה בשביל לשלח את ישראל, ואיך מלאה לבם עכשיו לרדוף אחריהם ולהחזירם, הגם שהקשה ד' את לבבם, אבל צריך שיהי' להם איזה אמתלא וסברא במה לתלות שגיונם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 80,
      "char_length": 606,
      "timestamp": "2025-02-06T19:21:53.115401"
    },
    {
      "id": "beshalach1_p81",
      "text": "ואפשר לתרץ כל הענין בהקדם קושית האוהחה\"ק עה\"פ ויהפך לבב פרעה ועבדיו וגו' ויאמרו מה זאת עשינו כי שלחנו את ישראל מעבדינו, דהדברים תמוהים וכי לרצונם עשו ושילחו, והלא הוכו מכות גדולות עד אשר כמעט ספו תמו ובעכ\"ח שילחום, ואיך נהפך לבם בדבר שלא הי' לרצונם מתחלה, ורצונם עתה כרצונם מאז, ולא הי' כאן שינוי והתהפכות ברצון לבם כלל, גם קשה מ\"ש מה זאת עשינו כי שלחנו, משמע שהם ב' דברים העשי' לבד והשליחות לבד. ובאמת לא הי' כאן אלא חדא והול\"ל מה זאת שלחנו את ישראל, וכבר ביארנו בזה ועוד לאלקי מילין.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 81,
      "char_length": 485,
      "timestamp": "2025-02-06T19:21:53.425565"
    },
    {
      "id": "beshalach1_p82",
      "text": "ואפשר דפרעה והמצריים אחרי שהוכו בעשר מכות והוכרחו לשלח את ישראל, התחכמו בתחבולות כי לא טוב הדרך והאמצעים אשר השתמשו בהם ללחוץ את ישראל ולהכניעם תחת ידם, מסיבת יראתם פן ירבה ונוסף גם הוא על שונאינו ונלחם בנו כמאמה\"כ, וראו והשיגו שלא הצליחו בתחבולותם להגיע המטרה, ותלו סיבת אי הצלחתם מחמת שגזרו עליהם גזירות אכזריות לגופם ולנפשותם, להשליך זכוריהם ליאור ולרומסם בטיט הבנין, גם מנעום מלקיים מצות ד' אלקיהם, אשר שלח ע\"י משה ואהרן שלח את עמי ויחוגו לי במדבר, דרך שלשת ימים נלך ונזבחה לד' וגו' ואיתא במדרש דם למה הביא עליהם לפי שלא הניחו את בנות ישראל ליטבול מטומאתן, ועוד הרבה אשר הרעו והצרו לישראל. ועל שעשו כל אלה קינא ד' אלקיהם בשביל עמו ומצותיו, והוציאם מתחת ידם ביד חזקה ובמכות גדולות ונפלאים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 82,
      "char_length": 692,
      "timestamp": "2025-02-06T19:21:53.679843"
    },
    {
      "id": "beshalach1_p83",
      "text": "ואפשר שהירא דבר ד' שהיו במצרים לא השתתפו עמהם להטביע את ילדי ישראל. וכמו\"כ לא הסכימו להצטרף עמהם בשאר הגזירות, אבל לא מצד מדת הטוב אשר בטבעיותם נמנעו מזה, אולם רצונם ומחשבותם הי' ג\"כ לרעה על ישראל, רק שהי' שונה ומשונה דרכי רשעתם משל פרעה ומצרים, שרצו להשיג אבדון אומה הישראלית ח\"ו ע\"י התחברות, ובאופן שלא ירעו להם ולא ילחצום, אלא אדרבה יניחום לקיים דתם, וייטיבו להם עד שיתחברו עמהם להיות לעם אחד, ואח\"כ ימשכו אחריהם לעשות כתועבת מצרים, עד שישקיעום בטומאת מצרים ח\"ו ולא יכלו לצאת משם לעולם, ככה הי' דעתם והשקפתם של היראי ד' שבמצרים, אלא שלא הי' כח השלטון והממשלה בידם למנוע הגזירות. ועכ\"פ לא השתתפו בקיום גזירותיו של פרעה. ואפשר דעכשיו כשראה פרעה ואנשיו שהוכרחו לשלוח את ישראל בעל כרחם, התנחמו על אופן מעשיהם וגזירתם על ישראל, באשר ראו כי לא הצליחו בדרך הזה, ע\"כ התחכמו וחשבו לאחוז בשיטתם של היראי ד' לכבוש את ישראל על ידי ההתחברות, ועל דעת כן רדפו אחר ישראל להחזירם למצרים, ולא חשבו להיצר ולהרע להם כאשר בתחילה, כי עוד זכרו את ידו החזקה של הקב\"ה עליהם ואת המכות אשר הכו, אלא שלפי דעתם המטופשת דימו שבאופן זה לא יהי' עליהם הקצף מאת ד', וע\"כ התחברו עכשיו לעצתם ודעתם של היראי ד' שביניהם לתפוס בשיטתם, ויחדיו רדפו אחרי ישראל להחזירם לארצם ולהטיב להם ולהניחם לקיים אמונתם, ובדרך זה להדיחם ע\"י התחברות עד שימשכו אחריהם לעשות כמעשיהם ויתערבו עמהם להיות לעם אחד.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 83,
      "char_length": 1255,
      "timestamp": "2025-02-06T19:21:54.053461"
    },
    {
      "id": "beshalach1_p84",
      "text": "ובזה יתיישבו הדקדוקים הנ\"ל בפסוק ויהפך לבב פרעה ועבדיו וגו', שנהפך לבבם ודעתם ושיטתם, וזה אומרו לבב פרעה ולא אמר לב פרעה ועבדיו, כי לשון לבב מורה על ב' הלבבות היצה\"ר הוא כח המסית והיצה\"ט, כי שניהם נהפכו להם מקצה אל הקצה, כי עד עכשיו הכח המסית אשר להם הסיתם להרע ולהציר לישראל, והיצ\"ט יעצם למנוע מזה, ועכשיו נתהפכו שניהם, כי היצה\"ר הסיתם להטיב לישראל כדי להביאם לידי התחברות כנ\"ל, והיצה\"ט השיאם שיחדלו מזה. וז\"ש מה זאת עשינו ר\"ל שהתחרטו על אופן מעשיהם, דעי\"ז נסתבב כי שלחנו את ישראל מעבדינו בעכ\"ח, וע\"כ ויאסור את רכבו ואת עמו לקח עמו, ולקח את היראי ד' ומרכבותיהם ושמם בראש חיילותיו להיות המנהיגים, ואת עמו לקח עמו להיות נטפלים אליהם, ולילך אחר עצתם ובשיטתם הנזכר.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 84,
      "char_length": 662,
      "timestamp": "2025-02-06T19:21:54.638400"
    },
    {
      "id": "beshalach1_p85",
      "text": "ועד\"ז אפ\"ל דברי הילקוט הנ\"ל (קושיא ג') שטען עוזא שר של מצרים כלום הטביעו בני מבניך או הרגו מהם, ואפשר שהי' כוונת טענתו להציל עכ\"פ היראי ד' שהי' חלק גדול ועם רב כמ\"ש לעיל ולפי שהם לא הטביעו את ישראל ולא השתתפו בקיום גזירתו של פרעה, למה יענשו גם הם בעונש הטביעה עם המצריים, ועל טענה זו לא הכחישו הבוי\"ת, כי עצם הטענה לא היתה מזוייפת, והאמת כן הי' שלא הטביעו את ישראל ולא הרגו מהם, אלא שאעפ\"כ מגיע להם מדת ענשם להיות נטבעים עם המצרים לפי שנתחברו אליהם לרדוף אחר ישראל, ומבואר באבות דר\"נ (פרק ל') ר\"ע אומר כל המדבק בעוברי עבירה, אע\"פ שלא עשה כמעשיהם ה\"ז מקבל פורעניות כיוצא בהם, וזה שהשיב לו הבוי\"ת שפרעה כפר בו ואמר לא ידעתי את ד', ושלחתי עליו עשר מכות ועדיין כפר בי, מי עשה כזה ולא הבין אינו ראוי לטבעו בים וכו', ר\"ל דלא יועיל להם הצטדקות והתנצלות על מה שהתחברו למצרים, שהי' להם להבין אחרי שכל כך כפרו בי לא הי' להם להתחבר עמהם, וע\"כ מגיע להם להיות נמדד להם כמידתם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 85,
      "char_length": 863,
      "timestamp": "2025-02-06T19:21:54.988586"
    },
    {
      "id": "beshalach1_p86",
      "text": "ומעתה נבין סברת הכתות המובא במכילתא הנ\"ל, ואפשר דכת א' שבישראל האומרת נחזור למצרים, המה טעו ונתנו האמנה ליראי ד' שבמצרים, וחשבו שכיון שהמה הרודפים אחריהם, ופרעה וכל מצרים הולכים בעצתם, מעתה טוב להם לחזור למצרים ויוכלו לקיים שם מצות ד' באין מפריע גם לא יגזרו עליהם עוד גזירות קשות ואכזריות, באשר שנשתנה תהלוכי המלוכה לאחוז בשיטתם של היראי ד', וע\"ז השיב להם משרע\"ה שאל תטעו להתדמות שהיראי ד' רוצים בטובתכם, אבל הם כהמצרים והמצריים כמותם וכולם שווים לרעה, וכמאמרם ז\"ל (תנחומא פ' וארא) כשר שבמצרים הרוג: וז\"ש להם כאשר ראיתם את מצרים היום לא תוסיפו לראותם עוד עד עולם, כלל כולם כא', ואין נפק\"מ בין אלו לאלו, וכולם מצרים ורשעים הם. ואותן הכת שאומרת נפול לים היו יראים מאוד מגודל ההיזק הנגרם לנפש ע\"י ההתחברות עם רשעים, וצריך זהירות הרבה להתרחק מן הצבועים המה היראי ד' יותר מהרשעים שביניהם, וגדול המחטיאו יותר מההורגו, ע\"כ אמרו יותר טוב שנפיל עצמינו לתוך הים מלהיות נתפס לתועבותם. ולכת זו השיב משה רבינו ע\"ה אל תיראו התיצבו וראו את ישועת ד' וגו', כי לא יצליחו במועצתם וכולם יטבעו בים. ולא יחטיאו אתכם עוד. ואותן הכת האומרת נצווח כנגדן, הי' טענתם שאנו נחזירם למוטב ע\"י ההתחברות, במה שנצווח קדמיהון ונאמר להם דברי מוסר, ואין חשש קלקול דכבר הם רוצים להכנע מפנינו וישמעו לנו. והשיב להם משרע\"ה ד' ילחם לכם ואתם תחרישון, כי לא תוכלו להתגבר עליהם אלא בעזר השי\"ת, כי קשה להנצל מהצבועים יותר מאלו המראים רשעתם בגלוי.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 86,
      "char_length": 1300,
      "timestamp": "2025-02-06T19:21:55.424173"
    },
    {
      "id": "beshalach1_p87",
      "text": "וז\"ש להם כי כאשר ראיתם את מצרים היום לא תוסיפו עוד לראותם עד עולם, ובתרגום כמא די חזיתון ית מצראי יומא דין לא תוספון למחזיהון וכו', ולכאורה מנפק\"מ אם כמא די חזיתון או באופן אחר, והול\"ל לא תוסיפו לראותם ודי בזה, וכאשר ראיתם מיותר וצ\"ב עו\"ק דבזוה\"ק הקשה ר' ייסא כתיב לא תוסיפו לראותם עוד עד עולם, והכתיב וירא ישראל את מצרים מת וגו', ותירץ א\"ר יוסי מתין חמון להון ע\"כ, ור\"ל דהא דכתיב לא תוסיפו לראותם היינו בחייהון לבד, וק\"ז היש\"מ זלל\"ה מביא קושיא בשם תשובת בית יעקב ממ\"ש התוס' כתובות (פ\"ג ע\"א) דעד עולם פירושו בין בחייהון ובין במיתתם, וא\"כ הכא נמי כתיב לא תוסיפו לראותם עוד עד עולם והדרא קושית הזוה\"ק לדוכתי', עו\"ק לפי\"ד הזוה\"ק דבא הכתוב לאסור ראייתם של מצרים, הו\"ל להכתוב לפרש דלא נאסרו אלא מצרים אלו, אבל לא דורות שלאחריהם, ובודאי אין שום איסור לראות מצרי הנעקר משם ובא למדינה אחרת, והכתוב אומר דור שלישי יבוא להם בקהל ד', וא\"כ למה סתם הכתוב לא תוסיפו לראותם עוד עד עולם, דמשמע דהאיסור על כל המצריים עד דורות עולם, ולא הו\"ל לסתום אלא לפרש וצ\"ע.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 87,
      "char_length": 944,
      "timestamp": "2025-02-06T19:21:56.106980"
    },
    {
      "id": "beshalach1_p88",
      "text": "ולדרכנו אפ\"ל דכ\"ז נכלל במאמר הכתוב כי כאשר ראיתם את מצרים היום לא תוסיפו לראותם וגו' אפקי' קרא למעוטי דרק לבחי' מצרים כאלו כאשר ראיתם אותם היום, וכמ\"ש התרגום כמא די חזיתון יתהון יומא דין, ה\"ה באיסור דלא תוסיפו לראותם עוד עד עולם ובאמת לא היו עוד מיום ההוא ועד עולם בחי' מצרים כאלו, המתדמים ליראי ד' בחיצוניותם, וסכנה גדולה לישראל התחברותם להיות נשקעים על ידם לתועבת וטומאת מצרים. ומבואר בדברי הילקוט הנ\"ל שפסוק הזה אמרה משרע\"ה כנגד הכת שבישראל שאומרת נחזור למצרים ורצו להתחבר עמהם, ובודאי לא רצו להתחבר עם רשעי מצרים שהיו מצירים להם כל ימות גלותם במצרים, כי לא יעלה על לב בר דעת לחשוב ככה, אלא כלפי אותן המתדמין ליראי ד' הי' כוונתם כמ\"ש לעיל, וע\"ז היתה הצווי עליהם מפי משרע\"ה כאשר ראיתם את מצרים היום, דבחי' מצרים כאלו לא תוסיפו לראותם עוד עד עולם שיש סכנה גדולה בדבר. ובאמת לא הי' עוד בחי' מצרים כאלו מן היום ההוא והלאה, ואלו נטבעו בים ומתו ולא הי' עוד בהם היזק ראי', ושאר המצרים המתגלים ברשעותם לא נאסרה ראייתם, דהוציא הכתוב לומר כאשר ראיתם את מצרים היום וגו' דרק בבחי' זו נאסרה ראייתם. וא\"ש תירוץ הזוה\"ק מתין חמון להון, ול\"ק ממה דכתיב וירא ישראל את מצרים מת, דגלי לן קרא דרק בבחי' זו נאסרה ראייתם משום סכנה דאמשוכי אבתרייהו: אבל מתין חמין להון דליכא בהן היזק ראי'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 88,
      "char_length": 1167,
      "timestamp": "2025-02-06T19:21:56.594064"
    },
    {
      "id": "beshalach1_p89",
      "text": "ויובן דברי המד\"ר בריש הפרשה מי צווח ווי פרעה צווח ווי, משל למלך שהי' בנו הולך למדינה אחד וכו' כך פרעה אמר כשהיו ישראל אצלי הי' הקב\"ה משלח לי אגרת בכל שעה, כה אמר ד' שלח עמי וגו' כשהוציא הקב\"ה את ישראל התחיל פרעה צועק ווי ששלחתי את ישראל, וצ\"ב דאין המשל דומה לנמשל, דכל אותן השליחות שקבל פרעה היו התראות על המכות, ולא של כבוד היו, ולמה הי' משתוקק אליהן עד שצווח ווי, עוד קשה דמתחלה בשעת יציאתם שמחו מצרים דכתיב שמח מצרים בצאתם כי נפל פחדם עליהם, ואיך נתהפכה שמחתם לתוגה ואיך אזלא הפחד מהם פתאום. ולדרכנו א\"ש כי התחכם פרעה והתנחם כי עונש כל המכות אשר באו עליהם, הי' בעבור כי התנהג עם ישראל באכזריות גם מנעם מלקיים דתם והמרה פי שלוחי השי\"ת, וכפר בהקב\"ה לומר לא ידעתי את ד', אבל עכשיו חשב לילך בדרך יראי ד' שבמצרים להיות מודה, במקצת ומתדמה ביראה חיצונית, והתחרט על מעשיו הראשונים שהם גרמו לו שהוכרח לשלחם בעכ\"ח ודימה דאלמלי לא הי' מתעקש נגד שליחות ד' לשלח את ישראל דרך ג' ימים לזבוח במדבר לעבוד את לא הי' עליו הקצף הגדול להכותו ואת עמו במכות נפלאים עד שהוכרח לשלחם לגמרי, וע\"כ התחרט והתנחם דהי' יותר טוב אם הי' מניחם דרך ג' ימים והיו באים בחזרה, ואח\"כ בכל פעם שהי' הקב\"ה רוצה שילכו לזבוח לפניו, הי' משלח אגרות ושליחות לפרעה כה אמר ד' שלח את עמי ויחוגו לי במדבר, ובתוך כך יוכל לשלוט בהם ויהיו נתפסים ברשתם תועבת וטומאת מצרים, אילולי הוציאם הקב\"ה משם ביד חזקה, וע\"ז הי' פרעה מתחרט וא\"ש שהשתוקק לאותן האגרות והשליחות ויובן ענין המשל בדרך זה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 89,
      "char_length": 1334,
      "timestamp": "2025-02-06T19:21:57.140172"
    },
    {
      "id": "beshalach1_p90",
      "text": "ועתה נבאר דברי המדרש הנ\"ל (בקושיא ב') ויאמר ד' מה תצעק אלי, אמר הקב\"ה למשה הים סוער והשונא רודף ואתה עומד ומרבה בתפלה וכו' באותה שעה אמרו ישראל ד' ימלוך לעולם ועד וצ\"ב. ויתבאר בהקדם דברי המד\"ר (פכ\"א ס\"ג) ויאמר ד' אל משה מה תצעק אלי הה\"ד (ישעי' ס\"ה) והי' טרם יקראו ואני אענה וגו' כל מי שהוא עושה רצון המקום ומכוין את לבו בתפלה שומע לו בעוה\"ז וכו' שנאמר והי' טרם יקראו ואני אענה בעוה\"ז ולעתיד לבא עוד הם מדברים ואני אשמע וכו' לכך א\"ל הקב\"ה למשה א\"כ מה תצעק אלי טרם יקראו ואני אענה עכ\"ד המדרש, וכתב היפ\"ת דבכוונת הלב די לצדיקים ולא צריכים צעקה, וזה רק לצדיקים וחסידים גדולים, אבל מתי העם צריכים ביטוי שפתים שתשמענה אזניהם מה שהם מדברים עכ\"ל. אמנם לכאורה קשה על דברי המדרש הנ\"ל דאדרבה מבואר בדברי חז\"ל בכ\"מ דהקב\"ה מתאו' לתפלתן של צדיקים. כאמרז\"ל (יבמות דף ס\"ד ע\"א) למה היו אמותינו עקרות מפני שהקב\"ה מתאו' לתפלתן של צדיקים. וכן איתא במד\"ר כאן בפ' בשלח (פכ\"א ס\"ה) באותה שעה היו ישראל עומדים ולא היו יודעים מה לעשות, והי' הים סוגר והשונא רודף והחיות מן המדבר וכו' ולמה עשה הקב\"ה להם כך. אלא שהי' הקב\"ה מתאוה לתפלתן וכו', מה עשה גירה לפרעה לרדוף אחריהם שנא' ופרעה הקריב, מיד ויצעקו בנ\"י אל ד', באותה שעה אמר הקב\"ה לכך הייתי מבקש לשמוע קולכם שנא' (שה\"ש ב') יונתי בחגוי הסלע וגו' השמיעני את קולך וגו' עכ\"ד המדרש, וא\"כ צ\"ב להבין דברי המדרש הנ\"ל שא\"ל הקב\"ה למשה מה תצעק אלי טרם יקראו ואני אענה, אדרבה הרי הקב\"ה מתאו' לתפלתן של ישראל",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 90,
      "char_length": 1320,
      "timestamp": "2025-02-06T19:21:57.772267"
    },
    {
      "id": "beshalach1_p91",
      "text": "ויתבאר בהקדם דברי הגמ' תענית (דף כ\"ה ע\"ב) שמואל הקטן גזר תעניתא וירדו להם גשמים קודם הנץ החמה, כסבורין העם לומר שבחו של צבור הוא, (פרש\"י שעדיין לא קראו ונענו) אמר להם אמשול לכם משל למה\"ד לעבד שמבקש פרס מרבו, אמר להם תנו לו ואל אשמע קולו שוב שמואל הקטן גזר תעניתא וירדו להם גשמים לאחר שקיעת החמה, כסבורים העם לומר שבחו של צבור הוא, א\"ל שמואל לא שבחו של צבור הוא, אלא אמשול לכם משל למה\"ד לעבד שמבקש פרס מרבו, ואמר להם המתינו לו עד שיתמקמק ויצטער ואח\"כ תנו לו, לשמואל הקטן שבחו של צבור היכי דמי. אמר משיב הרוח ונשב זיקא אמר מוריד הגשם ואתא מיטרא עכ\"ל הגמ'. והקשה בערבי נחל (ר\"פ וארא) אע\"ג דבאמת נוכל לומר איפכא. דבעובדא קמייתא שנענו מיד לפני התענית, הי' מפני שריחם ד' עליהם שלא יתמקמק בשרם, וכעין דמצינו ברב יהודה כי הו' שרא חד מסאנא הו' אתי מטרא, ובעובדא בתרייתא שלא נענו עד לאחר שקיעת החמה, יש לומר מפני שהקב\"ה מתאו' לתפלתן, וא\"כ מדוע הכריח שמואל הקטן בשניהם דלאו שבחו של צבור הוא. ותירץ דמ\"מ אם איתא דהו' שבחו של צבור, הי' השי\"ת נותן הבקשה באופן דליכא למטעי לחושדם בחוטאים, לכן אמר בבירור שאינו שבחו של צבור, והשלם בתכלית השלימות לפני השי\"ת יתן לו השי\"ת משאלתו בשעת התפלה ממש, כמ\"ש אמר משיב הרוח ונשב רוחא מוריד הגשם ואתי מטרא. אם לא בצדיק מפורסם שאין לחושדו כההוא דרב יהודה שנענה מיד או כההוא דר\"נ שמצינו שמתאו' לתפלתו, יעיי\"ש שהאריך לדרכו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 91,
      "char_length": 1241,
      "timestamp": "2025-02-06T19:21:58.409011"
    },
    {
      "id": "beshalach1_p92",
      "text": "ועד\"ז אפשר לפרש דברי המדרש הנ\"ל בהקדם מ\"ד במד\"ר להלן (פרשה כ\"א סימן ח') ר' אליעזר אומר א\"ל הקב\"ה למשה עת לקצר ועת להאריך, בני שרוים בצער והים סוגר והאויב רודף ואתה עומד ומרבה בתפלה דבר אל בני ישראל ויסעו, עוד איתא במד\"ר (פ' כ\"א סימן ב') א\"ל הקב\"ה למשה מה אתה צועק, גזור ואני אעשה שנא' ותגזר אומר ויקם לך, ואפ\"ל דאה\"נ דהקב\"ה מתאו' לתפלתן של צדיקים, אבל כאן היו ישראל שרוים בצער ובסכנה הים סוגר והאויב רודף, והיו המצרים רודפין אחריהם להטעותם שיחזרו לטומאת מצרים, וכבר היו כתות בישראל שהטעו אחריהם ואמרו נחזור למצרים כמבואר במכילתא ובתרגום יוב\"ע, וכמו שביארנו לעיל שהאמינו ליראי ד' שבין המצריים ורצו לחזור, וע\"כ הי' הסכנה גדולה שלא ימשכו אחריהם, ובכגון הא אין העת מוכשר להאריך בתפלה, ואע\"ג דהקב\"ה מתאו' לתפילתן של צדיקים ולתפילתן של ישראל, אבל לא במקום דאיכא למטעי ובמקום דאיכא חשש קלקול, וז\"ש במדרש הנ\"ל אמר הקב\"ה למשה עת לקצר ועת להאריך, הים סוגר והאויב רודף ואתה עומד ומרבה בתפלה, דבר אל בנ\"י ויסעו דבכגון הא עת לקצר כיון דאיכא חשש קלקול כנ\"ל. וז\"ש במדרש מה תצעק אלי הה\"ד טרם יקראו ואני אענה, אבל לע\"ל עוד הם מדברים ואני אשמע, דלעתיד לא יהי' עוד חשש קלקול כזה, שתמלאה הארץ דיעה ויתמו חטאים מן הארץ, ואז יהי' עת להאריך בתפלה דהקב\"ה מתאו' לתפילתן של ישראל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 92,
      "char_length": 1154,
      "timestamp": "2025-02-06T19:21:59.042629"
    },
    {
      "id": "beshalach1_p93",
      "text": "ובזה יבואר המדרש הנ\"ל (הובא בישמח משה) ויאמר ד' מה תצעק אלי, אמר הקב\"ה למשה הים סוער והשונא רודף ואתה עומד ומרבה בתפלה, א\"ל משה ומה עלי לעשות, א\"ל ואתה הרם את מטך, באותה שעה אמרו ישראל ד' ימלוך לעולם ועד, ויובן בהקדם מ\"ד במכילתא ר' יוסי הגלילי אומר אלו אמרו ישראל על הים ד' מלך לעולם ועד, לא היתה אומה שולטת בהן לעולם, אלא אמרו ד' ימלוך לעולם ועד לעתיד לבוא עכ\"ל, ולכאורה באמת למה אמרו כן, אבל כל השירה הזאת ברוה\"ק נאמרה מפי משרע\"ה וכל ישראל, והרוה\"ק גילה להם שעדיין לא הגיע זמן תיקון השלימות שיהי' התגלות כבוד מלכותו ית' מיד, וע\"כ אמרו ד' ימלוך לע\"ל, ואיתא בירושלמי פרק אין עומדין, המיצר אסור להתפלל, לא מסתברא אלא מהדין קרא דכתיב שמעי נא זאת עני' ושכורת ולא מיין, וכתבו התוס' במס' עירובין (ס\"ה ע\"א) דמה\"ט אל יתפלל דהוי שכור מתוך שטרוד בצרתו ובכעסו, וכעין שאמרז\"ל (עירובין דף ס\"ה ע\"א) יכול אני לפטור את כל העולם מדין תפלה שנאמר (ישעי' נ\"א) שכורת ולא מיין, אבל לעת\"ל יהי' נס יגון ואנחה, אז נוכל להתפלל והקב\"ה יתאוה לתפלתן של ישראל, וע\"כ לפי שאמר הקב\"ה למשה לא עת להאריך בתפלה ואתה הרם את מטך וגו', מזה ראו ישראל שעדיין לא הגיע זמן תיקון השלם, דאז אדרבה יהי' עת להאריך והקב\"ה יהי' מתאוה לתפלתן של ישראל, וע\"כ באותה שעה אמרו ברוה\"ק ה' ימלוך לעולם ועד לעתיד לבוא כמבואר במכילתא הנ\"ל, ובעוה\"ר עכשיו ההסתרת פנים גדלה מאוד, ואין עת להאריך בתפלה ואין בנו כח להתפלל, והבוי\"ת יעזור לנו בהארת פניו ית' שנצא משפל המצב הזה ונזכה לישועה שלימה ואמיתית במהרה, ועד אז לא נתפס ח\"ו, רק נהי' דבוקים בהקב\"ה ובתוה\"ק בדרך האמת בקדושה ובטהרה, ויעזור השי\"ת שנזכה במהרה לקבל פני משיח צדקינו בנחת ובשמחה בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו במהרה בימינו אמן.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 93,
      "char_length": 1547,
      "timestamp": "2025-02-06T19:21:59.582732"
    },
    {
      "id": "beshalach1_p94",
      "text": "ויהי בשלח פרעה את העם ולא נחם אלקים ד\"א פלשתים כי קרוב הוא כי אמר אלקים פן ינחם העם בראותם מלחמה ושבו מצרימה, כבר הקשינו לעיל דהלא ארץ ישראל קרובה למצרים מאוד. ובכניסתם לארץ פגעו במלחמה גדולה מאוד מלחמת ל\"א מלכים, וא\"כ מה יועיל הליכתם דרך המדבר שיתרחקו מגבול מצרים, מ\"מ כשיצאו מן המדבר ויתקרבו לכניסת הארץ שהוא קרובה למצרים, חזרה החששא למקומה פן ינחם העם בראותם מלחמה ושבו מצרימה, וצ\"ב טעם הכתוב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 94,
      "char_length": 396,
      "timestamp": "2025-02-06T19:22:00.332215"
    },
    {
      "id": "beshalach1_p95",
      "text": "ב) גם צ\"ב דמה מקום לחששא זו, דהרי בודאי לא יוכלו לשוב למצרים נגד רצונו ית', ומד' מצעדי גבר כוננו ואצלו ית' אין נפק\"מ בין דרך קרוב לרחוק, ורש\"י ז\"ל נשמר בזה שמפרש פן ינחם העם וגו', יחשבו מחשבה על שיצאו ויתנו לב לשוב. מבואר מדבה\"ק דאין החששא פן ישובו כ\"א שמא יתנו לב לשוב, והמחשבה בלבד פוגמת (ועוד נבאר בזה להלן) ולזה ויסב אלקים את העם דרך המדבר וגו' כדי למנעם ולהצילם ממחשבה זו, אמנם אף לדרך זו צ\"ב מדוע ירצו לשוב למצרים, ואחרי שסבלו מהם שיעבוד ועוני כ\"כ שנים, מדוע זה יעלה במחשבתם להשתוקק על החזרה אליהם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 95,
      "char_length": 504,
      "timestamp": "2025-02-06T19:22:00.536464"
    },
    {
      "id": "beshalach1_p96",
      "text": "ג) במכילתא לא הביאן הקב\"ה דרך פשוטה לארץ ישראל אלא דרך המדבר, אמר הקב\"ה אם אני מביא עכשיו ישראל לארץ. מיד מחזיקים אדם בשדהו וכו' והן בעלים מן התורה, אלא אקיפם במדבר מ' שנה, שיהיו אוכלין מן ושותין מי הבאר והתורה נבללת בגופן ע\"כ, וצ\"ב דאין זה טעם המבואר בכתוב פן ינחם העם בראותם מלחמה ושבו מצרימה, וצ\"ב להשוות טעם המבואר במכילתא עם טעם הכתוב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 96,
      "char_length": 340,
      "timestamp": "2025-02-06T19:22:00.808413"
    },
    {
      "id": "beshalach1_p97",
      "text": "ד) במד\"ר (פכ\"ד סי' ב') ויסע משה את בנ\"י, ר\"י אומר אמרו ישראל באותה שעה, כלום הוציאנו הקב\"ה ממצרים אלא בשביל ה' דברים וכו', עכשיו כבר נתן לנו ביזת הים, והרכיבנו על ענני הכבוד, וקרע לנו את הים, ופרע מן המצרים, ואמרנו שירה לפניו, נחזור למצרים וכו', עכ\"ד המדרש, וצ\"ב מה נתינת טעם הוא זה, ומדוע אחרי כל הנסים שעשה הקב\"ה רצו לחזור למצרים",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 97,
      "char_length": 331,
      "timestamp": "2025-02-06T19:22:00.997737"
    },
    {
      "id": "beshalach1_p98",
      "text": "ויתבאר הענין בהקדם מה דאיתא בתו\"כ, (הובא ברש\"י ז\"ל פ' אחרי) עה\"פ כמעשה ארץ מצרים אשר ישבתם בה לא תעשו וגו' מגיד שמעשיהם של מצרים ושל כנענים מקולקלים מכל האומות, ואותו מקום שישבו בו ישראל מקולקל מן הכל, ובתורת כהנים מסיים בשביל שישראל דרים שם, וצ\"ב אף לפי גירסת רש\"י ז\"ל מדוע נסתבב התיישבותן של ישראל במקומות המקולקלים מן הכל, וביותר תמוה לפי הגירסא שבתו\"כ בשביל שישראל דרים שם, דאיך גרם התיישבותן של ישראל על תושבי' הכנענים, שנעשו מקולקלים מן הכל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 98,
      "char_length": 447,
      "timestamp": "2025-02-06T19:22:01.211818"
    },
    {
      "id": "beshalach1_p99",
      "text": "אמנם יתבאר עפימ\"ד בגמ' (סוכה נ\"ב ע\"א) יצר הרע מניח את כל העולם ומתגרה בישראל, ובתלמידי חכמים יותר מכולן. והטעם מפני שכל קיום העולם תליא בכשרון מעשיהם, כאמרז\"ל (יבמות ס\"ג ע\"א) מ\"ד ונברכו בך כל משפחות האדמה, אפי' משפחות הדרות באדמה אין מתברכות אלא בשביל ישראל, עוד שם בגמ' אמר ר\"א אין פורעניות באה לעולם אלא בשביל ישראל וכו', וע\"כ מתגבר השטן ביותר להחטיא את ישראל, משא\"כ על אומה\"ע אינו מתחזק בהתגברותו כ\"כ, כי בלא\"ה מסיטרא דילי' אינון וא\"צ להתגברות, אמנם דבר ידוע שרוב בני אדם נשפעין מהנהגת המדינה, ובספה\"ק מאור ושמש כתב בפ' מסעי ששרים של מעלה הם המביאים לכל תאות יצה\"ר, שכל רצונם למשוך את האדם אחר תאוות יצה\"ר, ובפרט לאיש הישראלי כל מגמתם לנתק אותו מעבודת השי\"ת וכו', וע\"כ מעשה ארץ מצרים וארץ כנען מקולקלים מכל האומות ששרים של מעלה הביאו אותם לידי תאוות גדולות וכפרו בהשגחה יותר מכל האומות עוע\"ז עכת\"ד ז\"ל, ועיקר התגברותם הוא רק בשביל ישראל, ולתכלית זה ממשיכים את האומות שישראל דרים שם לתאוות רעות, כדי שישפיעו על ידם להחטיא את ישראל, כי טבע האדם להימשך אחרי בני מדינתו, וכמ\"ש הרמב\"ם ז\"ל (בפ\"ו מה' דיעות), דרך ברייתו של אדם להיות נמשך בדיעותיו ובמעשיו אחרי ריעיו וכו' נוהג כמנהג אנשי מדינתו: וכמשה\"כ ויתערבו בגוים וילמדו ממעשיהם, ובזה יובן מ\"ש בתו\"כ אותו מקום שישבו בו ישראל מקולקל מן הכל בשביל שישראל דרים שם, דכל התגברותם הוא רק בשביל ישראל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 99,
      "char_length": 1242,
      "timestamp": "2025-02-06T19:22:01.447400"
    },
    {
      "id": "beshalach1_p100",
      "text": "ועד\"ז יתבאר דברי המדרש הנ\"ל (בקושיא ד') שאמרו ישראל כבר קרע לנו את הים ופרע מן המצרים וכו' נחזור למצרים, כי השיגו וידעו ישראל שמעשיהם של מצרים ושל כנעניים מקולקלים מכל האומות, וממלחמה זו של ל\"א מלכים נתייראו מאוד, שיתגברו עליהם כל שרי אומות אלו להחטיאם, וע\"כ חשבו שטוב להם יותר לחזור למצרים, שהמצריים כבר ראו את היד הגדולה ונסי קרי\"ס שעשה השי\"ת בשביל ישראל, ואף המצריים שנשארו בארצם ראו נסי קרי\"ס, כמ\"ש ז\"ל במד\"ר (פכ\"א ס\"י) מה עשה הקב\"ה רמז לארץ מצרים ועלתה, והיו רואין מלחמה בים, שנאמר ויאמר מצרים אנוסה מפני ישראל, וע\"כ חשבו ישראל שטוב להם לחזור למצרים, ושם יקל להם להתגבר מול תאוות האומות ושריהם, כי כבר נכנעו מפני כובד המכות גם לצד שראו התגלות הנסים שעשה ד' לאהבתו את ישראל ע\"כ לא יוסיפו עוד להכביד עולם והתגברותם על ישראל, אבל ממלחמת ל\"א מלכים עלה מורך בלבבם, שמא לא יוכלו להתגבר נגדם, אמנם הי' רצון הבוי\"ת למנוע מחשבה זו מלבם, ולטעם זה הקיפם מ' שנה במדבר, שיהיו אוכלין מן ושותין מי הבאר והתורה נבללת בגופן, וע\"י התוה\"ק ישיגו דרך האמת ורצון הבוי\"ת, ולא יעלה על דעתם הרצון לשוב מצרימה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 100,
      "char_length": 989,
      "timestamp": "2025-02-06T19:22:02.126435"
    },
    {
      "id": "beshalach1_p101",
      "text": "ולדרכינו נבין דברי המכילתא הנ\"ל (קושיא ג') לא הביאן הקב\"ה דרך פשוטה לארץ ישראל אלא דרך המדבר, אמר הקב\"ה אם אני מביא עכשיו ישראל לארץ, מיד מחזיקים אדם בשדהו וכו' והן בטלים מן התורה, אלא אקיפם במדבר מ' שנה שיהיו אוכלין מן וכו' והתורה נבללת בגופן וכו' ולכאורה אין זה טעם המבואר בכתוב פן ינחם העם בראותם מלחמה ושבו מצרימה, אמנם לדרכנו הוא ענין אחד עם טעם המבואר בכתוב, ואפשר דמ\"ש פן ינחם העם בראותם מלחמה וגו' סובב על מלחמת ל\"א מלכים כקושיתנו לעיל (קושיא א') ואלמלי נכנסו לארץ ישראל בדרך פשוטה לא יהי' התורה נבללת בגופן, ואיתא להאי חששא פן ינחם העם בראותם מלחמה וירצו לשוב למצרים, ע\"כ הקיפן הקב\"ה דרך המדבר, וע\"י שיתעצמו בעצם התוה\"ק ישיגו רצון הבוי\"ת ולא ירצו לשוב עוד מצרימה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 101,
      "char_length": 672,
      "timestamp": "2025-02-06T19:22:02.609396"
    },
    {
      "id": "beshalach1_p102",
      "text": "באופן אחר יתבארו הדקדוקים ודברי המדרשים הנ\"ל, בהקדם לפרש מאמה\"כ ולא נחם אלקים דרך ארץ פלשתים כי קרוב הוא כי אמר אלקים פן ינחם העם בראותם מלחמה ושבו מצרימה, פרש\"י ז\"ל פן ינחם יחשבו מחשבה על שיצאו ויתנו לב לשוב עכ\"ל, וכתב הרא\"ם ז\"ל שכל לשון ניחום שבמקרא לשון מחשבה אחרת כמו שפירשו בפסוק (בראשית ו') וינחם ד' כי עשה את האדם, אף כאן יתהפכו ממחשבתן הראשונה שהיתה לצאת ממצרים ויתנו לב לשוב עכ\"ל הרא\"ם ז\"ל, אמנם מלת ינחם סובל ג' משמעות שונות, והפסוק שהביא הרא\"ם לראי' וינחם ד' כי עשה את האדם, גם שם פרש\"י ז\"ל ב' פירושים נחמה היתה לפניו וכו', דבר אחר נהפכה מחשבתו של מקום ממדת רחמים למדת הדין, עוד ישמש הכתוב במלת ינחם על לשון הנהגה כמ\"ש וינחם אל מחוז חפצם, ואף כאן ולא נחם אלקים פרש\"י ולא נהגם כמו לך נחה את העם וכו'",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 102,
      "char_length": 709,
      "timestamp": "2025-02-06T19:22:02.942454"
    },
    {
      "id": "beshalach1_p103",
      "text": "והנה כתב האוהחה\"ק להלן עה\"פ ותן שמה מלא העומר מן והנח אותו לפני ד' למשמרת וגו' כי פירוש למשמרת סובלת ב' דרכים, ומדרכי התורה כל שהתיבה תסבול ב' דברים, שקולים במשמעותה תכוין אל הב' כי איזה מהם תוציא וכו' עיי\"ש לענינו, וכמו\"כ לעניננו שמלת נחם סובלת ג' משמעות שונים, יתכן שנתכוין הכתוב על שלשתן, כי איזה מהם תוציא, ועד\"ז יתיישבו כל דברי רז\"ל והדקדוקים שבענין שנפרטו לעיל, דהנה תועלת וטובה גדולה נצמח לכל דורות ישראל, ממה שהקיפם הקב\"ה לישראל דרך המדבר, כמשה\"כ (ירמי' ב') הלוך וקראת באזני ירושלים לאמר זכרתי לך חסד נעוריך אהבת כלולותיך לכתך אחרי במדבר בארץ לא זרועה, ובגמ' סנהדרין (ק\"י ע\"ב) דרשו רז\"ל דאף אחרים באים בזכותם לעוה\"ב והזכות הזה עומדת לישראל בכל הדורות וכמ\"ש רש\"י ז\"ל בירמי' שם וז\"ל תאוותי לרחם עליכם כי זכרתי חסד נעוריך וכו', ומה הוא חסד נעוריך לכתך אחר שלוחי משה ואהרן מארץ נושבת יצאתם למדבר ואין צדה לדרך כי האמנתם בי, וסיים הכתוב כי בזכות זאת קדש ישראל לד' ראשית תבואתה כל אוכליו יאשמו רעה תבוא אליהם נאם ד', וזהו טעם מספיק שהוצרכו ישראל לסבב דרך המדבר, כי אלמלי הלכו דרך ארץ פלשתים בארץ נושבת, הי' נשלל מהם הנסיון הגדול, וראתה חכמתו ית' שבזכות הנסיון הזה יתקיימו ישראל בגלותם ויבואו לעוה\"ב, לכך הקיפם דרך המדבר ועי\"ז זכו לעצמם ולדורות הבאים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 103,
      "char_length": 1152,
      "timestamp": "2025-02-06T19:22:03.289633"
    },
    {
      "id": "beshalach1_p104",
      "text": "ואפ\"ל כי הטעם הנ\"ל נרמז ג\"כ בכתוב פן ינחם העם בראותם מלחמה ושבו מצרימה, ובטעם המובא במכילתא הנ\"ל שהסיבן הקב\"ה דרך המדבר, כדי שיהי' התורה נבללת בגופן. וכל אלה הטעמים יתאחדו לאחדים ועל קוטב א' יסובבו, ויתבאר בהקדם דברי המכילתא פ' בשלח כי ד' נלחם להם במצרים, ולא במצרים לבד אלא בכל המצירין להם לישראל לדורות וכו', לכך נאמר כי ד' נלחם להם במצרים, הרי דמצרים שם הכולל לכל האומות המצירים לישראל, וכן דרשו רז\"ל בפסיקתא זוטא (פ' בא סי\"ב) למה נקרא שמה מצרים על שם שהצירו את ישראל בה, ולפי\"ז כל המצירים נקראים בשם זה, והוא שם הכולל לכולן ע\"ש תכונתם ופעולתם, אלא שקראם הכתוב בשמם הפרטי להגדרת סימניהם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 104,
      "char_length": 590,
      "timestamp": "2025-02-06T19:22:03.812702"
    },
    {
      "id": "beshalach1_p105",
      "text": "ופירשתי בזה מ\"ד בתנחומא (פ' תצא ס\"ה) זכור את אשר עשה לך עמלק וגו', ר' תנחומא פתח זכרוניכם משלי אפר לגבי חומר גביכם (איוב י\"ג) אמר הקב\"ה לישראל אותן ב' זכירות שכתבתי לכם בתורה הוו זהירין בהן, תמחה את זכר עמלק זכור את אשר עשה לך עמלק וכו', אם זכיתם אתם בניו של אברהם אבינו וכו', ואם לאו לגבי חומר גביכם, התקינו עצמכם לשעבודה של מצרים עכ\"ד המדרש, ולכאורה צ\"ב דהרי הבטיח הבוי\"ת לישראל לא תוסיפון לראותם עוד עד עולם, והבטחה לטובה לא יתבטל בשום פנים, ואיך אמר התקינו עצמכם לשיעבודה של מצרים, וכבר ביארנוהו באופנים שונים (עיין בדרושים לפ' זכור) ולדרכנו יתבאר עפ\"י פשוטו דהכוונה על גלויות בין האומות, דמצרים הוא שם הכולל לכל המצירים לישראל, ועד\"ז יתפרש לעניננו במאמה\"כ פן ינחם העם בראותם מלחמה ושבו מצרימה, שזו הי' תקנה לדורות, ולא בשביל חשש של אותו הדור הסיבן הקב\"ה דרך המדבר, כדי למנוע חזרתן לארץ מצרים, דא\"א שישובו למצרים נגד רצונו ית', והקב\"ה הזהירם מלשוב בדרך הזה לעולם, אולם טעם הסיבן דרך המדבר הי' בשביל תקנת דורות העתידים חלושי כח. שלא יכלו לעמוד בקשרי המלחמה נגד נסיונות העצומים שיעמדו ויתגברו לעומתם, ע\"כ הכין הבוי\"ת לפניהם זכותם של דור המדבר, וכח האמונה החזקה של לכתך אחרי במדבר, הושתל על ידיהם גם בדורות העתידים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 105,
      "char_length": 1116,
      "timestamp": "2025-02-06T19:22:04.127188"
    },
    {
      "id": "beshalach1_p106",
      "text": "ועד\"ז יתבאר הפסוק פן ינחם העם בראותם מלחמה וגו', פרש\"י ז\"ל כגון מלחמת וירד העמלקי והכנעני, ובמכילתא דר' ישמעאל בראותם מלחמה זו מלחמת עמלק שנא' וירד העמלקי וגו' (במדבר י\"ד), דבר אחר זו מלחמת בני אפרים וכו', דכתיב בני אפרים נושקי רומי קשת הפכו ביום קרב וגו' (תהלים ע\"ח) מפני שלא שמרו ברית האלקים וגו' עברו על הקץ ועל השבועה עכ\"ד המכילתא, וכבר הבאנו לעיל (בדרוש הקדום), קושית המפרשים ז\"ל מדוע לא נקטו רז\"ל ויבא עמלק וילחם עם ישראל ברפידים, שהי' סמוך ליציאתם ממצרים, ועמלק בא מארצו להלחם עמהם, משא\"כ שם הזהירם הקב\"ה אל תעלו כי אין ד' בקרבכם ולא תנגפו לפני אויביכם, וא\"כ הי' מקום להנצל מן המלחמה, ואין כ\"כ האי חששא של פן ינחם העם בראותם מלחמה גם במלחמת בני אפרים היתה גרמת המלחמה על ידיהם ע\"י שיצאו שלא ברשות, ואין נפק\"מ בזה בין דרך רחוק לקרוב, וכמו\"כ יזדמן גם אם יסבו דרך המדבר, ולדרכינו ירמוז כל זה לדורות העתידים והבוי\"ת מגיד מראשית אחרית שיזדמן להם נסיונות כאלו, בראותם מלחמה כגון וירד העמלקי והכנעני וגו', וכגון מלחמת בני אפרים, שגרמת המלחמה הי' ע\"י שעברו על הקץ ועל השבועה והתגרות באומות לפני הזמן, ובעוה\"ר חטא הזה מצוי גם בדורנו וזה גורם לאריכת הגלות, וז\"ש כי אמר אלקים פן ינחם העם בראותם מלחמה, וכפרש\"י והרא\"ם ז\"ל שיחשבו מחשבה אחרת ויתהפכו ממחשבתן הראשונה, היינו כח האמונה הגדולה שהי\"ל ביציאתם ממצרים, ושבו מצרימה שזה יגרום אריכת הגלות ויתוסף כח לשונאי ישראל להיות מצירים לישראל כמ\"ש רז\"ל שעל חטא זה של דחיקת הקץ אמר הקב\"ה הריני מתיר את בשרכם וכו', ולטעם זה הסיבן הקב\"ה דרך המדבר והיקיפם מ' שנה טרם נכנסו לארץ, ודור המדבר דור דיעה שמרו את הברית והשבועה ולא דחקו את הקץ (חוץ מהערב רב שהם היו המעפילים) וכח האמונה זו הושתל על ידיהם לדורות העתידים, גם זכותם יעמוד להגן על כל דורות ישראל כאמרז\"ל, וזהו טעם הסיבן דרך המדבר.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 106,
      "char_length": 1621,
      "timestamp": "2025-02-06T19:22:04.661404"
    },
    {
      "id": "beshalach1_p107",
      "text": "או אפשר שירמוז הכתוב על מלחמת היצר, ועפימ\"ש האלשיך הק' (סו\"פ בשלח) כי כל שרי עם ועם קל לפניו ית' להפילם כמו רגע, ומיד נופלים אומותם, אך שר עמלק אין מפלתו כי אם ביד ישראל וכו', הוא השטן הוא הס\"מ הוא יצה\"ר, ובכל חטא ועון אשר נחטא אנו מחזיקים ומאשרים אותו כנודע, באופן שא\"א להפילו ארצה, אם לא שזכינו מכל עונותינו וכו', כי אז יכנע וימחה מן העולם, וז\"א כי מחה אתה את השר על השמים, ואח\"כ אמחה את זכר עמלק מתחת השמים, הפך יתר האומות שהוא ית' מפיל השר משמים תחלה וכו', וע\"כ צריך זכירה זו בלב כל איש ישראל, למען ידעו כי בדבר הזה תלוי' גאולתם וטובתם לעולם עכ\"ד ז\"ל, ובזה יל\"פ דברי התנחומא הנ\"ל, זכור את אשר עשה לך עמלק וגו', אמר הקב\"ה לישראל אותן ב' זכירות, תמחה את זכר עמלק זכור את אשר עשה לך עמלק הוו זהירין בהן, אם זכיתם אתם בניו של א\"א וכו', היינו שתהיו ראויים להתייחס אחריו שלחם ביצרו ועם כל העולם עוע\"ז, ואם לאו התקינו עצמכם לשעבודה של מצרים, היינו שעבוד הנפש של כוחות הטומאה ותועבת מצרים, וז\"א פן ינחם העם בראותם מלחמה, היינו מלחמת עמלק כפרש\"י והמכילתא, ופן יחשבו מחשבה אחרת לנטות מדרך האמת ולא יוכלו להתגבר נגד מלחמת היצר שהוא שרו של עמלק, ועי\"ז ושבו מצרימה, יחזרו לבחי' מעשה ארץ מצרים, וע\"כ הכין הקב\"ה כח וזכות של דור המדבר להיות זכותן וכח קדושתם מגינא ומצלת לכל דורות ישראל, וז\"ש הכתוב ולא נחם אלקים דרך ארץ פלשתים כי קרוב הוא, והי' נשלל מהם הזכות הגדול של לכתך אחרי במדבר, כי אמר אלקים פן ינחם העם בראותם מלחמה לדורות, ויחשבו מחשבה אחרת כנ\"ל ע\"כ הכין הבוי\"ת מראש הנסיון הגדול של לכתך אחרי במדבר. ובכח זה יתקיימו ישראל לדורות.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 107,
      "char_length": 1426,
      "timestamp": "2025-02-06T19:22:05.424258"
    },
    {
      "id": "beshalach1_p108",
      "text": "ולפי\"ז אפשר לפרש במלת פן ינחם ג' משמעות, כי איזה מהם תוציא, ויתכן שנתכוין הכתוב לכולם, ועפ\"י פשוטו יכוין הכתוב על אותו הדור יוצאי מצרים, דהנה השגחה סיבת הדביקות כמ\"ש הרמב\"ם ז\"ל, ואם זוכין לבטחון ואמונה אמיתית נמשך הישועה בניקל יותר, ומעתה אלמלי הלכו ישראל בדרך קרוב דרך ארץ פלשתים, יש מקום לחשוש שמא בראותם מלחמה יחשבו מחשבה להנצל מן הסכנה בדרך הטבע ע\"י שישובו למצרים, ואף שא\"א שישובו נגד רצונו ית', אבל המחשבה בלבד פוגמת ולא יהי' ראויים לנס, דהשגחה סיבת הדביקות, וז\"ש ולא נחם אלקים דרך ארץ פלשתים כי קרוב הוא וכפרש\"י ז\"ל נוח לשוב באותו הדרך למצרים, וע\"כ יש לחשוש שיעלה על לבם מחשבה זו, גם יל\"פ פן ינחם מלשון נחמה שיתנחמו בזה בראותם מלחמה ושבו מצרימה, אף שסבלו שם עבדות ועינוי, אבל מיראת סכנת המות יבחרו יותר לחזור ליד לוחציהם ואם ככה יחשבו לא יהיו ראויים אל הנס, ומה\"ט הסיבן הקב\"ה דרך המדבר ים סוף, וכאשר יהיו רחוקים ממצרים לא יהי' בחזרה מנוס ומפלט מן המלחמה, ויתלו עיניהם בישועת ד' ועי\"ז יהיו נושעים",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 108,
      "char_length": 901,
      "timestamp": "2025-02-06T19:22:06.131340"
    },
    {
      "id": "beshalach1_p109",
      "text": "ולדרכנו הנ\"ל שהי' טעם הסיבן דרך המדבר בשביל תועלת דורות העתידים, יתפרש ג\"כ מלת ינחם מלשון נחמה, דהנה באמת ספיקא קמי שמיא ליכא, וראתה חכמתו ית' שלכובד נסיונות הגלות ינחם העם בראותם מלחמה, זו מלחמת עמלק ומלחמת היצר, ויחשבו מחשבה אחרת, אלא שלא אמרו ית' במאמר מוחלט, כי דבורו ית' מכריח ויתבטל הבחירה, ולז\"א כי אמר אלקים פן ינחם העם, והנה המחשבה בלבד פוגמת כמ\"ש לעיל, אולם בכ\"ז אפשר לחזור בו ולהתגבר עליו, ומחשבה מוציא מידי מחשבה, וכל עוד שהאדם מצטער ומתחרט על המחשבה רעה, הבוי\"ת עוזרו ומצילו מידי מעשה, אבל אם ח\"ו ימצא מרגוע לנפשו ויקבל תנחומין על התהפכות המחשבה, אז עלול ח\"ו ליפול לתועבת מצרים, וז\"פ פן ינחם העם ר\"ל יחשבו מחשבה אחרת ויתנחמו בזה, ושבו מצרימה שאז יפלו לתועבת מצרים ח\"ו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 109,
      "char_length": 681,
      "timestamp": "2025-02-06T19:22:06.566476"
    },
    {
      "id": "beshalach1_p110",
      "text": "גם יל\"פ פן ינחם מלשון הנהגה כמ\"ש וינחם אל מחוז חפצם, עפי\"מ שפרשתי בפ' המרגלים עה\"פ נתנה ראש ונשובה מצרימה, פרש\"י כתרגומו נמני רישא, נשים עלינו מלך, ורבותינו פי' לשון ע\"ז עכ\"ל, והנה הרבה מפוה\"ת ובכללם השלה\"ק כתבו דמרגלים נתכוונו לש\"ש אלא שטעו. והכתוב העיד עליהם שהיו מתחלה כשרים וצדיקים, גם ישראל שבאותו הדור היו דור דיעה נשמות גבוהות ולא יתכן לחשוב שרצו לעבוד ע\"ז בפועל ח\"ו, ואפ\"ל עפ\"י אמרם ז\"ל (שבת דף ק\"ה) א\"ר אבין מאי קראה לא יהי' בך אל זר ולא תשתחו' לאל נכר. איזהו אל זר שיש בגופו של אדם, הוי אומר זה יצה\"ר וכו' שכך אומנתו של יצה\"ר היום אומר לו עשה כך, ולמחר אומר לו עשה כך, עד שאומר לו עבוד ע\"ז והולך ועובד עכ\"ד הגמ' ורש\"י ז\"ל (בפ' עקב) הביא מדברי הספרי וסרתם ועבדתם אלהים אחרים, וסרתם לפרוש מן התורה, ומתוך כך ועבדתם אלהים אחרים, שכיון שאדם פורש מן התורה הולך ומדבק בע\"ז וכו' עיי\"ש, ובזה יובן דנתנה ראש פירושו נמני רישא וכפרש\"י והתרגום, ואין מקרא יוצא מידי פשוטו, אולם אם ממנין ראש שלא ברצון השי\"ת ולא על דעתו של משרע\"ה, סופו שיהי' המנהיג הזה מוליכם לעבוד ע\"ז, ורבותינו ז\"ל גילו לנו מדרשו כי ראש זה לשון ע\"ז ע\"ש סופו, היום אומר לו עשה כך עד שאומר לו לעבוד ע\"ז, וגם בחי' זו נרמז כאן בכתוב, כי ראתה חכמתו ית' שבאחריות הימים יעמדו על ישראל מנהיגים רעים, ובסיבת ההנהגה ושבו מצרימה יפלו למעשה ארץ מצרים וע\"ד שאמה\"כ נתנה ראש ונשובה מצרימה, וז\"ש פן ינחם העם בראותם מלחמה היינו מלחמת היצר, וכגון וירד העמלקי נסיונות של דחיקת הקץ ומרידה באומות, ומעתה יש חשש פן ינחם העם מלשון הנהגה, שכח הנהגה רעה יתעום ושבו מצרימה, וע\"כ הכין הבוי\"ת כח והזכות של דור המדבר שתהי' מגינא ומצלת להקל כובד הנסיונות לדורות, וזהו טעם הסיבן דרך המדבר.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 110,
      "char_length": 1523,
      "timestamp": "2025-02-06T19:22:06.970213"
    },
    {
      "id": "beshalach1_p111",
      "text": "ואפשר לקשר טעם הכתוב עם טעם המובא במכילתא הנ\"ל, אמר הקב\"ה אם אני מביא עכשיו ישראל לארץ, מיד מחזיקים אדם בשדהו ואדם בכרמו והם בטלים מן התורה, אלא אקיפם במדבר מ' שנה שיהיו אוכלין מן ושותין מי הבאר והתורה נבללת בגופן וכו' עכ\"ד המכילתא, ולכאורה הרי ר' ישמעאל ס\"ל בגמ' ברכות (ל\"ה ע\"ב) ואספת דגנך מה ת\"ל, לפי שנא' לא ימוש ס\"ת הזה מפיך, יכול דברים ככתבן. ת\"ל ואספת דגנך הנהג בהן מנהג דרך ארץ, ואמר אביי הרבה עשו כר' ישמעאל ועלתה בידן כרשב\"י ולא עלתה בידן, ואיך אפ\"ל דבשביל שיחזיקו איש בשדהו יתבטל התורה, ואם ככה יש לחשוש א\"כ מה יהי' תקנתן של דורות אחריהם שלא יהיו אוכלי מן, אמנם משונה הדור ההוא מכל הדורות שבעולם, דלפי שכח זכותם מגין על כל דורות ישראל, ע\"כ הי' צורך להם לשמירה יתירה ולשלימות מאוד נעלה, ומה\"ט הסיבן הקב\"ה במדבר ונתן להם המן כדי שתהא התורה נבללת בגופן, ולולא כח התוה\"ק, גם זכות האמונה הגדולה של לכתך אחרי במדבר אין לה קיום נצחי לדורות, ולזה דייק הכתוב \"לכתך אחרי\" במדבר, ע\"ד הכתוב אחרי ד' תלכו, והוא רק ע\"י התוה\"ק וכל דבר בעבדות השי\"ת צריך שיהי' מקושר עם התוה\"ק, וזולת זה אין לה קיום, גם מפני שהי' הדור ההוא שורש כל דורות ישראל והוכנו להגין בזכותם על כל הדורות ע\"כ הוצרכו לשמירה יתירה ושיהיו דבוקים בעצם התוה\"ק דיבוק עצמי, ואלמלי זה פונה לכרמו וזה פונה לשדהו הי' נחסר מהם שלימות האמיתי, משא\"כ בדורות שאחריהם אין הכרח לזה והרבה עשו כר' ישמעאל ועלתה בידן, ולפי\"ז טעם המכילתא ישתווה עם טעם המבואר בכתוב, כי אמר אלקים פן ינחם העם וגו' כדרכנו הנ\"ל, ולטעם זה הוכן הנסיונות של דור המדבר, לכתך אחרי במדבר וגו' להגין על כל הדורות, ולזה הי' צורך להקיפם מ' שנה במדבר שיהא התורה נבללת בגופן.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 111,
      "char_length": 1487,
      "timestamp": "2025-02-06T19:22:07.713120"
    },
    {
      "id": "beshalach1_p112",
      "text": "ועפי\"ז יתבאר דברי המד\"ר ויהי בשלח פרעה, מי אמר ווי, משה אמר ווי וכו' אמר משה צועק אני שנתייגעתי להוציא את ישראל ממצרים ואיני נכנס עמהם לארץ עכ\"ד המדרש, וצ\"ב דאין לזה קישור עם מאמר הכתוב, והול\"ל בפ' בא עה\"פ יצאו כל צבאות ד' מארץ מצרים, גם מנין נתברר לו עכשיו שאין סופו ליכנס עמהם לארץ, ולדרכנו השיג משרע\"ה שיהיו עוד גלויות, דלטעם זה יש חשש פן ינחם העם וגו' יחשבו מחשבה אחרת, גם פן ינחם העם מרעת המנהיגים, וכ\"ז לא יצוייר אלמלי נכנס משרע\"ה לא\"י, כאמרז\"ל דלא שלטו האויבים במעשה ידיו ולא הי' אחרי' חורבן עוד, אלא שלא היה עדיין הזמן לגאולה נצחית, ועכ\"פ השיג משרע\"ה ממה שהסיבם הקב\"ה דרך המדבר לטעם פן ינחם העם, ידע שלא יכנס לארץ וע\"כ צווח ווי וא\"ש הקישור, והבוכ\"ע ינחנו בדרך האמת וננצל ממנהיגים לא טובים ונזכה לעשות תשובה שלימה, ובמהרה נקבל פני משיח צדקנו בנחת ובשמחה בקדושה ובטהרה, ונזכה לראות הישועה שלימה בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו בב\"א.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 112,
      "char_length": 858,
      "timestamp": "2025-02-06T19:22:08.428705"
    },
    {
      "id": "beshalach1_p113",
      "text": "עוד אפ\"ל ושבו מצרימה עפימ\"ש הרמב\"ן הק' בחידושיו למס' עירובין דלמ\"ד תחומין דאורייתא איך התירו חכמים ע\"י תקנת עירוב דבר שנאסר מן התורה, ותירץ הרמב\"ן דהאדם נמשך אחר סעודתו וע\"י שמחשבתו שם נחשב כאילו הוא עצמו הי' שם וזהו סברא דאורייתא. ומן התורה הותר ע\"י העירוב לילך עוד אלפים אמה ע\"י סעודתו שהניח שם, כי מחשבתו של אדם נמשך אחר סעודתו, וכל מקום שמחשבתו הוא שמה נחשב כאילו הוא עצמו הי' שם, ועד\"ז יובן הכתוב פן ינחם העם בראותם מלחמה ויכנס בלבם מחשבות כאלו שע\"י מחשבתם יחשב להם כאלו שבו למצרים, ולא שיחזרו בפועל שמה, כי הרבה שלוחים למקום למנעם, רק בעודם בא\"י אם יהרהרו לעשות כמעשה ארץ מצרים יחשב להם כאלו שבו בפועל וז\"ש ושבו מצרימה, וז\"ש במדרש כדי שלא יבואו לידי מחשבות כאלו לכן הוצרך להקיפן במדבר ארבעים שנה וכו' והתורה נבללת בגופן ואין עוד חשש זה שיחזרו למצרים ע\"י גרמת המחשבות.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 113,
      "char_length": 773,
      "timestamp": "2025-02-06T19:22:08.842290"
    },
    {
      "id": "beshalach1_p114",
      "text": "עוד אפשר לפרש אומרו ושבו מצרימה עפימ\"ש בספה\"ק צמח ה' לצבי פ' ראה עה\"כ אבד תאבדון (הובא לשונו בויואל משה מאמר ב' סי' קכ\"ט) ותוכן דבריו שאדמת ארץ ישראל אינה סובלת כל טומאה, ובאותן המקומות שמטמאין את א\"י מתקפלת הארץ תחתיהם ורצועה בישא מארץ העמים נמשך עלי' עיי\"ש, ובערבי נחל פ' שלח פי' שעד\"ז היה טעותם של המרגלים שלא מצאו בא\"י קדושת הארץ כי הי' הכל במדבר במקום חנייתן של ישראל עיי\"ש, וזהו אומרו פן ינחם העם בראותם מלחמה ושבו מצרימה, ר\"ל אף כשהם בא\"י יכולים להיות על אדמת מצרים ע\"י שיתנהגו שלא כשורה, ומה\"ט ויסב אלקים את העם דרך המדבר ים סוף כדי שיקבלו את התוה\"ק, ואחר שיהי' התורה נבללת בגופן יכנסו לא\"י ואין עוד חשש זה, ולפי\"ז טעם המדרש וטעם המבואר בפסוק מתאימים ועל קוטב א' יסובבו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 114,
      "char_length": 678,
      "timestamp": "2025-02-06T19:22:09.206319"
    },
    {
      "id": "beshalach1_p115",
      "text": "באופן אחר יתבאר דברי המכילתא והדקדוקים הנ\"ל בהקדם מ\"ד במד\"ר (פ' כ' סימן י\"ח) ויסב אלקים את העם דרך המדבר וגו', מכאן אמרו רבותינו אפי' עני שבישראל לא יאכל עד שיסב, שכך עשה להם הקב\"ה שנא' ויסב אלקים עכ\"ד המדרש, והוא פליאה דויסב דקרא אינו ממשמעות הסיבה כ\"א מלשון סיבוב, ואיך דרשו רז\"ל מכאן על הסיבה בלילי פסחים ואינו מענינו כלל, והיפ\"ת פי' זה רק דרך רמז מדכתיב ויסב ולא כתיב וינחם עיי\"ש, ועדיין צ\"ב קישור הרמז לכאן, דהסיבה בלילי פסחים מורה על החירות, והליכתם דרך המדבר מורה על ההיפוך כמשה\"כ ויענך וירעיבך וגו' למען נסותך וגו'",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 115,
      "char_length": 522,
      "timestamp": "2025-02-06T19:22:09.529551"
    },
    {
      "id": "beshalach1_p116",
      "text": "ב) ויקח משה את עצמות יוסף עמו וגו', במס' סוטה (י\"ג ע\"א) בא וראה כמה חביבות מצות על משרע\"ה, שכל ישראל נתעסקו בביזה והוא נתעסק במצות שנא' חכם לב יקח מצות וגו', עכ\"ד הגמ', והמהרש\"א ז\"ל בח\"א דקדק, מדוע תיארו אותו בשביל זה בתואר חכם, ומה ענין החכמה בזה יותר הול\"ל תואר צדיק וחסיד, גם מהו האשמה שכל ישראל נתעסקו בביזה, הרי היו מצווין על ככה מפי הגבורה, ואם הי' אפשר לקיים שניהם, מדוע באמת נמנעו ממצוה רבה כזו, והיו מושבעין על זה מפי יוסף הצדיק, ומדוע שבקו לי' למשה לבדו, ובגמ' תירצו מפני שאמרו כבודו בגדולים יותר מבקטנים, וא\"כ הרי לש\"ש נתכוונו ומהו האשמה בדבר וצ\"ב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 116,
      "char_length": 559,
      "timestamp": "2025-02-06T19:22:09.789766"
    },
    {
      "id": "beshalach1_p117",
      "text": "ולבאר הענין נקדים מ\"ד במד\"ר להלן (פכ\"ה ס\"י) ויותירו אנשים ממנו, אלו מחוסרי אמנה שבהם וכו' מיד ויקצוף עליהם משה, כיון שכעס שכח לומר להם שילקטו ביום הששי ב' עומרים לאחד כיון שהלכו ולקטו ביום הששי ומצאו כפלים, באו הנשיאים ואמרו למשה שנא' ויבואו כל נשיאי העדה ויגידו למשה, ומה אמר להם הוא אשר דבר ד' וגו', ואינו אומר הוא אשר דברתי, אלא אשר דבר ששכח עכ\"ד המדרש, והקשה היפ\"ת והלא הי' ראוי לומר להם דין זה תיכף ביום א' כמו שאמר להם כל הפרשה של מן, והכעס הי' אח\"כ ביום ב' כשהותירו ומדוע תלו רז\"ל סיבת השכחה ומניעת הציווי בקצף על המותירים, (וביארנו בזה בדברנו להלן עיי\"ש).",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 117,
      "char_length": 563,
      "timestamp": "2025-02-06T19:22:10.081903"
    },
    {
      "id": "beshalach1_p118",
      "text": "והנל\"פ לענינינו עפימ\"ד במדרש ילקוט (ר\"פ דברים רמז תשצ\"ט) אחד עשר יום מחורב, אלו זכו ישראל לאחד עשר יום היו נכנסין לארץ, אלא מתוך שקלקלו מעשיהם גלגל עליהם המקום למ' יום ארבעים שנה וכו', ר' יהודה אומר אלו זכו ישראל לג' ימים היו נכנסין לארץ שנא' וכו' עכ\"ד המדרש, והנה כתיב ובני ישראל אכלו את המן ארבעים שנה עד בואם אל ארץ נושבת את המן אכלו עד בואם אל קצה ארץ כנען, וטרם שעברו הירדן נפסק ירידת המן כמבואר בדרז\"ל, ומעתה אפ\"ל דע\"כ לא אמר להם משרע\"ה מצות והי' ביום הששי והכינו, ביום הראשון כשהתחיל ירידת המן ואמר להם כל הפרשה, כי הי' עדיין הי' משרע\"ה מצפה שיזכו ישראל למעלת השלימות, ולג' ימים יהיו נכנסים לארץ ומיד יפסק ירידת המן, ולא יהי' צורך להם באזהרה זו והי' ביום הששי והכינו, אמנם כשראה ביום השני ולא שמעו אל משה ויותירו וגו', השיג מעכשיו שלא הגיעו ישראל עדיין לבחי' זכו, וע\"כ אז הי' זמנו לומר להם מצות השבת, אלא מתוך שכעס ונצטער על מדריגתם של ישראל, שכח לומר שילקטו ביום הששי ב' עומרים לאחד, וא\"ש דסיבת הכעס גרמה, וביום השני דייקא.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 118,
      "char_length": 931,
      "timestamp": "2025-02-06T19:22:10.378470"
    },
    {
      "id": "beshalach1_p119",
      "text": "ועד\"ז יתבאר דברי המכילתא (הובא לעיל בדרוש הקדום) אמר הקב\"ה אקיפם במדבר מ' שנה שיהיו אוכלין מן ושותין מי הבאר והתורה נבללת בגופן וכו', ולכאורה הרי מפורש בכתוב טעם אחר, דסיבת הליכתם דרך המדבר הי' לטעם פן ינחם העם וגו' וכבר ביארנו בזה אופנים שונים, ולענינינו אפ\"ל דאלמלי זכו ישראל היו נכנסין לא\"י מיד, כי לא הי' מקום להך חששא פן ינחם העם וגו' שיחשבו מחשבה אחרת כפרש\"י ז\"ל, אבל מפני שידע הבוי\"ת שלא הגיעו ישראל עדיין לשלימותם, ויחשבו מחשבות לסור ממצות ד' וכמו שאירע להם. ע\"כ הקיפם הקב\"ה מ' שנה במדבר, שיהי' התורה נבללת בגופן ולא יסורו ממנה, נמצא דטעם המכילתא מקושר עם טעם המבואר בפסוק, דלולי הטעם פן ינחם, לא הי' צורך להקיפם במדבר לטעם המכילתא.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 119,
      "char_length": 640,
      "timestamp": "2025-02-06T19:22:10.828425"
    },
    {
      "id": "beshalach1_p120",
      "text": "ובזה נבוא לבאר דברי המדרש הנ\"ל ויסב אלקים את העם דרך המדבר וגו', מכאן אמרו רבותינו אפי' עני שבישראל לא יאכל עד שיסב, דהנה התוס' (בר\"פ ערבי פסחים) פירשו בטעם הרבותא דאפי' עני שבישראל וכו', דס\"ד דהסיבת עני לא חשיבא הסיבה, דאין לו על מה להסב ואין זה דרך חירות, ויש מפרשים דאדלעיל קאי לא יאכל עד שתחשך, ואפי' עני שלא אכל כמה ימים לא יאכל עד שתחשך, ומ\"ש לא יאכל עד שיסב הוא מילתא באפי נפשי' ולא מיירי בעני, אמנם בדברי המדרש כאן שלא נזכר הלכה זו דלא יאכל עד שתחשך, עכ\"ח רבותא דאפי' עני קאי על חיוב הסיבה וכפי' הראשון של התוס'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 120,
      "char_length": 520,
      "timestamp": "2025-02-06T19:22:11.150495"
    },
    {
      "id": "beshalach1_p121",
      "text": "ואפ\"ל עפ\"י דרכם דס\"ד דהסיבת עני לא חשיבא דרך חירות ולא מטעמם, וע\"ד שפי' בספה\"ק מעשה ד' ואילו לא הוציא הקב\"ה את אבותינו ממצרים, הרי אנו ובנינו וכו' משועבדים היינו לפרעה במצרים, ר\"ל דאלמלי לא הוציא הקב\"ה את אבותינו ביד חזקה, אלא פרעה ברצונו הי' משלחם, הרי אנו ובנינו עד סוף כל הדורות היינו משועבדים אליו שעבוד נפשי והתחייבות הכרת תודה, וזה גרוע ומזיק לבחי' הנפש יותר משעבוד הגוף עיי\"ש לדרכו, והנה כמו\"כ העני שאין לו מה לאכול ומצטרך ליהנות מאחרים, מדרך הטבע שהוא נעשה משועבד ומשוחד אל המחזיקים בו, וקשה לו לגלות ולפרסם האמת אשר הוא בהתנגדות לרצון תומכיו ועוזריו, ובעוה\"ר ככה הוא גם בהחזקת התורה, ישנם מנהיגים כשרים אשר לבם כואב על חילול שמו ית', ועל הפרת הדת והאמונה ר\"ל, אבל מפני שמקבלים תמיכה להרבצת התורה מאינשי דלא מעלי המחזיקים בדעת המינות וברעיון המדינה הציונית, בע\"כ נעשים משועבדים לדעת תומכיהן. וא\"א להם לגלות האמת כפי מה שבלבם בדעת התוה\"ק, ואף שכוונתם לש\"ש להרבצת התורה, אבל זהו מתחבולות היצה\"ר, כמ\"ש בספה\"ק זרע קודש לפרש הכתוב לא תקח שוחד כי היצה\"ר אם רוצה למנוע אחד ממצוה גדולה ועיקרות, משחד עיניו במצוה אחרת, כדי למנעו ממצוה היותר גדולה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 121,
      "char_length": 1046,
      "timestamp": "2025-02-06T19:22:11.425763"
    },
    {
      "id": "beshalach1_p122",
      "text": "והנה כמו\"כ העני שאין לו משלו ונהנה משל אחרים, ורוצה להראות בעצמו דרך חירות ולספר בנסי השי\"ת בגאולה האמיתית, אבל ה\"ה משועבד לדעת המחזיקים בו, וע\"כ הי' ס\"ד לומר דלא יתחייב בהסיבה דלא חשיבא דרך חירות, אמנם באמת צריך להתגבר בנסיון זה שלא לזוז מדעת התוה\"ק ודרך האמת אף עבור כל הון דעלמא, וזהו החרות האמיתי להיות מקושר ומשועבד לדרך התוה\"ק, ולפרוק מעליו כל שעבוד אחר זולתו, והראי' ממה שהסיב הקב\"ה את ישראל דרך המדבר, ועיכבם מ' שנה במדבר ונתאחרו מחרות של ישיבת הארץ איש תחת גפנו ואיש תחת תאנתו, והכל לטעם שתהי' התורה נבללת בגופן כמבואר בדברי המכילתא, וע\"כ גם העני נתחייב בהסיבה ויכול להראות בעצמו דרך חירות, על אשר הוציא הקב\"ה אותנו ממצרים וזכינו אל התוה\"ק, אשר כל החירות שבעולם בטילים לגבי', ואין לך בן חורין אלא מי שעוסק בתורה, וז\"פ דברי המדרש ויסב אלקים את העם דרך המדבר מכאן אמרו רבותינו אפי' עני שבישראל לא יאכל עד שיסב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 122,
      "char_length": 817,
      "timestamp": "2025-02-06T19:22:11.997616"
    },
    {
      "id": "beshalach1_p123",
      "text": "וכמו\"כ לענינינו להחזקת הישיבה ובתי ת\"ת כאן ובא\"י, מוכרחים אנו לקבל תמיכה להחזקת התורה כי המצב קשה מאוד כידוע, אבל ח\"ו לסוג אחור מדעת התוה\"ק אפי' זיז כ\"ש, ואף בעד כל כסף וזהב שבעולם, ויותר אני מוותר על הכל, וכמו שפירשתי בנסיון של אאע\"ה שהשליכו נמרוד לכבשן האש על שלא רצה להשתחוות לע\"ז, ולכאורה מה נסיון הוא זה בערך רום קדושתו ומסנ\"פ של אאע\"ה אמנם אחד הי' אברהם שפירסם אלקותו ויחודו ית' בעולם, והודיע לכל באי עולם שיש אלקי הממציא כל המציאות והוא יחיד ואין זולתו, ועכשיו שרצה נמרוד להשליכו לכבשן האש, בא אליו הבע\"ד בטענת הסתה, הלא אין בעולם זולתך המפרסם אמונת הבוית\"ש, ואם תושלך לאש ותשרף הלא ישארו כל העולם תועים ונתעים אחרי הע\"ז, מוטב לך לוותר עכשיו הפעם ולהשתחוות לע\"ז ואח\"כ תוכל להמשיך בדרכך להשריש האמונה בלבות בנ\"א, רק זאת הפעם תשתחוה לע\"ז בשביל תיקון העולם, אמנם אאע\"ה השיב לו אין אני רוצה להשתחוות לצלם אף בשביל תקון העולם: ואף שהשתוקק מאוד להאיר דרך לתועים ולהמשיכם לאמונת הבוית\"ש אבל להשתחוות לצלם בשביל זה לא אסכים בשום אופן שבעולם, ויותר אני מוותר על הכל והשי\"ת יעשה את שלו ואני עשיתי כל מה שבאפשרותי, וזה הי' הנסיון היותר גדול שהשליך מנגד כל רצון נפשו אף בעבודת השם מה שהי' משתוקק בכל לבו ונפשו לפרסם אמונתו ית' לכל באי עולם, ולא נעשה משוחד אל הרצון הזה, אבל ביטל רצונו מפני רצונו ית'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 123,
      "char_length": 1195,
      "timestamp": "2025-02-06T19:22:12.431794"
    },
    {
      "id": "beshalach1_p124",
      "text": "ובדרך אגב נל\"פ דברי הגמ' במסכת מגילה (ז' ע\"א) דאיכא שם הרבה ילפיתות דאסתר ברוה\"ק נאמרה, ר' יוסי בן דורמסקית אומר אסתר ברוה\"ק נאמרה שנאמר ובביזה לא שלחו את ידם, פרש\"י האיך ידעו מה עשו הרחוקים אי לאו דברוה\"ק נאמרה, אמר שמואל אי הואי התם הוה אמינא מלתא דעדיפא מכולהו שנא' קימו וקבלו וכו', אמר רבא לכולהו אית להו פירכא לבר מדשמואל דלית ליה פירכא וכו' והא דר' יוסי בן דורמסקית דלמא פריסתקי שדור פרש\"י שלוחים שלחו להם למרדכי ואסתר שלא נגענו בביזה שלא ירע למלך, וא\"כ אין ראי' מזה דברוה\"ק נאמרה עכ\"ד הגמ', ויל\"ד מאי הי' ס\"ד דגמ' מעיקרא לילף מהכא דברוה\"ק נאמרה, הלא המגילה לא נכתבה מיד כ\"א אחר זמן, כאמרז\"ל שלחה אסתר לחכמים קבעוני לדורות ולא רצו עד שדרשו כתוב זאת זכרון בספר וכו' עיי\"ש, וא\"כ במשך הזמן אפשר שחקרו כל פרטי פרטיים וגם שלחו הרחוקים שלוחים כקושית הגמ', ומנ\"ל דברוה\"ק נאמרה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 124,
      "char_length": 776,
      "timestamp": "2025-02-06T19:22:13.035659"
    },
    {
      "id": "beshalach1_p125",
      "text": "וק\"ז הישמח משה זלה\"ה (בפ' ואתחנן) ביאר דברי הגמ' הנ\"ל בדרך נעים ונחמד וז\"ל יש להבין מה הי' הכוונה בזה שלא שללו וכו' והנ\"ל דיש בו ענין נסתר לבד הפשוט, דהנה יש להבין מ\"ד בגמ' (גיטין נ\"ז) מבני בניו של המן למדו תורה ברבים וא\"כ מזה מוכרח שלא כלו זרע המן. וע\"ז יש לתמוה שמהסברא הי' ראוי לראשונה לכלות זרע הצורר, אבל הענין יובן עפימ\"ש ז\"ל (שמו\"ר פ\"א סכ\"ט) ויפן כה וכה וירא כי אין איש עתיד לצאת ממנו שיתגייר, ולכך באלו שהי' בהן ניצוצות הקדושה לא נגעו בהן. או שנשפע רוה\"ק על כל ישראל וכו', ואנשי הכנה\"ג כתבו המגילה וידעו זה ברוה\"ק, והנה איתא בספרים על פסוק ושבתי אני וראיתי דמעת העשוקים, שהכוונה על ניצוצות הקדושה שנשבו בתוך הטומאה, ועפי\"ז מדוקדק מאוד הלשון ובביזה במקום שיש ביזה לא שלחו את ידם. אמנם לפי\"ז צ\"ב פירכת הגמ' דלמא פרסתקי שדור, והוא ז\"ל תירץ דהפירכא רק לפי הפשטיות שהוא הלבוש, משא\"כ להפנימות, ולכך לא אמר אית להו תיובתא עייש\"ד כי נעמו ועוד נבאר בזה לדרכנו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 125,
      "char_length": 859,
      "timestamp": "2025-02-06T19:22:13.422497"
    },
    {
      "id": "beshalach1_p126",
      "text": "ונל\"פ אף לפי פשוטו דהכוונה על ביזה של כסף וזהב וכלים נחמדים, דהנה בני ישראל היו עסוקים לכלות שונאיהם ושונאי ד' זרע עמלק נוסף לזה היו צריכים להזהר שלא להרוג אותן שיש בהן ניצוצות הקדושה, כמ\"ש ק\"ז זלל\"ה שנשפע רוה\"ק על כל ישראל וידעו להזהר בזה, אמנם הנותן דעתו אל הביזה, לא ימלט שלא ינטה מן תכליתו, כי נעשה משוחד אל הרצון הזה, וכל מטרתו רק להשיג מן הביזה כל מה שאפשר, לז\"א הכתוב והרוג בשונאיהם חמשה ושבעים אלף, ואל תחשוב שלא כוונו אל המערה להרוג הראויים ליהרג, ולהניח הראויים להמלט, לז\"א ובביזה לא שלחו את ידם, שלא נגעו בביזה כלל, ואם אין משוחדים אל הביזה אז מגיעים אל האמת.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 126,
      "char_length": 570,
      "timestamp": "2025-02-06T19:22:13.855224"
    },
    {
      "id": "beshalach1_p127",
      "text": "אמנם לא יספיק מה שלא לקחו מן הביזה בפועל, דאף אם רק נותנים דעתם להשיג מן הביזה, א\"א לכוון אל האמת, וכמו שאירע להרבה בנ\"א שתעו מדרך האמת, בשביל שהיו מצפים להנאה המדומה ונשתחדו אל הרצון הזה, אף שלא הגיע אליהם ונסתיים בהבל וריק, אולם כותבי המגילה ידעו ברוה\"ק שלא כוונו שום א' מישראל אל הביזה, ולא שלחו את ידם להרוג בשונאיהם לכוונת הביזה, ומזה למדו ז\"ל דאסתר ברוה\"ק נאמרה, ול\"ק דחיית הגמ' דלמא פריסתקי שדור, ששלחו שלוחים להודיע למרדכי ואסתר שלא נגעו בביזה, דא\"א לברר דבר זה על ידי שליח ואין אדם יודע מה שבלב חבירו ועכ\"ח דברוה\"ק נאמרה, ומה דדחו בגמ' דברי ר\"י דדלמא פריסתקי שדור, היינו אלמלי לא הי' לנו ילפותא דשמואל דאסתר ברוה\"ק נאמרה, היינו מפרשים ובביזה לא שלחו את ידם שלא לקחו בפועל, וא\"כ אין ראי' דברוה\"ק נאמרה, דדבר זה אפשר שהודיעו ע\"י שלוחים כדחיית הגמ' דלמא פריסתקי שדור, אבל לפי המסקנא דאסתר ברוה\"ק נאמרה, נרמז בכתוב גם שלא נתכוונו אל הביזה וע\"כ ע\"י רוה\"ק דאל\"ה מנא ידעי, וכמו\"כ אפ\"ל לדרך ק\"ז הישמח משה זלה\"ה, דבאמת לפי המסקנא שכבר נתברר לנו ממקו\"א דאסתר ברוה\"ק נאמרה, מסתבר שנרמז ג\"ז בפסוק ובביזה לא שלחו את ידם, שלא נגעו להרוג במקום שיש ניצה\"ק, ומה דדחי בגמ' דלמא פריסתקי שדור, היינו אלמלי לא הי' לנו ילפותא ממקו\"א אין הכרח מכאן דברוה\"ק נאמרה, דדלמא פי' הכתוב כפשוטו, וע\"ז איכא דחויא דלמא פריסתקי שדור והבן.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 127,
      "char_length": 1212,
      "timestamp": "2025-02-06T19:22:14.152704"
    },
    {
      "id": "beshalach1_p128",
      "text": "היוצא לנו מזה דבמקום שיש עסק של ביזה צריך לסייעתא דשמיא מרובה שלא יכשל האדם וינטה מדרך האמת, כי השוחד יעוור עיני חכמים, וכבר פירשתי במאמר הנביא (ישעי' א') שמתאונן שם על מצב הדור בעת החורבן ואמר שריך סוררים וחברי גנבים כולו אוהב שוחד ורודף שלמונים וגו', דהנה ממ\"ש כולו אוהב שוחד ולא אמר כולו לוקחי שוחד. משמע שלא הי' כללות הדור בזה הבחי' רעה לקבל שוחד: רק היו אוהבי שוחד, ולכאורה מאי גריעותא כ\"כ אם רק אהבו את השוחד ונתגברו על יצרן ולא קבלו, ומדוע מונה אותו הנביא בין עבירות החמורות כ\"כ, ויש מהקדמונים דס\"ל דעדיף טפי מי שיש לו נטי' אל הרע ומתגבר עליו, שעושה לכבוד קונו, משא\"כ מי שבטבעיותו מרוחק ממנה במה עובד את אדוניו, ומסייע להם מדברי רז\"ל (תו\"כ סו\"פ קדושים) אל יאמר אדם אי אפשי בבשר חזיר וכו' והרמב\"ם חולק עליהם, (עיין ישמח משה פ' ראה) אמנם שאני שוחד מכל עבירות שבתורה, דאם יש לאדם נטי' ח\"ו אל א' מהעבירות ונתגבר על יצרו ולא עשאה, הרי עדיין לא פעל און ואדרבה עבודה גדולה הוא, משא\"כ שוחד מעוור עיני האדם ומרחיקו מדרך האמת, וע\"כ אף אם יש לו רק נטי' ואוהב את השוחד ומצפה לקבלו, אף אם לא יקבל כלום, הדמיון בלבד מעוור עיני שכלו, ואף שוחד דברים נמי אסור כאמרז\"ל (כתובות ק\"ה ע\"ב) והביאו בגמ' שם מעשה בר' ישמעאל בר אלישע דאייתי לי' האי גברא ראשית הגז, וא\"ל דינא אית לי, א\"ל פסילנא לך לדינא ולא קביל מיני', אותיב לי' זוגא דרבנן וקדייני לי', בהדי דקאזיל ואתי אמר אי בעי טעין הכי ואי בעי טעין הכא, (פרש\"י בכל אשר הולך ובא הי' לבו לזכותו וכו', ואומר בלבו הלואי ויטעון כך וכך ויזכה בדין) אמר תיפח נפשם של מקבלי שוחד. ומה אני שלא נטלתי ואם נטלתי שלי נטלתי כך, מקבלי שוחד עאכו\"כ, ולזה התאונן הנביא כולו אוהבי שוחד, אף שלא היו כולם מקבלי שוחד אבל מפני שהי' ענין השוחד אהוב אצלם כבר נתרחקו מאור האמת וצריך למאוס בזה בתכלית ההתרחקות.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 128,
      "char_length": 1617,
      "timestamp": "2025-02-06T19:22:14.762928"
    },
    {
      "id": "beshalach1_p129",
      "text": "ובזה יתבאר דברי הגמ' (סוטה י\"ג ע\"א) שכל ישראל נתעסקו בביזה ומשרע\"ה נתעסק בעצמות יוסף שנא' חכם לב יקח מצות, (עיין לעיל קושיא ב') דאה\"נ שגם ישראל לש\"ש נתכוונו ונצטוו על ככה מפי ד', ואמרז\"ל בגמרא ברכות (דף ט' ע\"א) שא\"ל הקב\"ה למשה בבקשה ממך לך ואמור לישראל בבקשה מכם שאלו ממצרים כלי כסף וכלי זהב וכו' ומה דשבקו העסק בעצמות יוסף על משרע\"ה, היתה ג\"כ כוונתם לש\"ש כאמרז\"ל שאמרו כבודו בגדולים יותר מבקטנים, אמנם מפני שהיו עסוקין בביזה נעשו משוחדין אלי' והשוחד יעוור עיני חכמים ואמרז\"ל אם חכם חכמתו מסתלקת ממנו, משא\"כ משרע\"ה נתקיימה חכמתו. ולזה דרשו רז\"ל חכם לב יקח מצות זה משה שעסק בעצמות יוסף ונסתלק מן הביזה, ולכך תיארוהו בזה בתואר חכם, וסיפי' דקרא ואויל שפתיים ילבט נדרש על ישראל דמפני שהרבו העסק בביזה נאבדה חכמתם, ואפשר דאילולי כן היו מכריעים לקיים שניהם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 129,
      "char_length": 751,
      "timestamp": "2025-02-06T19:22:15.569009"
    },
    {
      "id": "beshalach1_p130",
      "text": "ויהי בשלח פרעה את העם וגו', במד\"ר (פרשה כ' סימן ז') מי צווח ווי פרעה משל למלך שהי' בנו הולך למדינה א' ושרה אצל עשיר אחד וכו', והיה המלך משלח אגרות אל אותו האיש וכו', עד שהלך והוציא את בנו בעצמו, התחיל אותו האיש צווח וכו', כך פרעה אמר כשהיו ישראל אצלי הי' הקב\"ה משלח לי אגרת בכל שעה, כה אמר ה' שלח עמי וכו', כשהוציא הקב\"ה את ישראל התחיל פרעה צועק ווי ששלחתי את ישראל עכ\"ד, וצ\"ב כי אין המשל דומה לנמשל כי האגרות שקבל פרעה היו התראות על המכות ולא של כבוד, ולמה הי' משתוקק אליהם עד שצווח עבורם ווי.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 130,
      "char_length": 494,
      "timestamp": "2025-02-06T19:22:15.938541"
    },
    {
      "id": "beshalach1_p131",
      "text": "ב) ויהפך לבב פרעה ועבדיו אל העם ויאמרו מה זאת עשינו וגו', הקשה האוהחה\"ק וכי לרצונם שלחו. והלא הכו מכות גדולות ובע\"כ שלחום, ולא הי' כאן שנוי רצון כלל, דרצונם עתה כרצונם מאז, ולא יתכן לומר ויהפך לבם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 131,
      "char_length": 197,
      "timestamp": "2025-02-06T19:22:16.200061"
    },
    {
      "id": "beshalach1_p132",
      "text": "ג) גם יל\"ד מ\"ש מה זאת עשינו כי שלחנו את ישראל וגו', ובאמת לא הי' כאן עשיה אחרת זולתי השליחות, והול\"ל מה זאת שלחנו את ישראל וגו', ולמה האריך הכתוב לכתוב תרתי מילי עשי' ושליחות, ולפי הנראה אינו אלא חדא, גם הלשון כי שלחנו אינו מובן.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 132,
      "char_length": 229,
      "timestamp": "2025-02-06T19:22:16.348289"
    },
    {
      "id": "beshalach1_p133",
      "text": "ד) יל\"ד במה שפי' רש\"י ז\"ל ויהפך נהפכו לרדוף אחריהם בשביל ממונם שהשאילום, ויש להבין למה שינה רש\"י מהטעם המפורש בקרא כי שלחנו את ישראל מעבדנו, ונתן טעם חדש בשביל ממונם שאינו מרומז בכתוב כלל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 133,
      "char_length": 188,
      "timestamp": "2025-02-06T19:22:16.510007"
    },
    {
      "id": "beshalach1_p134",
      "text": "ה) במד\"ר (ס\"י) ויהי בשלח פרעה הה\"ד אמרו לאלקים מה נורא מעשיך ברוב עוזך יכחשו לך אויביך וכו' ר' ברכיה אמר יעשו כזבים בדבריהם כענין שנאמר וכחש בעמיתו, מתחלה אמר וגם את ישראל לא אשלח, ואח\"כ הוא הי' מחזיר על פתחיהן של ישראל וא\"ל לכו לשלום צאו לשלום הוי ברוב עזך יכחשו לך אויביך ע\"כ, ראוי להבין דלכאורה אין זה בגדר כחש וכזב, דמתחלה כשאמר את ישראל לא אשלח כן הי' דעתו ורצונו באמת, ופיו ולבו שווין, וגם עתה לא נשתנה רצונו, אלא שבע\"כ שלחם, ולא שינה דיבורו דמ\"ש לא אשלח כוונתו שלא ישלח ברצון עצמו, ולא עבר ע\"ז. ואין זה בגדר כחש וכזב, גם קשה דהול\"ל דרשא זו על פסוק קומי צאי מתוך עמי, כי שם מקומו בפ' הקודמת, ולמה המתין עד הכא. ואיך שייכא דרשא זו לכאן.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 134,
      "char_length": 641,
      "timestamp": "2025-02-06T19:22:16.638286"
    },
    {
      "id": "beshalach1_p135",
      "text": "ו) בפסיקתא ויהי בשלח פרעה וגו' ילמדינו רבינו השולח יד בפקדונו של חבירו כיצד הוא נגבה, כך שנו רבותינו השולח יד בפקדון ב\"ש אומרים ילקה בחסר וביתר, וב\"ה אומרים כשעת הגזילה וכו' ומנין שהיו ישראל בידו פקדון. שכן הוא אומר למשה שיאמר לישראל פקד פקדתי אתכם וכו' ובשביל ששלח יד בהם שבר הקב\"ה את זרועו וכו', ולכאורה קשה דלמה לי טעמא דפקדון, והלא בלא\"ה ראוי שיענש, שהושלכו ילדיהם ליאור על פקודתו ושקעם בבנין, והכו ע\"י הנוגשים, והרבה עליהם גזירות רעות, ומי שעושה כל אלה ראוי שיענש אפי' אינם בתורת פקדון אצלו, גם ראוי להבין דהול\"ל דרשא זו בפ' שמות עה\"פ הבה נתחכמה, וימררו את חייהם, כי שם מקומו, ולמה הסמיכו דרשא זו לפ' ויהי בשלח פרעה, וצ\"ב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 135,
      "char_length": 627,
      "timestamp": "2025-02-06T19:22:16.989577"
    },
    {
      "id": "beshalach1_p136",
      "text": "ולבאר כל הענין נקדים מה שהקשה האוהחה\"ק בפ' שמות וז\"ל: צריך לתת לב, למה יצו ה' דברים שאינם מהמוסר, לגנוב דעתם של המצרים במ\"ש נלכה נא דרך שלשת ימים, כי ח\"ו לא קצור קצרה ידו מפדות ישראל בע\"כ, גם בהשאלת כליהם למה יצטרכו לעשות דרך ערמה, הלא הי' ביכולת השי\"ת להוציא ממונם בע\"כ ועיניהם רואות וכלות, גם היו המצרים נותנים להם ברצונם אפי' בדרך מתנה כמ\"ש במדרש שאמרו עול שנים וצא, כי אמרו כולנו מתים, ותירץ האוהחה\"ק כי נתכוין ה' בזה להטעותם כדי שירדפו אחריהם, וזולת השאלה, גם זולת הליכתם בדרך זה על דעת לחזור, לא היו המצרים רודפים אחריהם והיו מתייאשים מחזרתם, ומ\"ש נלכה נא דרך שלשת ימים לא הי' דברי השי\"ת, אלא זקני ישראל אמרו כן, גם השאלת כליהם אין בו דברי שקר, כי בתורת שאלה בא לידם אלא שעכבוהו בעד תביעתם של שכר שכיר שעבדו להם וכו' עיי\"ש.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 136,
      "char_length": 729,
      "timestamp": "2025-02-06T19:22:17.320627"
    },
    {
      "id": "beshalach1_p137",
      "text": "אמנם עדיין צ\"ב כי למה יצטרך להטעותם בשביל שיתנו לב לרדוף אחריהם, והרי כמה דרכים למקום, והי' אפשר שיתן השי\"ת בלבם כבדות לב שירדפו אחריהם אף אם יהי' תחילת הליכתם שלא ע\"מ לחזור, ואמרו ז\"ל במדרש שפרעה שחרר אותם לגמרי בשעה שיצאו וא\"ל הרי אתם בן חורין הרי אתם ברשותכם, ואעפ\"כ הפך לבו ורדף אחריהם, וכמו\"כ הי' רודף אחריהם אף אם לא אמרו לו מתחלה נלכה נא דרך שלשת ימים. גם מה שתירץ האוהחה\"ק דזקני ישראל אמרו כן, ולא הי' דברי השי\"ת, אינו מתורץ בזה כל צרכו, שהרי אמרו חכז\"ל במס' סוכה (דף מ\"ו ע\"ב) לא לימא איניש לינוקא דיהיבנא לך מידי ולא יהיב לי' משום דאתי לאגמורי' שיקרא, שנאמר למדו לשונם דבר שקר, ואיך יתכן שבשעת שיצאו ישראל ממצרים והיו מוכנים לקבלת התורה, ועתה הי' התחלת הדרכתם לתורה ומצות, שילמדו לשונם דבר מרמה, וצ\"ב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 137,
      "char_length": 710,
      "timestamp": "2025-02-06T19:22:17.717408"
    },
    {
      "id": "beshalach1_p138",
      "text": "ולבאר כל אלה נקדים מה שהקשה הפרשת דרכים (בדרוש ה' דרך מצרים) וז\"ל איך דן הקב\"ה את המצריים במיתה וממון, והא קיי\"ל דאין אדם מת ומשלם. וכתבו התוס' בפ\"ה דמס' ע\"ז (דף ע\"א) דגם בבני נח אמרינן קים לי' בדרבה מיני' וא\"כ כיון שהמצריים נתחייבו מיתה איך נענשו גם בממון, ותירץ דקיי\"ל כרבנן דס\"ל דלא אמרינן קים לי' בדרבה מיני' אלא במיתה בידי אדם, אבל במיתה בידי שמים אדם מת ומשלם דלא קיי\"ל כר' נחוניא בן הקנה שהי' עושה את יוהכ\"פ כשבת עיי\"ש, ובדרך המצפה (בדרוש כ\"ו) כתב לתרץ קושיא זו דאפי' לדברי ר' נחוניא בן הקנה א\"ש, עפימ\"ש התוס' בכתובות (דף ל' ע\"ב ד\"ה זר), דגזירת הכתוב הוא בהקדש ותרומה דלא אמרינן קים לי' בדרבה מיני', ואמרי בהו מת ומשלם, ומעתה א\"ש אפי' לר' נחוניא דכיון דישראל קודש וראשית תבואתו של הקב\"ה דהיינו תרומה, כדמשמע מסוגית הגמ' קידושין (דף נ\"ג ע\"א) דראשית תבואתו היינו תרומה עיי\"ש, וע\"כ מדינא חייבים המצריים וכל האומה\"ע המריעים לישראל להיות לוקים ומשתלמים על ידיהם, ופי' בזה הכתוב קודש ישראל לה' ראשית תבואתו, ע\"כ כל אוכליו יאשמו, ר\"ל שחייבים לשלם מלשון ואת אשמו ישוב בראשו, וגם רעה תבוא עליהם שיענשו בידי שמים, עכת\"ד ז\"ל. ומעתה א\"ש דהי' ההכרח ליקח מידם הרכוש בתורת שאלה, דאלמלי הגיע לידם מעיקרא בתורת תשלומין, הי' פתחון פה למקטרג שלא יוכו המצריים עוד שאין אדם לוקה ומשלם, ע\"כ קבלוהו מעיקרא בתורת שאלה, ואחר שיצאו ונעשו הקדש כמו שיתבאר להלן זכו בהרכוש להיות שלהם לחלוטין.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 138,
      "char_length": 1270,
      "timestamp": "2025-02-06T19:22:18.088853"
    },
    {
      "id": "beshalach1_p139",
      "text": "ובזה יתבארו דברי רש\"י ז\"ל ויהפך לבב פרעה וגו' נהפכו לרדוף אחריהם בשביל ממונם שהשאילום, שאמרו לקינו ונטלו ממוננו ושלחנום וכו', כי מעיקרא היו מוכרחים לשלחם מפני המכות, ושמחו מצרים בצאתם, אבל עכשיו שנטלו את ממונם לחלוטין חשב פרעה כי מעתה בלא\"ה לא היו לוקין עוד, כי אין אדם לוקה ומשלם וע\"כ התחרט על מה ששלחם, וזה שפרש\"י ויהפך לבב פרעה וסיבת ההחרטה הי' בשביל ממונם שהשאילום שאמרו לקינו ונטלו ממוננו ושלחנום, כי לא הי' מוכרח עוד השליחות כי בלא\"ה לא היינו לוקים עוד אחרי שנטלו ממוננו, ולא ידע פרעה גם לא האמין שיש להם דין הקדש ע\"כ התחרט על ששלחם, וסיבת החרטה היתה בשביל ממונם כמו שפירש\"י וא\"ש.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 139,
      "char_length": 586,
      "timestamp": "2025-02-06T19:22:18.693473"
    },
    {
      "id": "beshalach1_p140",
      "text": "ונקדים עוד מ\"ד במד\"ר פרשת בא (פ' ט\"ז סימן ב') משכו וקחו לכם צאן הה\"ד בשובה ונחת תושעון וצ\"ב, אכן יתבאר עפי\"ד הירושלמי במס' תענית (פ\"א ה\"א) ר' אחא בש\"ר תנחום בי ר' חייה אמר אילו ישראל עושין תשובה יום א' מיד הי' בן דוד בא, מ\"ט היום אם בקולו תשמעו, א\"ר לוי אילו היו ישראל משמרין שבת אחת כתיקונה מיד הי' בן דוד בא, מ\"ט דכתיב כי שבת היום לה' חד יום, (ופי' בקרבן העדה דיליף לי' גז\"ש היום היום, מפסוק הנ\"ל היום אם בקולו תשמעו) ואומר בשובה ונחת תושעון, בשובה ונייח תתפרקון ע\"כ, עכ\"פ דרשת הירושלמי מהאי קרא דע\"י תשובה ומנוחת השבת יזכו ישראל לגאולתם, בשובה היינו תשובה, ונייח היינו מנוחת השבת, ובזכותם תושעון, והנה קיימו ישראל ב' בחינות הנ\"ל, דמצוה זו דמשכו וקחו לכם קיימו בעשור לחודש שהי' שבת הגדול, ואמרו חכז\"ל משכו ידיכם מע\"ז וכו' ואיתא במדרש שכפרו בע\"ז ועשו תשובה הגונה, נמצא שהי' להם ב' הזכותים, זכות השבת, וזכות התשובה, והיו ראויים להגאל, ועפימ\"ש הטו\"ז (בסי' רמ\"ב) עמ\"ש חז\"ל כל המשמר שבת כהלכתה אפי' עוע\"ז כדור אנוש מוחלין לו. איכא למידק ממנ\"פ אי לא עשה תשובה שבת מאי מהניא, ואי עשה תשובה שבת ל\"ל, ותירץ דמיירי שעשה תשובה, אלא דתשובה לא מהני שיהא מוחלין לו לגמרי כדאיתא במס' יומא בפ' יוהכ\"פ, עבר על כריתות ומיתות ב\"ד תשובה תולה ומיתה ממרקת, קמ\"ל כאן דאם בעשותו תשובה שומר שבת כהלכתה, מהני התשובה שיהא נמחל לו לגמרי, וע\"כ בנ\"י במצרים שהיו עוע\"ז ועברו על מיתת ב\"ד, היו צריכין לתשובה בצירוף שמירת שבת, ועי\"ז נמחלו עונותיהם והי' ראויים לגאולה, וז\"ש במדרש הנ\"ל משכו וקחו לכם הה\"ד בשובה ונחת תושעון. שהי' להם כאן צירוף זכות שניהם תשובה ושבת, ובזכות זה נגאלו וא\"ש.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 140,
      "char_length": 1453,
      "timestamp": "2025-02-06T19:22:18.988402"
    },
    {
      "id": "beshalach1_p141",
      "text": "ונקדים עוד מ\"ש המראה פנים להקשות על דברי ירושלמי הנ\"ל ממה דאיתא בגמ' שבת (דף קי\"ח ע\"ב) אמר ר' יוחנן אמר רשב\"י אלמלא משמרין ישראל שתי שבתות כהלכתן מיד נגאלים שנא' כה אמר ה' לסריסים אשר ישמרו את שבתותי, וכתיב בתרי' והביאותים אל הר קדשי וגו' ובירושלמי הנ\"ל מבואר דע\"י שמירת שבת א' מיד נגאלין, עיי\"ש שכתב דפליגי הבבלי והירושלמי, אמנם אין סברא לאפושי פלוגתא במקום שאפשר להשוות דבריהם ואפשר לתרץ בהקדם מה שהקשה המהרש\"א ז\"ל (במס' נדה דף ל\"ח ע\"א) דאיך למדו רז\"ל מהאי קרא דאשר ישמרו את שבתותי, אלמלי שמרו ישראל ב' שבתות מיד נגאלין, מדכתיב שבתותי ומעוט רבים שנים, הא כתיב בתורה כה\"ג כמו אך את שבתותי תשמרו וכולל כל השבתות עד סוף ימי עמידת העולם ומהיכי תיתי לדרוש כאן על ב' שבתות לבד ע\"כ קושיתו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 141,
      "char_length": 684,
      "timestamp": "2025-02-06T19:22:19.715696"
    },
    {
      "id": "beshalach1_p142",
      "text": "וק\"ז הישמח משה זלה\"ה (בפ' תשא) כתב לתרץ קושיא זו ותו\"ד דיסוד האי כללא שאמרו חכז\"ל מיעוט רבים שנים, אף דלכאורה ראוי לן למיזל לחומרא ולומר שרבים משמעותו יותר משנים, אבל אם תרבה אין לו שיעור, ולא בא הכתוב לסתום אלא לפרש, והי\"ל להכתוב לפרש כמה, ע\"כ אוקמי' אמיעוטי' ומיעוט רבים שנים והיינו רק במקום שבוודאי יש לו סוף ושעור, אלא שאין ידוע כמה אז אמרינן מעוט רבים שנים, אבל במקום שבאמת אין לו סוף, א\"כ לא בא הכתוב לסתום, דפירושו באמת לעולם, וא\"ש דמ\"ש אך את שבתותי תשמורו פירושו לעולם, אבל מ\"ש ז\"ל דאלמלא שמרו ישראל ב' שבתות מיד נגאלין ולמדו כן מדכתיב אשר ישמרו את שבתותי, ע\"כ אין פירושו לעולם דכי עד עולם לא יגאלו ח\"ו עד שישמרו כל שבתות עולם, א\"ו יש בו שיעור ולא ידוע כמה, בזה אמרינן מעוט רבים שנים דלא בא הכתוב לסתום, ואם תאמר יותר הי\"ל להכתוב לפרש, עכת\"ד ז\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 142,
      "char_length": 754,
      "timestamp": "2025-02-06T19:22:20.038507"
    },
    {
      "id": "beshalach1_p143",
      "text": "ויתבאר עוד בהקדם מ\"ש ק\"ז הישמח משה זלה\"ה בפ' תשא) דכתבו המפורשים הטעם מ\"ש חכז\"ל שני שבתות דוקא, דלא הוי שבת אמיתי כמאמרם שביתה ביום השביעי, רק אם שומר מקודם שבת א'. וא\"כ מתחילין אחריו ששת ימי המעשה ואח\"כ שובת ביום השביעי, הרי קיים בזה מצות שבת כהלכתה, אבל שבת הראשון ששמר, אין זה יום השביעי אחר ששת ימי המעשה, רק אחר כמה מאות או אלפים ימי המעשה, ולא קיים המצוה כהלכתה, ופי' בזה ושמרו בנ\"י את השבת ר\"ל שצריכין לשמור שבת א', לעשות את השבת, ר\"ל כדי שיעשו את השבת האחר לשבת אמיתי ואז לדורותיכם לברית עולם, ובזכות זה יהיו נגאלין ויהי' כולו שבת עכדה\"ק.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 143,
      "char_length": 546,
      "timestamp": "2025-02-06T19:22:20.440643"
    },
    {
      "id": "beshalach1_p144",
      "text": "ומעתה לא יקשה קושית המראה פנים, ולא יהי' סתירה בין הבבלי והירושלמי, דבאמת אלו שמרו ישראל שבת א' מיד נגאלין כמ\"ש בירושלמי, וגם הבבלי סובר כן, ומ\"ש במס' שבת הנ\"ל דצריך שני שבתות, הוא לטעם הנ\"ל דא\"א שיהי' שבת א' כהלכתה, אא\"כ יקדים לה עוד שבת כדי שיהי' שמירת שבת ביום השביעי שאחר ששת ימי המעשה, ומתורץ ג\"כ קושית המהרש\"א ז\"ל דבאמת ע\"י שמירת שבת א' מיד נגאלין ונדרש כן ממ\"ש שבת היום כמ\"ש בירושלמי, ומ\"ש שני שבתות היינו טעמא משום דא\"א שיהי' שמירת שבת כהלכתה, בלתי אם יקדים לה שבת א', אבל לא הכריחו כן מדכתיב שבתות ומיעוט רבים שנים, ול\"ק קושית המהרש\"א ז\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 144,
      "char_length": 548,
      "timestamp": "2025-02-06T19:22:20.729488"
    },
    {
      "id": "beshalach1_p145",
      "text": "ובזה יתורץ קושית האוהחה\"ק במאמה\"כ דרך שלשת ימים נלך דאפשר שמעיקרא הי' יציאתם רק על ג' ימים, דהנה בעשור לחודש שמרו ישראל שבת ראשונה כהלכתה בצירוף התשובה, כמ\"ש הטו\"ז דצריך שמירת שבת בצירוף תשובה, אולם עדיין חסרו להם ששת ימי המעשה, דא\"א שמירת שבת כהלכתה מבלי שיקדים לה ששת ימי המעשה, וע\"כ הי' צורך לזכות גאולתם עוד שמירת שבת א', והנה כשיצאו ישראל ממצרים חמישי בשבת הי' וביום ג' שלאחר יציאתם שבת הי', ע\"כ מתחלה יצאו רק על ג' ימים. והי' תלוי זכות גאולתם בשבת הבאה, וכששמרו שבת שני' כתיקונה נגאלו לחלוטין ואלולי כן היו מוכרחים לחזור למצרים אחר ג' ימים, נמצא דמ\"ש נלכה נא דרך שלשת ימים, האמת כן הי' בשעת אמירתם, ולא הי' בזה רמאות ושקר חלילה והבוי\"ת מגיד מראשית אחרית ידע מתחלה שישמרו שבת שני' כהלכתה, וע\"כ לא נזכר במאמר השי\"ת הזמן של ג' ימים, כי היתה ידיעה אצלו שלא יחזרו לסוף ג' ימים למצרים, אבל זקני ישראל הם שאמרו לפרעה נלכה נא דרך ג' ימים כי כן הי' התנאי בשעת יציאתם כנ\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 145,
      "char_length": 869,
      "timestamp": "2025-02-06T19:22:21.017861"
    },
    {
      "id": "beshalach1_p146",
      "text": "ואפשר דע\"י ששמרו ישראל שבת שני' כהלכתה ובצירוף תשובה הגונה נעשו ישראל קודש לה', ומעתה דינם של המצרים להיות לוקים ומשלמים על ידיהם, ומתחלה הי' ההכרח ליקח מידם הרכוש בתורת שאלה כמו שכתבנו לעיל, ואחר שנעשו קודש זכו בה ועכבוהו בתורת תשלומין, ויובן בזה מה שפירש\"י ז\"ל בשם המכילתא ויסע משה את ישראל מים סוף, הסיען בעל כרחן שלא רצו לפרוש מפני ביזת הים שהי' גדולה מאוד והוצרך להסיען בע\"כ, ולכאורה קשה ממ\"ש ז\"ל (במס' ברכות דף ז') דבר נא באזני העם וישאלו איש מאת רעהו וגו' אין נא אלא לשון בקשה, בבקשה ממך הזהירם על כך שלא יאמר אותו צדיק אברהם ואח\"כ יצאו ברכוש גדול לא קיים בהם, הרי שלא רצו ליטול הרכוש והוצרך לבקשם ולהזהירם, ומדוע נשתנה רצונם בביזת הים שלא רצו לפרוש ממנה, ולדרכינו א\"ש כי מתחלה הוכרחו ליטלו בדרך שאלה דייקא וע\"כ לא הי' רצונם לקבלו, כי למה להם להטריח ברכוש שאינה שלהם. אבל בקריעת ים סוף שזכו בה בתורת תשלומין להיות מוחלטת אצלם, שכבר הי' דינם כקודש להיות המצריים לוקין ומשלמין, מעתה לקחוהו ברצון לבם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 146,
      "char_length": 905,
      "timestamp": "2025-02-06T19:22:21.436881"
    },
    {
      "id": "beshalach1_p147",
      "text": "באופן אחר אפשר לתרץ קושית האוהחה\"ק הנ\"ל, עפי\"מ דאיתא בפסיקתא הנ\"ל דישראל היו בתורת פקדון במצרים כמ\"ש פקד פקדתי אתכם וגו' והדין בשומר ששלח יד בפקדון ושינה מדעת הבעלים שחייב לשלם הנזק ולהחזיר את הפקדון מיד, שיכולים הבעלים לומר אינך נאמן עוד על השמירה, ואפי' בשואל ששאל על זמן קצוב ואין ביד הבעלים להחזירו מידו עד סוף ימי השאלה, אבל אם שלח בה יד ושינה מדעת הבעלים. דבר פשוט שיכולין הבעלים להחזירו מידו לפני תשלום הזמן. כי אינו נאמן על שמירתו, ובזה יתבאר דמתחלה בשליחות הראשונה אמרו לפרעה דרך שלשת ימים נלך והי' האמת כן כי הי' תליא גאולתם בזכות המעשים כנ\"ל, אבל אחר שסירב כ\"כ ולא רצה לשלחם במצות השי\"ת אף על ג' ימים, הי' שולח יד בפקדון ושינה מדעת הבעלים ופסקה שמירתו והפקדון חזרה לבעלים הראשונים, וע\"כ נעשו בן חורין לחלוטין, ולא חזרו אליו אחר ג' ימים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 147,
      "char_length": 747,
      "timestamp": "2025-02-06T19:22:21.858625"
    },
    {
      "id": "beshalach1_p148",
      "text": "והנה פרעה לא ידע דע\"י זכות שמירת שבת וכח התשובה נגאלו לחלוטין, אבל חשב דרק בשביל שפשע מדעת הבעלים וסירב מלשלחם, ע\"כ נפסקה שמירתו ולא חזרו לידו, ולזה התחרט על מה שסירב ולא אבה לשלחם על שלשת ימים, וחשב שאלמלי נתרצה לשלחם על ג' ימים ולא הי' מסרב לדברי השי\"ת, היו חוזרים להתעכב בארצו עד כלות זמן הפקדון ד' מאות שנה, וזה שאמה\"כ ויהפך לבב פרעה שהתחרט על מעשיו, מה שסירב לשמוע בשליחות השי\"ת, ואמר מה זאת עשינו ר\"ל לשלוח יד בפקדון, ועי\"ז כי שלחנו את ישראל מעבדנו, וע\"ד שדרשו חכז\"ל ושלחה מי שמשלחה ואינה חוזרת, וז\"ש כי שלחנו את ישראל, שאנחנו גרמנו ששלחנום לחלוטין ולא יחזרו עוד.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 148,
      "char_length": 569,
      "timestamp": "2025-02-06T19:22:22.255486"
    },
    {
      "id": "beshalach1_p149",
      "text": "ובזה יתבאר דברי המדרש שהתחלנו בפתח דברינו, מי צווח ווי פרעה צווח ווי משל למלך וכו' כך פרעה אמר כשהיו ישראל אצלו, הי' הקב\"ה משלח לו אגרות בכל שעה, כה אמר ד' שלח עמי וגו' הכוונה בזה כי פרעה הי' סבור שאלמלי היה משלחם על ג' ימים ולא הי' מסרב, היו ישראל חוזרים לארצו עד כלות הזמן של ד' מאות שנה ובכל פעם שהי' רצון השי\"ת שיזבחו לפניו במדבר, הי' משלח אליו אגרות ושליחים לאמר שלח עמי ויחוגו לי במדבר, וא\"ש מה שהתחרט פרעה וצווח ווי, והמשל דומה לנמשל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 149,
      "char_length": 441,
      "timestamp": "2025-02-06T19:22:22.571190"
    },
    {
      "id": "beshalach1_p150",
      "text": "ומעתה יובן דברי המדרש הנ\"ל הה\"ד ברוב עוזך יכחשו לך אויביך וכו' ר' ברכיה אמר יעשו כזבים בדבריהם כענין שנא' וכחש בעמיתו, הכוונה בזה דע\"י שאמר גם את ישראל לא אשלח שלח יד בפקדון, וע\"כ דרשו חכז\"ל יכחשו מלשון וכחש בעמיתו ר\"ל שהכחש האמור כאן הכוונה ששלח יד בפקדון כמ\"ש וכחש בעמיתו בפקדון, וע\"כ סיימו במדרש בשביל שאמר וגם את ישראל לא אשלח, אח\"כ הוא הי' מחזיר על פתחיהן של ישראל וא\"ל צאי לשלום, ונשתחררו מתחת ידו לחלוטין, וזה כוונת הפסיקתא שהביא לכאן האי דינא דשולח יד בפקדון, דפרעה שלח יד בפקדונו ולכך הוציא השי\"ת את ישראל מתחת ידו, וע\"כ צווח פרעה ווי, כי התחרט על מה ששלח יד בהם, וא\"ש קישור דרשא זו לכאן.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 150,
      "char_length": 597,
      "timestamp": "2025-02-06T19:22:22.805640"
    },
    {
      "id": "beshalach1_p151",
      "text": "באופן אחר אפ\"ל דברי המדרשים והדקדוקים הנ\"ל בהקדם דברי התנחומא ופרעה הקריב וגו' הקריב את ישראל לתשובה, כיון שראו ששבו ישראל לאחוריהם וחנו לפני פי החירות לפני בעל צפון. אמר פרעה בעל צפון הסכים על גזרתי לאבדם במים, התחיל לזבח לקטר ולנסך לע\"ז לכך נאמר ופרעה הקריב עכ\"ד המדרש, וצ\"ב דרישי' לאו סיפי'. דברישא דרשו הקריב את ישראל לתשובה, וסיום דבריהם הקריב לע\"ז והול\"ל דבר אחר לחלק ביניהם. ומדערבינהו נראה דיש קישור ביניהם וצ\"ב הקישור.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 151,
      "char_length": 427,
      "timestamp": "2025-02-06T19:22:23.129903"
    },
    {
      "id": "beshalach1_p152",
      "text": "ב) אז ישיר משה ובנ\"י את השירה הזאת לד' ויאמרו לאמר, במכילתא את השירה הזאת לד', לד' אמרוה ולא לבשר ודם ע\"כ וצ\"ב גם בפסוק יל\"ד מ\"ש ויאמרו לאמר, כפל ב' אמירות צ\"ב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 152,
      "char_length": 160,
      "timestamp": "2025-02-06T19:22:23.347279"
    },
    {
      "id": "beshalach1_p153",
      "text": "ג) איתא במכילתא לא הביאן הקב\"ה דרך פשוטה לא\"י אלא דרך המדבר, אמר הקב\"ה אם אני מביא את ישראל לארץ מיד מחזיקים איש בשדהו ואדם בכרמו והם בטלים מן התורה, אלא אקיפם במדבר מ' שנה שיהיו אוכלין מן ושותין מי הבאר והתורה נבללת בגופן וכו' עכ\"ד המכילתא, וכבר דקדקנו לעיל דאכתי בזה לא יתוקנו דורות הבאים שלא יהיו אוכלי המן, וחזרה חששא למקומה תורה מה תהא עלי'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 153,
      "char_length": 346,
      "timestamp": "2025-02-06T19:22:23.472052"
    },
    {
      "id": "beshalach1_p154",
      "text": "ויתבאר עפימ\"ש רש\"י ז\"ל בשה\"ש עה\"פ אם לא תדעי לך היפה בנשים צאי לך בעקבי הצאן אם לא תדעי לך כנסייתי ועדתי וכו' איכה תרעי ותנצלי מיד המציקים לך וכו' התבונני בדרכי אבותיך הראשונים שקבלו תורתי ושמרו משמרתי ומצותי ולכי בדרכיהם עכ\"ל, והנה יש מקום לשאול מה צורך להתבונן בדרכי הראשונים בשמירת התורה ומצותי', והרי התוה\"ק מלמדת אותנו דרך החיים לשמור משמרת במל\"ת וחובת העשי' במ\"ע, גם מסורה לנו הקבלה בתושבע\"פ, ומה צורך עוד להתבונן בדרכי אבות הראשונים, אמנם אין זו שאלה כי האדם עלול לטעות וישנם מגלי פנים בתורה המסלפים ומזייפים דברי תורה בפשטים של שקר, היפך דעת התורה ורצון הבוית\"ש, ועלול האדם להימשך אחריהם לנטות מדרך האמת, או יפול בלבו ספק האמת עם מי, וא\"א להשיג האמת הברור בדעת התוה\"ק זולת ע\"י התבוננות בדרכי האבות ואופן הנהגתם בשמירת התורה ומצותי'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 154,
      "char_length": 740,
      "timestamp": "2025-02-06T19:22:23.658128"
    },
    {
      "id": "beshalach1_p155",
      "text": "ועד\"ז יל\"פ בפ' הפסח דכתיב ויקרא משה לכל זקני ישראל ויאמר אליהם משכו וקחו לכם צאן וגו'. ובמד\"ר (פרשה ט\"ז סימן א') אמר הקב\"ה הריני פורע לזקנים על שעשו את ישראל להאמין בשמי וכו', שהיו ישראל שוחטין פסחיהם על ידיהן של זקנים שנאמר ויקרא משה לכל זקני ישראל עכ\"ד המדרש, וראוי להבין מדוע לא סגי שיקיימו מצות הפסח עפ\"י הציווי שיאמר להם משרע\"ה מפי הגבורה, וכדרך שאר המצות כולם ומ\"ט הי' צורך במצוה זו להיות נעשית על ידיהם של הזקנים, גם יל\"ד להלן בפסוק וילכו ויעשו בנ\"י כאשר צוה ד' את משה ואהרן כן עשו, פרש\"י אף משה ואהרן כן עשו, וצ\"ב מה צורך להשמיענו זאת שאף משה ואהרן קיימו מצות השי\"ת בהקרבת הפסח, ובודאי לא יעלה על הדעת היפך זה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 155,
      "char_length": 618,
      "timestamp": "2025-02-06T19:22:24.004686"
    },
    {
      "id": "beshalach1_p156",
      "text": "ואפ\"ל עפימ\"ד במדרש בעשור לחודש לקחו כאו\"א שה לפסחו וקשר אותו בכרעי מטתו, ושאלום המצרים למה זה לכם, והשיבו לשחטו לשם פסח במצות השם עלינו, והיו שיניהם קהות על ששוחטין את אלהיהן ולא היו רשאים לומר דבר עכ\"ד המדרש, והנה עד שלא הגיע הקץ נצטוו ישראל שלא למרוד באומות ולהתגרות בלוחציהם, וכמ\"ש רש\"י ז\"ל (בפ' וארא) עה\"פ ויצום אל בנ\"י ואל פרעה מלך מצרים צום עליו לחלוק לו כבוד בדבריהם (עיין בדברנו שם שהארכנו בזה) דענין זה של התגרות באומות נכלל באיסור של דחיקת הקץ, אולם עכשיו כשהגיע הקץ הי' רצון הבוי\"ת בזה שיתגרו בהם, כמ\"ש במד\"ר (פ' בא) משכו וקחו לכם צאן הה\"ד (תהלים צ\"ז) יבושו כל עובדי פסל וכו', אמר לו הקב\"ה חייך אין ישראל יוצאים מכאן עד שישחטו את אלהי מצרים לעיניהם שאודיע להם שאין אלהיהם כלום וכו' אמנם מפני שבזמן הקץ אפשר שיבואו בנ\"י לטעות, וכמו שטעו בני אפרים בחשבונם להקדים את הקץ, והוא עון נורא ובעוה\"ר רבים נכשלו בזה בעיקבתא דמשיחא, ע\"כ רצה השי\"ת להורות שאין לעשות מעשה בענין זה כ\"א על ידיהן של הזקנים, וז\"ש במדרש על שעשו הזקנים את ישראל להאמין בשמי וכו' ע\"כ יהיו ישראל שוחטין פסחיהן על ידיהן של הזקנים, דלפי שהשרישו האמונה בישראל ע\"כ הם נאמנים על הדבר, וענין גדול כזה שהוא מעקרי האמונה צריך שיתחיל ע\"י הזקנים, ואף הזקנים לא עשו עד שראו במשה ואהרן שכן עשו, ובזה יובן דברי רש\"י ז\"ל וילכו ויעשו בנ\"י כאשר צוה ד' את משה ואהרן וגו' אף משה ואהרן כן עשו, להורות שלא עשו ישראל ולא הזקנים כ\"א אחרי שראו עשייתן של משה ואהרן.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 156,
      "char_length": 1315,
      "timestamp": "2025-02-06T19:22:24.303568"
    },
    {
      "id": "beshalach1_p157",
      "text": "ובזה יתבאר לעניננו דכבר ביארנו לעיל (בדרוש הקדום) כי מ\"ש הכתוב פן ינחם העם וגו' ושבו מצרימה, ר\"ל שישובו לבחינת טומאת מצרים שהיו משוקעים בה עד הנה, ובראותם מלחמה זה מלחמת עמלק ששרו הס\"מ והיינו מלחמת היצר, ועד\"ז פי' בש\"ך עה\"ת עיי\"ש, וחשש זה מצוי בכל הדורות, ובתקנת הדור ההוא נתקנו כל דורות העתידים, דע\"י שהסיבן הקב\"ה דרך המדבר והתורה נבללת בגופן כדאיתא במכילתא, מעתה כל דורות ישראל אחריהם, אף אם לא ותעצמו בעצם התורה כמוהם, יהי' להם תקנה ע\"י שיתבוננו בדרכי האבות הראשונים ויתנהגו בדוגמתם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 157,
      "char_length": 486,
      "timestamp": "2025-02-06T19:22:24.942935"
    },
    {
      "id": "beshalach1_p158",
      "text": "ובזה יתבאר דברי המדרש הנ\"ל (בדרוש הקדום) מי צווח ווי פרעה צווח ווי, דהנה כמו\"כ פרעה חשב שבודאי ישובו אליו בני ישראל, ואלמלי הלכו דרך ארץ פלשתים הי' החששא קרובה שישובו או בפועל או לבחי' מצרים, וכח הטומאה משתוקק לינק מן הקדושה, ובזה התנחם פרעה שהי' מוכרח לשלחם מכובד המכות, אבל חשב כי יחזרו לגבולו עכ\"פ ברוחני, אמנם אחר שראה שהקיפם הקב\"ה דרך המדבר למנוע חזרתם, ע\"כ צווח ווי, כי חכם גדול הי' באצטגנינות והשיג שמעתה לא ישובו עוד, וא\"ש קישור דברי המדרש ויהי בשלח פרעה וגו' ולא נחם אלקים דרך ארץ פלשתים, ע\"כ צווח פרעה ווי.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 158,
      "char_length": 516,
      "timestamp": "2025-02-06T19:22:25.195490"
    },
    {
      "id": "beshalach1_p159",
      "text": "ויתבאר אידך דברי המדרש (הו\"ל בדרוש הקדום קושיא ה') ויהי בשלח פרעה הה\"ד אמרו לאלקים מה נורא מעשיך ברוב עוזך וכו', ר' ברכיה אמר יעשו כזבים בדבריהם וכו', מתחלה אמר וגם את ישראל לא אשלח ואח\"כ הוא הי' מחזיר על פתחיהן של ישראל וא\"ל לכו לשלום וכו' עכ\"ד המדרש, וצ\"ב קישור דרשתם ז\"ל להכא, ויתבאר לדרכינו דנתברר עכשיו למפרע דמ\"ש ביציאתם לכו לשלום צאו לשלו' הי' כחש וכזב ולבו בל עמו, אלא שהוכרח לזה שאמרו המצריים כולנו מתים, אבל הי' מצפה שיחזרו לשעבודו או ירדוף אחריהם ויחזירם בע\"כ, והראי' דמיד שראה שהקיפם הקב\"ה דרך המדבר נתחרט וצווח ווי, וא\"ש קישור דרשתם ז\"ל לפסוק ויהי בשלח פרעה וגו' שצווח ווי על שלא יחזרו אליו עוד, ומזה נתברר שגם מ\"ש לכו לשלו' הי' כחש וכזב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 159,
      "char_length": 651,
      "timestamp": "2025-02-06T19:22:25.456202"
    },
    {
      "id": "beshalach1_p160",
      "text": "ונבוא לבאר מאמה\"כ ויהפך לבב פרעה וגו' ויאמרו מה זאת עשינו כי שלחנו את ישראל מעבדנו, פרש\"י ז\"ל ויהפך נהפכו לרדוף אחריהם בשביל ממונם שהשאילום, והדקדוקים כבר נפרטו לעיל בדרוש הקדום (קושיא ב' ג' ד' עיי\"ש) ונל\"פ בהקדם דברי הגמרא (ברכות דף ט' ע\"א) דבר נא באזני העם וגו' אמרי דבי ר' ינאי אין נא אלא לשון בקשה, א\"ל הקב\"ה למשה בבקשה ממך לך ואמור להם לישראל בבקשה מכם, שאלו ממצרים כלי כסף וכלי זהב שלא יאמר אותו צדיק ועבדום וענו אותם קיים בהם, ואח\"כ יצאו ברכוש גדול לא קיים בהם עכ\"ד הגמ' והקושיא מפורסמת הכי יעלה על הדעת שאאע\"ה יתרעם ח\"ו על מדותיו ית', גם צ\"ב נתינת טעם זה שלא יאמר אותו צדיק, ואף לולא זאת הבוי\"ת מקיים הבטחתו הטוב ואח\"כ יצאו ברכוש גדול, גם דקדק בפר\"ד הלשון קיים בהם לא קיים \"בהם\" דמלת בהם מיותר וכבר ביארנו בזה ועוד לאלקי מלין.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 160,
      "char_length": 734,
      "timestamp": "2025-02-06T19:22:25.768940"
    },
    {
      "id": "beshalach1_p161",
      "text": "ואפ\"ל עפ\"י המבואר בגמ' שם דישראל לא רצו לקבל הבטחת הרכוש ואמרו למשרע\"ה ולואי שנצא בעצמנו, משל לאדם שהי' חבוש בבית האסורים, והיו אומרים לו בנ\"א מוציאין אותך למחר ונותנין לך ממון הרבה, ואומר להם בבקשה מכם הוציאוני היום ואיני מבקש כלום עכ\"ד הגמ', ומעתה תו לא רמיא חיובא מצד קיום ההבטחה ואח\"כ יצאו ברכוש גדול, דקיי\"ל אף בהלוואה יכול המלוה למחול חובו, ואם אמר הריני כאלו התקבלתי אע\"פ שלא קבל נפטר המלוה מחיובו, אמנם הי' צורך בלקיחת הרכוש מטעם אחר, דהרי גזירת הגלות הי' על ארבע מאות שנה וישראל יצאו לסוף רד\"ו שנה, וכבר תירצו המפרשים שהתחילה הגרות משעה שנולד יצחק, ועוד תירצו דקישוי השעבוד השלים, גם תירצו ששאר גלויות משלימין, ועכ\"פ הי' מקום להסתפק שעדיין לא נשלם הקץ, אמנם ממה שיצאו ברכוש גדול שמגיע להם בשכר עבודתם כאמרז\"ל, מזה נתברר שכבר נשלם קיצם דאין שכירות משתלמת אלא לבסוף, גם ההבטחה הי' באופן זה ואח\"כ יצאו ברכוש גדול, ר\"ל אחר שיושלם קיצם, ולזה הזהיר אותם הקב\"ה כ\"כ על לקיחת הרכוש שלא יאמר אותו צדיק וכו', שמא יחשוש אאע\"ה דמה שלא נתקיים הבטחת הרכוש, מפני שלא נשלם קיצם זמן ד' מאות שנה, ואין זה כ\"א יציאה זמנית ויכרחו לחזור למצרים, ותתקיים הבטחת הרכוש בבניהם אחר כלות זמן הקץ, וז\"ש בבקשה מכם שאלו ממצרים וכו' שלא יאמר אותו צדיק ועבדום וענו אותם קיים בהם, ואח\"כ יצאו ברכוש גדול לא קיים בהם, ועתיד להתקיים בבניהם ע\"י שיחזרו להשלים זמן הגלות.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 161,
      "char_length": 1239,
      "timestamp": "2025-02-06T19:22:26.135060"
    },
    {
      "id": "beshalach1_p162",
      "text": "ובזה יבואר מאמה\"כ ויהפך לבב פרעה וגו' ויאמר מה זאת עשינו כי שלחנו את ישראל מעבדנו פרש\"י בשביל ממונם שהשאילם, דהנה לשון שילוח יצדק רק על שליחות לחלוטין ולא על יציאה זמנית, כמ\"ש ז\"ל בגמ' (יבמות קי\"ג ע\"ב) ושלחה מי שמשלחה ואינה חוזרת יצתה זו שמשלחה וחוזרת, הרי דנתמעט ממשמעות ושלחה יציאה זמנית, והנה פרעה חשב שאין זה אלא יציאה זמנית ועתידין לחזור אליו בהכרח, כי לא נשלם זמנם עדיין, אמנם ממה שראה שהקיפם דרך המדבר, ונתקיים בהם הבטחת הרכוש נתברר לו שהי' יציאתם לחלוטין ולא יחזרו עוד, וז\"ש ויהפך לבב פרעה וגו' ויאמר מה זאת עשינו כי שלחנו את ישראל וגו', ר\"ל שליחות לחלוטין וע\"כ פרש\"י בשביל ממונם שהשאילום, דמזה נתברר לו שלא יחזרו עוד, וע\"כ נהפך לבו לרדוף אחריהם, כי לא הי' דעתו מעיקרא כ\"א יציאה זמנית.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 162,
      "char_length": 693,
      "timestamp": "2025-02-06T19:22:26.702632"
    },
    {
      "id": "beshalach1_p163",
      "text": "והנה רש\"י ז\"ל פי' עה\"פ ויקח שש מאות רכב בחור וגו' מהיכן היו הבהמות הללו וכו' הרי נאמר וימת כל מקנה מצרים וכו' משל מי הי' מהירא את דבר ד' וגו', ובמדרש תנחומא מסיים בה הרי למדנו שהירא את דבר ד' הם היו תקלה לישראל, וכבר ביארנו (בדרוש הקדום) סברת אותן הירא את דבר ד', דעכ\"פ הי' בהם איזה בחינה יראה חיצונית מיראת העונש כמו שהעיד עליהם הכתוב, ואיך לא יראו לנפשותם לרדוף אחרי ישראל, אמנם הם היו פוסחים על ב' הסעיפים שהיו יראים את דבר ד', וגם מעבדי פרעה היו להיות סרים למשמעתו, וכוונתם הי' לרדוף אחרי ישראל ולהחזירם ולהשיג אבדון אומה הישראל ח\"ו ע\"י התחברותם (עיין באריכות בדברינו לעיל) והם תקלה גדולה לישראל יותר מהמפרסמים רשעתם בגלוי, ומצינו שאמר יהושע לישראל שיבחרו אם לעבוד את ד' או הע\"ז, וביאר בעל העקידה ז\"ל בפ' ואתחנן דמוטב שיבחרו בזה או בזה משישתתפו שניהם כא', וכן אלי' אמר לישראל עד מתי אתם פוסחים על ב' הסעיפים אם ד' אלקים לכו אחריו ואם הבעל לכו אחריו, ועכשיו נתחבר פרעה עם הירא דבר ד' לרדוף אחרי ישראל, ואחז בשיטתם להכשיל את ישראל בדרך זו של שותפות, לשתף שם שמים עם הע\"ז, ובזה יתבאר דברי התנחומא הנ\"ל ופרעה הקריב וגו' הקריב את ישראל לתשובה וכו' התחיל לזבח לקטר ולנסך לע\"ז לכך נאמר ופרעה הקריב, ולדרכנו ב' הדרשות יש להם קישור להדדי וע\"כ לא חילקו במדרש ביניהם לומר דבר אחר ולעשותו ב' מימרות, דזה הי' כוונת רשעתו לעשות שניהם ולהכשיל ישראל בדרך של שותפות כנ\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 163,
      "char_length": 1258,
      "timestamp": "2025-02-06T19:22:27.056958"
    },
    {
      "id": "beshalach1_p164",
      "text": "אולם בנ\"י לא נתפסו ברשתו ונתייחדו לבבם בלתי לד' לבדו, וז\"ש במדרש הנ\"ל אז ישיר משה ובנ\"י את השירה הזאת לד', לד' אמרוה ולא לב\"ו, שהיתה כוונתם זכה וברורה בלתי לד' לבדו, בלי שום כוונה משותפת, והי' עונין אחר משה רבינו ועל דעתו וכוונתו, ולז\"א ויאמרו לאמר, ר\"ל לאמר לדורות שילמדו דרך בעבודתו ית', שתהי' מיוחדת לשמו ית' בלי שום כוונה משותפת וכמשה\"כ זה אלי ואנוהו, זה למעוטי כוונת שיתוף לשתף ש\"ש וד\"א ח\"ו, ויובן בזה דברי המדרש ויאמינו בד' ובמשה עבדו, אם במשה האמינו בד' לא כש\"כ ומה ת\"ל במשה עכ\"ד וצ\"ב, ולדרכנו הכוונה דהאמונה בהשי\"ת צריך שתהי' כפי מסורת הקבלה שקבלו ישראל דור מדור ודור הראשון קבלו ממשרע\"ה ועשו על דעתו וכוונתו, כמ\"ש לעיל במאמרז\"ל אף משה ואהרן כן עשו, וזולת זה אין זה אמונה שלימה וברורה ועלול האדם לטעות באמונת השותפות, וזה משמיענו הכתוב ויאמינו בד' ובמשה עבדו, שהי' אמונתם בהשי\"ת ע\"י שנתנו אומן במשה רבינו ודרך עבודתו ועשו על דעתו וכוונתו ועי\"ז היתה אמונתם זכה שלימה וברורה, ולז\"א ומה תלמוד לומר במשה דא\"א מציאות האמונה זולתו, והשי\"ת יזכנו שנהי' דבוקים בדרך האמת בקדושה ובטהרה, ולראות במהרה בישועת כל ישראל ושמחתן בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו בב\"א.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 164,
      "char_length": 1078,
      "timestamp": "2025-02-06T19:22:27.660178"
    },
    {
      "id": "beshalach1_p165",
      "text": "באופן אחר יתבארו הדקדוקים הנ\"ל בהקדם מ\"ד במכילתא כי קרוב הוא קרובה השבועה שנשבע אברהם לאבימלך, השבעה לי באלקים הנה אם תשקור לי ולניני ולנכדי, ועדיין נכדו קיים, וצ\"ב הלא מפורש בפסוק טעם אחר כי אמר אלקים וגו', ולפי\"ד המכילתא בלא\"ה לא היו יכולין ליכנס לא\"י מיד מפני השבועה ומה צורך אל הטעם של פן ינחם העם וגו'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 165,
      "char_length": 307,
      "timestamp": "2025-02-06T19:22:28.139349"
    },
    {
      "id": "beshalach1_p166",
      "text": "ונל\"פ בהקדם מה דאיתא במד\"ר פ' וירא (פ' נ\"ד סי' ב') עה\"פ ועתה השבעה לי וגו' אם תשקור לי ולניני ולנכדי, אריב\"ח כתיב (תהלים ל\"ח) ואויבי חיים עצמו, מה שניתן לאברהם לשבע דורות ניתן לאבימלך לשלשה, למה לא נחם אלקים דרך ארץ פלשתים שעדיין נכדו קיים פי' רש\"י ז\"ל ואויבי חיים עצמו שהאריכו שנים, שמה שניתן לאברהם לשבע דורות וכו', שכשנכנסו ישראל לארץ כבר עברו ז' דורות מאברהם יצחק ויעקב לוי קהת עמרם ומשה, ומזרעו של אבימלך לא עברו אלא ג' דורות שכשיצאו ממצרים לא היו כי אם ג' דורות אבל לא נכנסו עד ארבעה דורות וכו', ולכאורה יפלא הלא נעשו לישראל נסים ונפלאות אשר לא נשמעו בכל הארץ קריעת ים סוף וכו', ואיך לא זכו להעביר נכדו של אבימלך מן העולם ולא ימנע מהם כניסת הארץ: ולא עוד אלא שהאריך ימים שלא כדרך הטבע, ולא מבעי לדברי הרמב\"ם בס' המורה שכתב דאף בימים קדמונים מאדם עד נח לא הי' אורך השנים הטבעיים המורגלים, כי הי' החידוש הזה באיש ההוא בהנהגתו וכו' או על דרך נס, ולפי דבריו בוודאי יקשה מדוע נעשה לנכדו של אבימלך נס זה שהאריך ימים כ\"כ, שאף בדורות הקודמים לא האריכו ימים כ\"א יחידים, ואף לדעת הרמב\"ן שכתב בפ' בראשית עה\"פ ויהיו ימי אדם שאז האריכו ימים כל הדורות, עכ\"פ הכל מודים שאח\"ז נתקצרו השנים, ומדוע נכדו של אבימלך האריך ימים כ\"כ הרבה דורות.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 166,
      "char_length": 1127,
      "timestamp": "2025-02-06T19:22:28.304797"
    },
    {
      "id": "beshalach1_p167",
      "text": "ויתבאר עפימ\"ד בגמ' מגילה (דף ו' ע\"א) אמלאה החרבה (יחזקאל כ\"ו) אם מליאה זו חרבה זו וכו' רנב\"י אמר מהכא ולאום מלאום יאמץ, וכ\"כ רש\"י ז\"ל עה\"פ ולאום מלאום יאמץ, לא ישוו בגדולה, כשזה קם זה נופל וכו' לא נתמלאה צור אלא מחורבנה של ירושלים עכ\"ל, נמצא כשישראל זוכין אל השלימות והתגברות הקדושה אז יש נפילה וירידה להסט\"א, ולהיפך ח\"ו הסט\"א יש לה תקומה, וכשיצאו ישראל ממצרים לא היו עדיין שלימים בקומת הקדושה ועון הדור גרם תקומה להסט\"א והוא הסיבה אשר האריך ימים נכדו של אבימלך ונמנעו מליכנס לא\"י מפני השבועה, ובזה יובן דברי המכילתא כי קרוב הוא קרובה שבועה שנשבע אברהם אבינו לאבימלך וכו' ועדיין נכדו קיים, אמנם יפלא מדוע האריך ימים כ\"כ למנוע כניסתן של ישראל לא\"י, ע\"ז יצדק טעם הפסוק כי אמר אלקים פן ינחם העם בראותם מלחמה ושבו מצרימה, וכ\"ז שקיים חשש זה אין עדיין שלימות בישראל ולכן האריך שנים נכדו של אבימלך, ולא נחם אלקים דרך ארץ פלשתים שלא היו יכולין ליכנס מיד לא\"י כי קרוב הוא וגו', והכל חדא טעמא הוא והא בהא תליא דמה\"ט קרובה השבועה כי אמר אלקים וגו'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 167,
      "char_length": 937,
      "timestamp": "2025-02-06T19:22:28.860210"
    },
    {
      "id": "beshalach1_p168",
      "text": "ועד\"ז אפ\"ל במאמה\"כ (פ' בא) ותחזק מצרים על העם למהר לשלחם מן הארץ כי אמרו כולנו מתים, פירש\"י מדברי המכילתא אמרו לא כגזירת משה הוא, שהרי אמר ומת כל בכור, וכאן אף הפשוטים מתים, ולכאורה הרי משה רבע\"ה התרה בהם רק על הבכורים שימותו, והמה ראו בכל המכות שנתקיימו בכל אופני התנאים כאשר התרה בהם משרע\"ה בלי שינוי מגרעת או תוספת, ומדוע חששו במכה זו דייקא שלא יהי' כגזירת משה, ואפשר שהשיגו בכח טומאתם, שנתעלו ישראל בליל היציאה למדריגת קדושה עליונה, ומפני שראו שאף הפשוטים מתים חשבו לסיבה, שכבר הגיעו ישראל לתכלית השלימות כבחי' דלעתיד, ואז הסט\"א כליל יחלוף והאלילים כרות יכרתון. ולזה ותחזק מצרים על העם למהר לשלחם מן הארץ כי אמרו כולנו מתים, דלעומת שנתעלו ישראל בקדושה תהי' הירידה להם, ומורך עלה על לבם לעכבם ולהתגבר למולם, אמנם אחר שראו שלא נחם אלקים דרך ארץ פלשתים כי קרוב הוא, קרובה השבועה וכו' ועדיין נכדו קיים, השיגו מזה שלא הגיעו ישראל לשלימותן עדיין, ע\"כ התחרט פרעה על ששלחם, וז\"ש ויהפך לבב פרעה וגו' ויאמרו מה זאת עשינו כי שלחנו את ישראל מעבדינו, כי מעיקרא שלחם מיראת המות שאמרו כולנו מתים ועכשיו נודעת להם שלא הי' מקום ליראה זו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 168,
      "char_length": 1024,
      "timestamp": "2025-02-06T19:22:29.306958"
    },
    {
      "id": "beshalach1_p169",
      "text": "וז\"ש במדרש ויהי בשלח פרעה את העם ולא נחם אלקים וגו' מי צווח ווי פרעה צווח ווי, דמפני שלא נחם אלקים דרך ארץ פלשתים, ע\"כ התחרט פרעה על שליחותם וצווח ווי, וא\"ש קישור דרשתם להכא, והנה אלמלי השיגו ישראל שלימותם, הי' מיד עולם התיקון והי' משרע\"ה נכנס עמהן לארץ ולא הי' חורבן עוד כמבואר בדרז\"ל אלא שלא זכו לזה ע\"כ לא נכנס משרע\"ה לארץ, ובזה יבואר אידך דברי המדרש מי צווח ווי משה צווח ווי שלא יכנס לארץ, דממה שלא נחם אלקים ד\"א פלשתים, נתברר שלא הגיעו עדיין לשלימותם ולזה צווח ווי שלא יכנס לארץ והבן. אי",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 169,
      "char_length": 492,
      "timestamp": "2025-02-06T19:22:29.802584"
    },
    {
      "id": "beshalach1_p170",
      "text": "באופן אחר נראה לפרש דברי המדרש הנ\"ל מי צווח ווי וכו' בהקדם מ\"ד עוד שם במד\"ר אעפ\"י ששלחם פרעה לא נתנחם הקב\"ה, משל למה\"ד למלך שנשבה בנו והלך אביו והצילו מן הלסטים והרגן, והי' הבן אומר לאביו כך וכך עשו לי וכו', אעפ\"י שהרגן לא הי' מתנחם וכו' כך עשו המצרים וכו' אעפי\"כ הי' אומר איני מתנחם עד שאהרוג לכולן וכו' לכך נאמר ולא נחם עכ\"ד המדרש, לכאורה צ\"ב לפי\"ז קישור דברי הפסוק ולא נחם אלקים דרך ארץ פלשתים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 170,
      "char_length": 397,
      "timestamp": "2025-02-06T19:22:30.055787"
    },
    {
      "id": "beshalach1_p171",
      "text": "ב) במכילתא דרשו כי קרוב הוא קרובה השבועה שנשבע אברהם לאבימלך השבעה לו באלקים וגו' ועדיין נכדו קיים ע\"כ, וצ\"ב דהרי מפורש בפסוק טעם אחר פן ינחם העם וגו' ושבו מצרימה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 171,
      "char_length": 163,
      "timestamp": "2025-02-06T19:22:30.267629"
    },
    {
      "id": "beshalach1_p172",
      "text": "ג) וחמשים עלו בנ\"י מאמ\"צ, פירש\"י אין חמושים אלא מזויינים וכו', וצ\"ב דמה ענין זה להסיבן דרך המדבר, ומקומה היותר נכון בסיפור יציאתם בפ' בא.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 172,
      "char_length": 137,
      "timestamp": "2025-02-06T19:22:30.373027"
    },
    {
      "id": "beshalach1_p173",
      "text": "והנ\"ל בהקדם דברי השפת אמת מר' ישמעאל הכהן (פ' בשלח סימן ל\"ד) וז\"ל: במדרש הובא בילקוט פרשה זו ה' ימלוך לעולם ועד למה כי בא סוס פרעה וגו' ע\"כ וצ\"ב, ונלענ\"ד דהסגנון יהי' כך דהוק\"ל למה אמרו דוקא ה' ימלוך בלשון עתיד, ותירץ דהיו מוכרחין לומר דוקא כך לפי שראו כי בא סוס פרעה, וזה דהנה אמור רבנן במדרש על פסוק זה, אלו היו אומרים ה' מלך לא הי' שום אומה ולשון שולטת בהם וכו' עיי\"ש, א\"כ נראה שטעו ישראל באומרם ה' ימלוך בלשון עתיד, אבל כד מעיינין היו מוכרחין לומר כן וזה דהרי אמרו רבנן בפ\"ק דסוטה עה\"פ הבה נתחכמה לו, נתחכם למושיען של אלו במה נדונם באש וכו' אלא באו ונדונם במים שכבר נשבע שלא יביא מבול לעולם, והם אינם יודעים וכו' שהוא אינו מביא אבל הם באים ונופלים לתוכו, כמו שהי' לפי האמת כי בא סוס פרעה וגו', והנה ממה שהוצרך הקב\"ה לבוא על המצריים בעקיפין להביאם בתוכו, כדי להתנצל משבועת המבול, זה הי' הוכחה ברורה לישראל דעדיין לא נשלם העולם במלכות שד\"י באופן שיהי' ה' אחד וכו', אלא תהי' עוד אומה ולשון שולטת בהם דא\"כ דל מהכא שבועת המבול, דכבר אמור רבנן בטעמא במדרש (הובא בילקוט פ' נח) עה\"פ עוד כל ימי הארץ אבל כשיגיע העת שכתוב בו כי שמים כעשן וגו', הארץ כבגד וכו' אז תופר ביום ההוא עיי\"ש, הרי שכאשר יבא תיקון העולם דאז לא תהי' שום אומה ולשון שולטת בישראל דביום ההוא יהי' ה' אחד ושמו אחד ממילא בטלה שבועת המבול, וא\"כ דון מינה ואוקי באתרא מדראו ישראל דאכתי היתה שבועת המבול באיתנה הראשון, מדהוצרך הקב\"ה להתנהג כביכול במרמה בחכמה דהוא אינו מביא אלא הם באים ונופלים לתוכו, עכצ\"ל דאכתי לא מטא זימנא לתקן עולם במלכות שד\"י ועדיין פקידה היא, וממילא שפיר עבדי דלא אמרו ה' מלך אלא ה' ימלוך לשון עתיד, והיינו חילייהו דישראל לפי שראו כי בא סוס פרעה וגו' עכ\"ל, מבואר מדבריו שאלמלי הי' אז עולם התיקון, לא הי' צורך להקיפם דרך המדבר ים סוף רק הי' מביא עליהם מבול במצרים וישראל היו הולכים בדרך היבשה דרך ארץ פלשתים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 173,
      "char_length": 1687,
      "timestamp": "2025-02-06T19:22:30.486364"
    },
    {
      "id": "beshalach1_p174",
      "text": "ובזה יובן מה שצווח משה ווי על שלא יכנס לארץ, עפימ\"ש ז\"ל דאלמלי הי' עולם התיקון מיד, הי' מרע\"ה נכנס לארץ, ורק מפני שלא הי' עוד עולם התיקון לא הי' יכול ליכנס לארץ כי אם הי' הוא בונה המקדש לא הי' יכול ליחרב כדאיתא בגמ' סוטה שבמעשה ידי משה לא שלטו ידי אויבים והי' ח\"ו חשש כלי', וע\"כ שפט משה רבינו ממה שהסיבם דרך המדבר ים סוף שאין עדיין עולם התיקון ולא יוכל ליכנס לארץ, ולזה צווח עכשיו ווי על שלא יכנס לארץ.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 174,
      "char_length": 402,
      "timestamp": "2025-02-06T19:22:31.300824"
    },
    {
      "id": "beshalach1_p175",
      "text": "והשתא יובן דברי המדרש הנ\"ל ולא נחם אלקים, אמר הקב\"ה איני מתנחם עד שאהרוג לכולן שנאמר וינער ה' את מצרים בתוך הים וכתיב סוס ורוכבו רמה בים וכו' לכך נאמר ולא נחם עכ\"ד המדרש (עיין קושיא א'), ולדרכינו א\"ש ומקושר דרשת המדרש עם פשוטו של מקרא, דמפני שהי' עדיין קיים חשש זה פן ינחם העם בראותם מלחמה ושבו מצרימה, ה\"ז מורה על העדר השלימות ולא הגיע עדיין זמן תיקון השלם א\"כ שבועת המבול עדיין קיימת, ומה\"ט אמר הקב\"ה איני מתנחם עד שאהרוג לכולן שנא' וינער ה' את מצרים בתוך הים, וזהו טעם הסיבן דרך המדבר ים סוף כנ\"ל, ובזה א\"ש מה שצוח פרעה עכשיו ווי, כי מה שהסיבם הקב\"ה דרך המדבר ים סוף, השיג שעתיד הקב\"ה להתנקם ממנו על הים, דאילולא כן הי' מוליכם בדרך הפשוטה לא\"י מיד, וע\"כ צווח ווי.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 175,
      "char_length": 666,
      "timestamp": "2025-02-06T19:22:31.523933"
    },
    {
      "id": "beshalach1_p176",
      "text": "ולדרכינו יתבאר דברי המכילתא (לעיל קושיא ב') כי קרוב הוא קרובה השבועה שנשבע אברהם לאבימלך וכו' ועדיין נכדו קיים. ומקושר עם פשוטו של מקרא, דאלמלי הגיעו ישראל לשלימות התיקון, היו הפלשתים מוותרים על השבועה, וכמו שיהי' לעתיד שכל האומות יביאו שי למלך המשיח, וא\"כ הי' אפשר להם לעבור לא\"י דרך ארץ פלשתים מבלי העברה על השבועה, אלא מפני שהי' עדיין קיים חשש זה פן ינחם העם וגו' ושבו מצרימה, לזה לא נחם אלקים דרך ארץ פלשתים כי קרוב הוא כי קרובה עדיין השבועה וכו'",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 176,
      "char_length": 450,
      "timestamp": "2025-02-06T19:22:31.881032"
    },
    {
      "id": "beshalach1_p177",
      "text": "ויובן בזה קישור הכתוב וחמשים עלו בנ\"י, פירש\"י אין חמושים אלא מזויינים עפימ\"ש רש\"י ז\"ל בפ' דברים עה\"פ באו ורשו את הארץ. אין מערער בדבר ואינכם צריכים למלחמה אילו לא שלחו מרגלים לא היו צריכים לכלי זיין עכ\"ל, מבואר שאלמלי זכו ישראל לשלימות, לא הי' צורך להיות מזויינים, אבל מפני שלא הגיעו עדיין למידה זו, ע\"כ ויסב אלקים את העם דרך המדבר ים סוף, ומה\"ט וחמשים עלו בנ\"י מאמ\"צ.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 177,
      "char_length": 368,
      "timestamp": "2025-02-06T19:22:32.105262"
    },
    {
      "id": "beshalach1_p178",
      "text": "באופן אחר אפ\"ל דברי המדרשים הנ\"ל ויהי בשלח פרעה את העם מי צווח ווי פרעה צווח ווי וכו') ד\"א מי אמר ווי משה אמר ווי וכו' וצ\"ב וכבר נפרטו הדקדוקים לעיל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 178,
      "char_length": 149,
      "timestamp": "2025-02-06T19:22:32.316962"
    },
    {
      "id": "beshalach1_p179",
      "text": "ב) במכילתא ולא נחם אלקים דרך ארץ פלשתים כי קרוב הוא, קרובה השבועה שנשבע אברהם אבינו לאבימלך ועתה השבעה לי באלקים הנה וגו' ועדיין נכדו קיים ע\"כ, וצ\"ב דהלא מפורש בכתוב טעם אחר פן ינחם העם בראותם מלחמה וגו' ולדברי המכילתא הרי לא הי' במציאות שילכו דרך ארץ פלשתים, מחמת איסור השבועה דרמיא עלייהו ומה צורך עוד לטעם הכתוב פן ינחם העם ושבו מצרימה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 179,
      "char_length": 339,
      "timestamp": "2025-02-06T19:22:32.439863"
    },
    {
      "id": "beshalach1_p180",
      "text": "ג) ויאמר ה' אל משה מה תצעק אלי דבר אל בני ישראל ויסעו, פירש\"י מה תצעק אלי עלי הדבר תלוי ולא עליך, וצ\"ב דאדרבה לטעם זה התפלה מחוייבת, שבו ית' תלוי הישועה וע\"כ עינינו תליות אליו שיושיענו ובעת צרה לכ\"ע התפלה חיובא דאורייתא, ומ\"ט מנעהו הקב\"ה למשרע\"ה מלהתפלל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 180,
      "char_length": 254,
      "timestamp": "2025-02-06T19:22:32.656672"
    },
    {
      "id": "beshalach1_p181",
      "text": "ד) במדרש (פ' כ\"א סי' ח') דבר אל בנ\"י ויסעו, יסיעו דבר מלבן וצ\"ב הכוונה ואינו מבואר מהו הדבר.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 181,
      "char_length": 92,
      "timestamp": "2025-02-06T19:22:32.814539"
    },
    {
      "id": "beshalach1_p182",
      "text": "ה) עוד במדרש (הובא בישמח משה) א\"ל הקב\"ה למשה הים סוער והשונא רודף ואתה עומד ומרבה בתפלה, א\"ל ומה עלי לעשות, אמר לו ואתה הרם את מטך, באותה שעה אמרו ה' ימלוך לעולם ועד עכ\"ד המדרש וצ\"ב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 182,
      "char_length": 182,
      "timestamp": "2025-02-06T19:22:32.910157"
    },
    {
      "id": "beshalach1_p183",
      "text": "ו) ואתה הרם את מטך ונטה את ידך על הים ובקעהו, במד\"ר (פ' כ\"א סי' ט') א\"ל הקב\"ה למשה השלך את מטך שלא יאמרו אילולי המטה לא הי' יכול לקרוע את הים וכו', וצ\"ב דלפי\"ד המדרש שנעשה הנס ע\"י נטיית ידו של משרע\"ה ולא באמצעות המטה, מ\"ט צוהו הקב\"ה להרימו ולהשליכו אח\"כ, הול\"ל נטה את ידך על הים ובקעהו, גם מ\"ט בקריעת ים סוף צוהו הקב\"ה להשליכו שלא יאמרו וכו', ולא חשש כן בשאר האותות שנעשו ע\"י המטה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 183,
      "char_length": 381,
      "timestamp": "2025-02-06T19:22:33.047046"
    },
    {
      "id": "beshalach1_p184",
      "text": "ז) כתיב (בפ' שמות) ואת המטה הזה תקח בידך אשר תעשה בו האותות, וכן סידר המגיד ובאותות זה המטה שנאמר ואת המטה הזה תקח בידך וגו' הנה ביאר הרמב\"ן ז\"ל (בפ' ראה) עה\"פ כי יקום בקרבך נביא וגו' ונתן אליך אות או מופת, וז\"ל ענין אות סימן על דבר שיהי' אח\"כ בדמיונו, כי כשיבוא הנביא ויאמר, דבר פלוני עתיד להיות לדמיון שיהי' כך, יקרא אות וכו', והמופת יאמר על דבר מחודש שיעשה לפנינו בשינוי טבעו של עולם עכ\"ל, ולפי\"ז מ\"ט נקרא המטה אות ומהו ענין הדמיון שבו, ויותר יאות שיקרא מופת ע\"ש הפלאים שנעשו על ידו במכות מצרים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 184,
      "char_length": 498,
      "timestamp": "2025-02-06T19:22:33.268748"
    },
    {
      "id": "beshalach1_p185",
      "text": "ויתבאר כל הענין עפימ\"ש במכילתא דאלמלי זכו ישראל היו נגאלים במצרים גאולה לדורות שאין אחרי' גלות עוד, אלא שלא היתה זכותם מספקת לכך וע\"כ היתה רק גאולה לשעה, ונקדים מ\"ש בספה\"ק קדושת לוי זלה\"ה לפרש אומרם ז\"ל (פסחים קי\"ח ע\"ב) הללו את ה' כל גוים אגבורות ונפלאות דעביד בהדייהו, כל שכן אנו דגבר עלינו חסדו ולכאורה דברי רז\"ל נעלמים מאתנו וכו', הלא מקרא כתיב או הנסה אלקים לבוא לקחת לו גוי מקרב גוי, בזה עיקר הבטחותינו שהבוי\"ת מראה גודל אהבתו ותשוקתו לעמו בית ישראל שבכל דור ודור עושה לנו נסים ונפלאות ומשלם גמול לכל אויבי נפשינו, וחלילה לומר שהשי\"ת עושה להם נסים ונפלאות, ותוכן תירוצו דע\"י הכאות הרשעים שהבוי\"ת עושה בהם דין, נתגדל ונתקדש שמו ית' בעולם, וזה באמת טובה גדולה גם להם דמאתו לא תצא רעה כתיב, וכאשר יפקחו עיניהם יראו גודל התועלת המגיע להם, רק הרשעים הם ערלי לב ולבם אטום מהבין זאת וכו', וז\"פ הגמרא דבאמת אין הקב\"ה עושה נסים ונפלאות רק לישראל עם קרובו. ולאומה\"ע מכה אותם השי\"ת בעונשין וגואל את ישראל מתוכם, ועי\"ז נתקדש ש\"ש וצריכים הם להלל את השי\"ת מה שנתקדש על ידם ש\"ש וז\"פ הללו את ה' כל גוים אנסים ונפלאות שעושה הקב\"ה עם ישראל ונפרע להם מכל צריהם הוא בהדייהו, כלומר שאלו הנסים והטובות הם מחמתם, שע\"י הכאתם נעשה נסים לישראל ונתקדש ש\"ש על ידם, ולעתיד גם האומות ישמחו ויהללו וישבחו לה' על החסד שעושה לישראל, וכמו שפי' בספר בינה לעתים (דרוש י\"ט) עה\"פ הנ\"ל הללו את ה' כל גוים וגו' כי גבר עלינו חסדו, וקשה ראובן בשמחה שמעון מה איכפת לי' ואיך יצוה לגוים שיהללו וישבחו על כי גבר עלינו חסדו, ותי' שטובה ותועלת גדולה נמשך לאומות ממה שעושה הקב\"ה נסים ונפלאות לישראל, כי בעודנו בגלות אין השגחתו ית' מתפרסמת ולא ניכר אלקותו האמיתי אצל הכל, כי הם נעדרי ידיעתו, אבל לעתיד ע\"י גאולת ישראל תתפרסם גדולתו ויכלתו, וכל העולם יכירו וידעו כי אמת מלכינו ואפס זולתו, היש תועלת גדול מזה לעוורים לא ראו אור, ולזה אמר אתם הגוים הללו ושבחו שמו ית', על כי גבר עלינו חסדו להוציאנו מאפילה לאורה, כי הלא ע\"י חסד זה ואמת ה' לעולם: האמת הגמור מאלקותו ית' מתפשט לעולם בכללי כי כולם יכירהו, וכיון שכן גם אתם חייבים להללו ולשבחו ע\"כ דבריו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 185,
      "char_length": 1902,
      "timestamp": "2025-02-06T19:22:33.530243"
    },
    {
      "id": "beshalach1_p186",
      "text": "וכתב הרמב\"ם ז\"ל באגרת תימן שכשיבוא מלך המשיח, לא יצטרך ללחום עם מלכי האומות רק ע\"י שיראו גודל חכמתו וקדושתו יהי' להם התבטלות נגדו בלי שום מלחמה, נמצא לפי\"ז אלמלי הי' גאולת מצרים גאולה שלימה שהי' מציאות לזה כנ\"ל, אז לא הי' מתחרט פרעה מה ששלח את ישראל מארצו, שהרי הי' משיג את גודל התועלת שהגיע גם אליו מה שנתקדש על ידו ש\"ש, ורק מפני שלא הי' עדיין השלימות הגמור, לא באו האומות להשגה זו לראות האמת, ע\"כ צווח ווי על ששלח את ישראל מארצו, ומבואר בספה\"ק דאלמלי זכו ישראל אז לתיקון השלימות הי' משרע\"ה נכנס לא\"י עמהם, והי' הוא בונה ביהמ\"ק ולא הי' נחרב לעולם דלא שלטו האויבים במעשה ידיו, נמצא דמה שלא נכנס משרע\"ה לא\"י מיד, מפני שלא הגיעו ישראל לתכלית השלימות עדיין.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 186,
      "char_length": 654,
      "timestamp": "2025-02-06T19:22:34.476493"
    },
    {
      "id": "beshalach1_p187",
      "text": "ובזה יתיישבו דברי המדרשים הנ\"ל פרעה צווח ווי, ואידך דברי המדרש משה אמר ווי על שאינו נכנס עמהן לארץ ושניהן על קוטב א' יסובבו, דמפני שלא נחם אלקים דרך ארץ פלשתים, מטעם פן ינחם העם וגו' ושבו מצרימה, ה\"ז מורה שלא הגיעו ישראל עדיין לשלימות האמיתי, ומה\"ט משה צווח ווי על שלא יכנס לארץ, וגם פרעה צווח ווי על ששלחם, ואלמלי הי' תיקון השלימות מיד, הי' שש ושמח על כי גבר עלינו חסדו ית' כנ\"ל. ויתבאר בזה גם דברי המכילתא הנ\"ל כי קרוב הוא קרובה השבועה שנשבע אברהם אבינו לאבימלך וכו' ועדיין נכדו קיים, והוא מקושר עם טעם הכתוב פן ינחם העם וגו' דאלמלי זכו ישראל לתיקון השלימות היו הפלשתים בעצמם מבטלים השבועה. דהנשבע על דעת חבירו אינו יכול להתיר שבועתו שלא בפניו, אבל על דעת המודר יכול להתיר, ואז היו כל האומות מכירין שגדולתם של ישראל טובה ותועלת גם להם ובל\"ס היו מוותרין על השבועה, אלא מפני שהי' קיים החשש זה פן ינחם העם וגו' ושבו מצרימה, וכמו שאמרו אח\"כ נתנה ראש ונשובה מצרימה, ודרשו רז\"ל אין ראש אלא ע\"ז, ע\"כ לא זכו לגאולה נצחיות מיד ומה\"ט כח השבועה עדיין במקומה עומדת, ולז\"א במכילתא קרובה השבועה שנשבע אאע\"ה וכו' ועדיין נכדו קיים, והוא טעם א' עם טעם המפורש בפסוק פן ינחם העם וגו'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 187,
      "char_length": 1067,
      "timestamp": "2025-02-06T19:22:34.821157"
    },
    {
      "id": "beshalach1_p188",
      "text": "ועד\"ז יתבארו דברי המדרשים הנ\"ל בענין קרי\"ס, בהקדם מה שפירשתי בספרי ויואל משה (מאמר א' סי' כ\"ד) מ\"ש רז\"ל (כתובות קי\"א ע\"א) שהשביע הקב\"ה את ישראל שלא ידחקו את הקץ פירש\"י ז\"ל שלא ירבו בתחנונים על כך יותר מדאי, וק\"ז זלה\"ה בתפלה למשה (סי' קכ\"ז) ובפי' על שה\"ש עמד בדברי רש\"י אלו דאינו מובן מה הוא הגבול של בקשת רחמים ומה נקרא יותר מדאי, ועו\"ק למה לא מצינו בדברי הפוסקים שיזהירו שלא להפציר בתפלה על הגאולה, עיי\"ש שפי' לדרכו, והנלפענ\"ד עפי\"ד הגמ' ב\"מ (דף פ\"ה ע\"ב) אלי' הוה שכיח במתיבתא דרבי, יומא חד הוה נגה לי' ולא אתא, א\"ל מאי טעמא נגה לי' למר א\"ל אדאוקימנא לאברהם ומשינא ידי' ומצלי ומגנינא לי' וכן ליצחק וכן ליעקב, ולוקמינהו בהדי הדדי, סברי תקפי ברחמי ומייתי לי' למשיח בלא זמני', א\"ל ויש דוגמתן בעוה\"ז, א\"ל איכא ר' חייא ובניו, גזר רבי תעניתא אחתינהו לר' חייא ובניו, אמר משיב הרוח ונשב זיקא, אמר מוריד הגשם ואתא מיטרא: מטא למימר מחיה המתים רגש עלמא, אמרי ברקיעא מאן גלי רזיא בעלמא, אמרי אלי' וכו' אתא אידמי כדובא דנורא על בינייהו וטרדינהו, ופי' שם המהרש\"א ז\"ל דאתי לומר שלא אתי עדיין זמן המשיח עיי\"ש, הרי מבואר שיש מדריגת צדיקים אשר להם הכח בתפלתם להביא משיח בלא זמני', אלא שמנעום מן השמים להתפלל תפלה כזו המכרחת ואתי אלי' וטרדינהו, ותפלה כזה הוא בגדר דחיקת הקץ, ולכן לא ביארו הפוסקים מהו הגבול של רבוי תחנונים יותר מדאי, דכח תפלה כזו המכרחת לא נמצא כ\"א ביחידי סגולה כמו ר' חייא ובניו, ומשמרים אותם מן השמים שלא יבואו לידי כך כמ\"ש בגמ', ומי שלא הגיע למעלה זו מותר לו להתפלל כמה שירצה ומצוה להתפלל ולאפושי ברחמי שימהר השי\"ת ויגאלינו, עייש\"ד באריכות.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 188,
      "char_length": 1442,
      "timestamp": "2025-02-06T19:22:35.321368"
    },
    {
      "id": "beshalach1_p189",
      "text": "והנה משה רבינו וודאי הי' לו כח תפלה זו המכרחת כר' חייא ובניו, ואפשר שעד\"ז היתה תפלת משרע\"ה על ישראל בעמדם על שפת הים, כי ידע שינצלו ישראל מיד מצרים ולא יטבעו בים כי כבר הבטיחו הבוי\"ת בהוציאך את העם ממצרים תעבדון את האלקים על ההר הזה, ובהכרח שיצילם השי\"ת כדי שיהיו ראויים לקבל התורה ולהכניסם לא\"י, אמנם רצה משרע\"ה לפעול בתפלתו שתהי' גאולה נצחיות שאין אחרי' גלות עוד, ולא הניחוהו מן השמים דלא הי' עדיין זמנו, ולז\"א לו הקב\"ה מה תצעק אלי, וכפירש\"י עלי הדבר תלוי ולא עליך, דענין הגאולה לא נמסר לשום נברא, כ\"א ביד הבוית\"ש לבדו ואפס בלתך גואלינו לימות המשיח. ולטעם זה מנעו מן השמים רצון צדיק ולא הרשוהו להתפלל תפלה המכרחת למהר הגאולה לפני זמנו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 189,
      "char_length": 637,
      "timestamp": "2025-02-06T19:22:36.030959"
    },
    {
      "id": "beshalach1_p190",
      "text": "וז\"פ המדרש דבר אל בני ישראל ויסעו יסיעו הדבר מלבן, ר\"ל שילמד לבנ\"י דעת שדבר זה לעשות פעולה בענין הגאולה יסיעו מלבן ודעתם, וכמו שפירשתי אמרם ז\"ל (סנהדרין צ\"ז) אין בן דוד בא עד שיתייאשו מן הגאולה וכו', כי הא דר' זירא כי הוה משכח רבנן דמעסקי בי', (פירש\"י לידע מתי יבוא) אמר להו במטותא בעינא מינייכו לא תרחקוה דתניא ג' באין בהיסח הדעת אלו הן משיח וכו' ולכאורה ה\"ה מעיקרי האמונה להאמין בביאת המשיח ובזכות אמונה זו יהיו ישראל נגאלים, ואיך יובן אמרם ז\"ל דאין ב\"ד בא אלא בהיסח הדעת, אמנם הכוונה בזה שלא להיות ממחשבי קיצין ושלא לצייר בדעתינו שום מחשבה לקרב הגאולה ע\"י פעולת אדם, רק לצפות ולחכות על ישועתו ית', ולקבוע בלבנו שאין בדעת האדם להשיג קץ הפלאות, וזהו בחי' היסח הדעת שאמרו רז\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 190,
      "char_length": 677,
      "timestamp": "2025-02-06T19:22:36.352032"
    },
    {
      "id": "beshalach1_p191",
      "text": "והנה אמרז\"ל במד\"ר (פ' קרח פ' י\"ח סי' כ\"ג) עה\"פ ומטה אהרן וגו' יש אומרים שהוא המטה שהי' ביד משה וכו' ואותו המעה הי' ביד כל מלך ומלך עד שחרב ביהמ\"ק ונגנז, ואותו המטה עתיד להיות ביד מלך המשיח במהרה בימינו שנאמר מטה עוזך ישלח ה' מציון וגו' עכ\"ד המדרש נמצא שזהו מסימני הגאולה האמיתית, כשיראו ישראל מטה משה רבינו ביד הגואל העתיד, הוא הגואל האמיתי שכך קבלו רבותינו ז\"ל שאותו המטה עתיד להיות ביד מלך המשיח, ואולי לטעם זה א\"ל הקב\"ה למשה רבינו ואתה הרם את מטך ונטה את ידך על הים ובקעהו, שכח הגאולה אשר בו נגנז עד שיבוא מלך המשיח. וע\"כ הי' נס קריעת ים סוף ע\"י נטיית ידו של משרע\"ה ולא באמצעות המטה, וצוהו הקב\"ה להרימו כלפי מעלה להורות לישראל שבחי' הגאולה הוא ביד הקב\"ה לבדו, עד שיעלה רצון העליון וימסרנה ביד מלך המשיח, גם אפשר שענין הרמתו הי' כדי להראותו לכל ישראל שיכירו בו לסימן הגאולה ולא יטעו בגאולה כוזבת, ולטעם זה נקרא המעה אות, שזהו סימן על הגאולה, וכמ\"ש הרמב\"ן ז\"ל דענין האות הוא סימן על דבר שיהי' כן בדמיונו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 191,
      "char_length": 905,
      "timestamp": "2025-02-06T19:22:36.688149"
    },
    {
      "id": "beshalach1_p192",
      "text": "ובזה יובן דברי המדרש באותה שעה אמרו ישראל ה' ימלוך לעולם ועד, דממה שראו ישראל שנמנע משרע\"ה מלהתפלל תפלה המכרחת להחיש הגאולה, גם ממה שצוה לו ית' ואתה הרם את מטך כפי' הנ\"ל, השיגו ישראל שעדיין לא קרבה עת הגאולה הנצחית, ולכן אמרו ה' ימלוך לעתיד לבוא, דאיתא במדרש אילו אמרו ישראל ה' מלך לא היתה אומה ולשון שולטת בהם לעולם, אמנם השיגו ישראל שעדיין לא זכו לתיקון השלימות, לז\"א ה' ימלוך לעתיד לבוא.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 192,
      "char_length": 390,
      "timestamp": "2025-02-06T19:22:37.136432"
    },
    {
      "id": "beshalach1_p193",
      "text": "באופן אחר אפ\"ל דברי המדרש משה צוח ווי וכו' בהקדם קושית הח\"ס זלה\"ה, דמה צורך לטעם פן ינחם העם ושבו מצרימה, הרי הי' הכרח בלא\"ה להנחותם דרך המדבר כדי שתנתן להם התורה בהר סיני, כי הי' ההר הזה דייקא מוכן לכך כמבואר בדרז\"ל, ובמכילתא דרשו רז\"ל כי קרוב הוא, קרוב הוא הדבר שאמר הקב\"ה למשה בהוציאך וגו' תעבדון את האלקים על ההר הזה ע\"כ, א\"כ טעם זה לבד מספיק ומה צורך לטעם פן ינחם העם, ע\"כ קושיתו ונשאר בצ\"ע.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 193,
      "char_length": 396,
      "timestamp": "2025-02-06T19:22:37.362507"
    },
    {
      "id": "beshalach1_p194",
      "text": "ואפ\"ל עפימ\"ש ק\"ז זלה\"ה (בתפלה למשה ס\"ח) לפרש מה שיסד רבינו מאיר בקינה וזלה\"ק: סיני העל כן בחר בך אלקים ומאס בגדולים וזרח בגבולך, להיות לאות ולמופת לדת כי תמעט ותרד מכבודה, דלכאורה הוא נגד דברי רז\"ל במס' מגילה וכו' א\"ר יוסף לעולם ילמוד אדם מדעת קונו, שהרי הניח השי\"ת כל ההרים וגבעות שבעולם ולא השרה שכינתו אלא על הר סיני, פירש\"י ילמוד אדם מדעת קונו לאהוב הנמיכות, א\"כ מבואר דהיא ללמד ענוה ולא לסימן לדת שתרד מכבודה, ולמה שאבאר דברי רבינו מאיר המה אחדים עם דברי רז\"ל ובקנה אחד עולים, דהלא כבר הרגישו המפורשים במדרש שהביא היפ\"ת (סדר ויחי פ' צ\"ט) עה\"פ נכון יהי' הר בית ה' בראש ההרים, ההרים שהיו כבר עכ\"ד המדרש, והקשו הלא השי\"ת בוחר בנמוכים וכו', ואבאר זה דבאמת וודאי כבוד שמים הוא להיות מקום כבודו והשראתו ית\"ש ברומו של עולם וכו', אך קודם שנתגלה מלכותו כי בכל משלה, וקודם שנודע לכל שאין זולתו, רצונו ית\"ש להסתיר לבוש הגאות ולא להתלבש בו, כדי שלא יטעו עי\"ז מכח מאמר נעשה אדם, כי יאמרו הלא אינו מתנהג בענוה, והם לא יבינו כי בא ללמד ענוה לאחרים ויפלו באמונות שניות ח\"ו, ע\"כ בחר לו ה' לשכון במקום נמוך, אבל לעתיד שיתגלה לעין כי אפס בלתו וכו', אז יתלבש בלבושו ההדר לו וכו', ועפי\"ז א\"ש דברי רבינו מאיר הנ\"ל, כי ידוע כי התורה ניתנה ע\"ד חירות וכו', דאילו לא חטאו הי' נשאר כבוד ה' כמו שיהי' לעתיד, וא\"כ למה בחר הנמיכות, אלא הוא כי הכל צפוי אף שהרשות נתונה, וא\"כ א\"ר מאיר שפיר סימן לדת שתרד מכבודה, כי אלולי כן לא הי' בוחר הנמוך כמו שלא יבחר לעתיד עכל\"ק.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 194,
      "char_length": 1340,
      "timestamp": "2025-02-06T19:22:37.589032"
    },
    {
      "id": "beshalach1_p195",
      "text": "ובזה יתיישב קושית החת\"ס זלה\"ה, דדרשת המכילתא כי קרוב הוא קרוב הוא הדבר שאמר הקב\"ה למשה בהוציאך את העם וגו' תעבדון את האלקים על ההר הזה, מקושר הוא עם טעם המפורש בכתוב פן ינחם העם ושבו מצרימה, דאלמלי זכו ישראל לשלימות התיקון בבחי' דלעתיד, הי' ניתנה להם התורה בהר תבור וכרמל וסיני בבחי' שיתאחדו כולם לעתיד במקום המקדש, ולא הי' צורך להוליכם דרך המדבר לטעם זה שתנתן להם התורה בהר סיני, אבל מפני כי אמר אלקים פן ינחם העם ושבו מצרימה, ועדיין לא הגיעו אל השלימות, ע\"כ הי' צורך להוליכם דרך המדבר כדברי המכילתא כי קרוב הדבר שאמר הקב\"ה למשה תעבדון את האלקים על ההר הזה, ומזה השיג משרע\"ה שלא יכנס לארץ וע\"כ צווח ווי.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 195,
      "char_length": 604,
      "timestamp": "2025-02-06T19:22:38.255699"
    },
    {
      "id": "beshalach1_p196",
      "text": "ויהי בשלח פרעה את העם וגו', במד\"ר (פרשה כ' סימן ב') הה\"ד (ירמיה ז') כה אמר ה' צבאות וכו' מלה\"ד לאדם שהי' לו פרדס, א\"ל חבירו מכור לי את הפרדס הזה, מכרו לו במנה ולא הי' יודע בעל הפרדס מה בתוכו, אמר לו בכמה מכרת את הפרדס, א\"ל במנה, א\"ל יש בו זתים בק' מנה וכו' ואילו לא הי' של לוקח אלא מעיינות שבתוכו די שנאמר מעין גנים וגו', התחיל המוכר תוהא, כך הי' פרעה כששלח את ישראל לא היו לפניו כלום, א\"ל גדולי מלכות מה עשית אילו לא הי' בידם אלא הביזה לבדם דיים שנאמר וגם ערב רב עלה אתם וכו', באותה שעה התחיל קורא ווי ווי הוי ויהי בשלח עכ\"ד המדרש, וראוי להבין ענין הנמשל אילו לא הי' בידם אלא הביזה לבדם דיים שנא' וגם ערב רב עלה אתם וגו' ומה רבותייהם דערב רב, ואיך יתאים אל דמיון המשל שא\"ל אילו לא הי' בידו אלא מעיינות שבתוכו די, גם מדוע יכנה הערב רב בשם ביזה ומה ענין התייחסות שם זה להם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 196,
      "char_length": 772,
      "timestamp": "2025-02-06T19:22:38.551585"
    },
    {
      "id": "beshalach1_p197",
      "text": "ב) במדרש (פ' כ' סימן ח') ד\"א ויהי בשלח פרעה, מי אמר ווי משה אמר ווי, משל לאחד שנעשה לבתו של מלך שושבין, והי' רואה במזל שהוא מוציאה מבית אביה ואינו בא עמה לבית החתן לחופתה, התחיל בוכה וכו', כך אמר משה צועק אני שנתייגעתי להוציא את ישראל ממצרים ואיני נכנס עמהן לארץ לכך ויהי בשלח עכ\"ד המדרש, וצ\"ב קישור ענין זה לכאן, ויותר נכון מקומו לעיל בפ' בא בסיפור יציאת ישראל ממצרים או להלן כשנגזר עליו שלא יכנס לארץ.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 197,
      "char_length": 403,
      "timestamp": "2025-02-06T19:22:38.965136"
    },
    {
      "id": "beshalach1_p198",
      "text": "ג) במד\"ר (פ' כ' סימן ג') ויהי בשלח פרעה וכי פרעה שלחם, בלעם אמר א\"ל מוציאם ממצרים וכאן כתיב ויהי בשלח פרעה, אלא מלמד שהי' פרעה מלוה אותם וכו' ואין שילוח האמור כאן אלא לוי' שנאמר ואברהם הולך עמם לשלחם, אמנם לפי פשוטו קשה וכי פרעה שלחם וכו'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 198,
      "char_length": 239,
      "timestamp": "2025-02-06T19:22:39.194567"
    },
    {
      "id": "beshalach1_p199",
      "text": "ונל\"פ עפ\"י הידוע בדברי חז\"ל ובזוה\"ק שבכ\"מ שנאמר העם הכוונה על הערב רב, ולכאורה יש לתמוה איך יצאו הערב רב ממצרים, וחז\"ל דרשו עה\"פ כי הוציא ה' את ישראל ממצרים זו גדולה על כולם שהרי אין עבד יכול לברוח ממצרים, והתינח בנ\"י יצאו בדרך נס שהוציאם הקב\"ה ביד חזקה ובזרוע נטוי', אבל הערב רב לא הסכים הקב\"ה שיצטרפו אל בני ישראל ביציאתם ממצרים כמ\"ש רש\"י ז\"ל עה\"פ שחת עמך אשר הוצאת ממצרים שחת העם לא נאמר, אלא שחת עמך, ערב רב שקבלת מעצמך ולא נמלכת בי, ואמרת טוב שידבקו גרים בשכינה הם שחתו והשחיתו עכ\"ל, וא\"כ איך זכו הם לנס היציאה שהי' נמנע בדרך הטבע לצאת משם כאמרז\"ל, וקושיא זו כחה יפה גם על בני אפרים שאמרו חז\"ל שיצאו שלשים שנה לפני הזמן נשיהן בניהם ובנותיהם, ואיך יכלו לצאת עם רב וארץ מצרים היתה מוקפת בכשפים שאף עבד לא יכול הי' לברוח משם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 199,
      "char_length": 727,
      "timestamp": "2025-02-06T19:22:39.345936"
    },
    {
      "id": "beshalach1_p200",
      "text": "אכן ל\"ק דמה שלא הי' עבד יכול לברוח ממצרים הי' ע\"י כח הכשפים שהם כוחות הסט\"א והואיל ובני אפרים עשו שלא כדת לעבור את פי ה' ליקח לעצמם חירות וגאולה לפני הזמן לכן לא מנעו בעדם כוחות הסט\"א, ועוד סייעו בידם לעבור את פי ה' לקחת חירות וגאולה לפני הזמן, לכן פתחה להם הסט\"א פתח כפתחו של אולם ויצאו בדרך הטבע באין מפריע ואין לתמוה מה שרדפו אח\"כ המצריים אחריהם והרגום, דזהו דרך הסט\"א לפתות את ישראל לדבר עבירה ואח\"כ מקטרגים עליהם להענישם, וכענין הזה הי' גם בערב רב שעלו עם ישראל, דהנה המה היו המביאים וגורמים לבנ\"י לכל חטאת ולכל עון למעול מעל בה', והם שעשו את העגל והחטיאו את ישראל וגרמו למשרע\"ה שלא יכנס לארץ לכן סייע להם הסט\"א שיוכלו לצאת עם ישראל, ופרעה והמצריים לא התנגדו ליציאתם, ואדרבה שלחו אותם כדי שיהיו לבנ\"י לאבן נגף ולמכשול, וז\"ש הפסוק ויהי בשלח פרעה את העם היינו הערב רב ול\"ק קושית המדרש בלעם אמר אל מוציאם ממצרים דזה נאמר על בנ\"י והקב\"ה הוציאם ולא פרעה שלחם, אבל את העם היינו הע\"ר שלח פרעה עם ישראל מרצונו כדי להצר לישראל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 200,
      "char_length": 923,
      "timestamp": "2025-02-06T19:22:39.729751"
    },
    {
      "id": "beshalach1_p201",
      "text": "ואמרז\"ל בספרי וגם ערב רב עלה אתם כאן נתקיים בהם ואח\"כ יצאו ברכוש גדול וצ\"ב, והוא כעין מה שדרשו ז\"ל במדרש הנ\"ל וגם ערב רב עלה אתם היא הביזה ושניהם צריכין ביאור, ואפ\"ל שטעמו של משרע\"ה שקבל הערב רב הי' מחמת שראה ברוח קדשו שנבלע בתוכם נשמות קדושות שעתידין להתברר ולהתקרב אל הקדושה לעתיד, ובאמת הי' ג\"כ רצון הבוי\"ת לקבלם ולהציל נשמות שבתוכם דלא יצוייר שעשה משרע\"ה דבר נגד רצונו ית', אלא מפני שראתה חכמתו ית' שיצא תקלה לישראל ע\"י הערב רב, לא צוהו על ככה אלא משרע\"ה מגרמי' עבד ונקראת על שמו, דלא יאות שיתייחס פעולת הרע אליו ית', וכעי\"ז מצינו בזוה\"ק פ' לך (דף פ\"ב ע\"א) א\"ר יצחק בגין כך לא פקיד קוב\"ה (לאאע\"ה) לנחתא למצרים, אלא הוא מגרמי' נחת, בגין דלא יהא פתחון פה לבני עלמא, דאמר לי' כן ולבתר אצטער על אתתי' עכ\"ל, ומבואר שם בזוה\"ק (דף פ\"ג ע\"א) שהי' רצון הבוי\"ת שירד למצרים עיי\"ש, אלא שלא צוהו על ככה לטעם המבואר לעיל בדברי הזוה\"ק, ולעיל בדברינו (פ' לך עמוד רל\"ז) ביארנו מ\"ש בזוה\"ק שם כיון דנחת אברהם למצרים בלא רשו, אשתעבידו בנוי במצרים ד' מאה שנין וכו', דאף שהי' רצונו ית' כך, מ\"מ נחשב לו לפגם בבחי' נורא עלילה עיי\"ש, ועד\"ז בשליחות המרגלים א\"ל הקב\"ה למשה אני איני מצוה אותך אם תרצה שלח, וכמו\"כ בענין הערב רב רצונו ית' הי' שיעשה משרע\"ה מעצמו, והשיג משרע\"ה שעתידין לצאת מהם נשמות גבוהות וע\"כ קיבלם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 201,
      "char_length": 1190,
      "timestamp": "2025-02-06T19:22:40.169874"
    },
    {
      "id": "beshalach1_p202",
      "text": "ונקדים דברי ק\"ז היש\"מ זלה\"ה (פ' תולדות ד\"ה ויאהב יצחק) לפרש הפסוק ובביזה לא שלחו את ידם עפי\"מ שמצינו בגמ' (גיטין דף נ\"ז ע\"ב) שמבני בניו של המן למדו תורה ברבים, הרי שלא כלה זרעו לגמרי, והטעם ע\"ד דכתיב וירא כי אין איש עתיד להתגייר ע\"כ ויך את המצרי וגו' ולכך באלו שראו ברוה\"ק שהיו בהם ניצוצות קדושות לא נגעו בהן, וידוע מה שפירשו וראיתי את דמעת העשוקים, דקאי על ניצוצות הקדושה העשוקים בתוך הטומאה, וז\"ש ובביזה, במקום ביזה לא שלחו את ידם לנגוע בהם עכ\"ל, ובזה יובן דברי המדרש הנ\"ל אמרו לו גדולי מלכות מה עשית אילו לא הי' בידם אלא הביזה לבדם דיים, היינו הנשמות הקדושות שהוליכו עמהם ממצרים שהם נקראים ביזה כפי' היש\"מ, שנאמר וגם ערב רב עלה אתם דמה\"ט קבלם משה רבינו מפני שראה בהם נשמות קדושות, ונצטערו המצריים מאוד שנשמות אלו נתקרבו אל הקדושה ולפיכך צוח פרעה ווי.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 202,
      "char_length": 753,
      "timestamp": "2025-02-06T19:22:40.747059"
    },
    {
      "id": "beshalach1_p203",
      "text": "ויובן בזה דמיון הנמשל למעיינות שבפרדס, דכמו שהמעיין תמיד הוא נובע ומתרבה, וכאשר האדם מסתכל בו אינו רואה מקורו ולא ישיג אכותו ומהותו דמקור המעיין מכוסה מעין, כמו כן הערב רב שקבלם משה רבינו שלפי ראות העין לא היו ראויין להתקרב אל הקדושה, אעפ\"כ הי' מובלעים בתוכם נשמות יקרות שעתידין להתברר אחר ביאת המשיח, וזה ראה משה רבינו וע\"כ קיבל אותם, ומבואר בדברי חכז\"ל דאלמלי נכנס משה רבינו ע\"ה לארץ ישראל הי' מיד עולם התיקון. ואז היו מתבררין כל הנשמות של הע\"ר, ובוודאי לא הי' פרעה משלח אותם, כי לא הי' ברצונו להוסיף קדושה על קדושה, ורק מפני שראה שלא קרבה הגאולה שלימה כמו שאמר בלעם אראנו ולא עתה אשורנו ולא קרוב, ע\"כ הסכים לשלוח הע\"ר עם ישראל כדי להצר להם, ובזה יתבאר דברי המדרש ויהי בשלח פרעה את העם, ר\"ל הע\"ר עם ישראל, משה צווח ווי שלא יכנס לארץ.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 203,
      "char_length": 735,
      "timestamp": "2025-02-06T19:22:41.130407"
    },
    {
      "id": "beshalach1_p204",
      "text": "ויהי בשלח פרעה את העם ולא נחם אלקים דרך ארץ פלשתים כי קרוב הוא, במכילתא לא הביאן הקב\"ה דרך פשוטה לארץ ישראל אלא דרך המדבר, אמר הקב\"ה אם אני מביא עכשיו ישראל לארץ, מיד מחזיקים אדם בשדהו ואדם בכרמו, והן בטלים מן התורה, אלא אקיפם במדבר מ' שנה, שיהיו אוכלין מן ושותין מי הבאר, והתורה נבללת בגופן, מכאן הי' ר' שמעון אומר לא ניתנה תורה אלא לאוכלי המן, ושניים להם אוכלי תרומה עכ\"ד המכילתא, וצ\"ב דאין זה הטעם המפורש בכתוב פן ינחם העם בראותם מלחמה וגו', ומדוע נטו חכז\"ל בדרשתם ליתן טעם חדש שונה מהמפורש בפסוק.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 204,
      "char_length": 500,
      "timestamp": "2025-02-06T19:22:41.498417"
    },
    {
      "id": "beshalach1_p205",
      "text": "ב) במד\"ר (פרשה כ' סי' ט\"ז) ד\"א ולא נחם אלקים, למה דרך פלשתים, א\"ר שמעון בן אבא א\"ר יוחנן כיון ששמעו הכנענים שישראל נכנסין לארץ, עמדו וקצצו הנטיעות שהיו להם, כיון ששמעו שנתעכבו במדבר מ' שנה היו סבורים שבמדבר תהא דירתם, עמדו ונטעו נטיעות וגדלו אותן ואח\"כ הכניסן לארץ עכ\"ד המדרש, ולכאורה גם זה צ\"ב דאין זה טעם המפורש בכתוב פן ינחם העם וגו'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 205,
      "char_length": 337,
      "timestamp": "2025-02-06T19:22:41.758773"
    },
    {
      "id": "beshalach1_p206",
      "text": "ונל\"פ בהקדם לבאר בדברי המדרש הנ\"ל דהטעם שהסיבם הקב\"ה דרך המדבר, הי' בשביל שקצצו הכנענים כל הנטיעות, והקב\"ה הבטיח לישראל להביאם אל ארץ טובה ורחבה וע\"י שנתעכבו ישראל מ' שנה במדבר, חזרו ונטעו נטיעות חדשים, ולכאורה טעם זה צ\"ב דכמו שנתן הקב\"ה בלבם לנטוע נטיעות חדשים אח\"כ, כמו\"כ הי' היכולת בידו ית' למנוע אותם מתחלה, או ליתן בלבם עצה שלא לקצצם, ומדוע בשביל טעם זה בלבד הי' ההכרח לסבבם מ' שנה במדבר, אלא וודאי שהי' רצון הבוי\"ת כן שיקצצו כל הנטיעות וינטעו חדשים וצ\"ב הטעם,",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 206,
      "char_length": 465,
      "timestamp": "2025-02-06T19:22:41.941195"
    },
    {
      "id": "beshalach1_p207",
      "text": "ויתבאר בהקדם דברי הגמ' (ע\"ז דף נ\"ג ע\"ב) א\"ר אלעזר וכו' דאמר רחמנא ואשיריהם תשרפון באש, מכדי ירושה הוא להם מאבותיהם, ואין אדם אוסר דבר שאינו שלו, ואי משום הנך דמעיקרא, (פירש\"י משום אשירות דמעיקרא היו קודם שניתנו לאברהם, ולא ידעינן הי נינהו), בביטולא בעלמא סגי להו, (פירש\"י דקיי\"ל נכרי מבטל ע\"ז של עכו\"ם על כרחו ליכפינהו לעובדי כוכבים וליבטלינהו), ותירצו בגמ' מדפלחו ישראל לעגל גלו אדעתייהו דניחא להו בע\"ז, וכי אתו עכו\"ם שליחותא דידהו עבדי, (פירש\"י הלכך הוי ע\"ז של ישראל ואינה בטילה עולמית) עכ\"ד הגמ' לענינינו, והנה דרשו רז\"ל עה\"פ נתנה ראש ונשובה מצרימה, אין ראש אלא ע\"ז שנאמר ויהי דוד בא עד הראש, ולפי שהי' גלוי וידוע לפניו ית' שיחשבו ישראל מחשבה אחרת ויטעו בעגל, ומעתה יאסרו כל הנטיעות שעבדו להם הכנענים, דגלו ישראל אדעתייהו דניחא להו והוי כע\"ז של ישראל, ע\"כ נתן השי\"ת בלב הכנענים שיעקרו כל הנטיעות ויתבטל הע\"ז, דבלא\"ה לא יוכלו ישראל ליהנות מהם ויצטרכו לעקרם, ואחר שעשו ישראל תשובה על חטא העגל, ונטעו הכנענים נטיעות חדשים ולזה מהני ביטול דלא הוי כע\"ז של ישראל, דכבר גלו ישראל אדעתייהו דלא ניחא להו בע\"ז, אלא שחכז\"ל נתנו סימנא להכיר האשירות האסורים כאמרז\"ל (ע\"ז דף מ\"ה ע\"ב) אר\"ע כל מקום שאתה מוצא הר גבוה וגבעה נשאה ועץ רענן דע שיש שם ע\"ז, ואפשר דאלו לא נעקרו ע\"י הכנענים והניחום לתקלה לישראל ולזה לא מהני להו ביטול כע\"ז של ישראל, אבל שאר הנטיעות שנטעו הכנענים אח\"כ יכלו ישראל ליהנות מהם ע\"י ביטול.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 207,
      "char_length": 1297,
      "timestamp": "2025-02-06T19:22:42.183102"
    },
    {
      "id": "beshalach1_p208",
      "text": "ומעתה א\"ש דמ\"ש במדרש דטעם עיכובם של ישראל במדבר הי' בשביל הנטיעות, הוא מקושר עם טעם המפורש בכתוב פן ינחם העם וגו', דמפני שהי' חשש זה קיים שיחשבו מחשבה אחרת לטעות אחר ע\"ז, וכמו שאירע באמת שטעו אחר העגל ונאסרו כל הנטיעות, לכן נתעכבו ישראל במדבר עד שנטעו חדשים לאחר שעשו ישראל תשובה והותרו להם, ועד\"ז אפ\"ל דגם טעם המכילתא מקושר עם טעם המפורש בכתוב, דהנה הבטיח הקב\"ה לישראל שיביאם אל ארץ טובה ורחבה וגו' בתים מלאים כל טוב, כרמים וזתים אשר לא נטעת, וא\"כ לא יצטרכו לעבוד עבודת שדה וכרם כלל, ומדוע חש הקב\"ה שיחזיקו איש בשדהו ובכרמו ויתבטלו מן התורה אמנם מפני שהי' חשש זה קיים פן ינחם העם כנ\"ל. ולזה הי' צורך שיעקרו הכנענים כל הנטיעות, ואלמלי נכנסו ישראל מיד, היו צריכים לעמול בעבודת שדה וכרם ויתבטלו מן התורה, וע\"כ הקיפם הקב\"ה במדבר מ' שנה שיהיו אוכלין מן ושותין מי באר והתורה נבללת בגופן שם כי לא הי' מתקיים עסק התורה בידם בארץ ישראל, ולאחר שחזרו ונטעו הכנענים כל הנטיעות, נכנסו לארץ מלאה כל טוב ונתקיים עסק התורה בידם גם לאח\"כ, וא\"ש דכולהו טעמים שאמרז\"ל נרמזו בטעם הכתוב פן ינחם העם וגו'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 208,
      "char_length": 983,
      "timestamp": "2025-02-06T19:22:42.854781"
    },
    {
      "id": "beshalach1_p209",
      "text": "ויהי בשלח פרעה וגו' במד\"ר (פ' כ' סי' ה') הה\"ד (שה\"ש ד') שלחיך פרדס רמונים, א\"ר לוי משל לאחד שהי' לו שדה והי' בה גל של צרורות, עמד ומכרה לאחר, עמד אותו האיש שקנאה והעביר אותו הגל מתוכה, ומצא תחתיו מים חיים: נטעה גפנים עשאה שורות שורות נטע בה כל מיני בשמים וכו' והושיב בתוכה שומר וכו', עבר עלי' אותו האיש שמכרה ראה אותה מליאה כל טוב, אמר אוי לי שכך מכרתי, אוי לי שכך הוצאתי מידי, כך היו ישראל במצרים גל של צרורות וכו', כיון שיצאו נעשו פרדס רמונים וכו' לכך נאמר ויהי בשלח פרעה עכ\"ד המדרש וצ\"ב דמיון המשל שאינו מתאים לכאורה עם הנמשל, כי בסיפור המשל הי' המעיין מכוסה בגל של צרורות, ולא הרגיש בו המוכר כלל ופנים חדשות באו אח\"כ ביד הקונה, משא\"כ פרעה הכיר וידע איכותם ומספרם של ישראל גם במצרים, ומה נתגלה לו מגדולתם יותר בעמדם על הים, ואם לצד שנתעלו במעלות הנפשות וברוחני, אין זה סיבה לפרעה שיתחרט עבור זה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 209,
      "char_length": 798,
      "timestamp": "2025-02-06T19:22:43.315708"
    },
    {
      "id": "beshalach1_p210",
      "text": "ואפ\"ל בהקדם מה שפירשתי דברי הזוה\"ק (ר\"פ ויקהל קצ\"ה ע\"א) ויקהל משה וגו' מאן אתר כניש לון. אלא בגין דהוו אינון ערב רב בינייהו אצטריך משה לאכנשא לון וליחדא לון מבינייהו עכ\"ד הזוה\"ק, ולכאורה אם התכוין משרע\"ה רק להפרידן מן הע\"ר הו\"ל להכתוב לומר ויפרד משה, דאין זה פעולת הקהלה כ\"א פעולת הפרדה, ויתבאר עפימ\"ש בס' אוהל יעקב פ' וישב לפרש הכתוב (איוב ט\"ו) כי עדת חנף גלמוד היות ידענו גם בעסקי העוה\"ז, כי הדבר המוסכם באסיפת הרבים יותר מקובל מהמוסכם ביחיד, אבל זה אינו רק אם הנאספים לחקור על הדבר אין כוונתם להנאת עצמם, בלתי להעמיק בתכלית ואמיתת הענין, משא\"כ באם המה בהסכמתם על הדבר כוונו כל אחד לפי ענינו הטמון בקרבו לטובתו, אז אין לסמוך על המוסכם מפיהם יותר מעל המוסכם מאיש פרטי, וזהו עדת חנף גלמוד פי' בשגם יהי' עדה גדולה עכ\"ז אינו חשוב כ\"א כיחידים פרטים כי כל אחד מובדל ומרוחק מזולתו עכת\"ד, ובזה יתבארו דברי הזוה\"ק ופי' הכתוב, דכ\"ז שהיו הערב רב מעורבין בישראל, היו מכניסים פירוד לבבות ומחשבת פניות גם בישראל, וע\"כ אף שהיו עם רב ועדה גדולה לא היו נחשבים כ\"א כיחידים פרטים וע\"י שהפרידן מן הערב רב נעשו ישראל קהלה אחת בהתאחדות הלבבות לעשות רצון הבוית\"ש, וז\"א ויקהל משה שהפרידן מן הערב רב שעי\"ז נעשו קהלה אחת בהתאחדות גמור.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 210,
      "char_length": 1111,
      "timestamp": "2025-02-06T19:22:43.723061"
    },
    {
      "id": "beshalach1_p211",
      "text": "ועד\"ז יתבאר ענין המשל שבמדרש הנ\"ל, דהנה רשעי ישראל היו במצרים מרובים על הכשרים פי כמה, כאמרז\"ל במדרש דא' מחמשה יצאו, ולחד מ\"ד א' מחמש מאות, ואיכא למ\"ד ב' מס' רבוא והשאר מתו בג' ימי אפילה על שהיו רשעים ולא רצו לצאת ממצרים, והן היו פטרונין לפרעה, עכ\"פ כ\"ז שהיו הרשעים ביניהם ומרובין עליהם לא הכיר פרעה מעלתם וחשיבותן של ישראל, כי היו בטלין לגביהם וכיחידים נפרדים נחשבו מחמת הרוב הגדול שהתנגד לדעתם, וזהו דמיון המשל למים חיים שמכוסה בגל של צרורות היינו הע\"ר, וכשיצאו ישראל ממצרים מתו כל אלו הרשעים בג' ימי אפילה, והע\"ר שיצאו עמהם לא היו מעורבים כ\"כ ביניהם, שעמדו חוץ לעננים, ואז השיג פרעה חשיבותן של ישראל, וכח הגדול שיש לאומה זו בשעה שהם נפרדים מן הרשעים ונקהלים יחד, וע\"כ צווח וויי שכך הוצאתי מידי.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 211,
      "char_length": 697,
      "timestamp": "2025-02-06T19:22:44.245335"
    },
    {
      "id": "beshalach1_p212",
      "text": "ויסב אלקים את העם דרך המדבר ים סוף וחמשים עלו בני ישראל מארץ מצרים, יל\"ד בשנותו את טעמו מהעם לבני ישראל, שהתחיל הכתוב ויהי בשלח פרעה את העם וגו' פן ינחם העם וגו' ויסב אלקים את העם וגו', ואח\"כ וחמשים עלו בני ישראל, וידוע דבני ישראל לאו היינו העם וצ\"ב הכוונה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 212,
      "char_length": 257,
      "timestamp": "2025-02-06T19:22:44.595364"
    },
    {
      "id": "beshalach1_p213",
      "text": "ב) וחמשים עלו בני ישראל פרש\"י אין חמושים אלא מזויינים וכו', דבר אחר חמשים מחומשים, אחד מחמשה יצאו וד' חלקים מתו בג' ימי אפילה, ולכאורה צ\"ב לשני הפירושים דאין כאן מקומה של הודעה זו, ולעיל היל\"ל בפ' בא בהזכרת יציאת מצרים, וברש\"י במוסגר (פי' בשם רש\"י ישן) לפי שהסיבתן במדבר גרם להם שעלו מחומשים וכו', וכתוב זה לא נכתב כ\"א לשבר את האוזן שלא תתמה במלחמת עמלק ובמלחמות סיחון ועוג ומדין מהיכן היו להם כלי זיין וכו' עכ\"ל, אמנם גם טעם זה צ\"ב דבאמת לא הוצרכו ישראל לכלי זיין ולא בכח החרב נלחמו בעמלק, כמפורש בכתוב והי' כאשר ירים משה ידו וגבר ישראל, ודרשו רז\"ל (ר\"ה כ\"ט ע\"א) וכי ידיו של משה עושות מלחמה וכו', אלא כ\"ז שישראל משעבדין את לבם לאביהם שבשמים היו נוצחים וכו', והכלי זיין שהוליכו עמהם הי' להם רק לנסיון, כמ\"ש רז\"ל ארבע כתין אתעבידו ישראל על ים סוף וכו' כת א' אמרה נסדר לקובליהון סדרי קרבא וכו' והשיב להם משה רבינו ד' ילחם לכם ואתם תחרישון, וא\"כ יותר טוב הי' להם אם לא הי' בידם כלי זיין, כי אז לא באו לידי נסיון. ובפרט שלא הי' צורך להם לכלי זיין כלל, ולפי' השני שפרש\"י חמשים מחומשים וכו' ודאי קשה דאין כאן מקומה להודיע זה והול\"ל לעיל בפ' יציאת מצרים, וכמו\"כ יל\"ד במאמה\"כ להלן ויקח משה את עצמות יוסף עמו כי השבע השביע את בנ\"י וגו', דהול\"ל להכתוב להודיענו זה בפ' יציאת מצרים, שהרי כבר נתקיים דבר זה טרם יציאתם, ואז הי' חלות השבועה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 213,
      "char_length": 1226,
      "timestamp": "2025-02-06T19:22:44.748144"
    },
    {
      "id": "beshalach1_p214",
      "text": "ג) ויאמר אם שמוע תשמע לקול ד' אלקיך וגו' כל המחלה אשר שמתי במצרים לא אשים עליך כי אני ד' רופאך, והקשו המפרשים דאם לא אשים רפואה למ\"ל, ורש\"י ז\"ל פי' ואם אשים ה\"ה כאלו לא הושמה כי אני ד' רופאך ולפי פירושו ג\"כ צ\"ב דעיקר חסר מן הספר, דלא כתיב ואם אשים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 214,
      "char_length": 248,
      "timestamp": "2025-02-06T19:22:45.405690"
    },
    {
      "id": "beshalach1_p215",
      "text": "ד) ויאמר משה אליהם איש אל יותר ממנו עד בוקר ולא שמעו אל משה ויותירו אנשים ממנו עד בקר וגו', דקדק האוהחה\"ק דלא הי' צ\"ל אלא ויותירו וגו', ואני יודע שלא שמעו אל משה, גם צ\"ב מ\"ט קראם הכתוב אנשים, ורז\"ל אמרו בכ\"מ אין אנשים אלא צדיקים, ובמד\"ר (פ' שלח פ' ט\"ז סי' ה') איתא בכל מקום שנאמר אנשים בני אדם צדיקים. הם, ואלו שהותירו המן היו דתן ואבירם כמפורש במד\"ר (פ' כ\"ה סימן י') ובפרש\"י ז\"ל ומ\"ט קראם הכתוב אנשים, והגם שמצינו במקצת מקומות מלת אנשים לא על צדיקים, כמו שני אנשים עברים נצים וכדומה, אה\"נ דבכ\"מ צריך ביאור ליישב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 215,
      "char_length": 513,
      "timestamp": "2025-02-06T19:22:45.567809"
    },
    {
      "id": "beshalach1_p216",
      "text": "ה) גם אינו מובן כוונת המותירים, ואם לצד חסרון אמונתם שייראו לנפשותם שלא יהי' להם למחר לאכול, אין לך שטות גדול מזה, שהרי כבר ראו בחוש גודל הנס שירד להם לחם מן השמים. והבטיח להם הקב\"ה ולקטו דבר יום ביומו ואיך ידאגו עוד דאגת מחר, ומה גם שלא לקטו רק איש לפי אכלו, וא\"כ מה שהותירו החסירו משיעור אכילתם של אותו היום, והיו מענים את נפשם על לא דבר, ואף אם הי' כל כוונתם רק למרוד במשרע\"ה, מ\"מ בודאי הי\"ל איזה חשבון והתחכמות, וזה דבר שאין לו הבנה כלל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 216,
      "char_length": 441,
      "timestamp": "2025-02-06T19:22:45.856835"
    },
    {
      "id": "beshalach1_p217",
      "text": "ו) ויראו בני ישראל ויאמרו איש אל אחיו מן הוא כי לא ידעו מה הוא ויאמר משה אליהם הוא הלחם אשר נתן ה' לכם לאכלה, ואחר שא\"ל משרע\"ה מצות השבת, כתיב וישבתו העם ביום השביעי, ויקראו בית ישראל את שמו מן, ולכאורה הרי כבר הזכיר לעיל ויאמרו איש אל אחיו מן הוא וגו', ומדוע חזר כאן לומר ויקראו בית ישראל את שמו מן, גם צ\"ב טעם שינוי הלשונות דלעיל הזכיר ויראו \"בני ישראל\" ויאמרו איש אל אחיו וגו', וכאן ויקראו בית ישראל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 217,
      "char_length": 403,
      "timestamp": "2025-02-06T19:22:46.109395"
    },
    {
      "id": "beshalach1_p218",
      "text": "ז) במכילתא איתא ויראו בני ישראל ויאמרו איש אל אחיו מן הוא, דורשי רשימות אמרו ישראל קראו שמו מן, שנאמר הוא הלחם אשר נתן ה' לכם לאכלה, ולהלן עה\"פ ויקראו בית ישראל את שמו מן, אמרו במכילתא דורשי רשימות אמרו בני ישראל קראו את שמו מן ע\"כ, ושניהם צ\"ב דמה הוסיפו על המפורש בקרא ומה צורך לדורשי רשימות, אחרי שמפורש בכתוב ויקראו בית ישראל את שמו מן, (עיין בישמח משה שביאר בזה עפ\"י דרכו)",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 218,
      "char_length": 376,
      "timestamp": "2025-02-06T19:22:46.332043"
    },
    {
      "id": "beshalach1_p219",
      "text": "ולבאר הענין נקדים מ\"ש בספה\"ק תפארת שלמה לפרש הפסוק ויקח משה את עצמות יוסף עמו וגו' וזלה\"ק, הנה בספר יהושע (כ\"ד) כתיב ואת עצמות יוסף אשר העלו בנ\"י ממצרים קברו בשכם, בגמ' (סוטה דף י\"ג ע\"ב) הקשו קראי אהדדי דהא כתיב ויקח משה את עצמות יוסף עמו, והכא כתיב אשר העלו בני ישראל וכו', הנ\"ל לרמז בזה כוונת יוסף לתועלת בני ישראל, שע\"י כח קדושת עצמותיו של יוסף הצדיק שנשארו עמהם במצרים, הנה זה שזכו בנ\"י לגאולה, כי זהו בחינת יוסף שנקרא גואל כיל\"ח, ובזכות עצמותיו נגאלו, (וכעין זה מצינו בזוהר (פ' ויחי דף רכ\"ב) אמר הקב\"ה אי יוסף אסתלק מהכא גלותא לא אתקיים עיי\"ש). וז\"ש פקוד יפקוד אלקים אתכם. פי' הפקידה מהגאולה אשר יפקוד אתכם יהי' ע\"י עצמותי וזה והעליתם את עצמותי מזה אתכם, שהם יסבבו את הגאולה לכם ולהעלות אתכם להשפיע לכם כל טוב לעולם, כי כן הוא גדול כח קדושת הבלא דגרמי של הצדיקים, אף לאחר פטירתם הם משפיעים כל טוב לבני ישראל ושפתותיהם דובבות בקבר, וז\"ש חכז\"ל קנה שם טוב קנה לעצמו קנה לו דברי תורה קנ\"ה גימטריא יוסף עה\"כ לרמז ע\"י קדושת יסוד יוסף קנה לעצמו, פי' שגם עצמותיו משפיעים כ\"ט והוא קנה לו ד\"ת שנעשה כמעיין המתגבר, ועד\"ז הוא שאמרו חכז\"ל צדיק זכיותיו חקוקים על עצמותיו וכן להיפך, כי ענין עצמות רומז לבחי' יסוד לכן אמרו מי שלא נשא אשה מבן עשרים שנה ולמעלה תיפח עצמותיו, אבל בהתיקון כתיב עצמותיך יחליץ, הנה לכך כתיב ויקח משה את עצמות יוסף עמו, כי משה רבינו ע\"ה הי' יודע את כל אשר נעשה בשביל העצמות האלה שגרם להם הגאולה כמ\"ש כי השבע השביע את בנ\"י, לשון שבועה להשפיעם כל טוב לכן לקחם עמו בכל המסעות של בני ישראל כנ\"ל, ומה שנאמר בספר יהושע ואת עצמות יוסף אשר העלו בני ישראל, הכי פירושו שהם העלו בנ\"י ממצרים, כי בזכותם נגאלו כנ\"ל, וכן הגאולה העתידה במהרה בימינו יהי' ג\"כ ע\"י הצדיק יסוד עולם וכו' עכלה\"ק לענינינו",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 219,
      "char_length": 1598,
      "timestamp": "2025-02-06T19:22:46.539373"
    },
    {
      "id": "beshalach1_p220",
      "text": "ועד\"ז אפשר לרמוז במאמה\"כ ויאר את הלילה ולא קרב זה אל זה כל הלילה, דהנה המצריים היו שטופים בזימה וקליפת מצרים הוא זימה, ובדרך זה רצו להתגבר על ישראל להכניס בלבם מחשבות זימה והרהורים רעים ולהביאם עי\"ז לידי טומאה ר\"ל, כמ\"ש רז\"ל (כתובות דף מ\"ו ע\"א) ונשמרת מכל דבר רע, שלא יהרהר אדם ביום ויבוא לידי טומאה בלילה, ובכוונה זו רדפו אחרי ישראל להשיגם ולהתגבר עליהם להחטיאם ר\"ל, אלא שהציל הקב\"ה את ישראל מידם, והבדיל הקב\"ה בינם ובין ישראל ע\"י מסך העננים, ולא יכלו להתקרב אל בני ישראל כלל, וז\"פ ויאר את הלילה שהאיר להם הקב\"ה את הלילה, שלא נכשל אף א' מישראל בהרהור או בחטא ח\"ו, ולא קרב זה אל זה כל הלילה, שקליפת מצרים לא נתקרב לשום א' מישראל, שאם חוטאים ר\"ל בחטא זה מוסיפים כח בסט\"א ונעשים דבוקים להם ממש, אבל ישראל בקרי\"ס הובדלו מהם ולא קרב זה אל זה כל הלילה, ונשארו כולם קדושים וטהורים שלא נכשל שום א' מישראל בחטא זה, וע\"כ נשאר כח זה נצחי לדורות, והקריאה מעורר הזמן, שבאלו פרשיות של ימי השובבים שקורין בתורה יציאת מצרים וקרי\"ס ומלחמת עמלק, המה מסוגלים לתקון חטא הידוע, ובכח זה ינצחו ישראל שרו של עמלק הוא הס\"מ ומלחמה זו ישנו בכל דור ודור עד דורו של משיח כאמרז\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 220,
      "char_length": 1051,
      "timestamp": "2025-02-06T19:22:47.308093"
    },
    {
      "id": "beshalach1_p221",
      "text": "והנה דרשו רז\"ל במכילתא פקד יפקד אלקים אתכם פקד אתכם במצרים, יפקוד אתכם בים סוף פקד אתכם במדבר, יפקוד אתכם על נחלי ארנון, פקד אתכם בעוה\"ז יפקוד אתכם לעוה\"ב, הרי שרמז יוסף הצדיק בשבועתו על כל הדורות עד ימות המשיח, ועד\"ז ירמוז והעליתם את עצמותי מזה אתכם על כל הדורות, שיאחזו בעצמות קדושת יוסף תקון היסוד, ועי\"ז תעלו מן הגלות עמו ותזכו לגאולה, ובס' זכרון למרן הח\"ס זלה\"ה הובא מכתי\"ק שהיה שעת חירום ומלחמה וסכנה גדולה לישראל ר\"ל, ואמר בדרשתו שהשמירה מחטא זה סגולה להנצל מחצי האויב, שג\"ז נקרא בלשון חץ בדברי רז\"ל יורה כחץ וכתיב כחצים ביד גבור כן בני הנעורים, וע\"כ מדה כנגד מדה יש בו סגולת הצלה מחצי המלחמה עייש\"ד באריכות, ובעוה\"ר גם עכשיו צריכים אנו לרחמי שמים להנצל מחבלי משיח. שלא יטרפו זאבי טרף את השה, ע\"כ נראה לתקן כ\"א פגמי נפשו ושלא לפגום עוד ובזכות זה נינצל ונזכה לישועה שלימה במהרה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 221,
      "char_length": 784,
      "timestamp": "2025-02-06T19:22:47.833929"
    },
    {
      "id": "beshalach1_p222",
      "text": "ונחזור לבאר הכתוב כל המחלה אשר שמתי במצרים לא אשים עליך כי אני ד' רפאך והדקדוקים הנ\"ל (קושיא ג') בהקדם לפרש הפסוק (תהלים מ\"א) אני אמרתי ד' חנני רפאה נפשי כי חטאתי לך, ולכאורה מה נתינת טעם הוא זה, וכי בשביל שחטא ינתן לו הרפואה, אמנם ידוע כי העון הוא חולת הנפש, וזהו שורש וסיבת כל חולי הגוף ר\"ל, אלא שהבוי\"ת מאריך אף ואינו מביא היסורים מיד, אולי ישוב האדם ויתקן פגמי נפשו ושב ורפא לו, וצריך האדם להקדים תפלה לצרה שיזכה לתקן פגמי נפשו ויתרפא מחולי הנפש ואז לא יבואו עליו חולי הגוף כלל, וכמ\"ש רז\"ל שבת (ל\"ב ע\"א) לעולם יבקש אדם רחמים שלא יחלה, שאם יחלה אומרים לו הבא זכות והפטר, ועד\"ז ביקש דוהמע\"ה ד' חנני רפאה נפשי כי חטאתי לך, שירפאהו ד' מחולי הנפש הנגרם בסיבת החטא ולא יגיעו אליו חולי הגוף כלל, הנה המצריים לא נתרפאו מחטאם כי לא עשו תשובה, ע\"כ הביא הקב\"ה מכות ונטרדו מעוה\"ז ועוה\"ב, והבטיח הקב\"ה לישראל אם שמוע תשמע לקול ד' אלקיך והאזנת למצותיו ושמרת כל חקיו וגו', אף שאין אדם צדיק בארץ אשר יעשה טוב ולא יחטא, אבל ירפאם ד' מחולי הנפש ע\"י התשובה, ולא יבואו עליהם חולי הגוף להשחיתם ח\"ו, וז\"ש כל המחלה אשר שמתי במצרים לא אשים עליך כי אני ד' רפאיך מחולי הנפש, ולא יגיעו עליך חולי הגוף כלל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 222,
      "char_length": 1082,
      "timestamp": "2025-02-06T19:22:48.208132"
    },
    {
      "id": "beshalach1_p223",
      "text": "ולבאר הפסוקים בפ' המן נקדים מ\"ש האוהחה\"ק עה\"פ ויאמרו איש אל אחיו מן הוא כי לא ידעו מה הוא, ואולי כי בראותם אותו הזמין ד' לפיהם, במקום שיאמרו מה הוא אמרו מן הוא, וזה שמו אשר קבע לו ד' ושם שמו בפי ישראל וכו', ואולי כי מזה נתחכמו בנ\"י וקראו את שמו מן, דכתיב ויקראו בית ישראל שמו מן. שהשכילו בתיבת מן שאינה מן הרגיל בנדבר, ואין זה אלא רוח ד' דיבר ומלתו על לשונם כי זה שמו עכלה\"ק, ובספה\"ק אגרא דכלה כתב שמעתי מפה קדוש כבוד אדמו\"ר הנ\"ל זצוק\"ל שהי' המן דק ובהיר כ\"כ ברוחניות, עד שע\"י אכילתו נזדכך הגוף, והי' ניכר לכ\"א פנימיות חבירו ומחשבתו, והנה איש אשר הי' מכיר את חבירו ביום אתמול בלא הודע פנימיותיו וחשבו לצדיק או בהיפך, וכהיום שאכלו את המן נתוודע לו פנימיותו ולא הכירו, כי נדמה בעיניו לאיש אחר, וזה ויאמרו איש אל אחיו מן הוא, ר\"ל מי הוא זה כי נהפך לאיש אחר עכ\"ל, ובאמת כ\"כ הרמב\"ן ז\"ל כי המן מתולדות אור העליון, ומעת שהשיגו ישראל לזיו השכינה בים, כמ\"ש ראתה שפחה על הים מה שלא ראה יחזקאל הנביא, מאותה שעה נתעלית נפשם להתקיים בתולדותיו שהוא המן עכ\"ד ז\"ל, ובזה מובנים דברי האגרא דכלה מ\"ש בשם רבו זלה\"ה, דמפני שהי' המן מתולדות אור העליון, ע\"כ נזדכך הגוף ע\"י אכילתו והי' ניכר לכ\"א פנימיות חבירו ומחשבתו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 223,
      "char_length": 1094,
      "timestamp": "2025-02-06T19:22:48.755047"
    },
    {
      "id": "beshalach1_p224",
      "text": "ובזה יתבאר דברי המכילתא עה\"פ ויראו בני ישראל ויאמרו איש אל אחיו מן הוא, דורשי רשימות אמרו ישראל קראו את שמו מן, שנאמר הוא הלחם אשר נתן ד' לאכלה, דלפי\"ד האגרא דכלה זלה\"ה יתפרש במשמעות הלשון ויאמרו איש אל אחיו מן הוא, דמלת מן הוא מוסב על אחיו, וא\"כ מניין לנו ילפותא שישראל קראו את הלחם מן, וע\"כ פירשו דורשי רשימות ישראל קראו את שמו מן, והביאו ראי' ממה שהשיב להם משה רבינו על אמרם ויאמרו איש אל אחיו מן הוא וגו' ויאמר משה אלהם הוא הלחם אשר נתן ד' לכם לאכלה, ר\"ל שהשגת הדעת אשר זכו אליה להכיר כ\"א פנימיות חבירו עד שאמרו איש אל אחיו מן הוא, הוא הלחם אשר נתן ד' לכם לאכלה, וזה הגורם, ומזה השכילו בני ישראל לקרוא שם הלחם מן וע\"ד שכתב האוהחה\"ק כי בראותם שהזמין ד' לפיהם תיבת מן שאינה מן הרגיל בנדבר, השכילו שאין זה אלא רוח ד' דיבר על לשונם, וזה שמו אשר קבע לו ד' ושם אותו בפי ישראל",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 224,
      "char_length": 773,
      "timestamp": "2025-02-06T19:22:49.303634"
    },
    {
      "id": "beshalach1_p225",
      "text": "והנה בני ישראל מורה על בני עלי', ובית ישראל על פחותי הערך כמ\"ש ק\"ז הישמח משה זלה\"ה בהפטורת וארא עיי\"ש, ואפשר שירמוז בית ישראל על הנשים ע\"ד שדרשו רז\"ל בית יעקב אלו הנשים, ובזה יתבאר שינוי הלשונות שבפסוקי הפרשה דבני עלי' שבישראל מיד ביום הראשון באכלם מהמן, זכו להזדככות נפלאה והשיגו שרשו בגבהי מרומים וקראו את שמו מן ע\"ש בחינתו הרוממה, וז\"ש ויראו \"בני ישראל\" ויאמרו איש אל אחיו מן הוא וגו', אבל בית ישראל שהם פחותי הערך והנשים לא באו להשגה זו מיד, כי השגת הדעת תליא באיכות בחי' הנפש והכנת המעשים כנודע, והשגת פנימיות התורה לא נמסרה לנשים, וכמו שפי' בספה\"ק בני יששכר עה\"פ כה תאמר לבית יעקב ודרשו רז\"ל אלו הנשים, ותגד לבני ישראל אלו האנשים, כי מלת ותגיד מורה על אמירה דחכמתא, וזהו לבני ישראל דייקא ולא לנשים, אמנם אף שזכו ישראל להזדככות הגוף והנפש ע\"י אכילת המן כנ\"ל, מ\"מ אינו דומה אכילתו בימות החול ליום השבת, דע\"י קדושת השבת זכו על ידו להזדככות בבחי' גבוה יותר, כמבואר בספה\"ק דע\"י סעודות השבת זוכים להשפעת הדעת, וע\"כ אחר שעבר עליהם השבת כמ\"ש וישבתו העם ביום השביעי, חזר לומר ויקראו בית ישראל את שמו מן, שגם בית ישראל הם פחותי הערך והנשים זכו להזדככות נפלאה וקראו את שמו מן ע\"ש בחינתו הרוממה, אמנם עדיין יש מקום לטעות שמה שבית ישראל קראו את שמו מן, הי' ע\"ש המאורע ומפני שאמרו איש אל אחיו מן הוא ע\"כ קראו שם הלחם מן, שכן הי' דרכם לקרות שמות ע\"ש המאורע, וא\"כ אין ראי' שזכו להזדככות ע\"י המן וע\"י השבת, וכדי שלא לטעות בזה ע\"כ אמרו במכילתא כאן דורשי רשימות אמרו בני ישראל קראו את שמו מן, דבני ישראל היינו בני עלי' והם ודאי זכו להזדככות והשגה גדולה וע\"ש כך קראו שמו מן, וכמו\"כ על בחי' זה אמר הכתוב ויקראו בית ישראל את שמו מן, שגם הם נזדככו ע\"י אכילתו וקדושת השבת והשיגו שרשו בגבהי מרומים, וע\"ש כך קראו את שמו מן.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 225,
      "char_length": 1603,
      "timestamp": "2025-02-06T19:22:49.692657"
    },
    {
      "id": "beshalach1_p226",
      "text": "והנה דתן ואבירם במה שהותירו מן המן הי' כל כוונתם ומחשבתם רק לחלוק על משה רבינו ולהרוס חומת הדת והקדושה ולז\"א הכתוב ולא שמעו אל משה ויותירו וגו', שזה הי' תוכן כוונתם לעשות היפך דברי משה רבינו. אמנם בדור דיעה כדור המדבר לא יכלו לגלות רשעתם כי זהו כוונתם, דאלמלי כן לא היו ישראל שומעים להם וכוונתם הי' להמשיך גם את ישראל לרעתם כמו שעשו במחלוקת קרח, ע\"כ הלבישו כל מעשיהם בלבוש של צדקות ובכוונה לש\"ש, ואף כאן במה שהותירו מהמן אולי באו בטענת הסתה לש\"ש, שלחביבות קדושתו מותירים ממנו מיומו לחבירו, ומה גם ע\"ד שכתב האוהחה\"ק כי מצו' זו משה מעצמו דן אותה. להיות שראה כי ד' נותן להם דבר יום ביומו זה יגיד כי אין יום מכין לחבירו והבין דבר מתוך דבר ואסר להם עכ\"ד, ומאחר שלא נאסר מפי הגבורה, ע\"כ מלאו לבם לחלוק בסברא על דעתו של משרע\"ה ואמרו דחביבות מצוה עדיפא, ועד\"ז רצו להמשיך גם אחרים לדעתם, אמנם יראו לנפשותם כי המן בעצמו יגלה מצפוני לבביהם ומחשבתם הרשעה, כמ\"ש בספה\"ק אגרא דכלה שנזדכך הגוף ע\"י אכילתו והי' ניכר לכ\"א פנימיות חבירו ומחשבתו לכן התחכמו ברשעתם והתענו נפשותם ולא אכלו ממנו ביומו, כ\"א הותירו אותו ליום המחרת ואכלוהו שלא כמצותו, ויתכן כי כח סגולה זו שנזדכך הגוף ע\"י אכילתו, לא ניתן כ\"א להנאכל ביומו כמצותו, ולזה התחכמו דתן ואבירם ויותירו מן המן ולא אכלוהו ביומו, כדי להסתיר פנימיות מחשבותיהם ויוכלו להטעות את ישראל לרעתם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 226,
      "char_length": 1218,
      "timestamp": "2025-02-06T19:22:50.504003"
    },
    {
      "id": "beshalach1_p227",
      "text": "ובזה יתורץ מה שדקדק האוהחה\"ק, דלא הי' צ\"ל אלא ויותירו וגו' ואני יודע שלא שמעו אל משה, ויתר הדקדוקים (לעיל קושיא ד') ולדרכינו מאמר ולא שמעו אל משה לא קאי על פעולת ויותירו, אלא ולא שמעו אל משה בכל דבריו, וכל מגמתם הי' רק להסיר את ישראל מאחרי משה, ולטעם זה ויותירו וגו', שזה הי' התחכמות שלא יתגלה מזימתם ע\"י המן, ומה שקורא אותם הכתוב אנשים שהוא תואר בכ\"מ על צדיקים, מפני שהיו מתדמין כן ומראים א\"ע בפני ישראל לצדיקים, וזהו טעם ויותירו אנשים, כדי שישארו בחזקת צדיקים ולא יתגלה פנימותם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 227,
      "char_length": 480,
      "timestamp": "2025-02-06T19:22:51.099177"
    },
    {
      "id": "beshalach1_p228",
      "text": "נחזור לענינינו לבאר קישור הפסוקים שבריש הפרשה ויסב אלקים את העם וגו' וחמשים עלו בנ\"י וגו' ודברי רש\"י ז\"ל (לעיל קושיא א' וב') עפימ\"ד במדרש ילקוט ארבע כיתות נעשו ישראל על הים וכו', אחת אומרת נעשה מלחמה כנגדן וכו' נאמר להם ד' ילחם לכם עכ\"ד המדרש, והנה זה הי' להם לנסיון גדול שעמדו בסכנה גדולה, והיו מזויינים בחרב וחנית וכלי מלחמה, ואעפ\"כ לא עשו שום פעולה בהשתדלות אנושי, כ\"א בטחו בישועתו ית' כאשר נצטוו ע\"י משה מפי הגבורה, ד' ילחם לכם ואתם תחרישון, ואפשר שלטעם זה לקחו ישראל עמהם כלי זיין בצאתם ממצרים, כאמרז\"ל במד\"ר (פרשה כ' סי' י\"ט) וחמשים עלו בנ\"י מאמ\"צ, שעלו מזויינים, ובודאי לא עשו דבר מדעתם, אבל כן הי' רצון הבוי\"ת כדי להגדיל בחי' הנסיון ולהגדיל מעלתם, וע\"ד שכתבו הרמב\"ן והראב\"ע ז\"ל (בפ' וירא) כי ענין הנסיון להראות צדקת המנוסה עיי\"ש, ואלמלי לא הי' בידם כלי זיין לא הי' בחי' הנסיון בשלימות, אמנם לא הי' אפשר לסמוך בזה כ\"א על הכשרים שבישראל ובני עלי', משא\"כ פשוטי העם ופחותי הערך אלמלי מסרו בידם כלי זיין, יש מקום לחשוש שמא לא יעמדו בנסיון וילחמו עם המצריים שלא ברצון הבוי\"ת, ולז\"א וחמשים עלו \"בני ישראל\" מארץ מצרים, היינו בני עלי' שנקראו בני ישראל יצאו מזויינים ולא העם, ומקושר גם עם פי' השני שפרש\"י חמשים מחומשים, א' מחמשה יצאו וד' חלקים מתו בג' ימי אפילה, דמפני שמתו רשעי ישראל ולא יצאו כ\"א הכשרים שנתחזקו באמונתם בהשי\"ת, וקבלו עליהם הנסיון של לכתך אחרי במדבר וגו' ע\"כ יצאו מזויינים להגדיל בחי' הנסיון ולהראות צדקתם, אבל אלמלי יצאו גם הרשעים עמהם שהיו מרובים פי כמה עליהם, הי' חשש קרוב שיתגברו עליהם להכריחם שילחמו במצרים, ולא הי' מקום שיצאו מזויינים כלל, וב' הפירושים הא בהא תליין.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 228,
      "char_length": 1487,
      "timestamp": "2025-02-06T19:22:51.376918"
    },
    {
      "id": "beshalach1_p229",
      "text": "ועד\"ז יתבארו קישור הפסוקים ולא נחם אלקים דרך ארץ פלשתים כי קרוב הוא, ר\"ל לטעם שקרובה עדיין זמן יציאתם מזוהמת מצרים, וע\"כ יש לחוש פן ינחם העם בראותם מלחמה ושבו מצרימה, ר\"ל שימשכו לדעתם ושיטתם והו\"ל כאילו שבו מצרימה דבמקום שמחשבתו של אדם שם הוא קביעותו כמ\"ש הרמב\"ן ז\"ל בענין ערובין, ופן ילחמו באומות שלא ברצון הבוי\"ת ע\"כ ויסב אלקים את העם דרך המדבר וגו' בשביל שתהי' התורה נבללת בגופן כדברי המכילתא, וחמשים עלו \"בני ישראל\" דייקא מארץ מצרים, ולא העם, ויקח משה את עצמות יוסף עמו, היינו קדושת עצמותו שפעל ותיקן במדת היסוד, ובזכות זה נגאלו ישראל ונטהרו מזוהמתם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 229,
      "char_length": 554,
      "timestamp": "2025-02-06T19:22:52.087679"
    },
    {
      "id": "beshalach1_p230",
      "text": "(מכתי\"ק) ברש\"י ז\"ל ויקח משה את עצמות יוסף עמו כי השבע השביע וגו' ולמה לא השביע בניו שישאוהו מיד וכו' יעיי\"ש, וכבר דקדקו קמאי מדוע לא הקשה רש\"י זאת (בפ' ויחי) אצל סיפור השבועה הזאת ועי' בישמח משה ז\"ל מ\"ש ע\"ז ואפשר לומר לפענ\"ד דהנה אחז\"ל בסוטה (דף י\"ג) חכם לב יקח מצות (זה משה) ואויל שפתים ילבט (אלו ישראל) שכל ישראל נתעסקו בביזה ומשה עסק בעצמות יוסף. ובישמח משה פ' בא בפ' וגם ערב רב עלה אתם וגו' כתב יש להפליא כיון שמבואר בתוה\"ק שישראל היו עוסקין אז בביזת מצרים שלא ברצונם, רק ע\"י ציווי הקב\"ה ומשה עבדו כמו שאמרו חכז\"ל, א\"כ אמאי אמרו עליהם חכז\"ל אויל שפתים ילבט שנפנו על כסף וזהב, הלא כתורה עשו וע\"י ההכרח, גם צריך להבין אם חכז\"ל ראו זה לחסרון מה שנפנו אל כסף וזהב א\"כ הי' החסרון במעשה, ולמה דרשו עליהם המקרא דאויל שפתים ילבט דמשמע שהי' החסרון רק בשפתים שלא הוזכר במקרא הזה שום עשי'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 230,
      "char_length": 782,
      "timestamp": "2025-02-06T19:22:52.361815"
    },
    {
      "id": "beshalach1_p231",
      "text": "ואפשר לומר עפ\"י מ\"ש א\"א הגה\"ק זלה\"ה בקדויו\"ט בפ' הנני ממטיר לכם וגו' ויצא העם ולקטו דבר יום ביומו. דתיבת דבר הוא לכאורה מיותר ואין לו הבנה, ופי' הוא ז\"ל דהנה ע\"י אמונה אמיתית אפשר להמשיך הפרנסה בלי שום השתדלות כמבואר בזוה\"ק שטו העם ולקטו דשטות גדול עשו במה שלקטו, כי לבתיהם הי' בא בלי לקיטה, והעיקר הוא לזכות לאמונה אמיתית, ומה שצריך לקיים וברכתיך בכל אשר תעשה יספיק אף במעשה כל דהו, ומצינו בגמ' (ב\"מ דף צ' ע\"ב) דאף עקימת שפתים הוי מעשה, וא\"כ יוצא ידי חובת עשי' אף בדיבור בעלמא, ובלא\"ה מצינו שצריך להתפלל על מזונו והוי גם זה מעשה היינו דיבורי התפלה להמשיך הפרנסה, וז\"ש הנני ממטיר לכם, ר\"ל שאשפיע לכם בלבכם שתדעו שהלחם מן השמים, ואח\"כ כשתדעו באמונת אומן שלחם הוא רק מן השמים, אזי ויצא העם ולקטו \"דבר\" יום ביומו: דבר דייקא שהדיבור בלבד תחשב להם למעשה ולא תצטרכו לעשי' אחרת עכ\"ד הקדושים",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 231,
      "char_length": 783,
      "timestamp": "2025-02-06T19:22:52.787270"
    },
    {
      "id": "beshalach1_p232",
      "text": "והנה באמת לאו כל אדם זוכה לזה שדיבורו יעשה רושם כעשי' ממש, וכבר פירשו בספה\"ק מאמה\"כ לא יחל דברו ככל היוצא מפיו יעשה, שאם לא יחל דברו כפירש\"י ז\"ל לא יעשה דבריו חולין דר\"ל שיהי' דיבורו בקדושה ולא יתחלל בשום ענין, אזי ככל היוצא מפיו יעשה שכל דיבוריו שיצאו מפיו יחשבו לעשי', ומי שמקדש דיבורו באמת ואינו מחללו בשום ענין, בוודאי יוכל להמשיך בתפלתו כל השפעות טובות בלי שום עשי' והשתדלות, ותפלתו אינה חוזרת ריקם לעולם, אמנם מי שאינו במדריגה זו לקדש דיבורו בקדושה גמורה, אין דיבורו פועל כ\"כ וצריך לאיזה עשי' והשתדלות, אבל מ\"מ אין מעצור לה' להושיע ברב או במעט ואף בעשי' כל דהו מקיים וברכתיך בכל אשר תעשה, ואין צריך לבלות ע\"ז כל זמניו ח\"ו והעיקר הוא האמונה והבטחון.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 232,
      "char_length": 654,
      "timestamp": "2025-02-06T19:22:53.241297"
    },
    {
      "id": "beshalach1_p233",
      "text": "ומצינו כשהקב\"ה צוה לישראל במצרים שישאלו כלי כסף וכלי זהב למען הרבות הרכוש, והם עשו כך וישאלו, ואח\"כ כתיב וישאלום, ופירש\"י ז\"ל אף מה שלא היו שואלים מהם היו נותנים להם, אתה אומר אחד טול שנים ולך, והנה כיון שבלא\"ה היו נותנים להם אף מה שלא שאלו, א\"כ למה הוצרך הקב\"ה להזהירם כ\"כ שישאלו מהם, הלא הי' באפשרי שיתנו להם הכל מבלי שאלה כמו שנתנו מעצמם העודף יותר ממה ששאלו, אמנם הם הוצרכו לעשות איזה השתדלות לקיים וברכתיך בכל אשר תעשה, ואח\"כ נפתח להם השפעה להשיג אף מה שלא שאלו, כי אחר שהאדם עושה איזה עשי' כל דהו, הקב\"ה בעזרו ומשפיע לו אף מה שלא נכלל כלל בעשי' שלו, ואין מעצור לה' להושיע ברב או במעט, אבל מרע\"ה שהי' כל דיבורו בקדושה לא הוצרך לשום עשי' והשתדלות, כי פעל הכל בדיבורו כמאמה\"כ ולקטו דבר יום ביומו וגו' ולכן אף שגם עליו חלה חובת המצוה לקיים ואח\"כ יצאו ברכוש גדול, מ\"מ לא הוצרך להשתדל בזה כלל, כי הי' בכוחו להשיג רכוש גדול בדיבורו בעלמא, ואך ישראל שלא היו במצרים במדריגה זו לפעול הכל בדיבורם, הוצרכו לעשי' והשתדלות.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 233,
      "char_length": 915,
      "timestamp": "2025-02-06T19:22:53.551940"
    },
    {
      "id": "beshalach1_p234",
      "text": "ובזה יובן מה שדרשו חכז\"ל ע\"ז אויל שפתים ילבט מה שנפנו אל כסף וזהב, אף שהי' באמת בציווי הקב\"ה לאסוף הרכוש אבל אלמלי הי' דיבורם מקודש בקדושה גמורה הי' בכחם לאסוף הרכוש בדיבור בעלמא כמו מרע\"ה, ולא היו מצטרכים להצטוות על עשי' והשתדלות, ואפשר שלכן קראו למרע\"ה בזה חכם לב, כי עיקר קדושת הדיבור צ\"ל מקושר אל הלב וכל דיבוריו יבואו מעומק פנימית הלב והבן.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 234,
      "char_length": 345,
      "timestamp": "2025-02-06T19:22:53.980274"
    },
    {
      "id": "beshalach1_p235",
      "text": "והנה יוסף הצדיק השפיע לכל העולם בקדושתו, וכנודע מספה\"ק שממדת יסוד שהוא קדושת יוסף בא כל שפע הפרנסה, וכמאמה\"כ משם רועה אבן ישראל, ולכן בימי הרעב זכה יוסף להיות המשביר לכל עם הארץ, ולזה הראה להם כי פי המדבר אליכם בלה\"ק, ר\"ל שלא עשה דבריו חולין כפירש\"י ז\"ל על לא יחל דברו, וכתב רש\"י ז\"ל שם הראה להם שהוא מהול, כי ברית הלשון וברית המעור מכוונים, והפוגם בבריתו משוך בערלתו, וקדושת היסוד וקדושת הפה כחדא אזלין, ולזה הי' בכחו להשפיע לכל באי עולם אף בלי השתדלות הטבעי, כי בדיבורו הקדוש הי' בכחו לפעול הכל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 235,
      "char_length": 497,
      "timestamp": "2025-02-06T19:22:54.168922"
    },
    {
      "id": "beshalach1_p236",
      "text": "ומעתה אפשר לומר שלכן לא צוה יוסף שישאוהו מיד ממצרים, שכמו שהוצרך להקדים לבוא לפניהם למצרים, בשביל שיהי' צינור המשפיע בימי הרעב נגד הטבע, כמשה\"כ וישלחנו אלקים לפניכם לשום לכם שארית בארץ, כמו כן גם בעת היציאה ממצרים שהוצרכו לרכוש גדול ולהשפעה מרובה, הוצרך גם יוסף הצדיק להיות שם שיומשך להם על ידו כח קדושה זו להמשיך צינור ההשפעה, אמנם כאשר נראה שהוצרכו להשתדלות עבור הרכוש, זה הי' לאות כי לא דבקו בקדושה זו שאמר יוסף כי פי המדבר אליכם בלה\"ק שלא עשה דבריו חולין כלל, כי אלו הי' כן הי' בכחם לפעול הכל בדיבור בלי שום השתדלות, ואך במשה מצינו ויקח משה את עצמות יוסף עמו שהשתדל רק בעצמות יוסף ולא הוצרך להשתדל בכסף וזהב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 236,
      "char_length": 612,
      "timestamp": "2025-02-06T19:22:54.430347"
    },
    {
      "id": "beshalach1_p237",
      "text": "ואפשר לפרש ויקח משה את עצמות יוסף עמו ר\"ל עצמותו של יוסף וכח קדושתו לקח עמו ולעצמו, שיהי' לו כח השפעה אף חוץ לדרך הטבע, אמנם עבור מרע\"ה א\"א לומר שהוצרך יוסף להשאר בשם שיהי' בכחו להשיג קדושה זו ע\"י יוסף, כאשר כתב בשו\"ת השיב משה (באו\"ח סי' ב') שזה וודאי שכל מה שמצינו באחד מבני עלי' וודאי דמשה כללא דכולהו, וא\"כ א\"א לומר במרע\"ה שהוצרך לסיוע מזולתו להשיג איזה קדושה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 237,
      "char_length": 363,
      "timestamp": "2025-02-06T19:22:54.722886"
    },
    {
      "id": "beshalach1_p238",
      "text": "ובזה אפשר לפרש דברי רש\"י ז\"ל שאצל סיפור השבועה לא קשיא לי' למה לא השביע בניו שישאוהו מיד, שאז הי' אפשר לתרץ אולי הוצרך להיות בשם שלבסוף יזכו ישראל על ידו להשפיע בכח הדיבור חוץ לדרך הטבע, אבל כאשר אמר הכתוב ויקח משה את עצמות יוסף עמו, שמבואר שאך משה לקח עמו עצמותו של יוסף הצדיק ע\"ה, ועבורו לא הוצרך להיות בשם, כי בכחו לבוא למדריגה זו בלי שום סיוע כנ\"ל, ולזה הקשה למה לא השביען שישאוהו מיד והבן, (ע\"כ מכתי\"ק).",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 238,
      "char_length": 408,
      "timestamp": "2025-02-06T19:22:54.914055"
    },
    {
      "id": "beshalach1_p239",
      "text": "ויקח משה את עצמות יוסף עמו כי השבע השביע את בנ\"י לאמר פקוד יפקוד וגו', פירש\"י בשם המכילתא השביעם שישביעו לבניהם, ולמה לא השביע בניו שישאוהו לארץ כנען מיד כמו שהשביע יעקב, אמר יוסף אני שליט הייתי במצרים וכו', אבל בני לא יניחום מצרים לעשות וכו' עכ\"ל, והקושיא מפורסמת מדוע לא הקשה רש\"י זאת בפ' ויחי אצל סיפור השבועה הזאת, וכן הקשה ק\"ז הישמח משה זלה\"ה עיי\"ש תירוצו.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 239,
      "char_length": 361,
      "timestamp": "2025-02-06T19:22:55.166336"
    },
    {
      "id": "beshalach1_p240",
      "text": "ב) בגמרא סוטה (י\"ג ע\"א) בא וראה כמה חביבות מצות על משה רבינו, שכל ישראל נתעסקו בביזה והוא נתעסק במצות שנאמר חכם לב יקח מצות ובמכילתא הגירסא בא וראה חכמתו של משה וכו', וכבר דקדקו קמאי מה שתיארוהו חז\"ל במעשה זו בתואר חכם, ויותר יאות אליו תואר צדיק (עיין בח\"א מהרש\"א מ\"ש בזה), גם מ\"ש יקח מצות בלשון רבים, ואין זה אלא מצוה א'.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 240,
      "char_length": 322,
      "timestamp": "2025-02-06T19:22:55.368823"
    },
    {
      "id": "beshalach1_p241",
      "text": "ויתבאר בהקדם מה שפירשתי בטעם שהוצרך משרע\"ה לשאול בדבר ה' בפרשת טמאים דכתיב (בפ' בהעלותך) ויאמר אליהם משה עמדו ואשמעה מה יצוה ה' לכם, ובפ' פנחס בענין בנות צלפחד כתיב ויקרב משה את משפטן לפני ה', ורז\"ל דרשו ראוי' היתה פרשה זו להאמר ע\"י משה כשאר כל התורה כולה, אלא שזכו אלו שתאמר על ידיהן וכו' (הביאו רש\"י ז\"ל), מ\"מ טעמא בעי מדוע נשתנו ב' מצות אלו מכל מצות התורה שהוצרך משרע\"ה להימלך בגבורה, והרי כל חלקי התורה נגלו לפניו וקבלם מסיני, ופירשתי עפי\"ד ק\"ז הישמח משה זלה\"ה (בפ' שמיני) דנמצא בדברי רז\"ל סתירות הרבה בהך הלכתא אי קברי צדיקים מטמאים או לאו, והוא ז\"ל הכריע דמעצם הדין ראוי להיות שצדיקים לא יטמאו, כי אין טומאה להם ובמיתתן נקראו חיים אך לא ניתנה לנו להתנהג בדין זה, כי הכרעה זו אין דעתינו דעת האנושי מקפת אותה, כי אני ה' חוקר לב ובוחן כליות כתיב, והאדם יראה לעינים, ולכך אין לנו להתנהג בזה כלל, אף אם נודע לנו שהוא צדיק, כדי שלא לחלק בין צדיק לצדיק דאין כח המבחין בידינו וכו' כנ\"ל ברור ואמת בס\"ד עכ\"ל.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 241,
      "char_length": 904,
      "timestamp": "2025-02-06T19:22:55.560281"
    },
    {
      "id": "beshalach1_p242",
      "text": "ובזה יתבאר לענינינו דהנה איתא בגמרא (סוכה כ\"ה ע\"א) ויהי אנשים אשר היו טמאים לנפש אדם, מי היו נושאי ארונו של יוסף היו, נמצא דאם צדיקים אינם מטמאים, היו ראויים אלו להקריב הפסח במועדו ככל ישראל, ולזה באו בטענה לפני משה ואהרן אנחנו טמאים לנפש אדם, היינו לנפש צדיק למה נגרע לבלתי הקריב את קרבן ה' במועדו בתוך בנ\"י, והשיב להם משרע\"ה עמדו ואשמעה מה יצוה ה' לכם, להורות כי לא ניתן הכרעה זו ביד בי\"ד של מטה, ואף אם נודע לנו בבירור שהוא צדיק מטעם שלא לחלק בין צדיק לצדיק דאין כח המבחין בידינו כנ\"ל, ובזה א\"ש שבתשובתו של הקב\"ה למשרע\"ה לא נתפרש על פרט הנשאל אם יקריבו הם הפסח במועדו או לאו, רק הודיעו ההלכה בסתם טמאים דעלמא, איש איש כי יהי' טמא לנפש וגו' והטעם כי לא נתנה לנו להתנהג בדין זה כנ\"ל, וטמאים דעלמא נדחו לפסח שני והבן. ועד\"ז יתבאר בענין בנות צלפחד, דאיתא בספרי לאלה תחלק הארץ צדיקים כמותכם, ואמרז\"ל (שבת צ\"ו ע\"ב) מקושש זה צלפחד ולפי\"ז מה מקום לטענתם ליטול חלק בארץ, אמנם כתבו התוס' במס' ב\"ב בשם המדרש דמקושש לש\"ש נתכוין עיי\"ש, ועד\"ז הי' טענתם דצדיק גמור הי', וע\"כ ויקרב משה את משפטן לפני ה' דלא ניתן לבי\"ד של מטה להכריע בזה דרק הבוי\"ת חוקר לב ובוחן כליות לידע מחשבה שבלב והבן. (עיין בדברינו במקומו תקחנו משם).",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 242,
      "char_length": 1108,
      "timestamp": "2025-02-06T19:22:56.028870"
    },
    {
      "id": "beshalach1_p243",
      "text": "ונקדים עוד מ\"ש האוהחה\"ק (פ' חקת) שלא מצינו שהקפיד ה' בפסח מצרים על דין הטומאה, שיהיו טמאי מתים נדחין מלעשות הפסח, וטעם הדבר כי ישראל לא היו טמאי מת, הגם שנגעו והאהילו על המת, אבל לפי שעדיין לא קבלו את התורה, דנו בהם דין גר שנתגייר ביום י\"ד ששוחטין עליו ואין חוששין לטומאה שנטמא קודם שנתגייר, ופי' בזה מאמה\"כ זאת חקת התורה וגו', פי' חקה זו של הטומאה ותנאי טהרתה תסובב מהתורה, כי ע\"י שקבלו התורה נעשו עם בני ישראל דבר שהרוחנים השפלים תאבים להדבק בהם וכו' ובמותם ג\"כ תתרבה הטומאה כאמרם ז\"ל ישראל מטמאין באהל ואין אומות מטמאין באוהל וכו' ואשר יסובב הכל הוא התורה עייש\"ד, ועפי\"ז פירשתי דברי המכילתא בפרשת קרבן פסח, וילכו ויעשו בנ\"י כאשר צוה ה' את משה ואהרן כן עשו, מה ת\"ל כן עשו, אף משה ואהרן כן עשו עכ\"ד המכילתא (והובא ברש\"י ז\"ל) וצ\"ב מה צורך להשמיענו שאף משה ואהרן קיימו מצות הפסח ככל ישראל, ולדרכינו נאמר כי הנה בנ\"י לא נזהרו מטומאת מת בפסח מצרים, שערם קבלתם התורה לא הי' נוהג לגבייהו דין טומאת מת כדברי האוהחה\"ק הנ\"ל, אמנם משה ואהרן שקיימו את התורה בעודם במצרים איך הקריבו קרבן פסח, ואפשר מפני דישראל קודם קבלת התורה לא הי' נוהג לגבייהו דין טומאה כלל, וכמו שלא נטמאו במת כך אינם מטמאין אחרים הנוגעים בהם, ולדברי הסובר דעכו\"ם מטמא במשא ורק מטומאת אהל נתמעטו אפשר דנזהרו משה ואהרן ממשא וא\"ש שהקריבו קרבן פסח. (עיין בדברינו פ' וישלח עמוד קנ\"ו עוד בענין זה) אמנם הרי מפורש בפסוק שנשא משה עצמות יוסף עמו, ויוסף הצדיק וודאי הי' לו דין ישראל לחומרא, ואיך הקריב קרבן פסח, אכן כבר ביררנו לעיל דצדיקים אין להם טומאה ובמיתתם נקראו חיים, וא\"ש דהוצרך להשמיענו דאף משה ואהרן כן עשו והקריבו את הפסח, ולא נמנעו מדין הטומאה שנהג בהם, ואפשר שלטעם זה לא נכתב בפירוש שאף משה הקריב הפסח, דדין זה שאין צדיקים מטמאים לא ניתן לקבוע הלכה בפירוש, דאין כח המבחין בידינו כמ\"ש ק\"ז הישמח משה זלה\"ה, וע\"כ נכתב רק ברמז במאמר כן עשו, דלפי פשוטו קאי על בני ישראל, אלא שהכריחו רז\"ל מיתורא דקרא, שנרמז בו שאף משה ואהרן קיימו מצות הפסח, ולא נמנעו לצד דין הטומאה שנוהגת אצלם.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 243,
      "char_length": 1836,
      "timestamp": "2025-02-06T19:22:56.594415"
    },
    {
      "id": "beshalach1_p244",
      "text": "ובזה יתבארו דברי המכילתא בא וראה חכמתו של משה שכל ישראל נתעסקו בביזה והוא נתעסק במצות שנאמר חכם לב יקח מצות, ולכאורה מדוע יחסוהו אל חכמתו ומה ענין החכמה בזה, ויותר יאות ליחסהו אל צדקותו וחסידותו, גם מ\"ש מצות בלשון רבים צ\"ב ואינו כ\"א מצוה אחת, אמנם הי' לו לחוש שע\"י העסק בעצמות יוסף ימנע ממנו הקרבת הפסח, ואולי גם השראת השכינה שהי' תדירה אצלו, אלא שחכמתו עמדה לו והשיג שהעסק בעצמות יוסף לא ימנעהו מן המצות, וזה וזה יתקיימו בידו, והכרעה זו אין דעת אנושי מקפת אותה, אבל משרע\"ה נתעלה בחכמת אלקית מבחי' חכמה עליונה, והכריע כן בחכמתו שעי\"ז ישיג מצות הרבה, וז\"ש בא וראה חכמתו של משה וכו' שנא' חכם לב יקח מצות והבן.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 244,
      "char_length": 607,
      "timestamp": "2025-02-06T19:22:57.518177"
    },
    {
      "id": "beshalach1_p245",
      "text": "ואפ\"ל עוד דהנה ישראל נתעסקו בביזה עפ\"י מצות השם עליהם, ובוודאי שלא יצוה ה' ליקח ממון של אחרים שלא מן הדין, והרבה תירוצים נאמרו בזה, והאמת שכל רכוש מצרים מגיע לישראל מדינא שזכו בהם מיוסף הצדיק, כדאיתא במדרש ילקוט (פ' ויגש רמז קנ\"ח) וילקט יוסף את כל הכסף וגו' א\"ר יהודה אמר שמואל כל כסף וזהב שבעולם לקט יוסף והביא למצרים, שנאמר וילקט יוסף את כל הכסף, אין לו אלא בארץ מצרים, שבארץ כנען ובשאר ארצות מנין, תלמוד לומר וכל הארץ באו מצרימה, וכשעלו ישראל ממצרים העלוהו עמהם שנאמר וינצלו את מצרים עכ\"ד המדרש, מבואר דעפ\"י הדין ה\"ה של ישראל שיוסף הצדיק זכה בהם בשבילם, אלא שאחר הסתלקותו נטלוהו המצרים שלא בדין, וכשיצאו ישראל הצילו מידם את שלהם, וע\"כ בעת שכל ישראל נתעסקו בביזה נתעסק משה רבינו בעצמות יוסף להראות שהוא הזוכה ומזכה לישראל בביזה ושלהם נטלו, וז\"ש במכילתא בא וראה חכמתו של משה שכל ישראל נתעסקו בביזה והוא נתעסק במצות וא\"ש הקישור.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 245,
      "char_length": 828,
      "timestamp": "2025-02-06T19:22:57.843327"
    },
    {
      "id": "beshalach1_p246",
      "text": "ונבוא לתרץ קושית המפורשים על מ\"ש רש\"י ז\"ל בשם המכילתא למה לא השביע יוסף את בניו שישאוהו לא\"י מיד כמו שהשביע יעקב וכו', ולכאורה הול\"ל קושיא זאת לעיל בפ' ויחי אצל סיפור השבועה זאת, (עיין קושיא א' לעיל), ויתבאר בהקדם דברי הזוה\"ק פ' תרומה (דף קמ\"א ע\"ב) גופיהון דצדיקיא דלא מתענגי בהאי עלמא אלא מתענוגי דמצוה וכו' ההוא רוח מסאבא לא יכיל לשלטאה עלייהו, דהא לא אתענגו מדילי' כלום וכו', מאן דנשמתיה נפקא לבר מארעא קדישא, והאי גופא אסתאב בההוא רוח מסאבו וכו', ואי האי גופא סלקין לי' לאתקברא גו ארעא קדישא, עלי' כתיב (ירמיה ב') ותבואו ותטמאו את ארצי ונחלתי שמתם לתועבה וכו' יוסף לא שליט על גופי' רוח מסאבו לעלמין וכו', ועם כל דא לא בעא דגופי' יסלקון לי' לאתקברא בארעא קדישא, אלא אמר והעליתם את עצמותי ולא גופי', יעקב לא מית וגופי' אתקיים בקיומא תדיר ולא דחיל לסט\"א וכו', ועל דא כתיב ושכבתי עם אבותי ונשאתני ממצרים גופא שלים עכ\"ד הזוה\"ק לענינינו, הרי מבואר הטעם שלא השביע יוסף לבניו שישאוהו לא\"י מיד, שלא יהי' בכלל ונחלתי שמתם לתועבה, ואף דלפי מדריגת קדושתו לא שייך לגבי', דלא שליט בי' רוח מסאבא כלל, מ\"מ לרוב ענותנותו חשש ונמנע להעלות גופו לטעם זה, ואפשר דע\"כ לא הקשו במכילתא התם למה לא השביע יוסף את בניו שישאוהו לא\"י מיד, דניחא להו בתירוץ הזוה\"ק הנ\"ל, אמנם בפסוק זה דכתיב ויקח משה את עצמות יוסף עמו עמו במחיצתו, מבואר מזה דאין בו דין טומאה כלל, דצדיקים אינם מטמאים אף במותם, ומעתה לא יונח עוד בטעמו של הזוה\"ק, ע\"כ הוקשה להם מ\"ט לא השביע לבניו שישאוהו לא\"י מיד, ותירצו כי חשש שמא לא יניחום המצרים ולא יוכלו לקיים שבועתו, ואפשר שמקושר טעם זה עם טעם הזוה\"ק, דלצד שחשד א\"ע שאינו ראוי לכך, ע\"כ חש שמא לא יסתייע מילתא ויעכבו המצריים בידם, ולטעם זה השביעם לשיגאלו ויצאו ממצרים יעלו את עצמותיו, (ועיין בדברינו פ' ויחי עמוד תקי\"ז מ\"ש בזה).",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 246,
      "char_length": 1622,
      "timestamp": "2025-02-06T19:22:58.258344"
    },
    {
      "id": "beshalach1_p247",
      "text": "ויקח משה את עצמות יוסף עמו, במס' סוטה (י\"ג ע\"א) בא וראה כמה חביבות מצות על משה רבינו, שכל ישראל נתעסקו בביזה והוא נתעסק במצות שנא' חכם לב יקח מצות וגו' ומנין היה יודע משה רבינו היכן יוסף קבור, אמרו סרח בת אשר נשתיירה מאותו הדור, הלך משה אצלה א\"ל כלום את יודעת היכן יוסף קבור, אמרה לו ארון של מתכת עשו לו המצרים וקבעוהו בנילוס וכו', וכתב המהרש\"א ז\"ל דגם שאר ארונות של השבטים העלו עמהם וכו', אבל היו יודעין קבורתם, משא\"כ ביוסף שהעלימו המצרים קבורתו וכו', ולהכי קבעי מנין הי' יודע משה היכן יוסף קבור, דאינו דומה שידע זה בנבואה כיון שלא הוזכר בקרא, אבל ידע ע\"י סרח בת אשר שהוא היתה מאותו הדור עכ\"ל המהרש\"א ז\"ל, לכאורה תירוצו אינו מספיק דאינו מן הנמנע שהשיג משרע\"ה בנבואה מקום קבורתו של יוסף ואף שלא הוזכר בקרא, וכמו שהשיג הרבה דברים נעלמים שאינם מפורשים בפסוקי התורה, ומאי קא קשיא לי' לגמ' מנין היה משה רבינו יודע וכו', גם צ\"ב הקישור אל מה שדרשו חכם לב יקח מצות וגו' ומנין הי' יודע משה רבינו וכו', ומדוע ל\"ק להו בל\"ז, וכן דקדק ק\"ז הישמח משה זלל\"ה (בפ' בשלח).",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 247,
      "char_length": 954,
      "timestamp": "2025-02-06T19:22:59.054953"
    },
    {
      "id": "beshalach1_p248",
      "text": "ב) עוד הקשה ק\"ז זלה\"ה דמשמע דדרשו חז\"ל רישא דקרא חכם לב יקח מצות, בשבח משרע\"ה שהיתה המצוה חביבה עליו, וסיפא דקרא ואויל שפתים ילבט על ישראל שנתעסקו בביזה (עיין בח\"א מהרש\"א שם) ולכאורה יש להפליא דהרי עסקו בביזה שלא ברצונם, כ\"א נצטוו על זה מפי הגבורה וקיימו בזה מצות הבוי\"ת, ומה דשבקו העסק בעצמות יוסף למשרע\"ה, מבואר שם בגמ' דכוונתם לש\"ש היתה ואמרו כבודו בגדולים יותר מבקטנים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 248,
      "char_length": 373,
      "timestamp": "2025-02-06T19:22:59.535670"
    },
    {
      "id": "beshalach1_p249",
      "text": "ג) עוד יל\"ד דדרשו חכם לב יקח מצות על משרע\"ה שנתעסק בעצמות יוסף, ואין זו אלא מצוה א', ומה דדרשו אויל שפתים ילבט על ישראל שעסקו בביזה צ\"ב דאין ענין זה לשפתים.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 249,
      "char_length": 156,
      "timestamp": "2025-02-06T19:22:59.735478"
    },
    {
      "id": "beshalach1_p250",
      "text": "ויתבאר הענין בהקדם דברי המדרש (ילקוט סו\"פ ברכה רמז תתקס\"ה) ויקבור אותו בגי, במה זכה משה שהקב\"ה נתעסק בו, אלא בשעה שהיו ישראל עסוקין בביזה, הי' מסבב את העיר ג' ימים וג' לילות למצוא ארונו של יוסף ולא מצאו, אחר שנתיגע הרבה פגעה בו סרח בת אשר, אמרה לו רבינו משה למה אתה יגע כל כך אמר לה ג' ימים וג' לילות סבבתי את העיר לבקש ארונו של יוסף ואיני מוצאו, אמרה לו בוא עמי הוליכו לנהר נילוס וכו', א\"ל הקב\"ה אם בעיניך דבר קטן שעשית חסד, גדול הוא בעיני שלא השגחת בכסף וזהב, ואף אני ארד בכבודי ובעצמי לעשות עמך חסד כשתפטר מן העולם עכ\"ד המדרש ולכאורה צ\"ב דהרי הג' ימים וג' לילות שהי' משרע\"ה מסבב את העיר למצוא ארונו של יוסף, היו בהכרח ג' ימים סמוך ליציאתם, ויתכן שהי' בג' ימי אפילה, דלפי חשבון הרמב\"ן ז\"ל (בר\"פ בא) נמשכו ימי האפילה עד ערב פסח עיי\"ש, וישראל עסקו בהשאלת כליהם של מצרים רק אחר מכת בכורות, כמבואר בפסוקים ותחזק מצרים על העם למהר לשלחם וגו' ובנ\"י עשו כדבר משה וישאלו ממצרים וגו', ולפי\"ז לא היו בזמן א' וביום א', וצ\"ב לשון הילקוט הנ\"ל בשעה שהיו ישראל עסוקין בביזה, הי' משרע\"ה מסבב את העיר ג' ימים וג' לילות, גם דברי הגמ' דסוטה הנ\"ל צ\"ב, במ\"ש שכל ישראל נתעסקו בביזה והוא נתעסק בעצמות יוסף, והרי זמנו של זה לא כזמנו של זה. ואיך דרשוהו רז\"ל בשבח משה שלא השגיח בכסף וזהב וכו' ובגנותן של ישראל דשבקו העסק בעצמות יוסף ועסקו בביזה ולא קרב זל\"ז בזמן וצ\"ב.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 250,
      "char_length": 1244,
      "timestamp": "2025-02-06T19:22:59.848411"
    },
    {
      "id": "beshalach1_p251",
      "text": "ונל\"פ דמה שעסקו ישראל בהשאלת כלי המצריים אחר מכת בכורות, יפה עשו וכדין עשו וקיימו מצות הבוי\"ת, אבל בג' ימי האפילה שנתעסקו ישראל לחפש בתי המצרים, ובאותו זמן נתייגע משה רבינו למצוא ארונו של יוסף, לזה דרשוהו רז\"ל בשבח משה וגנותן של ישראל, דאף שהי' רצון הבוי\"ת שיראו ישראל כליהם כמבואר במד\"ר דזו א' מהטעמים שהביא הקב\"ה חשך על המצריים, אולם להשלים רצון הבוי\"ת הי' מספיק בראי' בעלמא ובזמן קצר, ונחשב לחסרון מה שהרבו ההתעסקות בו, כדמשמע מדברי הילקוט הנ\"ל שג' ימים וג' לילות שהיה משרע\"ה מסבב את העיר לחפש ארונו של יוסף, היו ישראל עסוקין בביזה, ולזה דרשו רז\"ל ואויל שפתים ילבט על ישראל, דעצם לקיחת הביזה מצוה הוא, והחסרון הי' מה שהרבו דבר שפתים בענין הביזה, ולא בעסק עצמות יוסף, והגם דלישא ארונו של יוסף כבודו יותר בגדולים ומה\"ט הניחוהו למשרע\"ה, אבל מה שנתייגע משרע\"ה ג' ימים וג' לילות למצוא ארונו של יוסף, הי\"ל לישראל להצטרף עמו ולהתעסק במצוה זו והם היו עסוקים בביזה.",
      "source_file": "Beshalach1.txt",
      "chumash": "שמות",
      "parsha": "beshalach1",
      "paragraph_index": 251,
      "char_length": 859,
      "timestamp": "2025-02-06T19:23:00.488948"
    }
  ],
  "shape": [
    252,
    768
  ],
  "created_at": "2025-02-06T19:23:00.899349"
}