{
  "paragraphs": [
    {
      "id": "vayakhel_p0",
      "text": "עוד קשה לדברי הרמב\"ן שאם אלה הדברים אשר צוה ה' קאי על מלאכת המשכן, מדוע חזר הכתוב לומר להלן בציווי נדבת המשכן זה הדבר אשר צוה ה' וגו'.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 0,
      "char_length": 134,
      "timestamp": "2025-02-06T19:14:11.337623"
    },
    {
      "id": "vayakhel_p1",
      "text": "ג) הש\"ך עה\"ת מבאר מאה\"כ אלה הדברים אשר צוה ה' לעשות אותם. עפ\"י מה דאיתא בילקוט וז\"ל רבותינו בעלי אגדה אמרו מתחלת התורה עד סופה און בה פרשה שנאמר בה ויקהל בראשה אלא זאת אמר הקב\"ה למשה עשה לך קהלות גדולות ודרוש לפניהם ברבים הלכות שבת כדי שילמדו ממך דורות הבאים להקהיל קהלות בכל שבת ושבת ולהכנס בבתי מדרשות ללמד ולהורות לבני ישראל ד\"ת איסור והיתר כדי שיהי' שמי הגדול מתקלס בין בני וכו' ע\"כ. ולפי זה יתפרש מאמר אלה הדברים על הקהלת העדה והדרשה, אשר צוה ה' לעשות אותם לדורות הבאים. וכן פירש האוה\"ח הקדוש. אמנם גם לדבריהם קשה למה צוה הכתוב על הקהלת העדה בשבת בפרשה זו, שנאמרה בה אזהרת שבת רק בדרך אגב, כדי ללמד שאין מלאכת המשכן דוחה שבת, ולא השמיענו זאת בפרשה שנאמרה בה עיקר מצות שבת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 1,
      "char_length": 677,
      "timestamp": "2025-02-06T19:14:11.436855"
    },
    {
      "id": "vayakhel_p2",
      "text": "ד) רש\"י ז\"ל פירש ויקהל משה לשון הפעיל שאינו אוסף אנשים בידים אלא הן נאספים על פי דיבורו. הקשו המפרשים למה הוצרך להודיע שלא אסף משה את ישראל בידיו, פשיטא היא דבכל עת שהוצרך להקהיל את העדה נאספו אליו על פי דבורו, ולא הוצרך לאספם בידים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 2,
      "char_length": 233,
      "timestamp": "2025-02-06T19:14:11.760352"
    },
    {
      "id": "vayakhel_p3",
      "text": "ה) בזוה\"ק (ח\"ב דף קצ\"ה ע\"א) איתא דבפרשת תרומה כתיב מאת שכל איש אשר ידבנו לבו לכלול הערב רב במצות הנתינה לבתר וכו' אתו ע\"ר ועבדו ית עגלא וכו' אמר קב\"ה מכאן ולהלאה עובדא דמשכנא לא יהא אצא מסטרא דישראל בלחודייהו מיד ויקהל משה את כל עדת בני ישראל וגו' וכתיב בתריה קחו מאתכם תרומה לה' מאתכם ודאי ולא כקדמייתא דכתיב מאת כל איש אשר ידבנו לבו. ויקהל משה מאן אתר כניש לון אלא בגין דהוו אינון ערב רב בינייהו אצטריך משה לאכנשא לון וליחדא לון מבינייהו. עכ\"ל הזה\"ק. ולפי דבריו יש להקשות שאם כוונת הכתוב באמרו ויקהל משה להשמיענו שהבדילן והפרישן מן הע\"ר, היה ראוי שיאמר הכתוב חויפרד\" משה, ומדוע כתיב ויקהל משה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 3,
      "char_length": 595,
      "timestamp": "2025-02-06T19:14:11.910395"
    },
    {
      "id": "vayakhel_p4",
      "text": "ולעניננו נראה לומר כי הנה כאשר נצטוו בני ישראל לתת נדבה לבנין המשכן, נכספו והשתוקקו גם הערב רב אשר עלו אתם לתת חלקם בנדבה, ומסתמא היו כל הערב רב מאוחדים בחבורה אחת, והיה להם כח השפעה גדול, שהרי היו רבים במספר מבני ישראל כמה פעמים. ולכן כאשר נאמר לבני ישראל קחו מאתכם תרומה לה', ולא מן הערב רב, הוצרכו ישראל לעשות כל טצדקי, כדי להשמר מן הערב רב שלא יהי' להם חלק בנדבת המשכן, ולתכלית זה היתה נחוצה התחברות בין בני ישראל הכשרים, כי אף שיתכן לישראל לעסוק בתורה ובמצות גם כשאין אחדות ביניהם, אך כדי שיוכלו לעמוד איתן נגד השפעת הערב רב ולהתרחק מהם בתכלית הריחוק, לא סגי במה שישמור כ\"א תורה ומצוות לעצמו, כו יחיד בטל במיעוטו נגד הרבים המאוחדים, ועל כן הוצרכו ישראל להתקהל ולהתאחד, כדי לשמור על הפירוד המוחלט בינם לבין הערב רב.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 4,
      "char_length": 719,
      "timestamp": "2025-02-06T19:14:12.211067"
    },
    {
      "id": "vayakhel_p5",
      "text": "והשתא א\"ש מה שאמר הכתוב ויקהל משה ועי' קושיא ד), כו בהקהלה זו שהקהול משה את ישראל הכשרים, יצאה לפועל ההפרדה הגמורה ביינו לבין הערב רב, ומבלעדי ההקהלה וההתחברות בין הכשרים אי אפשר לשמור על פירוד והתבדלות מן הע\"ר וזה שכתב הזה\"ק מאן אתר כניש לון כלומר מה צורך היה בהקהלה זו ע\"ז אמר כו תכליתה הפרדה מן הע\"ר שעשו את העגל. ודברים אלו הם גם הוראה לדורות האחרונים, כמרומז במדרש ילקוט הנ\"ל כדי שילמדו ממך דורות הבאים להקהיל קהלות וכו'. כי בעוה\"ר נשארו עדיין מתי מעט יהודים כשרים, ותדיר מתמעטים והולכים, וכתות הערב רב חזקות מאד, והמה מאוחדום בהרבה ארגאנזואצועס, ע\"כ חייבים יהודים מעטים אלו להתחבר ולהתחזק ובכח מאוחד יהיה כמה מועט שיהי' יעמדו כחומה בצורה נגד הערב רב.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 5,
      "char_length": 656,
      "timestamp": "2025-02-06T19:14:12.601156"
    },
    {
      "id": "vayakhel_p6",
      "text": "ועוד מילין בפי לבאר דברי הזה\"ק הנ\"ל באופן אחר, בהקדם דברי החתם סופר זלה\"ה (פ' תצוה בדרושים למגלת אסתר) עה\"פ (אסתר י) דורש טוב לעמו ודובר שלום לכל זרעו. שתמה תמיהה גדולה מדוע שכיח פירוד הלבבות בקרב ישראל הרבה יותר מאשר בקרב האומות, ובת\"ח צדיקים יותר מבשאר עמו דארעא, והלא ישראל מתיחסים כאוהבי שלום ות\"ח מרבים שלום בעולם. עיי\"ש מה שהאריך ליישב. ועדיין אינו מסיק בדבריו יסוד מוצק להבין ענין זה לאשורו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 6,
      "char_length": 398,
      "timestamp": "2025-02-06T19:14:12.938582"
    },
    {
      "id": "vayakhel_p7",
      "text": "ואני אמרתי בפשטות כמה טעמים בדבר. חדא שהרי אמרו במשנה (סנהדרין דף ע\"א ע\"א) פיזור לרשעים הנאה להם והנאה לעולם ולצדיקים רע להם ורע לעולם כנוס לרשעים רע להם ורע לעולם ולצדיקים הנאה להם והנאה לעולם, ע\"כ. ולפי זה דבר פשוט הוא אשר הס\"מ שאומנותו להסית לרע, מתאמץ בכל כוחו למנוע כינוס והתחברות בין הצדיקים, ולעומת זה מתאמץ הוא לעשות חבור וכנוס בין הריקים והפוחזים, א\"כ אין זה מן התימה מדוע דרך רשעים צלחה, ושלום ושלוה שורר בינותם, ובין הצדיקים מבדיל הפירוד והמחלוקת, כי כל זה הוא מפעולות השטן, ועבודתו בכך, לעשות כינוס בין הרשעים ופיזור בין הצדיקים, ולא בניקל ניתן להתגבר עליו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 7,
      "char_length": 569,
      "timestamp": "2025-02-06T19:14:13.149586"
    },
    {
      "id": "vayakhel_p8",
      "text": "ועוד טעמא רבה איכא למילתא, כי הנה פשוטי העם קלו הדעת בעת אשר יחפצו להתאגד ביחד, כדי להגיע אל איזה מטרה אשר הציבו לעצמם זה דרכם כסל למו, שאין הם מקפידים ובוררים מי נעשה חבר בסיעתם, וכשר בעיניהם להתחבר אפילו עם רשעים העוברים כל עבירות שבתורה, כי זה כל חפצם שילכו עמהם בדעה אחת, להוציא אל הפועל את התכלית הנרצה להם, ומה להם לבקר את מומיהם ולהתגרות בהם, הרי כל כוונתם להגיע אל המערה שלמענה הקימו את האיחוד, ועל כן אין פירוד ומחלוקת ביניהם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 8,
      "char_length": 435,
      "timestamp": "2025-02-06T19:14:13.429419"
    },
    {
      "id": "vayakhel_p9",
      "text": "אמנם לא כן הדבר כאשר מתחברים יהודים כשרים, שמטרתם היא להרים קרן התורה ולחזק בדקי הדת, כי בריש כל מראין עליהם להזהר להתאחד אך ורק עם יהודים כשרים ההולכים בדרך התורה, והם בעלי מדות טובות ולא עולתה בהם, ומבלעדי זאת אין מציאות לפעול לחיזוק הדת, שהרי לא יתכן לעשות פעלים לתורה אלא אם כן כנים ואמתיים ללא זיוף. ועל כן כאשר נעשה חבור ואיחוד בין יהודים כשרים, והמצא ימצא ביניהם איש אשר לא כן הוא. מיד מבקרים את מומיו, ואמור יאמרו לו לא טוב הדבר אשר אתה עושה, ולעומת זאת גם הוא כאשר הוא מרגיש שאינו נוהג כשורה, ובאים להוכיחו על פניו, ירצה להצעדק ולהטיל מום בעמיתיו, באמרו הרי לא טוב אתה ממני. ומזה יוצא שמתנצחים א' עם חבירו וכאן מצא הבעל דבר מקום ללבות אש המחלוקת, ולהביא לפירוד לבבות. נמצא כי הקהלה ואיחוד שעושין לצורך דבר טוב עלול להביא לפירוד.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 9,
      "char_length": 737,
      "timestamp": "2025-02-06T19:14:13.664427"
    },
    {
      "id": "vayakhel_p10",
      "text": "ועוד נראה לי לומר הסבר אמיתי לזה עפ\"י מה דאיתא בגמרא (סוטה כ\"ב ע\"ב) אמר לה ינאי מלכא לדבותוה אל תתיראי מן הפרושים ולא ממי שאינן פרושין אלא מן הצבועין שדומים לפרושין שמעשיהם כמעשה זמרי ומבקשין שכר כפנחס ע\"כ. והנה נחזי אנן באיזה מחנה עלולים להמצא צבועים, זה ברור כו בין הפושעים וקלי הדעת אין נמצאים צבועים, כי לא יתכן לומר שנמצא בינם יהודי אשר בסתר לבבו הוא ירא ושלם, והוא צובע עצמו ומעמיד פנים כאלו הוא פושע ישראל, שהרי מה בצע לו לצבוע עצמו ולהעמיד פנו רשע, אם כפי האמת ירא שמים הנהו. אמנם לאידך גיסא נמצאים צבועים קלו דעת, המסתירים רשעתם ונכליהם, ומעמידים פנים כאלו הם יהודים כשרים. נמצא כו בזמן שנעשה איחוד בין הכשרים עלולים להמצא ביניהם גם צבועים, ואם וד הצבועים באמצע נעשה פירוד בין הדבקים, כי זה כל עבודתם של הצבועים בנכליהם אשר המה מתנכלים, זה בכה וזה בכה. וישנם עוד כמה בחינות לישב תמיהת החתם סופר זלה\"ה אך און כאן מקום להאריך.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 10,
      "char_length": 833,
      "timestamp": "2025-02-06T19:14:14.058757"
    },
    {
      "id": "vayakhel_p11",
      "text": "נחזור לענינינו לבאר דברי הזה\"ק כי הנה הערב רב היו לבני ישראל לפוקה ולמכשול בדבר העגל, כמבואר בזה\"ק כו המה עשו את העגל והסותו את ישראל לעבוד לו, וכל זמן שהם נמצאו עדיין בין בני ישראל והיה להם שייכות עמהם לא היה באפשר לעשות אחדות בקרב ישראל הכשרים, על כן הקהיל משה את כל עדת בני ישראל וגו', וכמ\"ש הזה\"ק שיחדם והפרישן מן הערב רב, כי כדי שיוכלו לשמור על האיחוד בינותם, הכרח הוא להם להתפרד מן הערב רבו אשר המה להם כקוץ מכאיב וכסילון ממאיר לחרחר ריב ומחלוקת בקרב ישראל, ורק ע\"י ההתפרדות מן הערב רב נעשתה הקהלה והתחברות בין ישראל הכשרים. (וכן הוא מפורש בזה\"ק פ' פנחס דף רל\"ז ע\"ב וז\"ל ומה כתיב קחו מאתכם תרומה לה' ולא מערב רב מדלא אתקריאו קהלה וחבור עד דאתעבר מנהון ערב רב\" כביכול בזמנא דמתערבין בינייהו כאילו לא הוו גוי אחד וכו' עיי\"ש עכ\"ל ברע\"מ שם).",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 11,
      "char_length": 743,
      "timestamp": "2025-02-06T19:14:14.466489"
    },
    {
      "id": "vayakhel_p12",
      "text": "והנה ישנם ארגאניזאצועס רבים, ואף שבכל מקום ניתן למצוא גם יהודים כשרים אך בעבור שהמה מעורבים בין הערב רב אין זאת קהלה והתאחדות, כאשר בארנו לעיל בדברי הזה\"ק, כי קהלה לא תתכן אלא כאשר און וד הע\"ר באמצע ולכן הכרח גדול הוא להחזיק התאחדות זו אשר נקרא שמה התאחדות הרבניס\"ג כו מטרת התאחדות זו הוא התפרדות מן העיר, וזולת התפרדות מהם אי אפשר לעשות התאחדות בין הכשרים, והתאחדות זו שומרת על הפירוד המוחלט מהם ומהמונם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 12,
      "char_length": 405,
      "timestamp": "2025-02-06T19:14:14.842646"
    },
    {
      "id": "vayakhel_p13",
      "text": "וכעין בחינה זו פרשנו בדברי הגמרא יבמות (דף י\"ד ע\"א) לא תתגודדו (דברים י\"ד) לא תעשו אגודות אגודות וכו' אמר רבא כגון ב\"ד בעיר אחת פלג מורין כדברי ב\"ש ופלג מורין כדברי ב\"ה וכו' ולכאורה קשה שהרי לפי דרשה זו אתו אזהרת לא תתגודדו שלא לעשות פירוד ומחלוקת בהוראה, ומדוע אפקיה קרא בלשון לא תתגודדו, ודרשו מיניה לא תעשו אגודות אגודות, שהיא לכאורה אזהרה הפכיות שלא לעשות אגודה והתחברות, והו\"ל לא תעשו פירוד ומחלוקת, אלא מכאן ראיה כי מהרבות באגודות נעשה פירוד ומחלוקת, ועל כן כאשר הזהיר הכתוב נגד מחלוקת ופירוד אמר לא תעשו אגודות אגודות, שהם הגורם אל הפירוד. וכעין זה הוא המכוון בדברי הזה\"ק שפירש מאה\"כ שויקהל\" משה שהפרידן מן הע\"ר, כי תכלית הקהלה זו היתה לשמור על הפירוד מן הע\"ר.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 13,
      "char_length": 667,
      "timestamp": "2025-02-06T19:14:15.074847"
    },
    {
      "id": "vayakhel_p14",
      "text": "תוכן הדברים כי לפי מצב הדור הכרח היה בהקמת התאחדות זו, והכרח גדול הוא לתמכה ולסעדה, כי בכל מה דאפשר מטרתה היא התבדלות ופירוד מן הערב רב, ולא זאת בלבד, אלא שיש לנו הגנה חזקה שלא יתערבו בה מן הע\"ר, כי מי שהוא מן הע\"ר, אינו רוצה אפילו להביט על התאחדות הרבנים, ובודל ממנה מאליו, ואין אנו צריכים להתייגע כדי להרחיקו מבינינו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 14,
      "char_length": 319,
      "timestamp": "2025-02-06T19:14:15.419544"
    },
    {
      "id": "vayakhel_p15",
      "text": "נחזור לענין ראשון לביאור המשך הפסוק (קושיא א בן דהנה כדי שיוכלו בנו ישראל לשמור על פירוד והתבדלות מן הע\"ר, היה עליהם להתנהג בדרך התורה בכל מעשיהם, עד שהעזר יתרחקו מהם מאליהם, ולא יחפצו להתקרב להם, כי יהודי המתנהג בדרך האמת שנאוי בעיניהם בתכלית. וזה אפ\"ל מרומז בדברי הכתוב ויקהל משה וגו' ויאמר אליהם אלה הדברים אשר צוה ה' לעשות אותם, כי הנה הקהלה זו היתה כדי לשמור על הפירוד בינם לבין הערב רב, כדברי הזה\"ק, ולכן צוה להם את הדרך אשר ילכו בה והמעשה אשר יעשון, כדי שיוכלו לשמור על פירוד מוחלט מהם ומהמונם, שיתנהגו בכל מעשיהם בדרך התורה האמיתי, וע\"י כך יתרחקו הע\"ר מהם. וז\"ש הכתוב אלה הדברים כלומר כללות התורה, אשר צוה ה' לעשות אותם, היינו שוטובו דרכיהם, וע\"י כך תהיה להם הגנה שלא יתערבו העזר עמהם. ואמנם בני ישראל עשו כדבר משה, ושפרו מעשיהם, וע\"י כך היתה ההתבדלות מן העיר בשלימות. ולפיכך כאשר בא ציווי השי\"ת שיתנו בני ישראל תרומתם למשכן לא הוצרכו הגזברים לעשות מעשה והשתדלות כדי שיתנו ישראל תרומתם, אלא באמירה בעלמא הוה סגי, כדכתיב זה הדבר אשר צוה ה' שלאמר\" קחו מאתכם וגו', ומאליהם הביאו בני ישראל נדבתם בחפץ לבם לבנין המשכן, כו ע\"ו שהטובו דרכיהם כאשר נצטוו במאמר אלה הדברים וגו', קנו שלמות בנפשם, והיה די באמירה בעלמא שיתנו חלקם למשכן. ולשני בקרים הביאו את כל הצריך למלאכה כדאי' בתנחומא פ' תרומה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 15,
      "char_length": 1193,
      "timestamp": "2025-02-06T19:14:15.617604"
    },
    {
      "id": "vayakhel_p16",
      "text": "ובדרך זה אפ\"ל כוונת רש\"י ז\"ל ויקהל משה לשון הפעיל שאינו אוסף אנשים בידים אלא הם נאספים על פי דבורו. (עיין קושיא ד) כי לפי מה שנתבאר לעיל שנתכוון הכתוב באמרו ויקהל משה שעשה התחברות בין ישראל הכשרים, כדי שיוכלו להתחזק ולהתאחד נגד הע\"ר, על כן כתב רש\"י ז\"ל שאינו אוסף אנשים בידים, כלומר שלא זאת המערה והתכלית לאסוף אנשים ולהקהילם אל מק\"א, כי אם יש פירוד לבבות בין הנאספים לא תפעול האסיפה כלום. ואך כאשר אין וד הערב באמצע, אזי יתכן שיהיה קירוב לבבות בין הנאספים, ומפרש רש\"י ז\"ל כיצד יצאה לפועל התחברות זו בין ישראל הכשרים והפירוד מן הערב רב, ע\"ו שאמר משרע\"ה לפניהם דברים קדושים, ודבריו היוצאים מן הלב נכנעו ללבות בנו ישראל ועשו בהם רושם, ונעשתה התחברות ביניהם. וזאת כוונת רש\"י ז\"ל ויקהל לשון הפעול\", כלומר שהכניס התפעלות בלבותם והן נאספין על פי דבורו\"ג ר\"ל שהתאחדו יחד על ידי דבוריו הקדושים שעשו רושם בלבם, ובכח זה יכלו לעמוד נגד הע\"ר, ולהשמר מהם שלא יהיה להם חלק בנדבת המשכן, כאשר נצטוו קחו מאתכם דייקא ולא מן הע\"ר. והשי\"ת יעזור שדיבוריו הקדושים של משרע\"ה ישפיעו גם עלינו להתחזק יחד נגד הע\"ר.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 16,
      "char_length": 988,
      "timestamp": "2025-02-06T19:14:16.204420"
    },
    {
      "id": "vayakhel_p17",
      "text": "ואפ\"ל ענין זה בדברי המדרש ילקוט הנ\"ל, עשה לך קהלות גדולות וכו' כדי שילמדו ממך דורות הבאים להקהיל קהלות וכו'. והוא ע\"ד מאה\"כ ויעש אברהם משתה גדול (בראשית כ\"א) ופירש\"י ז\"ל על שם שגדולי הדור היו מסובים שם. ולפיכך כאשר מתחברים ומתאחדים ההולכים בדרך האמת כדי להתבדל מן הע\"ר, יקרא להם בשם קהלות גדולות. וזאת כונת המדרש להקהיל קהלות כי כשם שהקהילן משה להפרידן מן הע\"ר, כן נצטוו לדורות להקהיל קהלות, כדי לשמור על הפירוד מן הע\"ר. והנה כל פעולה שעושים מקושרת בהוצאות, וכל דבר טוב שמקומים הוא בחינת מקדש מעט, ונכלל במצות קחו מאתכם תרומה לה', ובכל דבר שבקדושה צריכים התאמצות שיוכל להתקיים, וחובה עלינו להתחזק ולהתאחד, ובעוה\"ר רואים כי על כל דברים של שקר אין להם שום דוחק ממון, ובידם יש אלפי אלפים ורבבות עד אין שיעור וערך די והותר, ואלו היה בידנו רק חלק קטן טפה מן הים דוגמתן. והשי\"ת יעזור לנו שנוכל להתאחד ולהתחזק ולהחזיק ולקיים התוה\"ק והיהדות, ויהיה לנו היכולת לכך ויקח כל אחד חלק בסיוע זה. ונזכה מהרה לבנין ביהמ\"ק ולציון וירושלים בבנינה במהרה בישועה שלמה בהתגלות כבוד שמים עלינו בב\"א.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 17,
      "char_length": 975,
      "timestamp": "2025-02-06T19:14:16.675384"
    },
    {
      "id": "vayakhel_p18",
      "text": "ויקהל משה את כל עדת בנ\"י ויאמר אלהם אלה הדברים אשר צו' ד' לעשות אותם, ששת ימים תעשה מלאכה וביום השביעי יהי' לכם קדש וגו' הנה בפשטות נראה דמשה\"כ אלה הדברים אשר צו' ד' קאי על מצות שבת דסמיך לי', וכן מוכח מדברי חז\"ל שדרשו מפסוק זה מנין הל\"ט מלאכות, במס' שבת (צ\"ז ע\"ב) רבי אומר דברים הדברים אלה הדברים אלו ל\"ע מלאכות שנאמרו למשה מסיני ע\"כ, וכ\"כ הכלי יקר ז\"ל דאין לומר דאלה הדברים קאי על המשכן שהזכיר אח\"כ, שהרי נאמר להלן זה הדבר אשר צו' ד' וגו', א\"כ בזה הדבר המשכן אמור, ומה אנו מקיים אלה הדברים ע\"כ קאי על השבת עכ\"ל אבל קשה דא\"כ הול\"ל אלה הדברים אשר צו' ד' שלא לעשות אתם, דל\"ט מלאכות שדרשו חז\"ל מפסוק זה, הצווי בהם שלא לעשות.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 18,
      "char_length": 622,
      "timestamp": "2025-02-06T19:14:17.142326"
    },
    {
      "id": "vayakhel_p19",
      "text": "ב) הרמב\"ן ז\"ל כתב כי אלה הדברים אשר צו' ד' לעשות קאי על מלאכת המשכן ועבודתו, ולפי דבריו א\"ש מ\"ש לעשות כי מצותן בעשי', אבל קשה דא\"כ למה הפסיק אח\"כ במצות שבת לומר ששת ימים תעשה וגו' ואח\"כ חזר עוד למלאכת המשכן, והו\"ל להמתין ולומר אלה הדברים אחר שגמר מצות שבת, וגם יקשה על פירושו קושית הכלי יקר שהרי נאמר להלן זה הדבר אשר צו' ד' על מלאכת המשכן ולמה הוצרך לומר גם אלה הדברים אשר צו' ד' על מלאכת המשכן וסגי בחד.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 19,
      "char_length": 405,
      "timestamp": "2025-02-06T19:14:17.478419"
    },
    {
      "id": "vayakhel_p20",
      "text": "ג) ועוד הקשה הכלי יקר מ\"ש תעשה מלאכה בצירי, הול\"ל תעשה מלאכה בפתח, דתעשה משמע מעצמה, וגם דמיותר לגמרי ולמה נכתבה, וכי לא סגי בלא\"ה ובהכרח שיעשה מלאכה בששת ימים בתמי', ואין צורך להשמיענו היתר המלאכה בששת ימי החול דמהיכי תיתי לאסור.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 20,
      "char_length": 230,
      "timestamp": "2025-02-06T19:14:17.771875"
    },
    {
      "id": "vayakhel_p21",
      "text": "ד) להלן ויאמר משה אל כל עדת בנ\"י לאמר זה הדבר אשר צו' ד' לאמר יל\"ד דכפל מלת לאמר ב' פעמים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 21,
      "char_length": 90,
      "timestamp": "2025-02-06T19:14:17.921888"
    },
    {
      "id": "vayakhel_p22",
      "text": "ה) רש\"י פי' זה הדבר אשר צו' ד' לי לאמר לכם צ\"ב מה שהוסיף מלת לי, ומה הכוונה בזה, ומבואר בפסוק בפ' תרומה שהקב\"ה צו' למשה פרשה זו, שיאמרנה לבני ישראל, ומה חידש לן רש\"י ז\"ל בזה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 22,
      "char_length": 174,
      "timestamp": "2025-02-06T19:14:18.009567"
    },
    {
      "id": "vayakhel_p23",
      "text": "ואפ\"ל עפימ\"ש בזוה\"ק (פ' יתרו דף פ\"ח ע\"א) הכי תאנא כל ברכאן דלעילא ותתא ביומא שביעאה תליין, ותאנא אמאי לא אשתכח מנא ביומא שביעאה, משום דההוא יומא מתברכאן מנה כל שתא יומין עלאין, וכל חד וחד יהיב מזונא לתתא מההוא ברכה דמתברכאן ביומא דשביעאה, בג\"כ בעי לסדרא פתורא ולאתקנא סעודתא וכו' בגין דיתברך פתורי' כל אינון שתא יומין וכו' עכ\"ל מבואר דע\"י שמירת שבת כהלכתו מתברכין שתא יומין דלעילא, ומההוא ברכה מתברכין כל ששת ימי המעשה, נמצא דהצלחת ששת ומי המעשה תלוי בשמירת שבת כהלכתו, ובזה יבואר לעניננו דמשה\"כ אלה הדברים אשר צו' ד' לעשות אותם קאי על שמירת שבת דסמיך לי' כדמוכח מדרשת חז\"ל כנ\"ל, ומ\"מ אפקי' רחמנא בלשון לעשות אותם, אע\"ג דבשמירת שבת הצווי בהם שלא לעשות, אמנם לפי שנצטוו כאן מיד על עשיית המשכן, והעשו' בששת ימי המעשה נגמר לעילא ע\"י שמירת שבת כנ\"ל, ע\"כ אמר הכתוב לעשות אותם וקאי על עשיית המשכן ג\"כ, דבזה שתקוימו אלה הדברים אשר צו' ד' בשמירת השבת, יהי' לעשות אותם ויתברך העשי' במלאכת המשכן, ומפרש הכתוב ששת ימים תעשה מלאכה וביום השביעי שבת שבתון וגו', דע\"י שמירת שבת תעשה המלאכה מאלי' בשתא יומין דלעילא, דכל מה שיצטרך האדם בששת ומי המעשה לקיים בפועל, נגמרה עשי' ההוא בכח בשבת שלפני', ע\"י שמתברכין ששת יומין דלעילא, והם משפועין ברכה והצלחה במה שיעשה האדם בששת ימי המעשה לתתא.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 23,
      "char_length": 1170,
      "timestamp": "2025-02-06T19:14:18.137229"
    },
    {
      "id": "vayakhel_p24",
      "text": "ועוד נצטו' משה רבינו לאמר לישראל זה הדבר אשר צו' ד' קחו מאתכם תרומה לד', שתקוימו מלאכת המשכן בפועל ממש ובמעשה ידיכם, אע\"ג דכבר כתיב לעשות אותם וקאי ג\"כ על עשיית המשכן כנ\"ל, אבל העשי' ההוא יהי' רק בכח. ע\"י שיתברכו שתא יומין דלעילא, ע\"כ צום עוד שיקיימו עשיית המשכן בפועל, דברכתוך בכל אשר תעשה כתיב ובפרע בעשיית המצו' ודאי שצריך לקיים כל מצו' במחשבה ודיבור ומעשה, וע\"כ צום עוד על העשי' בפועל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 24,
      "char_length": 389,
      "timestamp": "2025-02-06T19:14:18.701468"
    },
    {
      "id": "vayakhel_p25",
      "text": "והנה איתא בשמות רבה ופ\"ר מ' ס\"ב) כשעלה משה למרום הראה לו הקב\"ה כל כלי המשכן וא\"ל עשה כך וכך וכו', סבור משה שהוא עושה אותו א\"ל משה מלך עשיתיך, און דרך מלך לעשות דבר, אלא גוזר ואחרים עושים, ואיתא עוד במדרש ועשית את הקרשים, וכי משה עשה את המשכן, והלא כתיב ועשה בצלאל וגו' אלא משה לתלמוד ובצלאל למעשה מכאן אמרו רבותינו ליתן שכר למעשה כעושה ע\"כ ובזה יתבארו דברי רש\"י ז\"ל זה הדבר אשר צו' ד' לו לאמר, הוסיף רש\"י ז\"ל מלת לי שלא נאמרה בפסוק, לשלול ולמעט את ישראל מכלל זה, שלמשה לבדו ניתנה לקיים מצות מלאכת המשכן באמירה לבד, אבל ישראל נצטוו לקיים מלאכת המשכן בפועל ממש כמ\"ש קחו מאתכם וגו' וז\"ש זה הדבר אשר צו' ד' לי לאמר, שהצווי הי' לי לקיים באמירה לבדה, אבל אתם קחו מאתכם תרומה ותקיימו המצו' בפועל, ומעתה הי' כאן ב' צוויים וב' אמירות, אמירה למשה שיקיים המצו' באמירה לבדה, ואמירה לישראל שיקיימו המצו' בפועל וא\"ש מה שכפל הכתוב מלת לאמר ב' פעמים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 25,
      "char_length": 834,
      "timestamp": "2025-02-06T19:14:18.925329"
    },
    {
      "id": "vayakhel_p26",
      "text": "ויקהל משה את כל עדת בני ישראל ויאמר אליהם אלה הדברים אשר צוה ה' לעשות אותם וגו' וביום השביעי יהי' לכם קדש וגו'. צריך ביאור שהרי כל התורה כולה נאמרה בהקהל כדאיתא בעירובין (נ\"ד ע\"ב) ואמאי הוצרך הכתוב לפרש הכא שנאמרה בהקהל. ובזוה\"ק (דף קצ\"ה ע\"א) איתא ויקהל משה מאן אתר כניש להון אלא בגין דהוה אינון ערב רב בינייהו איצטריך משה לאכנשא לון וליחדא לון מבינייהו, עכ\"ל הק'. ולדבריו א\"ש שהוצרך הכתוב להודיענו שהקהילן משה להפרישם וליחדם מן הע\"ר, אמנם אכתי צריך ביאור מדוע הסמיך הכתוב הפרשה זו למצות שבת, מה שייך ענין ההפרשה מן הע\"ר למצות שבת. וגם צ\"ב מדוע הוציא הכתוב הפרדה זו בלשון הקהלה, והול\"ל ויפרד משה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 26,
      "char_length": 596,
      "timestamp": "2025-02-06T19:14:19.350312"
    },
    {
      "id": "vayakhel_p27",
      "text": "ונראה לומר בהקדם מה שפירשנו דברי המדרש (דברים רבה פ\"ג א) וז\"ל את סבור שמא לרעתך נתתי לך את השבת לא נתתי לך אלא לטובתך כיצד א\"ר חייא בר אבא את מקדש את השבת במאכל ובמשתה ובכסות נקיה ומהנה את נפשך ואני נותן לך שכר מנין וקראת לשבת עונג (ישעי' נ\"ח) מה כתיב אחריו אז תתענג על ה' ויתן לך משאלות לבך, ע\"כ. ודברי המדרש תמוהים מה מקום היה לטעות ולומר שהקב\"ה נתן את השבת לרעה, עד שהוצרך המדרש להוציא מלבות הטועים וסוברים כן. ועוד יש לתמוה שמפרש כיצד ניתן לך השבת לטובתך את מקדש את השבת במאכל ובמשתה וכו' ומהנה את נפשך ואני נותן לך שכר. וקשה וכי זה בלבד הוא טוב השבת ונועמו, מה שניתן לאכילה ושתייה, ולולא זאת האם היה השבת לרעתנו ח\"ו. ופרשנו עפ\"י מ\"ש הרב בית יוסף ז\"ל (או\"ח סי' רפ\"ח) וז\"ל גרסינן בירושלמי (שבת פט\"ו ה\"ג) ר' חגי אמר לא ניתנו שבתות וימים טובים אלא לאכילה ושתיה ר' ברכיה אמר לא ניתנו אלא לעסוק בהם בד\"ת ובתנחומא מפרש לא פליגין מה דא\"ר ברכיה לת\"ת אלו הפועלים שהם עסוקים במלאכתם כל ימות השבוע ובשבת הם באים ומתעסקים בת\"ת ומה דא\"ר חגי להתענג אלו ת\"ח שהם יגעים בתורה כל ימות השבוע ובשבת הם מתענגים, עכ\"ד הרב\"י ז\"ל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 27,
      "char_length": 1010,
      "timestamp": "2025-02-06T19:14:19.658735"
    },
    {
      "id": "vayakhel_p28",
      "text": "והנה כאשר האדם עמל ויגע בפרנסתו בששת ומי המעשה הרי זה מוכיח כי און מעשיו כשורה, כדאיתא בברכות (דף ל\"ו ע\"ב) רשב\"י אומר בזמן שישראל עושים רצונו של מקום מלאכתם נעשית ע\"י אחרים. ואמרו ז\"ל (קידושין דף פ\"ב ע\"ב) הריעותי את מעשי וקפחתי את פרנסתי, וזאת כוונת המדרש שמא תאמר לרעתך נתתי לך את השבת וכו' כלומר דהוה אמינא שעיקר מצות שבת שייכא רק גבי אנשים שהם יגעים בפרנסה כל ימות החול, והם בבחינת רע שמעשיהם מקולקלים, ועל כן ניתן להם השבת כדי שיהיו פנויים לעסוק בתורה אבל אותם העוסקים בתורה כל ימות החול ומלאכתם נעשית ע\"ו אחרים, שהם בבחינת טוב, הו\"א שלא שייכא גבייהו מצות שבת, שהרי שביתה ממלאכה לא שייכא גבייהו, שגם בימות החול הם בעלים ממלאכה. וגם לא ניתן להם השבת לעסוק בתורה שהרי הם עוסקים בה כל השבוע. וכדי להוציא מטעות זה קאמר המדרש לא נתתי לך את השבת אלא לטובתך, כלומר דמצות שבת ניתנו לת\"ח העוסקים בתורה שהם בבחינת טובים, כי להם ניתן השבת לאכול ולשתות ולהתענג (ועיין בדברנו פ' עקב באורך).",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 28,
      "char_length": 881,
      "timestamp": "2025-02-06T19:14:20.156562"
    },
    {
      "id": "vayakhel_p29",
      "text": "ועפי\"ז נבא ליישב מה שהקשינו ע\"ד הזה\"ק דמה שייך ענין ההפרדה מן הע\"ר למצות שבת, דהנה כלל ישראל הכשרים ודאי היו בבחינת טובים והיו עסוקים בת\"ת כל ימות החול ולהם ניתן השבת לאכול ולשתות ולהתענג. אמנם הערב רב שהיו משורש רע וקלקלו מעשיהם היו עסוקים במלאכתם כל ימות השבוע, ולהם ניתן השבת לעסוק בת\"ת. נמצא כי בעת שצווה אותם משה על מצות שבת נעשה ממילא פירוד וחילוק בין ישראל לערב רב, שהרי לא ראי זה כראי זה, דלישראל שהם טובים ניתן השבת להתענג בו בתענוג אכול ושתה, ולערב רב שהרעו מעשיהם ניתן לת\"ת. וא\"כ מובן שפיר שייכות הכתוב ויקהל משה, וכמ\"ש הזה\"ק שהפרידן מן הע\"ר למצות שבת, כו ע\"י מצות שבת נתגלה כי נפרדו דרכיהם. ובזה יתיישב עוד מה שקשה ע\"ד הזה\"ק, שאם כוונת הכתוב להודיע שהפרידן מן הערב רב, אמאי נכתב כאן ויקהל משה, הול\"ל ויפרד משה. ולדברנו ניחא, כי הנה משה הקהיל את כלם וחד ללמדם הלכות שבת, ומהקהלה זו נעשה פירוד וחילוק בין ישראל קדושים לבין הערב רב, כי נודע להם שאין דינם שוה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 29,
      "char_length": 868,
      "timestamp": "2025-02-06T19:14:20.601078"
    },
    {
      "id": "vayakhel_p30",
      "text": "באופן אחר י\"ל מאמר הכתוב ויקהל משה דלכאורה יתירא הוא. שהרי כל התורה בהקהל נאמרה כדאיתא בעירובין, ולמה הוצרך הכתוב לומר שפרשה זו בהקהל נאמרה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 30,
      "char_length": 140,
      "timestamp": "2025-02-06T19:14:21.062386"
    },
    {
      "id": "vayakhel_p31",
      "text": "ב) אלה הדברים אשר צוה ה' לעשות אותם ששת ימים וגו' וביום השביעי יהיה לכם קודש וגו'. הקשו המפרשים שהרי פשטות הכתוב הוא כי מאמר אלה הדברים וגו' קאי על אזהרת מלאכה בשבת דסמיכא ליה, ולפי\"ז הוה ליה לכתוב אשר צוה ה' שלא לעשות, שהרי עיקר מצות שבת היא שלילת העשייה. והרמב\"ן ז\"ל פירש כי מאמר אלה הדברים קאי על מלאכת המשכן ולדבריו ניחא דכתיב אשר צוה ה' לעשות וגו', אמנם הקשה הכלי יקר ז\"ל ע\"ז שהרי להלן כתיב זה הדבר אשר צוה ה' וגו' קחו מאתכם, א\"כ הרי דבר המשכן אמור, ומה אנו מקיים אלה הדברים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 31,
      "char_length": 480,
      "timestamp": "2025-02-06T19:14:21.163097"
    },
    {
      "id": "vayakhel_p32",
      "text": "ג) במדרש ילקוט ויקהל משה וכו' מתחלת הפרשה ועד סופה אין בה פרשה שנאמר בראשה ויקהל אלא זאת בלבד אמר הקב\"ה עשה לך קהלות גדולות ודרוש לפניהם ברבים הלכות שבת כדי שילמדו ממך דורות הבאים להקהיל קהלות בכל שבת וכו' אמר משה לישראל אם אתם עושים כסדר הזה הקב\"ה מעלה עליכם כאילו המלכתם אותו בעולמו שנאמר ואתם עדי נאם ה' ואני א' (ישעי' מ\"ג) וכן דוד הוא אומר בשרתו צדק בקהל רב (תהלים מ') וכי מה בשורה היו ישראל צריכים בימי דוד וכו' שהיה פותח ודורש לפניהם דברי תורה שלא שמעתן אוזן מעולם עכ\"ד המדרש. והדקדוקים רבו בדברי המדרש, חדא שאם המכוון בהקהלה זו היה שילמדו ממנו דורות הבאים להקהיל קהלות, מדוע לא תקן משרע\"ה תקנה קבועה לדורות שיהיו דורשים בכל שבת ושבת, כאשר תקן להם שיהיו דורשים הלכות חג בחג וכו'. (כמבואר בילקוט הנ\"ל. ועי' מגלה ל\"ב ע\"א).",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 32,
      "char_length": 726,
      "timestamp": "2025-02-06T19:14:21.418338"
    },
    {
      "id": "vayakhel_p33",
      "text": "ד) גם לשון המדרש וכו מה בשורה היו ישראל צריכים וכו' שהיה פותח ודורש לפניהם ד\"ת שלא שמעתן אוזן מעולם צ\"ב, וכי מה לשון בשורה שייך בדברי תורה שחיוב תמידי על האדם לעסוק בהם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 33,
      "char_length": 169,
      "timestamp": "2025-02-06T19:14:21.781451"
    },
    {
      "id": "vayakhel_p34",
      "text": "ה) ועוד יל\"ד האם רק דברים שלא שמעתן אוזן מעולם דרש לפניהם דהמע\"ה, והלא ודאי היה דורש לפניהם דיני התורה והמצות כדי לאלפם בינה, ולהורותם את הדרך ילכו בה ואת המעשה אשר יעשון.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 34,
      "char_length": 171,
      "timestamp": "2025-02-06T19:14:21.893797"
    },
    {
      "id": "vayakhel_p35",
      "text": "ונראה לבאר בהקדם מה שפירשנו המשנה (אבות פ\"ה מ\"כ) יהודה בן תימא אומר הוו עז כנמר וקל כנשר רץ כצבי וגבור כארי לעשות רצון אביך שבשמים הוא היה אומר עז פנים לגיהנם ובושת פנים לגן עדן יהי רצון מלפניך ה' אלקינו שתבנה עירך במהרה ותן חלקינו בתורתך, עכ\"ל המשנה. ולכאורה הרי כל המשנה הוא דברי יהודה בן תימא, שהרי לא נזכר במשנה זו אלא הוא, וא\"כ למה הפסיק רבינו הקדוש מסדר המשנה באמצע דבריו וכתב הוא היה אומר', מה צורך להודיענו זאת, פשיטא הוא כיון שלא נזכר במשנה עוד תנא ממנו יצאו הדברים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 35,
      "char_length": 475,
      "timestamp": "2025-02-06T19:14:22.024111"
    },
    {
      "id": "vayakhel_p36",
      "text": "אמנם נראה כי דבר גדול הודיענו בזה, כי לכאורה רישא וסיפא דהאי מתניתין סתרי אהדדי, דפתח בשבח מדת העזות, באומרו הוו עז כנמר, וסיים בגנותה ואמר עז פנים לגיהנם ובושת פנים לג\"ע. אמנם האמת הוא שאין כאן סתירה כלל, והיו תואמים ויחדיו יהיו תמים, שהרי כך היא דרכה של תורה להשתמש במדות הפכיות לעבודת השי\"ת, הכל כפי צורך הענין. ועל האדם לכלכל מעשיו במשפט ולשקול במאזני שכלו, איזה הדרך ישכון אור, ובכל מדה יש אשר עת לקרבה ועת לרחוק ממנה, ופעמים אשר צורך גדול הוא למען קיום התוה\"ק להשתמש במדת העזות, ובפרט בדורינו השפל דור עיקבא דמשיחא שהחוצפה סגיא, ועובדי ה' באמת זעירין אינון, והרוב נתפסים אחר זרם העולם, ומלעיגים בעובדי ה' וחושבי שמו, ובוזים את דברם, על כן ההכרח הוא להשתמש נגדם במדת העזות, שלא לסגת אחור מפניהם, ולא יבטל דעתו נגדם, אלא ישים פניו כחלמיש ומצחו נחושה לבלתי הכלם מהם. וכמ\"ש הרמ\"א ז\"ל (או\"ח סי' א') וז\"ל ואל יבוש מפני המלעיגים עליו בעבודת ה' וכו', ע\"כ. ברם צריך לזאת כח הבחנה רבה וזהירות יתירה, לפלס מעגלותוו, שלא ישתמש במדת העזות כי אם בעת הצורך לעבודת השי\"ת. אבל זולת זאת יאחז במדת הענוה, להיות שפל בעיניו כחרס הנשבר, ולהתרחק ממדת העזות עד קצה האחרון, במקום שאינו נוגע לכבוד שמים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 36,
      "char_length": 1083,
      "timestamp": "2025-02-06T19:14:22.265899"
    },
    {
      "id": "vayakhel_p37",
      "text": "ואפשר לומר כי זאת היתה כונת רבינו הקדוש מסדר המשנה שכתב באמצע דברי יהודה בן תימא תיבות מהוא היה אומר\"נ כו עבור ששובח התנא מעלת העזות, כאומרו הוי עז כנמר, יש לחוש פן יאמר האדם כו מדת העזות מעולה היא מאד להשתמש בה בכל עת. אף במקום שאין בה תועלת לעבודת ה', כי אין בו דעת להבחין כו עת לרחק ממנה. ואם יאמרו לו שפיל לסיפא דמתני', וראה מה כתיב בה עז פנים לגיהנם, יענה ויאמר לך כו רישא וסיפא תרי תנאי נינהו דפליגי, ואנא קים לי כחד תנא, על כן לאפוקי מהאי דעתא שבשתא הודיענו מסדר המשנה כי מהוא היה אומר' כלומר לאו תרי תנאי נינהו, ומאן דאמר הוי עז כנמר, אמר נמי הא דעז פנים לגיהנם, וכך היא המדה, יש אשר חובה היא לאחוז במדת העזות במקום הנוגע לכבוד השם יתברך, ויש אשר היא מדה מגונה מאד, וחייבים להתרחק ממנה כמטחוי קשת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 37,
      "char_length": 705,
      "timestamp": "2025-02-06T19:14:22.825756"
    },
    {
      "id": "vayakhel_p38",
      "text": "והנה אמרו ז\"ל בסוף מס' סוטה (דף מ\"ט ע\"ב) בעוקבתא דמשיחא חוצפא יסגי, ואם כן שמדת החוצפה גדולה כ\"כ בדור עוקבתא דמשיחא, הרי צורך גדול ליראי ה' לאחוז במדת העזות נגד המלעיגים עליהם, ולאו כל אדם יכול ליישר אורחותיו, ויכולים להכשל להשתמש במדה זו גם במקום שצריך לרחוק ממנה. וכשראה התנא זאת ברוח קדשו נתיירא מן המכשול העלול לצאת מכך, ולכן התפלל ע\"ז יה\"ר מלפניך ה' א' שתבנה עירך במהרה וכו' ואז לא יהי' כבר מן הצורך להשתמש במדת העזות לעבודת ה'. (ועי' בדברינו פ' חיי שרה עמוד תצ\"ה).",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 38,
      "char_length": 470,
      "timestamp": "2025-02-06T19:14:23.190457"
    },
    {
      "id": "vayakhel_p39",
      "text": "ומה שמסיים התנא תפלתו ותן חלקנו בתורתך\". יתבאר בהקדם דברי האר\"י הק' בפ' נצבים עה\"כ ולא אתכם לבדכם אנכי כורת את הברית הזאת וגו' כי את אשר ישנו פה וגו' ואת אשר איננו פה עמנו היום (דברים כ\"ט). שהכונה כי כל תלמיד בדורות העתידים קיבל חלק התורה שלו השייך לשרש נשמתו בהר סיני, ואותו חלק התורה אי אפשר שיתגלה ע\"ו אחר, כי אם על ידו. ובאמת מבואר כן במד\"ר (שמות פ' כ\"ח ד) עה\"כ וידבר אלקים את כל הדברים האלה לאמר. וז\"ל א\"ר יצחק מה שהנביאים עתידים להתנבאות בכל דור ודור קבלו מהר סיני שכן משה אומר להם לישראל כו את אשר ישנו פה עמנו עומד היום ואת אשר איננו פה עמנו היום עמנו מעומד\" היום אין כתיב כאן אלא עמנו היום אלו הנשמות העתידות להבראות שאין בהם ממש שלא נאמרה בהם עמידה אע\"פ שלא היו באותה שעה כאו\"א קבל את שלו וכן הוא אומר משא דבר ה' אל ישראל ביד מלאכי (מלאכי א') בימי מלאכי לא נאמר אלא ביד מלאכי שכבר היתה הנבואה בידם מהר סיני ועד אותה שעה לא ניתנה לו רשות להתנבאות וכן ישעיה אמר (ישעי' מ\"ח) מעת היותה שם אנו אמר ישעיה מיום שניתנה תורה בסיני שם הייתי וקיבלתי את הנבואה הזאת אלא ועתה ה' שלחני ורוחו עד עכשיו לא ניתן לו רשות להתנבאות ולא כל הנביאים בלבד קיבלו מסיני נבואתן אלא אף החכמים העומדים בכל דור ודור כל אחד ואחד קבל את שלו מסיני וכו' עכ\"ל המדרש. הרי מבואר כי כל אחד ואחד קבל חלק התורה השייך אליו מסיני, ואין חלקו יכול להתגלות כו אם על ידו. והנה אם הוא אדם כשר אזי יכול חלק התורה השייך אליו להתגלות על ידו, אמנם אם הוא אדם רשע, אז אף אם הוא מגלה חידושי תורה אין בכך כלום. אדרבה מרבה בכך את כח הטומאה בעולם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 39,
      "char_length": 1401,
      "timestamp": "2025-02-06T19:14:23.441054"
    },
    {
      "id": "vayakhel_p40",
      "text": "ונקדים עוד דברי ספר זיקוקין דנורא בהקדמתו לפירושו על תנא דבי אליהו שכתב לפרש המדרש ב\"ר פי\"א י\"א) עה\"פ כו בו שבת מכל מלאכתו וגו' ר' פנחס בשם ר' הושעיא אמר אע\"ג דאת אמר כי בו שבת מכל מלאכתו ממלאכת עולמו שבת ולא שבת ממלאכת הרשעים ולא ממלאכת הצדיקים וכו' ופירש עפ\"י דאיתא בזה\"ק (הקדמת הזוהר דף ה' ע\"א) כי ע\"ו שהאדם מחדש חידושים אמיתיים בתורה\"ק נבראים מהם שמים חדשים וארץ חדשה ועל דא כתיב (ישעי' ס\"ו) כי כאשר השמים החדשים והארץ החדשה אשר אני עושה עומדים לפני וגו' עשיתי לא כתיב אלא עושה שעושה תדיר שמים וארץ חדשים מאינון חדושין ורזין דאוריתא אבל מי שאינו לומד תורה כדבעי ומחדש מילין דלא ידע על בוריין נברא מחידושיו רקיע שוא ועל דא כתיב (ישעי' ה') הוו מושכי העון בחבלי השוא, ע\"כ.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 40,
      "char_length": 673,
      "timestamp": "2025-02-06T19:14:24.158918"
    },
    {
      "id": "vayakhel_p41",
      "text": "וז\"פ דברי המדרש כי אעפ\"י שהקב\"ה ברא עולמו בששה ימים ובשביעי שבת וינפש, אבל רק ממלאכתו שבת ולא שבת ממלאכת הצדיקים והרשעים, כי תדיר בכל זמן ועידן נבראים שמים וארץ חדשים ע\"י חידושי התורה שמחדשין הצדיקים, וגם נבראים רקועו שוא ע\"ו חידושים שאינם אמיתיים. נמצא כי לא שבת מבריאת שמים וארץ הנבראים ע\"י מעשה הצדיקים והרשעים, וזה כונת הכתוב כו בו שבת מכל מלאכתו אשר ברא אלקים לעשות, אבל ע\"י הצדיקים והרשעים עדיין נבראים שמים וארץ, עכת\"ד.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 41,
      "char_length": 426,
      "timestamp": "2025-02-06T19:14:24.474832"
    },
    {
      "id": "vayakhel_p42",
      "text": "היוצא לנו מזה כי לימוד תורה שלא עפ\"י דרך האמת, לא די שאינו מועיל, כו אם מקלקל בבריאת שמי שוא, וא\"כ אדם רשע המגלה חידושי תורה אין בכך כלום, ואין זה חלקו אשר ניתן לו בה\"ס. השייך לשורש נשמתו, ויש לשאול דאיך יתגלה חלק התורה השייך אליו, שהרי בלתי אפשר הוא שיתגלה ע\"י אחר. ועל כרחך לומר ע\"ד שכתב האר\"י ז\"ל לפרש מאמר חכמינו ז\"ל (סנהדרין צ\"ז ע\"א) תנא דבו אליהו ששת אלפים שנה הוו עלמא שני אלפים תוהו שני אלפים תורה ושני אלפים ימות המשיח ובעונותינו שרבו יצאו מהם מה שיצאו ע\"כ. וביאר עפ\"י מה שאמרו ז\"ל (נדה י\"ג ע\"ב) אמר ר' יוסי אין בן דוד בא עד שיכלו כל הנשמות שבגוף (פירש\"י ז\"ל גוף חדר כי גוף שם מקום המיוחד לנשמות העתידים להיות נולדים) שנא' (ישעי' נז) כי רוח מלפני יעטוף ונשמות אני עשיתי (הרוחות שלפני שגזרתי להיות נולדים קודם יעטוף מעכב את הגאולה וכו'). נמצא כו עד אשר לא יצאו כל הנשמות אשר גזר עליהם היוצר מתחלת בריאת העולם שיבראו, מתעכבת הגאולה, וע\"י שחוטאים ופוגמים בעוה\"ז ונגזר עליהם לבא בגלגול נוסף לתקן את אשר עוותו, נמצא כי חוזרים לעולם אותם נשמות שהיו בעולם כבר, ומתעכבים מלבא לעולם נשמות חדשות, וע\"י כך מתעכבת הגאולה. וז\"פ הגמרא ובעוה\"ר יצאו מהם מה שיצאו, שיוצאים לעולם נשמות שיצאו כבר בגלגול הקודם, ולפיכך עדיין בן דוד לא בא, עכ\"ד האר\"י ז\"ל. (ועי' בדברינו לעיל פ' משפטים).",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 42,
      "char_length": 1174,
      "timestamp": "2025-02-06T19:14:24.687225"
    },
    {
      "id": "vayakhel_p43",
      "text": "תמצית הדברים כו עבור שלא השלים האדם בעוה\"ז את תפקידו אשר למענו נברא, עליו לבא בגלגול נוסף, ובכך הוא מעכב יציאת נשמות חדשות לעולם, ומתעכבת הגאולה, וא\"כ אדם אשר לא גילה בעוה\"ז את חלק התורה אשר קבל בהר סיני, ושאינו יכול להתגלות ע\"ו אחר, צריך לבא פעם נוספת בגלגול כדי לגלות חלקו. ומובנים בזה שפיר סיום דברי המשנה אבות הנ\"ל שתבנה עירך מהרה ותן חלקנו בתורתך, וכמו שפירשנו שדברי התנא מוסבים על זמן עיקבתא דמשיחא שתגבר מדת העזות בעולם, ע\"כ סיים דבריו בתפלה יה\"ר שתבנה עירך מהרה ולא יצטרכו יותר למדה זו. אמנם מן הדברים המעכבים את הגאולה הוא שלא נתגלו עדיין חלקי התורה השייכים לנשמת כ\"א מישראל, ע\"כ התפלל ותן חלקנו' בתורתך, שיזכה כ\"א לגלות חלקו בתורה, ושוב לא יצטרכו לבא בגלגול, ויבנה ביהמ\"ק במהרה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 43,
      "char_length": 688,
      "timestamp": "2025-02-06T19:14:25.263305"
    },
    {
      "id": "vayakhel_p44",
      "text": "ועפ\"י הקדמות אלו יתבארו לנו דברי המדרש ילקוט הנ\"ל ואות ג') עשה לך קהלות גדולות ודרוש לפניהם ברבים וכו' כדי שילמדו ממך דורות הבאים וכו'. כי משרע\"ה הקהול את כל עדת בנ\"י שהם ס' רבוא נשמות שכל אחד מהם אחוז באות אחת מה\"ת, כידוע מדברי המקובלים ז\"ל ולמד עמהם חלקי התורה השייכים לכל אחד מהם. וזאת כונת המדרש כדי שילמדו ממך דורות הבאים וכו' ר\"ל שהדורות העתידים ועמלו בתורה ויגלה כ\"א חלק תורתו, כדי לקרב את הגאולה. אמר משה לישראל אם אתם עושים כסדר הזה דהיינו שיגלו חלקי התורה השייכים לנשמותיהם, מעלה אנו עליכם כאילו המלכתם אותי בעולמי וכו', שהרי ע\"ו שיגלה כ\"א חלק התורה השייך אליו, יצאו נשמות חדשות לעולם, ותתקרב הגאולה והיה ה' למלך על כל הארץ.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 44,
      "char_length": 634,
      "timestamp": "2025-02-06T19:14:25.593090"
    },
    {
      "id": "vayakhel_p45",
      "text": "ואתי נמי שפיר מה שדקדקנו בסוף דברי המדרש וכן דוד הוא אומר בשרתו צדק וגו' שהיה פותח ודורש לפניהם ד\"ת שלא שמעתן אוזן מעולם. והכונה שגילה להם חלק התורה השייך לנשמתו, שהם ד\"ת שלא שמעתן אוזן מעולם, כי אי אפשר שיתגלו ע\"י אחר, וע\"כ נקט לשון בשורה, כי מה שגילה להם דוד חלקי התורה השייכים אליו בשורה טובה היא להם שע\"י כך תתקרב הגאולה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 45,
      "char_length": 325,
      "timestamp": "2025-02-06T19:14:25.907756"
    },
    {
      "id": "vayakhel_p46",
      "text": "ועל פי האמור נבא ליישב הדקדוקים בדברי הכתוב ונראה כו על כן הודיענו הכתוב שהקהיל משה את כל העדה כדי לרמוז שהקהיל יחד את כלל ישראל, ולימדם חלקי התורה השייכים להם, כמו שפירשנו בדברי המדרש ילקוט. וז\"ש הכתוב אלה הדברים וגו' פירוש דאלה הדברים קאי על כל התורה, אשר צוה ה' לעשות אותם\" כלומר שיגלה כל אחד חלק התורה השייך לנשמתו. ועל כן נקט ביה עשייה, וכמו שהבאנו לעיל מדברי הזה\"ק כי ע\"ו חידושי תורה אמיתיים נבראים תדיר שמים וארץ חדשים, וע\"י כך מקרבים הגאולה ויבנה במהרה ביהמ\"ק העתיד, אשר ירד בנוי ומשוכלל מן השמים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 46,
      "char_length": 505,
      "timestamp": "2025-02-06T19:14:26.100618"
    },
    {
      "id": "vayakhel_p47",
      "text": "ועל פי זה יש ליישב גם דברי הרמב\"ן ז\"ל שפירש מאמר אלה הדברים וגו' על מעשה המשכן. דהנה ידוע מ\"ש ק\"ז זלה\"ה בישמח משה פ' פקודי שהמקדשות הם העתקה מן המשכן, שנעתקה קדושת המשכן אליהם. ועל כן שפיר י\"ל כדברי הרמב\"ן כי מקרא זה רומז אל הקמת המשכן, אלא שאין הכוונה על משכן שעשה משה במדבר, כי אם על מקדש העתיד אשר יהי' העתקה מן המשכן, ועליו נאמר מקרא זה, שע\"י שיגלו חלקי התורה השייכים לנשמת כל אחד מהם יתקרב קץ הגאולה ויבנה המקדש העתיד.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 47,
      "char_length": 423,
      "timestamp": "2025-02-06T19:14:26.371587"
    },
    {
      "id": "vayakhel_p48",
      "text": "ובדברינו אלה מיושב גם מה שהקשה הכלי יקר ז\"ל, שאם מאמר אלה הדברים מוסב על מעשה המשכן, א\"כ למה חזר הכתוב לומר פעם שנית זה הדבר אשר צוה ה' וגו' על מעשה המשכן, והשתא א\"ש כי תרוייהו צריכי, דמאמר זה הדבר, חוזר אל המשכן, שעשה משה במדבר, ובמאמר אלה הדברים נצטוו על התגלות חלקי התורה השייכים לכל אחד מישראל, וע\"י כך תתקרב הגאולה העתידה ויבנה ביהמ\"ק במהרה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 48,
      "char_length": 346,
      "timestamp": "2025-02-06T19:14:26.596749"
    },
    {
      "id": "vayakhel_p49",
      "text": "ויקהל משה את כל עדת בני ישראל ויאמר אליהם אלה הדברים אשר צוה ה' לעשות אותם ששת ימים וגו' וביום השביעי יהי' לכם קדש וגו'. רבו הדקדוקים בפרשה זו. חדא דקדקו המפרשים למה נאמר ויקהל בפ' זו מה שלא מצינו בכל התורה, ואם להודיע כי פרשה זו בהקהל נאמרה דבר זה למדנו מדכתיב כאן כל\" עדת בני ישראל, וכדאיתא בתורת כהנים פ' קדושים הובא ברש\"י שם דבר אל כל עדת בני ישראל וגו' מלמד שנאמרה פרשה זו בהקהל, ואם כן הכא נמי הוה סגי אילו היה כתוב ויאמר משה אל כל עדת בני ישראל, ותיבת ויקהל למה לי.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 49,
      "char_length": 472,
      "timestamp": "2025-02-06T19:14:26.792182"
    },
    {
      "id": "vayakhel_p50",
      "text": "ב) רש\"י ז\"ל כתב ויקהל לשון הפעיל שאינו אוסף אנשים בידים אלא הן נאספין על פי דיבורו. וצ\"ב וכי למה הוצרך להודיענו שלא הלך משה לאספם בידים, והרי מילתא דפשיטא היא שהיו נאספים על פי דיבורו, ומצינו בפ' וישב ואת כל אשר הם עושים שם הוא היה עושה ופירש\"י כתרגומו במימריה הוה מתעביד הרי שאף דכתיב היה שעושה \" לשון פעל, מפרשינן ליה כאלו הוה כתיב בלשון הפעיל, שנעשה עפ\"י דיבורו, וכ\"ש הכא דכתיב ויקהל שהוא לשון הפעיל, ודאי שפירושו שהיו נאספין על פי דבורו. ובפרט שדיבורו של משה ודאי נחשב כמעשה ממש, כדכתיב (במדבר ט) על פי ה' יסעו בני ישראל ועל פי ה' יחנו ופירש\"י כיון שהיו ישראל חונין עמוד הענן מתמר ועולה ונמשך על גבי בני יהודה כמין סוכה ולא היה נפרש עד שמשה אומר שובה ה' רבבות אלפי ישראל הוי אומר על פי ה' וביד משה, הרי שאמירת משה נחשבה ממש כמעשה. וא\"כ פשיטא שכונת הכתוב לומר שנאספו על פי דבורו, ולמה הוצרך רש\"י להשמיענו זאת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 50,
      "char_length": 812,
      "timestamp": "2025-02-06T19:14:27.032910"
    },
    {
      "id": "vayakhel_p51",
      "text": "ג) בילקוט כאן ובשם מדרש אבכיר) איתא רבותינו בעלי אגדה אומרים מתחלה התורה ועד סופה אין בה פרשה שנא' בראשה ויקהל אלא זאת בלבד אמר הקב\"ה עשה לך קהלות גדולות ודרוש לפניהם ברבים הלכות שבת כדי שילמדו ממך דורות הבאים להקהיל קהלות בכל שבת ושבת וכו' ללמד ולהורות ד\"ת וכו' שיהא שמי הגדול מתקלס בין בני וכו' וכן דוד הוא אומר (תהלים מ) בשרתו צדק בקהל רב וכי מה בשורה היו ישראל צריכים בימי דוד (פי' בזית רענן שכל ימיהם היו בטובה ולא הוו צריכים לבשורה) והלא כל ימיו של דוד מעין דוגמא של משיח היה אלא פותח ודורש לפניהם דברי תורה שלא שמעתן אוזן מעולם עכ\"ל. ולפי\"ז אתו תיבת ויקהל להורות שיקהילו קהלות בכל שבת וכו'. אמנם צריך להבין למה רמזה לנו התורה דבר זה בפרשה זאת דוקא, ואי משום שהוזהרו כאן על מלאכת שבת הרי נאמרה ונשנית אזהרת שבת כמה פעמים בפרשיות הקודמות בפ' יתרו ובפ' משפטים ובפרשת תשא, וכאן לא נאמרה אלא אגב גררא להודיע שאין בנין המשכן דוחה שבת, וא\"כ הוה ליה להשמיענו זאת בפרשה שנאמרו עיקר דיני שבת ואמאי נטר עד הכא.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 51,
      "char_length": 906,
      "timestamp": "2025-02-06T19:14:27.429395"
    },
    {
      "id": "vayakhel_p52",
      "text": "ד) לשון הילקוט שכ' היה דורש לפניהם ד\"ת שלא שמעתן אוזן מעולם צ\"ב. שהרי אמרו חז\"ל (ירושלמי פאה ב' ו') אפי' מה שתלמיד ותיק עתיד להורות לפני רבו כבר נאמר למשה בסיני ואיתא במד\"ר (שמות פ' כ\"ח ד) וידבר אלקים את כל הדברים האלה וגו' א\"ר יצחק מה שהנביאים עתידים להתנבאות בכל דור ודור קבלו מהר סיני וכו' ואף החכמים העומדים בכל דור ודור כל או\"א קבל את שלו מסיני. וא\"כ בודאי כי תורתו של דוד שהיא תורת אמת נאמרה בסיני, ומאי קאמר המדרש שדרש לפניהם דברים שלא שמעתן אוזן.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 52,
      "char_length": 454,
      "timestamp": "2025-02-06T19:14:27.871615"
    },
    {
      "id": "vayakhel_p53",
      "text": "ה) גם ראוי להבין במה מתורצת קושית המדרש וכי מה בשורה היו ישראל צריכים בימי דוד והלא כל ימיו של דוד מעין דוגמא של משיח היה ולא חסרו כל טוב ומאי קא ניחא להו בתירוצם שהיה פותח ודורש ד\"ת, וכי מעיקרא לא הוה ידע כי דוד למד עמהם תורה והלא מבואר כן בכמה פסוקי תהלים. אלא ע\"כ שאעפ\"כ הוקשה לו כי דבר תמידי אין נופל בו לשון בשורה, דבשורה לא שייכא אלא בדבר פתאומי, וא\"כ מה תירץ באמרו שהיה דורש לפניהם ד\"ת שלא שמעתן אוזן מעולם, דהא אין שייך לשון בשורה בדברי תורה שאין להם הפסק לעולם, ומדינא אין להסיח דעתו ממנה, ובודאי שהיו ד\"ת דבר תמידי אצל דוד.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 53,
      "char_length": 533,
      "timestamp": "2025-02-06T19:14:28.200711"
    },
    {
      "id": "vayakhel_p54",
      "text": "ו) אלה הדברים אשר צוה ה' לעשות אותם וגו' הקשו המפרשים דלפי פשטות משמעות הכתוב קאי אומרו אלה הדברים על מצות שבת דסמיכא לוה. וגם חז\"ל (במס' שבת צ\"ז ע\"ב) למדו מכאן ל\"ט אבות מלאכות, וא\"כ הוה ליה למיכתב אלה הדברים אשר צוה ה' שלא לעשות אותם, דהרי עיקר מצות שבת היא בשב ואל תעשה ולא בקום ועשה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 54,
      "char_length": 286,
      "timestamp": "2025-02-06T19:14:28.479521"
    },
    {
      "id": "vayakhel_p55",
      "text": "ז)והרמב\"ן ז\"ל פי' כי אומרו אלה הדברים קאי על מלאכת המשכן וכליו וכל עבודתו והקדים מצות שבת לומר שאין בנין המשכן דוחה אותה ע\"כ. ולדבריו מיושב אומרו לעשות אותם\". אמנם קשה ע\"ז קושית הכלי יקר ז\"ל דהרי כתיב להלן זה הדבר אשר צוה ה' וגו' קחו מאתכם תרומה לה', וא\"כ למה הוצרך לכתוב כאן אלה הדברים וגו'. גם קשה דהול\"ל להקדים אזהרת שבת קודם אומרו אלה הדברים דקאי על מלאכת המשכן, ואמאי הפסיק באמצע הציווי על מלאכת המשכן באזהרת שבת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 55,
      "char_length": 418,
      "timestamp": "2025-02-06T19:14:28.648753"
    },
    {
      "id": "vayakhel_p56",
      "text": "ח) ועוד קשה כי כל הפסוק הזה מיותר הוא ואפי' קאי על מצות שבת, דהול\"ל ויקהל משה וגו' ויאמר אליהם ששת ימים וגו', ולמה ליה להקדים ולסתום הציווי במאמר אלה הדברים, ואח\"כ לפרש מה שלא מצינו כן בשאר ציווום שבתורה, וע\"כ טעמא בעי למה כלל לומר אלה הדברים, ואין בכלל אלא מה שבפרט ומספיק לנו הפרט.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 56,
      "char_length": 283,
      "timestamp": "2025-02-06T19:14:28.874944"
    },
    {
      "id": "vayakhel_p57",
      "text": "ט) גם צריך טעם למה נאמר אאלה\" הדברים, כי כ מקום שנאמר אלה פוסל את הראשונים, ומה בא הכתוב לפסול כאן.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 57,
      "char_length": 99,
      "timestamp": "2025-02-06T19:14:29.082203"
    },
    {
      "id": "vayakhel_p58",
      "text": "י) ששת ימים תעשה מלאכה וגו'. צ\"ב שהרי הכתוב בא להזהיר על איסור מלאכה בשבת, ומה לו להשמיענו היתר מלאכה בששת ומי המעשה מהיכי תיתי לאסור.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 58,
      "char_length": 134,
      "timestamp": "2025-02-06T19:14:29.184193"
    },
    {
      "id": "vayakhel_p59",
      "text": "יא) עוד הקשה הכלי יקר ז\"ל מדוע כתיב תעשה בציר\"י תחת התיו דמשמע שמעצמה תעשה, והול\"ל תעשה מלאכה בפתח. ובמכילתא פ' ויקהל איתא כתוב א' אומר ששת ימים תעשה מלאכה (משמע ע\"ו אחרים) וכתוב אחד אומר ששת ימים תעבוד ועשית כל מלאכתך (שמות כ') (דמשמע שהוא עצמו יעבוד) כיצד יתקיימו שנו כתובים הללו אלא בזמן שישראל עושים רצונו של מקום מלאכתם נעשית ע\"ו אחרים וכו' וכשאין עושים רצונו של מקום מלאכתם נעשית ע\"ו עצמם שנא' ועשית כל מלאכתך ע\"כ. והקשה במרכבת המשנה דלכאורה לא אתיא האי דרשא דמכילתא כר' ישמעאל דסבירא ליה (ברכות דף ל\"ה ע\"ב) הנהג בהם מנהג דרך ארץ חורש בשעת חרישה וזורע בשעת זריעה וכו' והלכתא כר' ישמעאל, ואכתי לר' ישמעאל האי תעשה מאי עביד ביה. וגם ראוי להבין למה מודיענו הכתוב שבזמן שישראל עושים רצונו של מקום מלאכתם נעשית ע\"ו אחרים דוקא במצות שבת, והרי זה שייך בכל המצות שכולם רצונו של מקום הם ותירץ כי נרמז כאן מאמר חז\"ל פ' כל כתבי (דף קי\"ח ע\"ב) כל המענג את השבת וכו' ניצול משעבוד מלכיות וע\"י שמירת שבת ישראל נגאלין. וז\"ש הכתוב ששת ימים תעשה מלאכה עמי אחרים, כאשר ביום השביעי תשבות וכו' עיי\"ש. אבל אכתי קשה כי אם לזאת יכוון הכתוב הול\"ל זאת בפרשה שנאמרו בה עיקר מצוות שבת בפ' יתרו ובפ' משפטים ובכ\"מ בתורה, ולמה השמיענו זאת בפ' ויקהל שלא נאמרה מצות שבת אלא אגב גררא. ותו דבפ' יתרו כתיב במצות שבת ששת ימים תעבוד ועשית וגו', דמשמע ע\"ו עצמו, ולמה כאן נאמר תעשה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 59,
      "char_length": 1247,
      "timestamp": "2025-02-06T19:14:29.283437"
    },
    {
      "id": "vayakhel_p60",
      "text": "יב) ויאמר משה אל כל עדת בני ישראל לאמר זה הדבר אשר צוה ה' לאמר. צ\"ב כפל ב\"פ לאמר. גם צריך להבין אומרו זה הדבר, דזה מיעוטא הוא ומאי אתו למיעוטי.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 60,
      "char_length": 143,
      "timestamp": "2025-02-06T19:14:29.860557"
    },
    {
      "id": "vayakhel_p61",
      "text": "יג) להלן בפרשה ויאמר משה אל בני ישראל ראו קרא ה' בשם בצלאל בן אורי בן חור וגו'. הקשו בעלי התוספות למה נאמר ראו עיי\"ש וליכא למימר שהכוונה כדאי' במדרש רבה פ' תשא עה\"פ ראה קראתי בשם בצלאל (שמות רבה פ\"מ ב) וז\"ל ראה קראתי וכו' א\"ל אני מראה לך ומה עשה הקב\"ה הביא לו ספרו של אדה\"ר והראה לו כל הדורות שהן עתידין לעמוד מבראשית עד תחיית המתים דור דור ומלכיו וכו' א\"ל כל אחד ואחד התקנתיו מאותה שעה וכן בצלאל מאותה שעה התקנתיו וכו' עכ\"ל. שהרי הכא א\"א לומר כי הראה משה לישראל ספרא דאדם קדמאה, כי בודאי לא זכו כל ישראל לראות ספרא דאדם קדמאה, שהוא בחינת נבואה או בחינת רוה\"ק גבוהה, כמ\"ש הספה\"ק, ומשה גילה להם רק בדבור וא\"כ למה נאמר ראו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 61,
      "char_length": 621,
      "timestamp": "2025-02-06T19:14:29.971392"
    },
    {
      "id": "vayakhel_p62",
      "text": "יד) בגמרא ברכות (דף נ\"ה ע\"א) א\"ר יצחק אין מעמידין פרנס על הציבור אא\"כ נמלכין בציבור שנא' ראו קרא ה' בשם בצלאל א\"ל הקב\"ה למשה הגון עליך בצלאל א\"ל רבש\"ע אם לפניך הגון לפני לא כ\"ש א\"ל אעפ\"כ לך אמור לישראל הלך ואמר להם לישראל הגון עליכם בצלאל וכו'. ופירש\"י ראה קראתי בשם בצלאל ראה משמע הכן את לבבך תן עיניך בדבר. וכיוצא בזה פירש\"י בפ' משפטים עה\"פ ראה אתה אומר אלי וגו' וז\"ל ראה תן עיניך ולבך על דבריך. ע\"כ. הרי כי משמעות ראה גם ראייה שכלית במשמע וכ' החתם סופר ז\"ל כי דברי הגמ' שצוה הקב\"ה למשה להמלך עם הדבור במינוי בצלאל נראים כחולקין על דברי המדרש שהראה הקב\"ה למשה ספרו של אדה\"ר וא\"ל אף בצלאל מאותה שעה התקנתוו, דא\"כ לא היה שייך להמלך בצבור כיון שהתקינו הקב\"ה מראש עיי\"ש.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 62,
      "char_length": 668,
      "timestamp": "2025-02-06T19:14:30.292589"
    },
    {
      "id": "vayakhel_p63",
      "text": "אמנם נ\"ל דאין מוכרח לומר דפליגי, עפמ\"ש לעיל כי ספרא דאדם קדמאה לא נתגלה למשה בבחי' דבור, רק בבחינת מחשבה וידיעה, והידיעה אינה מכרחת את הבחירה. ואפשר דכך היתה הידיעה כי התמנותו תהיה ע\"ו שומלכו בצבור, ולעולם ליכא פלוגתא בין הגמ' והמדרש. עכ\"פ לדברי הגמ' תתפרש תיבת ראו על ראיה שכלית, שא\"ל משרע\"ה שיתבוננו אם הם מסכימין להתמנותו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 63,
      "char_length": 325,
      "timestamp": "2025-02-06T19:14:30.613695"
    },
    {
      "id": "vayakhel_p64",
      "text": "ולכאורה יש להתבונן מדוע לא צוה ה' להמלך בצבור בכל התמנות שהיתה לישראל עד הנה, שהרי כבר נתמנה משה רבינו למלך על ישראל כמאמה\"כ ויהי בישורון מלך (דברים ל\"ג). ואהרן נתמנה כהן גדול, וכן נתמנו הנשיאים והזקנים, ולא מצינו בהם שיצוה ה' שיתמנו ע\"י שומלכו בצבור ויהיו נבחרים על ודם, אלא הכל היה עפ\"י ה' כי הקב\"ה בעצמו שלח משה עבדו ואהרן אשר בחר בו, וכן הנשיאים והזקנים נתמנו ע\"ו משה עפ\"י ה' ברוה\"ק מבלי שימלכו בצבור. וא\"א לומר שגם בהתמנווות אלו נמלכו בצבור: שהרי התמנויות אלו קדמו למינוי בצלאל, ואלו היו נמלכים בצבור גם בהם ודאי לא היה הכתוב שותק מלהשמיענו בהם זאת, ולהורות הלכה זו דנמלכום בצבור: ומדוע המתין עד כאן. אלא ע\"כ שבכל המינוים הקודמים למינוי בצלאל לא נמלכו בצבור, וא\"כ צ\"ב מדוע דוקא במינוי בצלאל היה ציווי הקב\"ה להמלך בצבור. ובאמת לפום סברא לא היה צורך כ\"כ כאן להמלך בצבור, שהרי בהכרח יסכימו כולם, כי לא היה אחר הראוי לכך כמ\"ש ז\"ל יודע היה בצלאל לצרף אותיות שנבראו בהם שמים וארץ, והשי\"ת מלא אותו רוח חכמה. וגם לא היה באפשר שיבנה המשכן ע\"ו אחר, כי היה שייך לשורש נשמת בצלאל, כמ\"ש ז\"ל במדרש הנ\"ל כי אמר הקב\"ה משעת בריאת העולם התקנתו את בצלאל לכך, וא\"כ הדעת נותנת שיסכימו כל ישראל להתמנותו, וגם שלא היתה אלא התמנות לשעה עד גמר המשכן, ואעפי\"כ צוה הקב\"ה להמלך בצבור אם הם מרוצים בהתמנותו כדי להורות הלכה לדורות, כי כל התמנות בישראל תעשה עצו שומלכו בצבור וכפי שתסכים דעת הרוב, וא\"כ על מה זאת עשה ה' ככה בהתמנות משה ואהרן והנשיאים שלא הסכימה דעת כל ישראל עליהם והראיה שערערו עליהם עדת קרח, וגם היתה התמנות שררה על כל ישראל, ולא היתה ההתמנות לשעה כ\"א לעולם, ואעפ\"כ לא צוה ה' שימלכו עם הצבור כלל, כ\"א עפ\"י ד', וטעמא בעי.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 64,
      "char_length": 1511,
      "timestamp": "2025-02-06T19:14:30.798357"
    },
    {
      "id": "vayakhel_p65",
      "text": "טו) ראו קרא ה' בשם בצלאל וגו'. ויל\"ד דהוה ליה למימר ראו קרא ה' לבצלאל, וידוע נדע שקראו השי\"ת בשמו, ולמה כתב בשם בצלאל, והוא יתירא לכאורה. וכן לעיל בפ' תשא שנא' ראה קראתי בשם בצלאל דקדקו המפרשים ז\"ל כי תיבת בשם יתירא היא, ותרצו זה בכה וזה בכה, והאוה\"ח הקדוש והכלי יקר ז\"ל תירצו כי חכמתו וגדולתו רמוזות בשמו, כמ\"ש ז\"ל בצל א\"ל היית ושמעת ע\"כ דקדק הכתוב לומר בשם בצלאל עכ\"ד ז\"ל. אמנם לפי\"ז צ\"ב מדוע לא נאמר כן במשה שקרא ה' בשמו ולא באהרן ולא בכל הנביאים, שהרי ע\"כ לומר כי בכולם שמם מורה על גדולת שורש נשמתם, כמ\"ש בספרים הקדושים כי שמו של האדם מורה על שורש נשמתו בגבהי מרומים: ואמרו ז\"ל במס' ברכות (דף ז' ע\"ב) מנא לן דשמא גרים א\"ר אלעזר דאמר קרא (תהלים מ\"ו) לכו חזו מפעלות ה' אשר שם שמות בארץ אל תקרי שמות אלא שמות ע\"כ. אמנם במשרע\"ה ואהרן וכו' און אנו משיגין הכונה בשמותיהם, אלא בבצלאל שגילו לנו חז\"ל שירמוז אשר התלונן בצל ארל. אבל ברור ששמות משה ואהרן וכל הנביאים ירמזון על פנימיות שורש נשמתן, ובכולם לא נאמר קראתי בשם, ומדוע בבצלאל כתבה תוה\"ק קראתי בשם בצלאל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 65,
      "char_length": 956,
      "timestamp": "2025-02-06T19:14:31.552143"
    },
    {
      "id": "vayakhel_p66",
      "text": "טז) בתנחומא ריש פ' זו ויאמר משה וגו' ראו קרא ה' בשם בצלאל ילמדנו רבינו עד כמה חייב אדם המטפל בכלאים כך תני רשב\"י ובגד כלאים שעטנז לא יעלה עליך (ויקרא י\"ט) אפי' על גבי מאה כלים אסור לו ללבוש וכו' אמר הקב\"ה לישראל שמרו מצותי וחקותו למה ששכר מצוה מצוה ושכר עבירה עבירה בן עזאי אומר מצוה גוררת מצוה ועבירה גוררת עבירה א\"ר מאיר על כל מצוה שאדם עושה מוסרין לו מלאך לשמרו עשה מצוה אחת מוסרין לו מלאך אחד עשה מצות הרבה מוסרין לו מלאכים הרבה לשמרו כל זמן שאדם מרבה במצות הוא קונה שם טוב לעצמו וכו' תדע לך שהרי בצלאל ע\"י שקנה שם טוב זכה שיעשה מלאכת המשכן וכו' שנאמר ראו קרא ה' בשם בצלאל עכ\"ל המד\"ת. והמדרש הזה אומר דרשוני חדא מה שייכא מצות כלאים לפ' הקמת המשכן. גם מ\"ש המדרש כאן כי על מצוה כל שעושה מוסרין לו מלאך א' לשמרו. למה השמיענו המדרש זאת במצות כלאים דוקא, והרי בכל המצות הוא כן. גם מ\"ש המדרש בצלאל ע\"ו שקנה שם טוב זכה שיעשה מלאכת המשכן, צ\"ב, וכי רק בעבור שמו זכה לכל הגדולה הזאת, והלא היה מוכן לכך בגודל קדושתו, ומששת ומי בראשית התקינו הקב\"ה לכך, כי משרש נשמתו היה עומד לבנות את המשכן, ומשום כך זכה להקרא בשם בצלאל, וודאי כי אלו היה אדם אחר נקרא בשם בצלאל לא היה זוכה שיוקם המשכן על ידו, וא\"כ לא מן השם הוא זה אשר הונף ואשר הורם להיות ממונה על מלאכת המשכן.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 66,
      "char_length": 1154,
      "timestamp": "2025-02-06T19:14:32.050078"
    },
    {
      "id": "vayakhel_p67",
      "text": "וטרם נבא לבאר כל הענין נציע דברי הרמב\"ם ז\"ל בפ\"ע מהלכות כלי המקדש (ה\"א ז') וניישבם על מכונם וז\"ל, כיצד מעשה החושן אורג בגד מעשה חושב מן הזהב והתכלת וכו' וקובע בו ארבעה טורים של אבן המפורשים בתורה וכו' ומפתח על האבנים שמות השבעים כתולדותם כותב על האודם ראובן ועל ישפה בנימין וכותב בתחלה למעלה מראובן אברהם יצחק ויעקב וכותב למטה מבנימין שבעי י\"ה כדי שיהיו כל האותיות מצויות שם עכ\"ל. וכתב הכסף משנה כי מקור דבר זה מהגמ' יומא (דף ע\"ג ע\"ב) וז\"ל כיצד נעשית ר' יוחנן אמר שהיו האותיות בולעות ר\"ל אמר מצטרפות והקשו והא לא כתיב בהו צד\"י (פירש\"י בכל השבעים ואם היה צריך לה וכו' מהיכן היא באה) א\"ר שמואל בר יצחק אברהם יצחק ויעקב כתיב שם והא לא כתיב עי\"ת א\"ר אחא בר יעקב שבעי ישורון כתיב שם וכו', עכ\"ל הגמ'. ובירושלמי ספ\"ז דיומא וז\"ל אית תניי תני הקול היה שומע ופי' בפ\"מ הקול היה שומע, הכהן והשיב כן להנשאל) אית תניי תני הכתב היה בולע וכו' מ\"ד הכתב היה בולט והא לות חי\"ת בשבטים ולא צד\"י ולא קו\"ף בשבעים ופי' למ\"ד הכתב היה בולט א\"כ היה צריך שיהיה בכתב החושן כל הא\"ב והא לית חי\"ת וכו' בכתב השבטים) אברהם יצחק ויעקב כתיב עליהן והא לית עי\"ת בשבעים כל אלה שבטי ישראל (בראשית מ\"א) היה חקוק עליהן עכ\"ל הירושלמי. וכ' הכ\"מ ווש לתמוה למה שינה רבינו לכתוב שהיה כתוב למטה שבטי וה במקום שבעי ישראל דירושלמי או ישורון דגמ' דידן וי\"ל דכיון דבחד גמרא כתיב הכו ובאידך גמרא כתיב הכי משמע דישראל וישורון לאו דוקא דלא אתי למימר אלא דכתיב טית וכיון שכן עדיף לן למימר דהוה כתיב שבטי י\"ה דכתיב ביה עדות לישראל דדמי למאי דכתיב בחשן לזכרון לפני ה', עכ\"ד הכ\"מ ז\"ל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 67,
      "char_length": 1425,
      "timestamp": "2025-02-06T19:14:32.617731"
    },
    {
      "id": "vayakhel_p68",
      "text": "והקשה החתם סופר זללה\"ה (בחי' עה\"ת דפוס ירושלים) ע\"ד הכסף משנה ז\"ל שתירוצו תמוה יותר מקושיתו. והכוונה דהרי כלל גדול הוא, כי בכל מקום שהבבלי חולק עם הירושלמי הלכה כדברי הבבלי, וא\"כ הו\"ל לרמב\"ם ז\"ל להכריע להלכה כדברי הבבלי, או עכ\"פ כחד מנהון, ולמה כתב שלא כדברי שניהם. על כן תירץ החת\"ס ז\"ל דהנה לכאורה צ\"ב דעת התלמוד בבלי דס\"ל שהיה כתוב בחשן שבעי ישורון. לשון שלא מצינו בשום פסוק, ויותר מסתברא כדעת הירושלמי שהיה כתוב שבעי ישראל, דהוא לישנא דקרא בפ' ויחי. וצריך לומר כי מסתמא קבלה היתה ביד חכמי תלמודנו שבבבל כו היה כתוב באבני החשן שבעי ישורון. ע\"כ אומר אני מסברא דשם ישראל מורה כשצריכים סעד לתומכם ולהיישיר דרכיהם לעבודת השי\"ת, אז הם מכונים בשם ישראל אותיות ישר אל כו הם צריכים לעזר השי\"ת לישר מעלליהם. אמנם מצינו בפ' ברכה שקורא אותם הכתוב ישורון, דכתיב אין כא\"ל ישורון כי שם ישורון מורה כו הם ישרים ושלמים מאליהם בלי סעד, ושם זה חשוב יותר מישראל. ומעתה היתה קבלה ביד חכמי התלמוד בבלי אשר בחושן של אהרן הכהן נכתב שבעי ישורון. לאשר דור המדבר היו במדרגה גבוהה. אך אח\"כ שנתקלקלו הדורות הוצרכו לאבני חשן חדשים, ומכ\"ש בבית שנו לא היו כותבין ישורון, אלא לישנא דקרא כל אלה שבטי ישראל, נמצא כי לא פליגי הבבלי והירושלמי ואו\"א דברי אלקים חיים. וס\"ל להרמב\"ם ז\"ל דכ\"ז אם און צריכין עדות שהם בני א\"ל חי בנו אבותיהם, אז יש לחלק בין ישראל לישורון אבל אם צריכין לעדות, כמו שהיה בדור יוצאי מצרים שאמרו חז\"ל בפסיקתא (הובא ברש\"י פ' פנחס) לפי שהיו האומות מבזין אותם ואומרים מה אלו מתיחסין על שבטיהן סבורים הם שלא שלטו המצרים באמותוהם אם בגופם היו מושלים ק\"ו בנשותיהם לפיכך הטיל הקב\"ה שמו עליהם ה\"א מצד זה ויו\"ד מצד זה לומר מעיד אני עליהם שהם בני אבותיהם וזה הוא שמפורש עזו דוד שבטי י\"ה עדות לישראל (תהלים קכ\"ב) השם הזה מעיד עליהם לשבטיהם וכו', עכ\"ל רש\"י ז\"ל. וה\"נ בבית שני דכתיב (איכה ה) נשים בציון ענו בתולות בערי יהודה, וס\"ל לר' יוחנן אליבא דחד אמורא אין מקבלין גרים מתרמוד (יבמות ט\"ז ע\"ב) משום בנות ירושלים שבאו עליהם עכו\"ם בחורבנה. ומסקנת הגמרא דלא כר' יוחנן. כי לא נתערב זרע ישראל בזרע עכו\"ם, אלא שמרן הקב\"ה בדרך נס כדאיתא בגמ' שם (דף י\"ז ע\"א) גמירי דבנתא דההוא דרא איצטרויי אוצטרי (פירש\"י נבקע רחמן מלקלוט זרע ונעשו עקרות). וכן איתא שם בגמ' שעל מדוכה זו ישב חגי הנביא ואמר מקבלין גרים וכו' ומן התרמודיין, עיי\"ש. ומעתה היה ראוי ונכון לכתוב על אבני החושן לזכרון לפני ה' עדות זו, שהם שבטי י\"ה ולא נתערב בהם זרע פסול, כי שמו יתברך מעיד עליהם שהם בני אבותיהם. והשתא א\"ש, כי ידוע שר' יוחנן הוא מסדר הירושלמי, ע\"כ אזיל לשיטתיה דס\"ל ביבמות כי אין מקבלין גרים מתרמוד, כי יש חשש שנתערבו בהם בנות ישראל, וע\"כ ס\"ל שהיה כתוב בחשן שבטי ישראל, מבלי עדות שם הי. אבל הרמב\"ם ס\"ל כמסקנת תלמודא דידן ודלא כר' יוחנן. כי לא נתערבו זרע עכו\"ם בזרע ישראל, ע\"כ ס\"ל שהיה נכתב על אבני החשן שבעי י\"ה, כי הוא עדות לישראל. עכת\"ד החת\"ס זלה\"ה. ובאמת קשה להבין תירוצו ז\"ל, וכמ\"ש הוא ז\"ל על דברי הכ\"מ שתירוצו תמוה יותר מקושותו, כן יפלא על תירוצו, דמאי קאמר שהרמב\"ם ס\"ל כמסקנת תלמודא דידן וע\"כ כתב שהיו חקוק בחשן שבטי ו\"ה כי הוא עדות לישראל והרי גמ' דילן ס\"ל שהיה כתוב בחושן שבעי ישורון, ואכתי שיטת הרמב\"ם דלא כמאן, ובפרט שהוא חולק עליהם בדבר שהוא מציאות, ורבותינו בעלי התלמוד קבלה היתה בידם שכך היה כתוב באבני החשן, למר כדאית ליה ולמר כדאית ליה, ואלו ואלו דא\"ח: ובודאי היה להם טעם נכון לקבלתם והיאך יתכן שתפס הרמב\"ם שיטה חדשה מסברא דנפשיה, היפך קבלת חז\"ל ח\"ו, ובודאי לא ניתן להאמר כן. וצריך ישוב נכון לדעת הרמב\"ם ז\"ל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 68,
      "char_length": 3166,
      "timestamp": "2025-02-06T19:14:33.296276"
    },
    {
      "id": "vayakhel_p69",
      "text": "ואפשר לומר כו מ\"ש הרמב\"ם ז\"ל שהיה כתוב באבני החשן שבעי י\"ה יש לו מקור נאמן בדברי חז\"ל, והוא בזוה\"ק פ' פקודי במאמר ר' יוסי ור' חייא שם, ועפ\"י זה יתיישבו גם שיטת הבבלי והירושלמי כמו שיתבאר. ונקדים לזה הקדמה קטנה שנתבארה אצלינו בכמה מקומות, כו מה שנמצאים בדברי הרמב\"ם ז\"ל כמה מאמרים שלא נמצא מקורם לא בבבלי ולא בירושלמי, ומקור מקומם טהור בספר הזוה\"ק, ועל כן יש מן האחרונים שהוכיחו כו ראו עיניו הבדולחים של הרמב\"ם ז\"ל את ספרי הזה\"קו ומשם שאב מקורם. אמנם באמת נראה אשר לא כן הוא שלא נתגלה עדיין ספר הזוה\"ק בימיו, אבל הסברתי הדבר עפ\"י פשטות, כו ידוע אשר בימי הראשונים ז\"ל היו מצויים הרבה מדרשי חז\"ל בכת\"י ואור הדפוס לא נגה עליהם. (ומחמת הגזירות והרדופות שהיו על בני ישראל בארצם פזוריהם ומכללם גזירת ספרי הקדש נאבדו מדרשים אלו). ואפשר שהרמב\"ם ז\"ל שאב מקורו מדברי חז\"ל במדרש, ואותם המימרות נמצאים גם בזה\"ק, כו בדברי הזה\"ק יש מאמרים רבים מלוקעים מדברי התנאים והאמוראים ז\"ל, ורבים מהמאמרים בספר הזה\"ק נמצאים גם במדרשים שלפנינו, ואפשר כי כל אלו ההלכות שפסק הרמב\"ם ז\"ל ואין אנו יודעים מקורם, לקוחים הם ממדרשי חז\"ל שהיו בימיו וספו תמו ברבות הימים ואותם מאמרים נמצאים גם בזה\"ק כנ\"ל שבספר הזהר יש הרבה מאמרי חז\"ל מן המדרשים, אבל הרמב\"ם ז\"ל לא ראה את ספר הזה\"ק, כו לא נראה בעליל אורו הבהיר של ספר הזה\"ק בימי הרמב\"ם ז\"ל, וזה ברור ואמת מבלי ספק.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 69,
      "char_length": 1227,
      "timestamp": "2025-02-06T19:14:34.459735"
    },
    {
      "id": "vayakhel_p70",
      "text": "ומעתה יתבארו שיטות הבבלי והירושלמי ופסק הרמב\"ם ז\"ל בטעם נכון. כי שיטת הרמב\"ם ז\"ל יש לה מקור בדברי הזה\"ק, ובודאי שהרמב\"ם ז\"ל אח מקורה הערה ממדרשי חז\"ל שהיו בימיו, שהם מתאימים לדברי הזה\"ק. ונעתיק תוכן דברי הזה\"ק פ' פקודי עה\"פ ויעש את האפוד וגו' (ח\"ב דף רכ\"ט ע\"ב) אזר יוסי אפוד וחשן כחדא הוו וכו' קיימן כל אינון תריסר אבנין כלהו נעלי שמהן בני ישראל וכלהו תריסר תחומין עלאין (י\"ב צירופי הוי\"ה הגהות מהרח\"ו) כלהו ברזא דשבטי ישראל אינון ורזא דא כתיב (תהלים קכ\"ב) ששם עלו שבטים שבעי י\"ה עדות לישראל להודות לשם ה' ששם עלו שבעים אלין אינון תריסר שבעין עלאין לעילא דאינון שבטי י\"ה דהא שמא דא עדות לישראל א\"ר חייא תרי זימנין כתיב שבעים אלא ששם עלו שבעים אלו שבעין דלתתא שבטי ו\"ה אלו שבעין דלעילא עדות לישראל דא רזא דשמא קדישא עלאה דא דאקרי עדות וכו' ואינון תריסר שבטין קדישין עלאין אינון תריסר אבנין קדישין ועל דא אינון קיימין לתתא כגוונא דלעילא וכו' וכהנא רבא נטיל לון ושוי לון על לביה לדכרא להון תדיר דכתיב ונשא אהרן את שמות בני ישראל על לבו לפני ה' תמיד, עכת\"ד הקדושים לענינינו. עכ\"פ מבואר מדבריו כי תריסר אבנין קדישין דלתתא הם כגוונא דלעילא ותרוסר שבעין דלעילא אינון שבטי י\"ה והם עדות לישראל ודא רזא דשמא קדישא עלאה. ולהלן יתבאר מדוע תפס הרמב\"ם שיטה זו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 70,
      "char_length": 1146,
      "timestamp": "2025-02-06T19:14:35.033362"
    },
    {
      "id": "vayakhel_p71",
      "text": "ועתה נבא לבאר שיטת הבבלי דס\"ל שהיה חקוק באבני החשן שבטי ישורון, ושיטת הירושלמי דסבר שהיה חקוק בו שבטי ישראל, ויש לומר עפימ\"ש האבן עזרא בפ' האזינו עה\"פ וישמן ישורון יש אומרים שהוא מגזרת אשורנו, וכ\"כ הספורנו שם כי גם בעלי העיון שבהם הנקראים ישורון מן אשורנו ולא קרוב ר\"ל שיש להם כח ראייה שכלית פנו אל התענוגים הגשמיים וטח מראות עיניהם ומהשכיל לבותם עיי\"ש. מבואר מדבריהם כו שם ישורון מורה על כח ראיה שכלית ורוחנית. והנה גם הנבואה מכונה בלשון ראיה כמאה\"כ (שמואל א ט') כי לנביא היום יקרא לפנים הרואה. נמצא כו שם ישורון מורה גם על בחינת נבואה שהוא ראיה רוחנית.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 71,
      "char_length": 554,
      "timestamp": "2025-02-06T19:14:35.549427"
    },
    {
      "id": "vayakhel_p72",
      "text": "והנה ע\"י שהיו לישראל האורים והתומים זכו לכח ראיה רוחנית כעין מדרגת נבואה, כמ\"ש זיל במס' יומא שם ואע\"פ שגזירת נביא חוזרת (פירש\"י ז\"ל כגון של יונה בן אמיתי) גזירת אורים ותומים אינה חוזרת שנאמר במשפט האורים (פירש\"י כדין שאינו חוזר) למה נקרא שמם אורים שמאירין את דבריהם תומים שמשלימין את דבריהם. וכתב רש\"י ז\"ל בפ' תצוה כי האורים והתומים הוא כתב שם המפורש שהיה נותנו בתוך כפלי החשן שעל ידו הוא מאיר דבריו וכו' ובמקדש שני היה החשן שא\"א לכ\"ג להיות מחוסר בגדים אבל אותו השם לא היה בתוכו וכו' עכ\"ל. וכ\"כ הרמב\"ן ז\"ל שהיו שמות קדושים מכוחם יאירו האותיות מאבני החשן אל עיני הכהן, עכ\"ל. אמנם בבית שנו שבטלו האורים והתומים כמאחז\"ל במס' סוטה (דף מ\"ח ע\"א) משמתו נביאים הראשונים בעלו אורים ותומים, וכמ\"ש רש\"י ז\"ל שאותו השם לא היה בתוכה, ניטל מהם כח הראיה הרוחנית.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 72,
      "char_length": 746,
      "timestamp": "2025-02-06T19:14:35.829266"
    },
    {
      "id": "vayakhel_p73",
      "text": "ומעתה אפ\"ל כו בחושן המשפט שנשא אהרן הכהן על לבו, וכן כ\"ז שהיו ישראל במדבר, וכל זמן בית ראשון, היה כתוב על אבני החשן שבעי ישורון כי ע\"י השם המפורש שהיו נתון בו היו מאירים דבריהם, וזכו ישראל להגיע לכעין בחינת נבואה, וע\"ש כך נקראו בשם ישורון המורה על בחינת נבואה, כי אותיות השבעים שהיו חקוקים באבני החשן היו מראים להם עניני העתידות בדרך נס וע\"כ נקראו שבטי ישורון ע\"ש שמות השבטים המאירים בהם, אבל בבית שני שניטל מהם כח הראייה, כי לא היה השם הקדוש נתון בון כפלי החשן. נמצא כי כל פעולת החשן היתה להעלות זכרונם של ישראל לפני ה\"נ כמאה\"כ ונשא אהרן את שמות בני ישראל על לבו לזכרון לפני ה' תמיד, ע\"כ בחושן שהיה בזמן בית שנו היה כתוב שבטי ישראל, ע\"ש פעולתם להעלות זכרונן של ישראל לפני אביהם שבשמים, אבל מדרגת ישורון ופעולתה לא היה להם עוד. ולפי\"ז י\"ל דהא דאיתא בירושלמי שהיה כתוב באבני החשן שבעי ישראל, מיירי מן החשן אשר היה בזמן בית שני, שלא היתה להם מעלת ישורון.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 73,
      "char_length": 852,
      "timestamp": "2025-02-06T19:14:36.178355"
    },
    {
      "id": "vayakhel_p74",
      "text": "ואפשר כי ר' יוחנן מסדר הירושלמי זכה עוד לראות במו עיניו את החשן שהיה בזמן בית שנוי, והוא עפימ\"ש בסדר הדורות וסדר תנאים ואמוראים) בשם ס' שלשלת הקבלה שחי ר' יוחנן יותר מג' מאות שנה, ובשם כת\"י ושן כתב שחי ארבע מאות שנה, ואין מבורר לנו אימת התחילו שנותיו, כי מצינו בגמ' (ב\"ב דף כ\"ח ע\"א) א\"ר יוחנן שמעתי מהולכו אושא ופירש\"י י' גליות שגלתה סנהדרין מיבנה לאושא, והיה זאת בימי ר\"ג דיבנה שהיה בזמן החורבן כמ\"ש בסדר הדורות. ואם הוא ר' יוחנן מסדר הירושלמי נמצא שהתחילו שנותיו בערך לפני החרבן, ושלמו בימי ר' אשו שהוא ג' מאות שנה אח\"כ, ובפרט לפי הכת\"י המובא בסדר הדורות שחי ד' מאות שנה, נמצא כו היה זמן רב קודם החרבן. ואף אם תמצא לומר כי ר' יוחנן דבגמ' ב\"ב הנ\"ל ששמע מהולכו אושא הוא ר\"ו אחר ואינו ר' יוחנן מסדר הירושלמי, כמו שרוצה להוכיח הרב בעל סדר הדורות דר' יוחנן מסדר הירושלמי נולד בימי רבי. מ\"מ כיון שהיה בדור של התנאים, ובלי ספק שעדיין היו בימיו מזקני התנאים, ששמע ר\"ו מפיהם מה שראו בעיניהם את החשן שהיה בבית שני, ע\"כ בחר ר' יוחנן לכתוב בירושלמי שבעי ישראל, כמו שהיה חקוק על החושן שהיה בבית שני.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 74,
      "char_length": 988,
      "timestamp": "2025-02-06T19:14:36.600350"
    },
    {
      "id": "vayakhel_p75",
      "text": "אמנם רבינא ורב אשי שהיו סוף האמוראים, ונשכח כבר בדורם מה שהיה בבית שני, כי לא היו בימיהם עדי ראיה, וכל מה שידעו היה בקבלה, ע\"כ בחרו יותר לכתוב שבעי ישורון. כמו שהיה כתוב על חשן אהרן וכל ימי בית ראשון. כי היא המדריגה אשר אנו מצפים אליה לעתיד, כשיחזרו לנו האורים והתומים וכח הנבואה, ונמצא כו לא פליגי הבבלי והירושלמי כלל, ואלו ואלו דברי אלקים חיים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 75,
      "char_length": 346,
      "timestamp": "2025-02-06T19:14:37.098475"
    },
    {
      "id": "vayakhel_p76",
      "text": "ועתה נבא לבאר דעת הרמב\"ם ז\"ל מי\"ט כתב כדעת הזוה\"ק ולא הלך בשיטת הבבלי או הירושלמי. דהנה במס' סוכה (דף מ\"א ע\"א) איתא משחרב ביהמ\"ק התקין ר' יוחנן בן זכאי וכו' ושיהא יום הנף כולו אסור מ\"ט מהרה יבנה ביהמ\"ק וכו' ומפרש בגמ' דחיישינן לשמא יבנה בליל ששה עשר או ביום חמשה עשר סמוך לשקיעת החמה. והקשו רש\"י ותוס' שם הא און בנין ביהמ\"ק דוחה יו\"ט וכן אין בונין ביהמ\"ק בלילה ותירצו ה\"מ בנין הבנוי בידי אדם אבל מקדש העתיד שאנו מצפים בנוי ומשוכלל הוא יגלה ויבא משמים שנא' (שמות ט\"ו) מקדש ה' כוננו ידיך. וכן תירצו הרשב\"א והריטב\"א ז\"ל. ומבואר כן בזוה\"ק פ' פנחס (דף ר\"כ ורכ\"א) דבנין העתיד לא יהיה ע\"ו אדם אלא בונה ירושלים ה' איהו ולא אחרא וכו' דאפילו קרתא דירושלים לא ליהוי אומנתא דבר נש וכו' כ\"ש ביתא דאיהו דוורא דיליה, עכלה\"ק. מבואר מדבריו שלא יהיה בנין בני אדם בבית השלישי כלל, אלא ירד כולו בנוי ומשוכלל מן השמים. ועיין בספרי ויואל משה (מאמר שלש שבועות סי' ס' ס\"א וס\"ב) שהארכתי ליישב הסתירות בדברי חז\"ל בענין זה, כי מבואר במד\"ר פרשת צו (פ\"ט) שהמלך המשיח יבנה ביהמ\"ק העתיד, ובירושלמי מס' מגילה (פ\"א הי\"א) משמע דעולי גליות יבנו אותו, וגם הרמב\"ם זל כתב (פי\"א ה\"ד הלכות מלכים) אחד מסימני מלך המשיח שהוא מזרע דוד ויבנה ביהמ\"ק. והערוך לנר במס' סוכה שם ישב הסתירה כי תרוייהו איתנייהו ביה מעיקרא יבנה המקדש בידי אדם, ואח\"כ יבוא הביהמ\"ק של מעלה לתקן הבית שנבנה כנשמה בתוך הגוף. וכעין זה כתב ק\"ז ביוטב פנים. ולכאורה תירוץ זה הוא רק ליישב הסתירה בדברי חז\"ל, אבל בדעת רש\"י ותוס' א\"א לומר כן, ולדבריו אכתי תקשה קושית רש\"י ותוס' שם איך אפשר לבנות ביהמ\"ק ביו\"ט ובלילה, שהרי יהי' בנוי גם בידי אדם. וע\"ש בספרי ויואל משה (שם סי' ס\"ד) שכתבתי ליישב דבריהם בשני אופנים עיי\"ש.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 76,
      "char_length": 1538,
      "timestamp": "2025-02-06T19:14:37.311177"
    },
    {
      "id": "vayakhel_p77",
      "text": "ובפשטות אפ\"ל עפ\"י מה שאמה\"כ ביוסף כשהיה בבית האסורים ואת כל אשר עושים שם הוא היה עושה ופי' התרגום במימריה הוה מיתעביד. וא\"כ י\"ל שאף במקומות שאמרו שהמלך המשיח יבנה ביהמ\"ק, און הכונה שהוא בעצמו יבנה בידים, אלא על פו דבורו יבנה, שבכח דיבוריו ותפלותיו הקדושים תהיה אותה ההשפעה שיבא ביהמ\"ק בנוי ומשוכלל מן השמים. ולפי\"ז ל\"ק קושית רש\"י ותוס' הנ\"ל, כי בנין כזה מותר לבנות ביו\"ט ובלילה, עיי\"ש באורך.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 77,
      "char_length": 391,
      "timestamp": "2025-02-06T19:14:38.055614"
    },
    {
      "id": "vayakhel_p78",
      "text": "עכ\"פ לדברי הכל יבוא ביהמ\"ק העתיד בנוי ומשוכלל מן השמים, ובודאי שגם כלי המקדש ובגדי הכהונה ירדו מן השמים, וע\"כ באבני החושן העתיד יהיה חקוק שבטי י\"ה, כמ\"ש בזה\"ק פ' פקודי הנ\"ל דשבטום דלעילא אינון שבטי י\"ה עדות לישראל. וע\"כ כשירד החשן משמים יהיה החושן דלעילא ויהי' רשום בו שבטי י\"ה, ואפשר שאפי' לדעת הסוברים כו יעשה הכל בידי אדם ואח\"כ ירד ביהמ\"ק בנוי ומשוכלל מן השמים, כדוגמת הנשמה בתוך הגוף, כמ\"ש לעיל בשם הערוך לנר והיוטב פנים, מ\"מ בלי ספק יעשוהו בדוגמא דלעילא לגודל השגתם, וכמבואר במד\"ר פ' צו הנ\"ל שמלך המשיח עצמו יבנהו, וגם לצד שישיגו כי עשייתם הוא הכנה להוריד קדושת המקדש דלעילא, ודאי שיעשו אותו ואת כל כליו כמתכונת ביהמ\"ק של מעלה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 78,
      "char_length": 632,
      "timestamp": "2025-02-06T19:14:38.302468"
    },
    {
      "id": "vayakhel_p79",
      "text": "ומעתה נתברר לנו בבירור גמור כי בחושן העתיד יהיה כתוב שבעי ו\"ה, ומעתה אפ\"ל כי הרמב\"ם ז\"ל פירש בהלכותיו תמונת החושן באופן שיהיה לעתיד, ואז יהי' דוגמא דלעילא, ויהיה חקוק בו שבטי י\"ה, והטעם שלא ביאר הרמב\"ם צורת החשן שהיה במדבר ובבית ראשון המובא בבבלי או צורת החשן בבית שני המבואר בירושלמי, כי אין לנו עוד נפק\"מ בזה דמאי דהוה הוה, ע\"כ כתבו כתמונתו לעתיד. ואע\"ג שהוא הלכתא למשיחא וכבר כתב הרמב\"ם ז\"ל בהלכות מלכים (פי\"ב) כי הענינים שאחר ביאת המשיח לא ודע אדם איך שיהיו עד שיהיו שדברים סתומים הם אצל הנביאים וכו'. מ\"מ בענין זה היה לו מקור נאמן בדברי חז\"ל, כמבואר בזה\"ק, כי ביהמ\"ק העתיד ירד בנוי ומשוכלל משמים, ומבואר בזה\"ק פ' פקודי כי בחושן דלעילא כתובים בו בחינת שבטי י\"ה, וברור שהשיג הרמב\"ם דברי חז\"ל אלו, ומקורם הערה ממדרשים שהיו נמצאים לפניו, ואבדו מאתנו ע\"כ כתבו כתמונתו שלעתיד. והוא דוגמת מה שכתב התויו\"ט ביומא ופ\"ה מ\"ה) לתרץ דברי הרמב\"ם ז\"ל שפסק (בהלכות בית הבחירה פ\"ב ה\"ב) כת\"ק דר' יוסי (יומא נ\"א ע\"ב) כי ב' פרוכות הבדילו בין הקודש וקדשי הקדשים. ובהלכות עבודת יוהכ\"פ (פ\"ד ה\"א) משמע דפסק כר\"י דלא היתה שם אלא פרוכת אחת ותירץ התויו\"ט דבהלכות עבודת יוהכ\"פ דלאורויי לן סדר העבודה הוא בא ע\"כ כתב בדרך שיהיה לעתיד כשתחזור עבודת ביהמ\"ק למקומה ב\"ב עיי\"ש וכמו כן אנו נאמר שהרמב\"ם אורי לן את צורת הבגדים שילבש הכהן גדול כשתחזור עבודת בית המקדש למקומה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 79,
      "char_length": 1241,
      "timestamp": "2025-02-06T19:14:38.661017"
    },
    {
      "id": "vayakhel_p80",
      "text": "ואפשר לומר עוד כי ע\"כ לא כתבו ב' התלמודים את תבנית החושן העתיד, לפי שהיו בתוך אלף שנה לחורבן הבית ומבואר בזוה\"ק בכמה מקומות כו בתוך אלף שנה היתה מוכרחת גזירת הגלות, ועיין בספרי ויואל משה (מאמר א' סי' ע\"ג וע\"ד) שנתקשה בזה האברבנאל בספרו ישועות משיחו, שהרי מצינו כמה מימרות שהיתה מועילה תשובה גם בתוך אלף השנים. והחיד\"א בשם הגדולים האריך בזה טובא ותירץ עפ\"י מה דאיתא בזוהר חדש (פ' נח דף מ' דפוס מונקאטש) דאפילו כנישתא חדא דתייבין בזכותא איתכניש. ואפשר שבתוך האלף שנים לא הוה סגיא תשובה דכנושתא חדא להביא את הגאולה כי אם ע\"י תשובת כל ישראל אבל אחר האלף שנים מהני תיובתא דרישו כנישתא או כנישתא חדא עיי\"ש. עכ\"פ אפשר שע\"כ לא כתבו בתלמוד בבלי ובירושלמי תבנית החשן העתיד, כי עדיין לא היה זמנו והוו הלכתא למשיחא, ע\"כ כתב ר' יוחנן מסדר הירושלמי תבניתו כפי אשר ראהו בבית שנו, או שמע מפי זקני החכמים אשר עדיין ראוהו, והבבלי כתבו כפי מה שהיה במקדש ראשון, שהיה בבחינה גבוהה יותר, שזכו ישראל לבחינת נבואה ע\"י האורים והתומים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 80,
      "char_length": 909,
      "timestamp": "2025-02-06T19:14:39.238572"
    },
    {
      "id": "vayakhel_p81",
      "text": "אולם הרמב\"ם ז\"ל שכבר היה באלף השני לחורבן הבית, שכבר עברו אלף השנים שבהם היתה גזירת הגלות מוכרחת, ואז הוה כל יומא ויומא זימניה, וכמ\"ש בזה\"ק (שמות דף י\"ז ע\"א) שגזרת הגלות היתה רק על אלף שנים ולא יתיר כדכתיב כל היום דוה (איכה א') ויומו של הקב\"ה אלף שנים ומה שנתארך הגלות אחר אלף שנים הוא משום שלא עשו ישראל תשובה עיי\"ש. וכיון שהיה כבר זמן הראוי לגאולה בימי הרמב\"ם ז\"ל, ע\"כ פירש לנו תבנית החשן העתיד, ולא חידש דבר מדעתו כפי מה שביארנו לעיל כי מקורו טהור בדברי רז\"ל, וא\"ש כי לא פליג הרמב\"ם עם הבבלי והירושלמי, דמר אמר חדא ומר אמר חדא.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 81,
      "char_length": 530,
      "timestamp": "2025-02-06T19:14:39.686790"
    },
    {
      "id": "vayakhel_p82",
      "text": "ואפ\"ל עוד בחינה לבאר דעת הרמב\"ם ז\"ל עפ\"י דאיתא בילקוט ר\"פ האזינו (מובא בדברנו בכמה מקומות) עתידה כנסת ישראל שתאמר לפני הקב\"ה רבש\"ע הרי עדי קיימין שנא' (דברים פ\"ל) העידותי בכם היום את השמים ואת הארץ אמר לה הריני מעבירן שנא' כי הנני בורא השמים החדשים (ישעי' ס\"ה) אומרת לפניו רבש\"ע הריני רואה מקומות שקלקלתו בהם ובושתי שנא' (ירמי' ב) ראי דרכך בגיא א\"ל הריני מעבירם שנא' כל גיא ינשא (ישעי' מ') אומרת לפניו רבש\"ע הרי שמי קיים א\"ל הריני מעבירו שנא' וקורא לך שם חדש (ישעי' ס\"ט) אומרת לפניו הרי שמו קרוי על שם הבעלים אומר לה הריני מעבירו שנא' והסירותי את שמות הבעלים מפיה (הושע ב) אומרת לפניו רבש\"ע אעפ\"כ בני בית מזכירין אותי ואומר לה ולא יזכרו עוד בשמם (הושע ב) וכו' עכ\"ל הילקוט. והנה לכאורה אינו מובן למה יבושו ישראל לעתיד בשמם, והרי שם ישראל קבלו מיעקב אבינו ע\"ה, והם מכונים בו כשהם במדרגה גדולה, ועל מה ולמה יתבוששו להקרא בו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 82,
      "char_length": 821,
      "timestamp": "2025-02-06T19:14:39.966727"
    },
    {
      "id": "vayakhel_p83",
      "text": "אמנם דברי חז\"ל ברוח הקודש נאמרו כי השיגו ברוח קדשם אשר באחרית הימים בעוקבתא דמשיחא יחטאו ישראל בשם זה, ויעשוהו ר\"ל יסוד למינות, וכל מעשה כפירה ותעתועים יעשו ושם ישראל חתום עליו, ויתפרסם שם ישראל לרעה ולבושת בכל העולמות, ולכן יבושו ישראל בשמם זה לעתיד, ויאמר להם הקב\"ה הריני מעבירו וקורא לך שם חדש. אך לא גילה הקב\"ה את השם החדש אשר יקרא אותנו בו, כדי שלא ותעבוהו עושי רשע, ושמא יחטאו גם בו לכנות שמם עליו, ע\"כ כתיב רק וקורא לך שם חדש אשר פי ה' יקבנו, פי' לעתיד יתגלה שמנו החדש כאשר רוח הטומאה יעביר מן הארץ.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 83,
      "char_length": 506,
      "timestamp": "2025-02-06T19:14:40.362268"
    },
    {
      "id": "vayakhel_p84",
      "text": "ועפי\"ז אפשר להסביר דעת הרמב\"ם ז\"ל, שע\"כ לא תפס כשיטת הבבלי והירושלמי שהיה כתוב דעל אבני החשן שבטי ישראל או שבעי ישורון, כי באלו השמות מכונים ישראל בבית ראשון ובבית שני ומה לו להזכיר השמות אשר ישתנו לעתיד, ויקרא השי\"ת לישראל שם חדש אשר פי ה' יקבנו, וע\"כ הרמב\"ם ז\"ל דמיירי מהחשן שיהי' בבנין העתיד, כתב שיהיה חקוק על אבני החשן שבטי י\"ה, כי זה לא ישתנה לעולם, באשר הוא מורה על דבקותם של ישראל בקב\"ה, ובשם זה מעיד הקב\"ה עלינו כדכתיב (תהלים קכ\"ב) שבטי ו\"ה עדות לישראל, ששם זה מקושר בו יתברך, לא יפול בו חילוף והשתנות כמשה\"כ (מלאכי ג' ו') אני ה' לא שניתי, ובשם זה לא יבושו ישראל לעתיד, כי אדרבה הוא מורה על דביקותם בהשי\"ת ועדותו עלינו. ואפשר שנרמז בפסוק הנ\"ל וקורא לך שם חדש אשר פי ה' יקבנו, כי בשם החדש יהיה מפורש שמו יתברך ויורה על דבקות ישראל בקב\"ה, ומובנת שפיר דעת הרמב\"ם ז\"ל אשר אדניה מיוסדים על דברי חז\"ל במדרש.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 84,
      "char_length": 810,
      "timestamp": "2025-02-06T19:14:40.648351"
    },
    {
      "id": "vayakhel_p85",
      "text": "ועתה נתנה ראש ונשובה ליישב כל הקושיות המוצגים בפתח דברינו, ובתחלה נבאר מה שהקשו המפרשים (קושיא א') שהרי מדכתיב כל עדת בני ישראל ידענו שפרשה זו בהקהל נאמרה, וא\"כ סגי לכתוב ויאמר משה אל כל עדת בני ישראל ותיבת ויקהל יתירא היא. ויתישב בהקדם מה דאיתא במד\"ר פ' תרומה (פל\"ה ד) עה\"פ ועשית את הקרשים למשכן, לא היה צריך לומר אלא ועשית את הקרשים משכן מהו למשכן א\"ר הושעיא ע\"ש שהוא עומד למשכן שאם נתחייבו שונאיהן של ישראל כלייה יהא מתמשכן עליהם, ע\"כ. וכן במד\"ר פ' פקודי (פנ\"א ג) מהו משכן שנו פעמים א\"ר שמואל בר מרתה שנתמשכן שני פעמים על ידיהם זהו שאנשי כנה\"ג אומרים (נחמיה א) חבול חבלנו לך וגו' מהו חבול חבלנו וכו' ואין חבול אלא משכון שנא' לא יחבול רחים ורכב לכך כתיב אלה פקודי המשכן משכן העדות ב' פעמים עכ\"ל. ולכאורה הרי דיה לצרה בשעתה, ולמה רמז הכתוב ביום שמחתם של ישראל שנתבשרו בו על המשכן, את החרבנות העתידות לבא עליהם. אמנם לפי שלא היה עדיין השלימות הגמור, כו שלמות קדושת המקדש תהיה רק בבנין השלישי שיבנה ע\"ו הקב\"ה בעצמו, וירד בנוי ומשוכלל מן השמים, וכמ\"ש לעיל שיהיה המקדש העתיד כלא בדרגא דלעילא. ועל בחינת קדושה זו היו ישראל מתאוים כשנצטוו על הקמת המשכן, אמנם היה צורך להקדים את המשכן ושני המקדשות, כי הם הכנה לבית השלישי, וכמ\"ש ק\"ז הישמח משה זלל\"ה בפ' תצוה עה\"פ כתית למאור לפרש הפ' תביאמו ותטעמו וגו' מכון לשבתך וגו' כי כשראתה חכמתו יתברך אשר אין בכח הארץ הגשמית הלזו לקבל ולסבול נוגה אור קדושת בהמ\"ק השלישי שיבנה בב\"א ע\"כ הקדים ב' המקדשות אשר ע\"י קנתה הארץ כח רוחני ואיכות קדושה נפלאה שתוכל לסבול קדושת בנין שלישי מעשי ודי יוצר עיי\"ש. ע\"כ רמז להם הקב\"ה מיד בצוותו על מלאכת המשכן את החורבנות העתידים לבא אליהם, כדי שיבינו אשר עדיין לא תהי' קדושת המשכן באופן השלמות הגמור שהם משתוקקים עליה ולא תהיה קדושה זו כו אם אחר החרבנות, שתקנה הארץ איכות קדושה נפלאה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 85,
      "char_length": 1650,
      "timestamp": "2025-02-06T19:14:41.047878"
    },
    {
      "id": "vayakhel_p86",
      "text": "ומעתה באשר תכלית רצונו יתברך בציווי מלאכת המשכן והמקדש היתה כדי להקנות בארץ איכות קדושה שתוכל לסבול רום קדושת הבית השלישי, ואז תהיה הקדושה נצחיית, ע\"כ נרמז בפרשיות אלו שבהם נצטוו על בנין המשכן בחינת ביהמ\"ק העתיד, כי זה היא עיקר הרצון והתכלית בציווי המשכן, אלא שלא גילה לנו הכתוב זאת בפירוש, כו אלו הם דברים התלויים בשרש הגאולה, והם בבחינת מליבא לפומא לא גליא. ע\"כ נאמר ברמז בתורה בציווי עשיית המשכן, כל תבנית ביהמ\"ק העתיד, ותבנית כל כליו וערך קדושתו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 86,
      "char_length": 450,
      "timestamp": "2025-02-06T19:14:41.824416"
    },
    {
      "id": "vayakhel_p87",
      "text": "והנה בחינה זו השיג משרע\"ה ולא ניתן רשות לגלותה עד עת קן, ויאירו אל מול עינינו דברי האוהחה\"ק פ' תרומה עה\"פ ככל אשר אני מראה אותך את תבנית המשכן וגו' וכן תעשו פירש\"י לדורות וכו' כשתעשו לי כלי בית עולמים וכו' כתבנית אלו תעשו אותם וכו' והקשה הרמב\"ן ז\"ל וז\"ל ולא ידעתי שיהיה זה אמת שיתחייב שלמה לעשות כלי בית עולמים בתבנית אלו וכו' והאריך האה\"ח הקדוש לישב קושיות הרמב\"ן והרא\"ם ז\"ל ותו\"ד עפ\"י מה שאמר הכתוב הכל בכתב מיד ה' עלי השכיל ואמרו חז\"ל במדרש אגדת שמואל ר' ירמיה בשם ר\"ש בית המקדש מסרה הקב\"ה למשה בעמידה וכו' ונביאים מסרוה לדוד ודוד לשלמה וכו' ע\"כ. הראת לדעת כו כל תבנית המקדש ניתנה למשה מסיני והכל כתוב בתה\"ק ונגלה לדורשו תורה ברוה\"ק, ובזה סרה קושית הרמב\"ן ז\"ל, כי מ\"ש הכתוב ככל אשר אני מראה אותך וגו' קאי גם על תבנית המקדש שהראה הקב\"ה למשה צורתו ותבניתו וע\"ז קאי וכן תעשו לדורות ולא על תבנית המשכן עיי\"ש עכת\"ד. וכמו כן אנו נאמר כי גם תבנית המקדש העתיד הראה הקב\"ה למשה, ודבר זה ברור ואין בזה שום ספק ונרמז בפסוקי פרשיות אלו, כו הוא התכלית והרצון האמיתי בציווי המשכן כנ\"ל, אלא שטמנם הכתוב ברמז.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 87,
      "char_length": 995,
      "timestamp": "2025-02-06T19:14:42.048315"
    },
    {
      "id": "vayakhel_p88",
      "text": "ובהקדמה זו ורווח לנו ויתורצו כל הספיקות והקושיות, ויבואר למה כתוב ויקהל משה (קושיא א) עפימ\"ש בעלי התוס' פ' ויחי (ומובא גם במדרש) עה\"פ האספו ואגידה לכם וכתיב הקבצו ושמעו דתרוייהו לשון קבוץ ואסיפה ותרתי למה לי. אלא כאן רמז להם יעקב כי ילכו ב' פעמים בגלות ויאספו בשניהם, עכ\"ד ז\"ל. וכמו כן אפ\"ל לדרכנו כי כשבא לצוות להם על מעשה המשכן, הרי רמז להם תכלית המשכן שהוא בנין העתיד, ושיקדים לזה החרבנות. ע\"כ רמז להם שיהיה קיבוץ גליות כמה פעמים, ולכן כתיב ויקהל משה לשון הקהלה דהוא יתירא שהרי כבר נאמר כל' עדת בני ישראל אלא להורות שיהיה כמ\"פ קיבוץ גליות. ועפ\"י מה שכתבנו כו מרומז בפסוק זה הגאולה העתידה, יובן הרמז בדברי רש\"י ז\"ל (עיין קושיא ב') ויקהל לשון הפעיל שאינו אוסף אנשים בידים אלא הן נאספין על פי דבורו. כי אף שלא גלה להם שיתארך הגלות זמן זמנים טובא כ\"כ, אבל רמז רמז להם שאסור לדחוק את הקץ, אלא צריך להתפלל אל השי\"ת בתפלות ובתחנונים שימהר ויחיש גאולתנו ופדות נפשנו, אבל אין לעשות מעשה בידים להחיש הגאולה, כי מושבעים אנחנו ע\"ז בג' שבועות, והוא סכנה גדולה ר\"ל. וע\"כ כלפי שאמר הכתוב ויקהל המרמז על קיבוץ גליות כנ\"ל, כ' רש\"י ז\"ל כו הוא לשון הפעיל שאינו אוסף אנשים בידים, ר\"ל שלא תהיה האסיפה והקיבוץ מן הגלות על ידי מעשה בני אדם, אלא הן נאספון על פי דבורו, כי הגאולה העתידה תהיה ע\"ו דיבורי תפלה שמתפללין האבות הקדושים ומשה רבינו ע\"ה וכל הצדיקים בעולם העליון, וע\"י דיבורי תורה ותפלה של דורות ישראל בעוה\"ז בזכות ששופכים לבם בתפלה בדיבורים אמתיים על הגאולה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 88,
      "char_length": 1345,
      "timestamp": "2025-02-06T19:14:42.530433"
    },
    {
      "id": "vayakhel_p89",
      "text": "ובזה יתיישב מה שהקשה הכלי יקר למה כתיב אלה הדברים אשר צוה ה' לעשות אותם, דקאי על מעשה המשכן, והרי נאמר להלן זה הדבר אשר צוה ה' וגו' קחו מאתכם. ולדרכנו אפ\"ל כי מאמה\"כ אלה הדברים ירמוז על ביהמ\"ק העתיד, וע\"כ כתיב אלה פוסל את הראשונים, כי קדושת בית השלישי תעלה על כולנה, שירד כלול בהדרו בנוי ומשוכלל מן השמים, ויהיה נצחי וקיים לעד. וז\"ש הכ' אלה הדברים ר\"ל הבנין השלישי המקוה, אשר צוה ה' לעשות אותם, פי' שנצטוינו לעשות הכנה רוחנית, למען נוכל להשיג קדושתה לעתיד, שהרי לא תתכן בו עשייה בידי אדם, כמ\"ש לעיל בשם הזה\"ק אשר הבית השלישי הוא מעשה ודי יוצר אשר כוננו ידיו. אלא כונת העשיה היא שנכין עצמנו אל הקדושה ההיא כדו שנהיה ראוים אליה. ואמר הכתוב איך תתכן עשיה בבית השלישי שירד בנוי ומשוכלל, ע\"כ אמר ששת ימים תעשה מלאכה וביום השביעי יהי' לכם קדש וגו'. ויבואר עפימ\"ש חז\"ל (שבת קי\"ח ע\"ב) אלמלי שמרו ישראל ב' שבתות מיד היו נגאלין ובזה\"ק מבואר (הקדמת הזוהר דף ה' ע\"ב) שהכונה הוא על שבת אחת דליליא ויממא יחשבו לשתים. וכתב הנועם מגדים בפ' אמור תדע כי לא נשמר שבת כהלכתו בכלל כל ישראל על האופן הצריך מיום נתינת שבת עד הנה דאל\"ה מדוע לא נגאלו ישראל כל זמנים הללו אלא ודאי שמירת שבת כהלכתו דבר יקר עד למאוד ומי יודע מה הוא כהלכתן ועד כמה צריך להיות הדחילו ורחימו והחדוה לשמירת שבת, עכ\"ד ז\"ל. עכ\"פ ברור בדברי חז\"ל שע\"י שמירת שבת כהלכתה נזכה להגאל גאולת עולמים, ויבנה המקדש מכון לשבתו עולמים. וזשה\"כ אלה הדברים אשר צוה ה' לעשות אותם, והוא ציווי לעשות הכנה אל המקדש העתיד, ומפרש הכתוב והולך כי העשיה היא, ששת ימים תעשה מלאכה וגו', כי שמירת שבת כהלכתה זו היא העשיה וההכנה לבנין בהמ\"ק.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 89,
      "char_length": 1462,
      "timestamp": "2025-02-06T19:14:43.194232"
    },
    {
      "id": "vayakhel_p90",
      "text": "ויובנו היטב בזה גם דברי המכילתא כי תעשה פירושו על ידי אחרים, שעל ידי שמירת שבת יזכו לביאת המשיח, ויתקיים הכתוב ועמדו זרים ורעו צאנכם (ישעיה ס\"א), ונזכה לשלימות הגאולה, ואל שלימות המקדש, אשר ירד אלינו בנוי ומשוכלל מן השמים, ואחר כך חזר הכתוב שנית לומר. ויאמר משה אל כל עדת בני ישראל לאמר זה הדבר אשר צוה ה' לאמר קחו מאתכם וגו'. והוא ציווי על עשיית המשכן. שנצטוו לעשותו בפועל ממש, כאומרו קחו מאתכם, כדי שיזכו לקדושת המשכן. אמנם אמר הכתוב זה הדבר זה מיעוטא הוא, כי לא יזכו עדיין אל שלמות קדושת מקדש העתיד, והמשכן הוא רק הכנה אל המקדש העתיד. ואפשר שלכונה זו אמר הכתוב אשר צוה ה' שלאמר\"ל כי המשכן הוכן להיות מקום תפלה לכל ישראל, והוא שער השמים להעלות תפלותיהם, וע\"י תפלות ותחנונים יעשו הכנה אל הגאולה העתידה, ואל שלימות המקדש העתיד. וז\"ש הכתוב זה הדבר אשר צוה ה' לאמר, זה מיעוטא הוא, שקדושת המשכן הוא רק אלאמר\"נ בבחי' אמירה כנ\"ל, שנצטוו לעשות קדושה לשעתה אבל הקדושה השלמה והנצחות תהיה רק לעתיד. ובזה סרו כל הקושיות הנ\"ל בפסוקים לכשתדקדק בהם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 90,
      "char_length": 936,
      "timestamp": "2025-02-06T19:14:43.918064"
    },
    {
      "id": "vayakhel_p91",
      "text": "ועפי\"ז נבוא אל הביאור במאמר הכתוב ראו קרא ה' בשם בצלאל, והקשו המפרשים (עי' קושיא ט\"ו) מדוע נאמר בשם בצלאל, והל\"ל קרא ה' לבצלאל, ולא מצינו כן גבי משה ואהרן וכל הנביאים. אולם אמרו חז\"ל במס' ברכות (דף נ\"ה ע\"א) בצלאל ע\"ש חכמתו נקרא וכו' בצל א\"ל היית וידעת וא\"ר יהודה א\"ר יודע היה בצלאל לצרף אותיות שנבראו בהן שמים וארץ וכו'. ונראה לומר כי השיג בצלאל בחכמתו בחינת ביהמ\"ק וכליו שלמעלה, ועשה הכל לתתא כגוונא דלעילא, וכמו דאיתא בזה\"ק פ' פקודי הנ\"ל דתריסר שבעין שבחשן למטה הם בגוונא דלעילא, כן הוא בכללות המשכן וכליו עשה הכל למטה מכוון למה שלמעלה, ולעתיד נזכה שיבוא אלינו המקדש וכליו דלעילא בעצמם מן השמים, כדאיתא בזה\"ק פ' פנחס הנ\"ל, ובצלאל בגודל קדושתו וע\"י שעשה את המשכן בגוונא דלעילא, עשה הכנה וקנתה הארץ כח רוחני וקדושה נפלאה, ותוכל לסבול את קדושת הבית השלישי מעשה ידי יוצר כבחי' שכ' ק\"ז היש\"מ זלה\"ה, ולמדרגה זו שיוכל לעשות המשכן בגונא דלעילא, זכה בצלאל מפני שנכלל שם הקב\"ה בשמו, וכמ\"ש ז\"ל בצל אל היית.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 91,
      "char_length": 897,
      "timestamp": "2025-02-06T19:14:44.392773"
    },
    {
      "id": "vayakhel_p92",
      "text": "ואפשר שזאת כונת מאמר משרע\"ה לישראל ראו קרא ה' בשם בצלאל, ר\"ל שצירף הקב\"ה שם א\"ל בשם בצלאל, וזה להורות כו נתן לו השי\"ת יתרון החכמה והמדע לעשות את המשכן בדוגמא דלעילא, דוגמת המקדש העתיד, כי לפי ששמו מקושר בשמו יתברך, נשפע לו מחכמה עליונה שיוכל לעשות המשכן כגוונא דלעילא, באשר כל מה שמקושר בשמו יתברך הוא נצחי, וע\"כ נקרא מקדש העתיד מקדש ה' באשר הוא נצחי, ועל כן אמר להו משה לישראל ראו קרא ה' בשם בצלאל, כי הוא הראוי ומוכן להוריד קדושה בחינת הקדושה דלעתיד, כי קרא ה' שמו בשם בצלאל, וזה לאות כו ראוי הוא לכך, כי כל דבר שמצורף בו שמו של הקב\"ה הוא נצחי, ולעתיד יעמוד בצלאל עם משרע\"ה, והפעולה הרוחנית בהורדת קדושת המקדש תעשה על ידו. כי הוא מוכן לכך מאז בריאת העולם, כדברי המדרש הנ\"ל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 92,
      "char_length": 675,
      "timestamp": "2025-02-06T19:14:44.835852"
    },
    {
      "id": "vayakhel_p93",
      "text": "ואפ\"ל מאמר הכתוב ראו\" קרא ה' בשם בצלאל, דלכאורה מה הראה להם בזה ועי' קושיא י\"ג) ויתבאר עפ\"י מה שביארנו בדברינו (בפרשת ויגש עמוד תי\"ד) דברי המכילתא פ' יתרו וכל העם רואים את הקולות. רואים את הנשמע ולכאורה מדוע לא מצינו שחשבו חכמינו ז\"ל בין הנסים שנעשו במתן תורה, גם מופת זה שהיו רואים את הקולות, וביארנו כי אפשר שדבר זה מובן הוא גם עפ\"י חוקי הטבע, כי קול יש בו ממשות, אלא שלרוב דקותו אין בכח חוש הראות להשיגו, ואותן הקולות שיצאו מפי הגבורה במ\"ת לרוב תוקפן וגבורתן כמאה\"כ קול ה' בכח, היו מורגשום בחוש הראות, וכמו כן במשרע\"ה שאמרו ז\"ל שכינה מדברת מתוך גרונו של משה, היה הקול ההוא נראה בחוש הראות עיי\"ש. וזה אפ\"ל בדברי הכתוב אראו\" קרא ה' בשם בצלאל כי דיבוריו של משרע\"ה שהשכינה היתה מדברת מגרונו, נראו לעיני כל ישראל, ואמר להם משה קראו\" קרא ה' בשם בצלאל, פירוש שיראו עיניהם בחינתו של בצלאל, שרמז להם במאמר קרא ה' בשם בצלאל, ועל כן הסכימו כולם למונויו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 93,
      "char_length": 845,
      "timestamp": "2025-02-06T19:14:45.188700"
    },
    {
      "id": "vayakhel_p94",
      "text": "ועתה נבא לבאר דברי הילקוט הנ\"ל (עי' אות ג' ד') מתחלת התורה ועד סופה אין לך פרשה שנאמר בראשה ויקהל אלא זאת בלבד אמר הקב\"ה עשה לך קהלות גדולות ודרוש לפניהם ברבים וכו' כדי שילמדו ממך דורות הבאים להקהיל קהלות וכו' ללמוד ולהורות דברי תורה וכו' שיהא שמי הגדול מתקלס בון בנו וכו'. ואפשר לומר הכונה בדברי הילקוט, דהנה לעתיד יהיה הקיבוץ האמיתי, שיתקבצו כל ישראל בביאת משיח צדקינו, ויעמדו בתחיה עם כל הצדיקים ומשרע\"ה עמנו, וכל ישראל יחזרו בתשובה כמ\"ש הרמב\"ם ז\"ל ושמו הגדול יתעלה ויתקלס על ידינו, ואז תתגלה לנו בחינת התורה שלעתיד שהוא פנימיות התורה, וכמ\"ש ז\"ל (קהלת רבה פ\"ב) כל מה שאדם לומד בעוה\"ז הבל הוא לפני תורתו של משיח (ועי' בדברינו פ' מקץ עמוד של\"ב באורך). ולפי שפרשת ויקהל מורה על קיבוץ גליות והגאולה העתידה, כמבואר לעיל בדברינו, ע\"כ רמזו לנו חז\"ל את הענינים המסוגלים להחיש קץ הגאולה, וזאת כונת הילקוט עשה לך קהלות גדולות כדי שילמדו ממך דורות הבאים להקהיל קהלות וכו', כו ע\"ו שנקהלים יחד בקבוץ עם רב לקבל עליהם עול תורה ומצוות ועול מלכות שמים ותשובת הרבים כחה גדול עד מאד, עושים פועל דמיוני אל העתיד, וע\"י זה יזכו לקרב הגאולה ויהא שמי הגדול מתקלס בין בני לעת קץ.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 94,
      "char_length": 1058,
      "timestamp": "2025-02-06T19:14:45.627251"
    },
    {
      "id": "vayakhel_p95",
      "text": "ואפשר לומר בזה גם המשך דברי הילקוט מ\"ש וכן דוד הוא אומר בשרתו צדק בקהל רב וכי מה בשורה היו ישראל צריכים בימי דוד וכו' אלא שהיה פותח ודורש לפניהם ד\"ת שלא שמעתן אוזן מעולם. וכונת דבריו כי אף שהיו ישראל ברום המעלות, וומיו של דוד מעין דוגמא של משיח היו, אולם ידעו והשיגו שעדיין לא הגיע זמן הגאולה העתידה והנצחית, וקבלה היתה בידם שבהמ\"ק עתיד להחרבל וכנסת ישראל תצא בגולה, ובעלי ההשגה הבינו תוקף הגלות והצרות העלולים עוד לבא על ישראל. וע\"כ הוצרכו לבשורת הגאולה וביאת המשיח, וזאת בישר להם דוד המלך ע\"ה, והורה להם את הדרך אשר ילכו בה, שיזכו ע\"י כך אל הגאולה העתידה, וז\"ש דוד בשרתו צדק בקהל רב, כי ע\"י שקיבץ עם רב ועוררם אל התשובה, ושיקבלו עליהם עומ\"ש ועול תורה, והאיר להם את הדרך, ומסר להם הדרכה בעבודת השי\"ת, ופעולות אלו סגולתם לקרב הגאולה. וגם בלי ספק עשה פעולה גדולה בעולם העליון. להמתיק ולהקל צרות הגלות וחבלי משיח, ולמהר עת הגאולה. ובכח תשובת הרבים הגדול מאד, ומצורף אליה קדושתו של אדוננו המלך דוד ע\"ה ודאי עשו תיקונים גדולים בגבהי מרומים, וזאת הוא הבשורה הטובה אשר בישר להם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 95,
      "char_length": 972,
      "timestamp": "2025-02-06T19:14:46.129576"
    },
    {
      "id": "vayakhel_p96",
      "text": "ועפ\"י זה נבין כונת הילקוט הנ\"ל שהיה דורש לפניהם ד\"ת שלא שמעתן אוזן מעולם, עפ\"י המבואר בדברנו (פ' מקץ עמוד של\"ג) כי בחינ פנימיות התורה תתגלה אך לעתיד, כאמרם ז\"ל (קהלת רבה פ\"ב) כל מה שאדם לומד בעוה\"ז הבל הוא לפני תורתו של משיח. אמנם האבות הקדושים בגודל קדושתם זכו להשיג פנימיות התורה, שהיא בחינת תורתו של משיח, ובודאי שגם דוד המלך ע\"ה שהוא נשמת מלך המשיח השיג בחינת תורתו של משיח, אמנם בחינה זו שהשיג לא ניתנה להגלות עדיין והיא בבחינת ליבא לפומא לא גליא, וכל אלה שהשוגוה היתה השגתם רק בבחינת ליבא, בהשגת הדעת, אבל לא נתגלו בפה, ולכלל שמיעת אוזן לא באו מעולם. דכל עניני הגאולה הם בבחינת מלובא לפומא לא גליא. וכעין שכתב ק\"ז הישמח משה זללה\"ה בפ' וישלח לפרש מ\"ש חז\"ל (ב\"ב י\"ב ע\"א) חכם עדיף מנביא. ולכאורה קשה הרי אמרו חז\"ל (שבת דף צ\"ב ע\"א) אין השכינה שורה אלא על חכם וכו' וא\"כ כל נביא נמי חכם הוא, אמנם ידוע כי דבר התלוי בבחירה לא ניתן להאמר בבחינת דבור, כי הדיבור מכריח את הבחירה, ע\"כ הוא רק בבחינת מחשבה והצדיקים הגדולים המתדבקים בחכמה העליונה יוכלו להשיג גם במחשבתו של יוצר בראשית, משא\"כ הנביאים אין השגתם כ\"א במה שהוא בחי' דבור ולא בחינת מחשבה, עיי\"ש.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 96,
      "char_length": 1049,
      "timestamp": "2025-02-06T19:14:46.608963"
    },
    {
      "id": "vayakhel_p97",
      "text": "ואפשר שזאת כונת המדרש שהיה דורש לפניהם ד\"ת שלא שמעתן אוזן מעולם, כי הגם שלא זכו כולם להשגה זו, אבל בישר להם שמודיעם דברים שלא שמעתן אוזן, כי בדבריו היו עמונים דברים שלא נתנו להתגלות בחינת דבור, וע\"י הדרכה זו שמסר להם דרכי עבודת השי\"ת, נכלל בהם הכח שיזכו ע\"ו כך לבחינת הגאולה, ואז תתגלה להם השגה זו, וזאת הבשורה הטובה אשר מסר להם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 97,
      "char_length": 329,
      "timestamp": "2025-02-06T19:14:47.143314"
    },
    {
      "id": "vayakhel_p98",
      "text": "ואפ\"ל עוד רמז במ\"ש להם דברים שלא שמעתן אוזן מעולם עפימ\"ש ק\"ז הייטב לב זלל\"ה בפ' מעות דברי הבינה לעתים (דרוש ס\"ד) לפרש מאמר הנביא (ישעי' י\"א) על מלך המשיח ושפט בצדק דלים והוכיח במישור לענוי ארץ וגו' שהכונה כי המלך המשיח ע\"ו שיעשה פעולות הצדק והמישור בכל מעשיו, יכניס רושם בלב כל אדם לעשות כמעשהו, ולא יצטרך להוכיחם בפה. וכתב עוד ויותר מזה שמעתי מפי דודי הגאוה\"ק בעל אריה דבי עילאי זלל\"ה לפרש הפסוק (במדבר ח) ומבן חמשים שנה ישוב מצבא העבודה וגו' ושרת את אחיו וגו' לשמור משמרת ועבודה לא יעבוד. כי הלוים היו מעוררים לבות בני ישראל לתשובה בעת הקרבת הקרבן. בשירם ובזמרם, ומבן חמשים נפסל בקול, ולא היה יכול לעשות עבודתו לעורר לתשובה ע\"י הקול, עכ\"ז עמד על משמרתו עם אחיו הלוים לעורר הלבבות לתשובה, כי בינה יתירה נודעת להם, והיו מתבודדים בינם לבין קונם איש על עבודתו לשפוך כמים לבו ושיחו לפני ה', ובאו בקושרות עם כללות לבבות ישראל האחוזים זה בזה, ובכן היו מעוררים הלבבות לשוב בתשובה, וז\"ש הכתוב ומבן חמשים שנה ישוב מצבא העבודה ולא יעבוד עוד בפועל ממשו עכ\"ז ושרת את אחיו וגו', ר\"ל עם אחיו, לשמור משמרת לעורר הלבבות, הגם ועבודה לא יעבוד. בפועל, עכ\"ד ז\"ל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 98,
      "char_length": 1043,
      "timestamp": "2025-02-06T19:14:47.338345"
    },
    {
      "id": "vayakhel_p99",
      "text": "וכעין זה פי' ק\"ז זלה\"ה בתפלה למשה (תהלים קי\"א) אודה ה' בכל לבב. שבעת שהודה דוד לה' הלהוב לבבות בני ישראל, והיינו אודה ה' בכל לבב, ר\"ל עם כל הלבבות המתעוררים על ידו. ואפשר שזאת כונת הילקוט בשרתי צדק בקהל רב שהיה דורש לפניהם ד\"ת שלא שמעתן אוזן מעולם, כי בגודל קדושת דוד המלך ע\"ה וע\"י עבודתו הקדושה, לא הוצרך לומר להם דברי תוכחה, כי אם בישר להם דרכי הצדק ודרכי התשובה והיראה במעשיו בלבד, ונתעוררו לבבות בני ישראל ע\"ו עבודתו הקדושה ודברי תורה שאמר להם, ואף שלא היו מוסבות אליהם. וזאת היא בחי' דברים שלא שמעתן אזן מעולם, כי אין אומר ואין דברים בלו נשמע קולו, ואעפי\"כ נכנסו הדברים בלבות בנו ישראל לעוררם לתשובה. ועפי\"ז יובן המשך הפסוק, הנה שפתי לא אכלא, כי אף שהתעוררו מעצמם לתשובה. אעפ\"כ אמר להם דברי מוסר והתעוררות והוכיחם בפיו. כו בחינה זו להלהיב הלבבות בלא דבור ושמיעה אינה מועילה לכל סוגי אנשים, וגם דוד המלך ע\"ה בגודל ענותנותו לא סמך על כחו בזה, וזה שסיים ה' אתה ידעת, כי בחינת המחשבה אין יודע רק השי\"ת לבדו, ע\"כ אמר להם דברי תוכחה גם בפיו. אלא שחז\"ל גילו לנו שגם בדברים שלא שמעתן אוזן היה כחו גדול, לעוררם בתשובה, ולהכניס בהם בחי' אהבה ויראה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 99,
      "char_length": 1043,
      "timestamp": "2025-02-06T19:14:47.860552"
    },
    {
      "id": "vayakhel_p100",
      "text": "ועתה נבוא לבאר מדוע לא צוה הקב\"ה להיות נמלכים בצבור בהתמנותם של הנשיאים ובהתמנות משה ואהרן שהרי כולם היו עפ\"י ה' וברוה\"ק בלי שאלת פו הצבור, ומדוע דוקא מעת התמנות בצלאל והלאה בא דברו יתברך להמלך בצבור בכל מינוי שררה. וכבר אמרתי בזה כמה טעמים ועפי\"ד הזה\"ק הנ\"ל ויקהל משה שהפרידן מן הע\"ר יתבאר היטב, שהרי מתחלה צוה הקב\"ה ויקחו לי תרומה מאת כל\" איש, וגם העיר בכלל, כדאיתא בזה\"ק. וגם שיעת משרע\"ה היתה לקרב את העיר ולהכניסם תחת כנפי השכינה, ומעתה אילו היו נמלכים עם הצבור בעת התמנות מנהיג או נשיאים, הרי היתה נמנית גם דעת העיר ביניהם, כי לא היה אפשר לעשות פירוד ולא להתחשב עמהם, ואילו היתה ההתמנות עפ\"י דעתם הוה נפיק מיניה חורבא. ובפרט שהם היו הרוב, כו מרובים היו מבני ישראל כדאיתא במכילתא פ' בא, והיו בוחרים להם מנהיג אשר ילך אחר שרירות לבם ויטה אל אשר יחפוצו, וכמ\"ש האלשיך הקדוש בפ' שלח עה\"פ נתנה ראש ונשובה מצרימה שהיתה כונתם שהם ימנו ראש וע\"כ יהיה מוכרח לצוות להם לשוב מצרימה כי הם הממנים אותו, עיי\"ש. וגם עפ\"י הלכה או אפשר לצרף למנין הרוב בשום התמנות כי אם אותן האומרים דעתם לשם שמים, כמבואר ברמ\"א חו\"מ סי' קס\"ג שמטילין חרם על זה שיקבלו עליהם שכל א' יאמר דעתו לשם שמים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 100,
      "char_length": 1068,
      "timestamp": "2025-02-06T19:14:48.420086"
    },
    {
      "id": "vayakhel_p101",
      "text": "ובעוה\"ר בדורותינו אלה לא נהיגי עוד תקנת החרם, כי יש חשש שגם החרם לא יועיל, ופן יעברו על החרם עבור נגיעתם, גם מי יודע לכוון אמיתת לבבו אם דעתו באמת לש\"ש, ואולי טועה הוא ומשגה בידו, ע\"כ בלית ברירה אנו סומכין על דעת הרוב, אפי' שאין בידינו בירור גמור שהרוב מכוונים לשם שמים, כיון שאין בידינו למנות עפ\"י נביא, בעל כרחך סמכינן על דעת הרוב. אבל בהתמנות הנשיאים ובהתמנות משה ואהרן, שהיתה עפ\"י ד' וברוה\"ק, שהוא בירור גמור לא היה רצון השי\"ת שימלכו בצבור, שהרי אז בהכרח שגם דעת הע\"ר היתה מצטרפת למנין הרוב, כיון שהיו אז בצוותא חדא עם כלל ישראל, כדברי הזה\"ק, ואילו לא היו מתחשבין בדעת הע\"ר היה זה גורם לפירוד ומחלוקת ח\"ו, וכמ\"ש הבעהתו\"ס בפ' תשא, שע\"כ לא מנה אהרן מנהיג תחת שיעשה העגל כי ירא פן תרבה קטטה בישראל ויבואו לידי שפיכות דמים. וממילא היה הכרח לצרף דעתם, ומה גם שהיה הציווי שיטלו גם מהם לבנין המשכן, בודאי שהיו מוכרחים להתחשב בדעתם. כמנהג העולם שאם נוטלים מאיש נדבת ממון, גם דעתו כרוכה בצדה. ע\"כ לא היה אפשר להמלך בצבור במינויים הקודמים כדי שלא לצרף דעת העיר למנין הרוב.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 101,
      "char_length": 966,
      "timestamp": "2025-02-06T19:14:49.001448"
    },
    {
      "id": "vayakhel_p102",
      "text": "אכן אחר חטא העגל, היה דבר ד' לישראל עמו קחו מאתכם, דייקא, ולא מן הערב רב, כדברי הזה\"ק, וכיון שלא לקחו מהם נדבה לבנין המשכן, לא שאלו מהם חות דעת, ונפרדו ישראל מהם לגמרי, כדברי הזה\"ק ויקהל משה שהפרידן מן הע\"ר, ועל כן צוה הקב\"ה למשה שימלך בצבור במינוי בצלאל, ומשם נלמד לדורות אשר בכל התמנות ושררה יהיו נמלכים בצבור, כיון שהצבור היו רק שלומי אמוני ישראל הנאמנים לד' ולתורתו, ואין זר אתם, שפיר אפשר לסמוך על דעת הרוב.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 102,
      "char_length": 412,
      "timestamp": "2025-02-06T19:14:49.498384"
    },
    {
      "id": "vayakhel_p103",
      "text": "ולדרכנו יתבארו דברי התנחומא הנ\"ל (עיין אות ע\"ז) ראו קרא ד' בשם בצלאל וגו' ילמדנו רבינו עד כמה חייב אדם המטפל בכלאים וכו'. בהקדם דברי הרמב\"ן ז\"ל בפ' קדושים (פ' י\"ט י\"ט) עה\"פ את חקותי תשמרו בהמתך לא תרביע כלאים שדך לא תזרע כלאים ובגד כלאים שעענז לא יעלה עליך. וז\"ל והטעם בכלאים כי השם ברא המינים בעולם וכו' ונתן בהם כח התולדה שיתקיימו המינים בהם לעד כל זמן שירצה הוא יתברך בקיום העולם וכו' וציוה בכוחם שיוציאו למיניהם ולא ישתנו לעד לעולם שנאמר בכלם למינהו וכו' והמרכיב שני מינין משנה ומכחיש במעשה בראשית כאילו יחשוב שלא השלים הקב\"ה בעולמו כל הצורך ועוד כתב טעם בכלאי זרעים וטעמו שייך גם בשאר מיני כלאים כדי שלא לערבב הכוחות המגדלים הצמחים להיות יונקים זה מזה ממה שאמרו בב\"ר (פ\"י ז') א\"ר סימון אין לך כל עשב ועשב מלמטה שאין לו מזל ברקיע ומכה אותו ואומר לו גדל הה\"ד (איוב ל\"ח) הידעת חקות שמים אם תשים משטרו בארץ והנה המרכיב כלאים או זורען בכדי שינקו זה מזה מבעל חקות שמים ולכך אמר בהם חקותי תשמורו כי הם חקות שמים וכו' והמערב כלאים מכחיש ומערב במעשה בראשית. וכו'. ובכלאי בגדים שלא שייכי הנך טעמי כתב וטעם כלאי הבגדים. להרחיק התערובות במינים. ובשם הרמב\"ם ז\"ל במורה נבוכים כתב כי עעם השעענז מפני שהיה בזמן ההוא בגד ידוע לכומרים ובעלי הכשפים שבהם היו עושים כל מעשיהם וכו' ולפי שהיה ענין גדול ורצוי להם מאד שיפעלו בו פעולותיהם הידועות לע\"ז ולשדים הרחיקה אותו התורה מכל אדם כו התורה תבא למחות מעשיהם ולהכחיד זכרם עכ\"ד ז\"ל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 103,
      "char_length": 1313,
      "timestamp": "2025-02-06T19:14:49.732727"
    },
    {
      "id": "vayakhel_p104",
      "text": "ובאמת אפשר לומר כי הטעם שכתב הרמב\"ן ז\"ל בשם הרמב\"ם חד טעמא הוא עם הטעם הקודם שנתן הרמב\"ן, כי לפי שכומרי הע\"ז הבינו שורש הרע היוצא מלבישת שעטנז, כי ע\"ו לבישת שעטנז יבוא גם לערב כלאי זרעים וכו', שעל ידם עושה עירבוב הכוחות ומכחיש מעשה בראשית, וממעט השפעה אלקית מעליו. לכן לבשו בגדי שעטנז לע\"ז כדי להמשיך על עצמם כוחות הטומאה והקליפה, ומשום כך אסרה תורה עלינו ללבוש שעטנז כדי להרחיק התערובות במינים. והאוה\"ח הקדוש פירש בזה טעם שסמך הכתוב מצות ואהבת לרעך כמוך למצות כלאים, כי לצד שצוה ה' על אהבת החברים והתקשרות לבם יחד, כי חפץ ה' התקשרות ענפי הקדושה, ומזה יאמר אדם כי לא יקפיד ה' על הרבעת טהורה עם טהורה מין בשאינו מינו, לזה בא הכתוב ואמר כי אין הרצון בזה לקשר בהמה עם בהמה, ואפי' שניהם מין טהרה וכו', עכ\"ד ז\"ל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 104,
      "char_length": 707,
      "timestamp": "2025-02-06T19:14:50.334027"
    },
    {
      "id": "vayakhel_p105",
      "text": "והנה לכאורה עדיין צריך טעם לסמיכות ואהבת לרעך כמוך לכלאי בגדים. כי שם אין שייך בחינת התקרבות והתרחקות ולא עירבוב הכוחות. אמנם אפשר להסביר טעם סמיכות ואהבת לרעך כמוך למצות כלאי בגדים, עפימ\"ש האוה\"ח הקדוש פ' תשא (פ\"ל י\"ב) דמ\"ש חז\"ל (אבות פ\"ד י\"א) העושה עבירה אחת קונה לו קטיגור אחד הוא מין העון ממש כמעשהו ושם המלאך הוא כשם העון שממנו נברא והוא מטעהו לעשות עבירה דוגמתו בסוד אומרם עבירה גוררת עבירה עיי\"ש. וזה ג\"כ ענין אמרם מצוה גוררת מצוה, כי מהמצוה שעשה נברא מלאך טוב המסייעו לקיים מצוה אחרת דוגמתו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 105,
      "char_length": 499,
      "timestamp": "2025-02-06T19:14:50.678473"
    },
    {
      "id": "vayakhel_p106",
      "text": "ומעתה יתבאר לנו טעם סמיכות מצות ואהבת לרעך כמוך למצות כלאי בגדים, דהנה שורש מצות כלאים הוא שצוה הקב\"ה לבל נעשה התחברות במיני צמר ופשתים, כי כך רצונו יתברך שיהיו מינים אלו נפרדים ולא יתאחדו, יהיה מאיזה טעם שיהיה. ומעתה העובר ח\"ו על ציווי השי\"ת ולובש כלאים, קונה לו קטיגור אחד, ונברא ממעשהו מלאך רע הנקרא על שם החטא אשר חטא, ומסיתו לעבור עבירה דוגמתו, להתחבר עם מינים ואפיקורסים, ולהתקרב אל עושי רשעה, וכן להיפך ע\"י התקרבות עם עושי רשע, יסותו המלאך הרע הנברא מחטא זה לעבור על איסור לבישת שעענזר כי עבירה גוררת עבירה, ושניהם בחינה אחת להם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 106,
      "char_length": 536,
      "timestamp": "2025-02-06T19:14:50.934867"
    },
    {
      "id": "vayakhel_p107",
      "text": "והנה זה לעומת זה עשה אלקים, וכשם שצוונו להתרחק מעושו רשע כן צונו להתחבר עם יראי ה' וחושבי שמו, והוא מ\"ע ואהבת לרעך כמוך, וכמ\"ש האוה\"ח הקדוש שע\"כ מסיים הכ' אני ה\"כ כי כללות ישראל כולם הם ענפי שם הוי\"ה יתברך, עיי\"ש. ומסגולת מצוה זו הוא שמסויעתו ומביאתו להשמר מהתחברות עם עושי רע, וכן להנצל מאיסור כלאים, כי ע\"ו קיום מצות ואהבת לרעך כמוך נברא מלאך טוב ששמו כשם המצוה אשר עשה, ומסייעו לקיים מצוה דוגמתו, והוא התפרדות מן הרשעים. ובאמת אף שב' מצוות אלו בעצם מדותיהם הפכיות שזו מדתה אהבה והתחברות, וזו מדתה התרחקות והפרדה. אבל שרשם ובחונתם אחת היא, כי הא בהא תליא, ואין לאחד מהם קיום בלתי חבירו, דאי אפשר להיות התחברות גמור וקירוב לבבות בין אוהבי ה\"ו אם לא יתפרדו מהם כל פועלי און. וכן להיפוך אי אפשר להיות פירוד גמור מן הרע ומן הדומה לו, כ\"א ע\"י התחברות גמורה בין יראי ה' וחושבי שמו יתברך. ותכלית המכוון בשניהם אחד הוא, והם יסוד גדול בקיום התורה והיהדות. והשתא יובן שפיר טעם סמיכות מצות ואהבת לרעך כמוך למצות כלאים כי שניהם טעם אחד להם, וע\"י קיום אחד מהם, נברא מלאך המסייעו לקיים משנהו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 107,
      "char_length": 980,
      "timestamp": "2025-02-06T19:14:51.201628"
    },
    {
      "id": "vayakhel_p108",
      "text": "ועפי\"ז יתבארו לנו דברי התנחומא הנ\"ל, דהנה הארכנו לעיל לפרש דברי הזה\"ק ויקהל משה שהפרידן מן הע\"ר, כי לפי שרצה משה לעוררם על האחדות ביניהם, כמ\"ש הכלי יקר ז\"ל שמאה\"כ ויקהל משה רומז שהקהלה זו היתה לתווך השלום בינותם, וכדי שיהיה השלום בר קיימא ביניהם, יתאחדו ולא יתפרדו, הוצרך להפרידם מן העאר, ולהזהירם שלא ישתמשו במדת האחדות עם העיר, וכן להיפך שלא ישתמשו במדת ההפרדה וההתרחקות כלפי יראי ה' וחושבי שמו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 108,
      "char_length": 397,
      "timestamp": "2025-02-06T19:14:51.687002"
    },
    {
      "id": "vayakhel_p109",
      "text": "ובעוה\"ר היצה\"ר מסית ומטעה להשתמש במדות היפך מדרך האמת, ועם אלו אשר מצווים להתחבר עמהם מראה פנים בחסרונות, כדי לעשות פירוד בין הדבקים, וכלפי פועלי און אשר המצוה להתרחק מהם, הוא מראה פנים במעלות וקירוב הדעת. ובעוה\"ר רבים משתמשים במצות ואהבת לרעך כמוך להתחבר עם מינים ואפיקורסים ר\"ל, כו לפי שיסוד קיום הדת תלוי בזה, ע\"כ מתגבר היצה\"ר בכל כוחותיו להכשיל ולהטעות בני אדם בזה. אמנם מי שרצונו לעשות רצון הבורא יתברך באמת, עליו להשתמש בשני הפכים אלו בזמן ובמקום הראוי לכל אחד מהם, כפי דרך התורה ודרך האמת, כי או לא הא לא קיימא הא, ובהבטל א' מהם יתבטל גם חבירו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 109,
      "char_length": 551,
      "timestamp": "2025-02-06T19:14:51.911697"
    },
    {
      "id": "vayakhel_p110",
      "text": "ומעתה מבוארים שפיר דברי התנחומא ראו קרא ה' בשם בצלאל וגו' ילמדנו רבינו עד כמה חייב אדם המטפל בכלאים וכו'. עפימ\"ש חז\"ל כי למדנו ממה שצוה ה' להמלך עם הצבור במינוי בצלאל, שאין מעמידין פרנס על הצבור אא\"כ נמלכים בציבור. ולדרכנו א\"ש שפרשת מינוי בצלאל כתובה בפרשת ויקהל, שהרי ויקהל מורה על שהפרידן משה מן הע\"ר, וכן עשה התחברות בין ישראל הכשרים כדברי הכלי יקר ז\"ל, ולכך זכו ששרתה השכינה על בצלאל כמ\"ש ז\"ל בצל אל היית וידעת, וצירף הקב\"ה שמו בשם בצלאל להורות על השראת השכינה והחכמה העליונה שזכה בצלאל אליה, אבל אילו היתה ההתמנות בזמן שהיו בהתחברות מן הערב רב, ובשאלת פיהם, לא היתה השכינה שורה עליו ועל מעשיו, וכמו שאמרו ז\"ל (סנהדרין כ\"ו ע\"א) על שבנא וסייעתו דהוה מסתפי חזקיה אמר דילמא נטייה דעתיה דקב\"ה בתר רובא (כי שבנא שדר פתקא לסנחריב כשצר על ירושלים שבנא וסייעתו השלימו והם היו הרוב נגד חזקיה וסייעתו שלא השלימו) בא נביא וכו' אמר לו קשר רשעים אינו מן המנין.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 110,
      "char_length": 851,
      "timestamp": "2025-02-06T19:14:52.193755"
    },
    {
      "id": "vayakhel_p111",
      "text": "וכתב המהרש\"א ז\"ל כי סנחריב חרף מערכות אלקים חיים, וע\"כ שבנא וסייעתו שבאו להשלים עמו היו מחשבותם לרעה על ה' וכאלו חשבו לעבוד ע\"ז וכו' ולפי ביאורו של המהרש\"א ז\"ל לא אמר כלל על שבנא וסייעתו שהיו רשעים, שאל\"כ איך חשש חזקיה שיטה קב\"ה אחרי הרוב, ויוכל להיות שהיו צדיקים, אלא שמחשבה זו להתקשר עם מחרפי ה', הוי מחשבת ע\"ז ואין הקב\"ה באותו המנין, כיון שהוא קשר רשעים, שמתקשרים עם שונאי ה'. (ועי' בספרי ויואל משה מאמר שלש שבועות סי' קנ\"ו בזה). ולפי שמפ' ויקהל למדנו מעלת ההתחברות בין הצדיקים, וכן מעלת ההתפרדות מעושי עול, ע\"כ סמך התנחומא לכאן עד כמה חייב אדם המטפל בכלאים כך תני רשב\"י אפי' ע\"ג מאה כלים אסור לו ללבוש וכו'. ומפרש המדרש טעם שצותה התורה להרחיק כל כך מכלאים ששכר מצוה מצוה ושכר עבירה עבירה, ומכל מצוה נברא מלאך המטהו לעשות מצוה בדומה לו, ולהיפך מכל עבירה נברא מלאך רע המסיתו לעבירה כיו\"ב. ואשר על כן מצווים אנו להתרחק מכלאים עד קצה האחרון, כי עבירה זו גוררת אחריה התקרבות עם אישים פועלי און, ולהיפך הזהירות במצות כלאים תגרור אחריה לקיים מצות ואהבת לרעך כמוך, ולעשות אחדות וקירוב לבבות בין בני ישראל הכשרים. ומביא התנחומא חיזוק לדבריו עד כמה חמורה מצות כלאים תדע לך שכן הוא שהרי בצלאל ע\"ו שקנה שם טוב, זכה שיעשה מלאכת המשכן. ור\"ל שצירף הקב\"ה שמו בשם בצלאל, ע\"ו כך שרתה השכינה במעשה ידיו, וכל מה שזכה לכך היה כי נתמנה ע\"ו ישראל הכשרים: שהתאחדו והתחברו יחדיו, ולא ע\"ו הע\"ר כו נפרדו מהם, ואילו לא נפרדו מן הע\"ר לא שרתה שכינה במעשי ידיו, ודבר זה הוא מופת חותך כמה צריך להזהר בכלאים, ולהפרד מעושו רשע אשר טעם אחד להם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 111,
      "char_length": 1413,
      "timestamp": "2025-02-06T19:14:52.596301"
    },
    {
      "id": "vayakhel_p112",
      "text": "ואפשר לומר בדרך רמז במשנה (ריש מס' שקלים) בא' באדר משמיעין על השקלים ועל הכלאים כי כתבו המפרשים ז\"ל שמצות מחצית השקל מורה על אחדות, כי כל אחד לעצמו הוא רק מחצית והשלמות נקנה רק בהתחברות, וע\"כ בא' באדר אשר משמיעין על השקלים המורה על אחדות, מזהירין גם על הכלאים. כו מצות כלאים מורה לבל ישתמש באחדות עם פועלי און. שאסרה תורה להתחבר אתם, ושניהם אחוזים ודבוקים זה בזה, ההתפרדות מעושי רשע והאחדות בין ישראל הכשרים. והשי\"ת יעזור שנזכה לילך בדרך האמת, ונזכה לראות את החשן אשר כתוב בו שבעי יה עדות לישראל כמו שכתב הרמב\"ם ז\"ל, ואז יתקיים להודות לשם ה' שידעו כי זה ה' קוינו לו נגילה ונשמחה בישועתו, ונזכה לקבל פני משיח צדקינו בהתרוממות קרן התורה וישראל, ובהתגלות כבוד שמים עלינו במהרה בימינו אמן.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 112,
      "char_length": 685,
      "timestamp": "2025-02-06T19:14:53.305175"
    },
    {
      "id": "vayakhel_p113",
      "text": "באופן אחר י\"ל מאה\"כ ויקהל משה וגו' דקשה למה הוצרך הכתוב להודיע שהקהול אותם, והרי בכל עת שדבר אליהם היה מקהיל את העדה. גם ליישב קושיית המזרחי ז\"ל על רש\"י ז\"ל שכתב הקדים אזהרת שבת לציווי מלאכת המשכן לומר שאינו דוחה את השבת. והקשה מה איצטריך קרא למיעוטי, והלא פשיטא הוא דמלאכת המשכן עשה ושבת עשה ול\"ת ואין עשה דוחה ל\"ת ועשה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 113,
      "char_length": 321,
      "timestamp": "2025-02-06T19:14:53.698201"
    },
    {
      "id": "vayakhel_p114",
      "text": "ונראה דהנה לכאורה היו ישראל יכולים לעסוק במלאכת המשכן בשבת, באופן שלא יהיו חייבים עליו משום מלאכה בשבת, דהיינו שיעשו שנים ביחד כל מלאכה ומלאכה וקיי\"ל ושבת צ\"ב ע\"ב) שנים שעשו מלאכה פטורים בזה יכול לעשותה לבדו וזה יכול לעשותה לבדו. ואף דאיכא עליה איסורא דרבנן כדאמרינן ושבת ק\"ז ע\"א) כל פטורי דשבת פטור אבל אסור וכו'. מ\"מ באותה שעה עדיין לא גזרו חכמים איסור על כך, והיה הדבר מותר לכתחלה, וא\"כ לכאורה קשה כיון שהיו ישראל רדופין וזריזים למהר ולהחיש הקמת המשכן, כדי שיתכפר להם עוון העגל, א\"כ אמאי לא בנו אותו בשבת באופן ההיתר. וצריך לומר דכיון שעתידין היו חכמים לגזור איסור על עשיית מלאכה ע\"י שנים בשבת, לא רצה הקב\"ה שיבנה המשכן באופן שעתיד להיות אסור מדרבנן אף שבאותה שעה עדיין היה היתר גמור. וזאת אפ\"ל בכוונת רש\"י ז\"ל הקדים להם אזהרת שבת לציווי מלאכת המשכן לומר שאינו דוחה את השבת. כלומר שאינו דוחה שבת אפילו באופן שהוא עתה היתר גמור, אלא שעתידין חכמים לאסרו, כגון בעשיית מלאכה ע\"י שנים, ותו לא קשה מידי קושיית הרא\"ם ז\"ל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 114,
      "char_length": 917,
      "timestamp": "2025-02-06T19:14:53.881806"
    },
    {
      "id": "vayakhel_p115",
      "text": "ובדרך זה נבא לפרש מאה\"כ ויקהל משה וגו' דהנה בטרם נצטוו ישראל על מלאכת המשכן, לא ידעו אשר נמצאים ביניהם חכמים גדולים ואומנים מופלגים חושבי מחשבות לעשות בכסף ובזהב ובכל מלאכה. וכמ\"ש הרמב\"ן ז\"ל בפרשת תשא וז\"ל אמר ה' למשה ראה קראתי בשם בצלאל וגו'. והטעם כי ישראל במצרים פרוכים בעבודת חומר ולבנים לא למדו מלאכת כסף וזהב ונחשת ואבנים טובות ולא ראו אותם כלל והנה הוא פלא שימצא בהם אדם חכם גדול בכסף ובזהב כו אף בלומדים לפני חכמים לא ימצא אדם בקי בכל האומניות כולם לכן אמר השם למשה שיראה הפלא הזה וידע כי הוא מלא רוח אלקים לדעת כל אלה בעבור שיעשה המשכן וכו' עכ\"ל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 115,
      "char_length": 555,
      "timestamp": "2025-02-06T19:14:54.312844"
    },
    {
      "id": "vayakhel_p116",
      "text": "וכן איתא במד\"ר (שמו\"ר פמ\"ח ה) עה\"פ וימלא אותו רוח אלקים ולא זה בלבד אלא כל מי שנתעסק במלאכת המשכן נתן בו הקב\"ה חכמה ובינה ודעת שנא' ויעשו כל חכם לב ולא בבני אדם אלא אפילו בבהמה וחיה וכו' ע\"כ. הרי שקודם שצוה ה' שיעסקו ישראל במשכן, לא נודע להם שנמצאים בקרבם חכמי לב. וגם החכמים עצמם לא ידעו כי נשאה רוחם אותם, והם מוכשרים לקרבה אל המלאכה מלאכת המשכן לעשות אותה. ורק כאשר הקהולם משרע\"ה והודיע להם ציווי ה' לעשות את המשכן, מיד נתעוררה החכמה בלב כל חכם רלב, והרגישו כ\"א בנפשו איזה מלאכה שייכת לו לפי שורש נשמתו, או אז נוכחו ישראל לדעת כו אכן נמצאים בקרבם חכמי לב רבים, היודעים לעשות מלאכת כסף וזהב וכל מלאכת אומנות. ולכן מיד כאשר נודע שנמצאים ביניהם חכמי לב רבים היה מקום לחוש פן מחמת גודל השתוקקותם למהר בהקמת המשכן יבנו אותו גם בשבת, דהיינו שיעשו כל מלאכה בשנים, כי רבים המה החכמים העוסקים במלאכה. על כן הוצרך משה להזהירם ששת ימים וגו' וביום השביעי יהי' לכם קודש. שאין מלאכת המשכן דוחה שבת אף באופן המותר מן התורה, לפי שעתידין חכמי ישראל לאסרו לא ניחא ליה לקב\"ה שיבנה המשכן בשבת אף באופן זה. (ועי' בדברנו לעיל פ' תשא עמוד ש\"י).",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 116,
      "char_length": 1024,
      "timestamp": "2025-02-06T19:14:54.603843"
    },
    {
      "id": "vayakhel_p117",
      "text": "וזהו המשך הכתובים ויקהל משה וגו'. שהקהילם לצוות עליהם מלאכת המשכן, ונתעוררה החכמה בלבות החכמים ונודע לישראל שנמצאים ביניהם אומנים רבים אשר נתן ה' בהם רוח חכמה לקרבה אל המלאכה, והיה חשש פן יבנו את המשכן בשבת באופן היתר ע\"י שנים שעשאוה, על כן הזהיר מיד על שמירת שבת, שלא יבנו את המשכן בשבת אפילו באופן המותר כיון שעתידים חכמים לאסרו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 117,
      "char_length": 331,
      "timestamp": "2025-02-06T19:14:55.100891"
    },
    {
      "id": "vayakhel_p118",
      "text": "ויקהל משה וגו' קשה שלא מצינו כן בשאר מקומות שיודיע הכתוב על הקהלת העדה, ומדוע הוצרך להודיע בפרשה זו שהקהילן משה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 118,
      "char_length": 112,
      "timestamp": "2025-02-06T19:14:55.281026"
    },
    {
      "id": "vayakhel_p119",
      "text": "ב) אלה הדברים אשר צוה ה' לעשות אותם וגו'. הקשו המפרשים דאם קאי על מצות שבת דכתיבא בתריה הול\"ל, שלא לעשות, דעיקר מצות שבת היא שלילת העשיה. ואם קאי על מלאכת המשכן כפירוש הרמב\"ן, יתירא היא, שהרי כתיב בתריה זה הדבר אשר צוה ה' קחו מאתכם וגו'.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 119,
      "char_length": 237,
      "timestamp": "2025-02-06T19:14:55.369223"
    },
    {
      "id": "vayakhel_p120",
      "text": "ונראה דהנה האוה\"ח הקדוש כתב לפרש מאה\"כ אלה הדברים וגו'. עפ\"י דבריהם ז\"ל שאמרו כל המודה בע\"ז ככופר בכל התורה כולה (ספרי שלח פט\"ו כ\"ב הובא ברש\"י שם) ומעתה הנה היו צריכים ישראל לתקן כל תרי\"ג מצות אשר פגמו בכולם וכו' אשר על כן באה מצות ה' להם שיזהרו במצות שבת ואמרו ז\"ל ששקולה שבת כנגד כל התורה (שמות רבה פכ\"ה טז) עכ\"ד האה\"ח הקדוש. והנה כדי שיתכפר להם חטאם כפרה גמורה, היו ישראל חייבים לעשות תשובה מאהבה, כדי שיתהפכו להם הזדונות לזכיות. אך לאו כל אדם זוכה להשיג מדרגת תשובה מאהבה, כי כבד הדבר מאד, ולא ניתן להשיגה כו אם כאשר האדם במדרגת התפשטות הגשמיות, דהיינו שזיכך עצמו עד שאינו מביט על תועלת עצמו כלל, וכל חפצו ורצונו לעשות נחת רוח להשי\"ת, כי אם עדיין דואג הוא לתיקון נפשו, אין זו בחינת תשובה מאהבה, שהרי כוונתו עבור תועלת נפשו, ולא מחמת גודל חפצו והשתוקקותו להתדבק בהשי\"ת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 120,
      "char_length": 772,
      "timestamp": "2025-02-06T19:14:55.519556"
    },
    {
      "id": "vayakhel_p121",
      "text": "אמנם ק\"ז זלה\"ה בישמח משה פרשת האזינו כתב להמליץ זכות, דרבים ששבו כמעט מן הנמנע שישובו כולם מאהבה, ואף ששבים מיראה ואינם מגיעים לאהבת הבורא, נעשים להם הזדונות לזכיות, כיון דנפיש זכותא דרבים, ומסתמא כיון שכתב כן ראה זאת ברוח קדשו. ועפ\"י זה יתבארו לנו הדקדוקים הנ\"ל, דהנה תיבת אלה\" רומזת לחטא העגל שאמרו אלה אלהיך ישראל. וכן דרשו ז\"ל (ברכות ל\"ב ע\"ב) עה\"פ גם אלה תשכחנה (ישעי' מ\"ט) זה מעשה העגל, ולכן הודיע לנו הכתוב כאן ויקהל משה את כל עדת בני ישראל, ובכח דבוריו הקדושים עורר אותם לעשות תשובה על מעשה העגל ויאמר אליהם אלה\" הדברים פירוש הדברים שאמרו לעגל הזהב שאלה\" אלהיך ישראל, אשר צוה ה' לעשות אותם, כלומר שבכח התשובה יעשו מחטא זה מצוות אשר צוה ה\"נ כי יתהפכו להם זדונות לזכיות. ואל תתמה כיצד הגיעו כל ישראל למדרגת תשובה מאהבה עד שנעשו מעוונותיהם זכיות, על כן אמר הכתוב ויקהל משה את כל עדת בני ישראל, ובהתקבץ כולם וחד מועלת זכות תשובת הרבים להפך מעברות לזכיות, אפילו אם הם עושים רק תשובה מיראה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 121,
      "char_length": 891,
      "timestamp": "2025-02-06T19:14:55.896509"
    },
    {
      "id": "vayakhel_p122",
      "text": "ובדרך זו אפ\"ל מאמר הגמרא וע\"ז דף ד' ע\"א) לא היו ישראל ראויים לאותו מעשה (חטא העגל) וכו' אלא כדו להורות תשובה לרבים. דהכוונה כדי להורות לדורות, אשר אף אם אין ישראל זוכים לעשות תשובה מאהבה, תועיל תשובת הרבים כתשובה מאהבה, להפך להם זדונות כזכיות. או אפשר לומר כי ישראל שבאותו הדור היו במדרגה גבוהה מאד, והיה בכחם להגיע למעלת תשובה מאהבה, ולא היו זקוקים לתשובת הרבים כדו להפך להם הזדונות לזכיות, אלא שעל כן נקהלו כולם וחד לעשות תשובה מיראה, כדי להורות תשובה לרבים, היינו הדורות הבאים שלא יהיה בכוחם לעשות תשובה מאהבה, והורו להם ישראל שתועיל תשובת הרבים מיראה כתשובה מאהבה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 122,
      "char_length": 568,
      "timestamp": "2025-02-06T19:14:56.328978"
    },
    {
      "id": "vayakhel_p123",
      "text": "וזאת י\"ל גם כוונת המדרש ילקוט עשה לך קהלות גדולות ודרוש לפניהם ברבים וכו' פירוש שבכח דבוריו הקדושים יעורר אותם לתשובה, ואף שאותו הדור לא היו זקוקים לכך, שהיה בכחם לעשות תשובה מאהבה, אלא כדי שילמדו ממך דורות הבאים להקהיל קהלות וכו', כי בדורות הבאים לא יזכו למדרגת תשובה מאהבה, ותועיל להם תשובת הרבים דנפיש זכותייהון כתשובה מאהבה. וז\"ש המדרש וכן אמר דוד בשרתי צדק בקהל רב, כלומר שבישר להם שנעשו מעוונותיה זכיות בקהל רב. ע\"ו כח תשובת הרבים. וזאת גם כוונת המדרש שהיה פותח ודורש לפניהם ד\"ת שלא שמעתן אוזן מעולם, כי נתגלו להם שיש בידם לקנות להם מצות שלא נאמרו בהר סיני, ולא קלטה אזנם שמץ מנהו, והם המצוות המתהוות ע\"י שמתהפכים להם זדונות לזכיות.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 123,
      "char_length": 638,
      "timestamp": "2025-02-06T19:14:56.595929"
    },
    {
      "id": "vayakhel_p124",
      "text": "ויקהל משה וגו' פירש\"י ז\"ל לשון הפעיל שאינו אוסף אנשים בידים אלא הן נאספין על פי דבורו, עכ\"ל וקשה למה הוצרך להודיענו זאת שלא אספם משה בידים, והלא פשיטא שלא הוה משה הולך מבית לבית לקרוא להם ולהקהילם, אלא היה שולח שלוחים להקהילם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 124,
      "char_length": 226,
      "timestamp": "2025-02-06T19:14:56.916851"
    },
    {
      "id": "vayakhel_p125",
      "text": "ב) להלן בפרשה אחר שמפרש הכתוב כל מה שנצטוו להביא לנדבת המשכן, כתיב ויצאו כל עדת בני ישראל מלפני משה. יש לדקדק דהא קרא יתירא הוא דפשיטא שאחר שסיים משה דבריו שבו להם איש לאוהלו. ובכל מקום שהיתה הקהלת העדה לא מצינו שהוצרך הכתוב להודיע שאחר גמר ההקהלה שבו לביתם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 125,
      "char_length": 258,
      "timestamp": "2025-02-06T19:14:57.058977"
    },
    {
      "id": "vayakhel_p126",
      "text": "ונראה לומר כו הנה בני ישראל התעצבו אל לבם והיתה נפשם מרה עליהם על אשר חטאו בעגל, כמאה\"כ (שמות לג) ויתאבלו ולא שתו איש עדיו עליו. וודאי שהיתה להם השתוקקות גדולה לשמוע שנמחל להם אותו עון, ולכן כאשר ירד משה מן ההר למחרת יוהכ\"פ והודיע שרצונו לדבר עם כלל ישראל, מיד עברה הרנה במחנה, ונחפזו כולם לרוץ אל משה, מגודל השתוקקותם לשמוע דבר ה' מפי משה עבדו, ולא הוצרך משה לשלוח שלוחים לקרוא להם כבכל פעם. וז\"ש רש\"י ז\"ל שאינו אוסף אנשים בידים אלא הם נאספים על פו דבורו. כי הנה מדי פעם כאשר היה חפץ להקהיל את בני ישראל להשמיעם את דבר ה', אף שלא הלך בעצמו לקרוא להם, מ\"מ כיון ששלח שלוחים להקהילם, הרי זה כאילו הקהילם הוא בעצמו, כי שלוחו של אדם כמותו. אמנם עתה לא הוצרך לשלוח שלוחים אחריהם, אלא מעצמם נקהלו ובאו מרוב צמאונם לדבר ה'. ולדרך זו יתבאר אומרו ויצאו כל עדת בני ישראל מלפני משה, כי כל כך גדלה השתוקקותם לחזות בקדושת אור פני משה, עד שגם בגמר דיבוריו הקדושים לא רצו לצאת מתוך אהלו, כי נכספה וגם כלתה נפשם להיות אתו עמו ולהתבשם מקדושתו. והוצרך משה לשלחם בעל כרחם, ולכן הודיענו הכתוב ויצאו כל עדת בני ישראל מלפני משה, כלומר שיצאו שלא מרצונם אלא בעבור שחזקה עליהם פקודתו של משה לצאת להביא איש נדבתו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 126,
      "char_length": 1087,
      "timestamp": "2025-02-06T19:14:57.206714"
    },
    {
      "id": "vayakhel_p127",
      "text": "או יאמר לפרש מאה\"כ ויצאו כל עדת בני ישראל מלפני משה, דהנה קיי\"ל (שו\"ע או\"ח סי' צ' סי\"ב) אסור לרוץ כשיוצא מבית הכנסת כדי שלא תראה עליו ישיבת ביהכ\"נ כמשאוי אבל היוצא לדבר מצוה מותר לרוץ. ולפי\"ז י\"ל כו כוונת הכתוב להודיענו כו אעפ\"י שבני ישראל בבית מדרשו של משה היו עומדים ובודאי שאף מי שיצא משם כדי ללכת ללמוד בביתו, לא היה נחשב כיוצא לדבר מצוה, שמותר לו לרוץ מביהכנ\"ס, שהרי אינו דומה לימודו בביתו, למה ששמע מפי משה. ומודיענו הכתוב שאפילו הכי יצאו כל עדת בני ישראל מלפני משה, וכמ\"ש האוה\"ח הקדוש לפרש שיצאו בזריזות להביא, ולא היה בהם גם אחד שנתעכב, ע\"כ. ואל תתמה איך הותר להם לצאת בחפזון מבית מדרשו של משה, כי לפי שהלכו להביא נדבתם למשכן. ולקיים את אשר צוה להם משה מפי הגבורה, נחשבה היציאה מבית הכנסת מצוה ומותר להם לרוץ. וניחא נמי שלא מצאנו בשאר מקומות שיודיענו הכתוב שיצאו בנו ישראל מלפני משה, דשאני הכא שהיתה היציאה מצוה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 127,
      "char_length": 820,
      "timestamp": "2025-02-06T19:14:57.732170"
    },
    {
      "id": "vayakhel_p128",
      "text": "ויקהל משה וגו' במדרש ילקוט איתא רבותינו בעלי אגדה אומרים וכו' אמר לו הקב\"ה למשה עשה לך קהלות גדולות ודרוש לפניהם ברבים הלכות שבת וכו'. הקשו המפרשים מה כוונת המדרש באמרו רבותינו בעלי אגדה אומרים, ולא מצינו כן במקום אחר. עוד קשה למה רמז לנו הכתוב ענין עשית קהלות גדולות בשבת דוקא בפרשת ויקהל, שלא נאמרה בה אזהרת שבת כי אם בדרך אגב, כדי להזהיר שאין בנין המשכן דוחה שבת. והיה ראוי לרמוז זאת בפרשיות הקודמות שנאמר בהם עיקר אזהרת שבת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 128,
      "char_length": 428,
      "timestamp": "2025-02-06T19:14:58.123963"
    },
    {
      "id": "vayakhel_p129",
      "text": "ב) אלה הדברים וגו'. הקשו המפרשים שהרי עיקר מצות שבת הוא שביתה ממלאכה שהיא שלילת העשיה, והול\"ל אשר צוה ה' שלא לעשות. ולדברי הרמב\"ן ז\"ל שפירש דמאמר אלה הדברים וגו' קאי על מלאכת המשכן, קשה למה הפסיק באמצע הציווי על מלאכת המשכן וצוה על איסור מלאכה בשבת, ואח\"כ חזר לצוות על מלאכת המשכן, והיה ראוי שיקדים להזהיר על מלאכה בשבת טרם שהתחיל לצוות על מלאכת המשכן.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 129,
      "char_length": 352,
      "timestamp": "2025-02-06T19:14:58.335856"
    },
    {
      "id": "vayakhel_p130",
      "text": "ג) רש\"י ז\"ל פירש הקדים אזהרת שבת לציווי מלאכת המשכן לומר שאינו דוחה שבת. והקשה הרא\"ם פשיטא הוא שאין מלאכת המשכן דוחה שבת, דאין עשה דוחה לית ועשה ומה צריך קרא למיעוטי.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 130,
      "char_length": 166,
      "timestamp": "2025-02-06T19:14:58.514853"
    },
    {
      "id": "vayakhel_p131",
      "text": "ד) עוד יש להקשות כי דברים אלו שאמר משה לישראל הם הדברים שאמר הקב\"ה אליו הכתובים בפ' תרומה ושם לא מצינו שהזהירו הקב\"ה שאין המשכן דוחה שבת ומדוע הזהיר משה את ישראל על כך.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 131,
      "char_length": 168,
      "timestamp": "2025-02-06T19:14:58.637510"
    },
    {
      "id": "vayakhel_p132",
      "text": "ה) במד\"ר פ' תרומה איתא (פל\"ג ז) ויקחו לי תרומה הה\"ד כי לקח טוב נתתי לכם וכו' ד\"א הה\"ד תורה צוה לנו משה מורשה אל תקרי מורשה אלא ירושה ירושה היא לישראל לעולם, ע\"כ. וצ\"ב.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 132,
      "char_length": 167,
      "timestamp": "2025-02-06T19:14:58.785369"
    },
    {
      "id": "vayakhel_p133",
      "text": "ולבא לביאור הענין נקדים מה שביארנו בפרשת כו תשא ליישב קושיית המזרחי הנ\"ל דמה צריך קרא שאין מלאכת המשכן דוחה שבת, פשיטא היא. וביארנו עפ\"י מה דאיתא בגמרא (סוכה מ\"א ע\"ב) יום הנף כולו אסור דחיישינן שמא יבנה ביהמ\"ק ביו\"ע ויקריבו העומר אחר חצות עיי\"ש. והקשה רש\"י ז\"ל הא און בנין ביהמ\"ק דוחה יו\"ט כדאיתא בשבועות (ט\"ו ע\"ב) ותירץ דה\"מ בנין הבנוי בידי אדם אבל מקדש העתיד שאנו מצפים בנוי ומשוכלל הוא יגלה ויבא משמים, וכ\"כ התוס' שם. והקשה בערוך לנר שם שהרי מצינו בכ\"מ במדרש שגם בנין העתיד יתעסקו בו בנו אדם. ותירץ דתרוייהו איתנייהו ביה מתחלה יתעסקו בו בני אדם ואח\"כ ירד בנוי ומשוכלל משמים וכ\"כ אא\"ז זלה\"ה ביטיפ. וביארנו שם דעל כרחיך צ\"ל שאין הכוונה שמתחלה יתעסקו בו בנו אדם בפועל ממש, שהרי בגמרא סוכה הנ\"ל משמע להדיא שלא יעסקו בו בני אדם כלל, דאל\"כ הדרא קושיא לדוכתא כיצד יוכלו בני אדם להתעסק בו ביו\"ט, והא און בנין ביהמ\"ק דוחה יו\"ט. אלא ע\"כ שהכוונה על ההכנה לבנינו, כגון הלימוד וההבנה בצורת הבית ובמדותוו, כי הלימוד וההבנה נחשב כמעשה בפועל ממש, וכדאיתא במדרש תנחומא פ' צו (י\"ד) וז\"ל בא וראה כשהקב\"ה מראה ליחזקאל את צורת הבית מה הוא אומר הגד את בית ישראל את הבית ויכלמו מעוונותיהם ומדדו את תכנית (יחזקאל מ\"ג) וכו' א\"ל הקב\"ה ליחזקאל וכי בשביל שבני נתונים בגולה יהא בנין ביתי בעל א\"ל הקב\"ה גדול קריותה בתורה כבניינה לך אמור להם ויתעסקו לקרות צורת הבית בתורה ובשכר קרוותה שיתעסקו לקרות בה אני מעלה עליהם כאלו הם עוסקים בבנין הבית, ע\"כ. הרי מפורש כי העסק בתורה בצורת ביהמ\"ק ומדותיו נחשב כעשויה בפועל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 133,
      "char_length": 1384,
      "timestamp": "2025-02-06T19:14:58.978702"
    },
    {
      "id": "vayakhel_p134",
      "text": "והנה אילו לא היו ישראל חועאים בעגל, והיו נשארים במדרגה שזכו אליה בעת המעמד הנבחר, היו זוכים מיד אל התיקון השלם, והיה המשכן יורד אליהם משמים בנוי ומשוכלל, ולא היו צריכים לעסוק בבניינו בפועל, כי אם לעסוק בתורה בצורתו ובמדותיו אך ע\"ו שחטאו בעגל נפלו ממדרגתם, ולא זכו אל התיקון השלם, ולכן הוצרכו להתעסק בבנין המשכן בפועל. ועל פי זה יתיישב מה שהקשינו (קושיא ד) שהרי בפרשת תרומה לא מצינו שציוה הקב\"ה למשה שיזהיר את ישראל שאין מלאכת המשכן דוחה שבת, ומדוע הוצרך משה לצוות את בני ישראל שאין מלאכת המשכן דוחה שבת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 134,
      "char_length": 503,
      "timestamp": "2025-02-06T19:14:59.671118"
    },
    {
      "id": "vayakhel_p135",
      "text": "והשתא אי\"ש כו בעת דבר ה' אל משה וצוהו ל עשיית המשכן עדיין היו ישראל ברום המעלה, שהרי פרשת תרומה נאמרה למשה קודם חטא העגל כמ\"ש בזה\"ק (ויקהל קצ\"ה ע\"א) שעל כן נאמר בה מאת (כל איש לרבות הע\"ר לנתינה, ולפיכך לא היה מקום להזהיר את ישראל בעת ההיא שלא יבנו את המשכן בשבת, שהרי קודם חטא העגל היו ראוים שירד בנוי ומשוכלל מן השמים, ולא היו צריכים לעשות מעשה בהקמתו, ובלימוד צורתו ותכונותיו סגי להו, ומלאכה כזאת מותרת גם בשבת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 135,
      "char_length": 413,
      "timestamp": "2025-02-06T19:14:59.919438"
    },
    {
      "id": "vayakhel_p136",
      "text": "אמנם בעת שהגיד משה לבני ישראל את ציווי הקב\"ה לבנות את המשכן, הוא הציווי האמור בפרשת ויקהל, כבר היה אחר חטא העגל, כמ\"ש רש\"י ז\"ל שפרשה זו נאמרה להם ממחרת יוהכ\"פ. וכדאיתא בזה\"ק ושם) שעל כן נצטוו קחו מאתכם תרומה לה מאתכם דייקא, ולא מן הע\"ר שעשו את העגל. ובסבת החטא נפלו ישראל ממדרגתם ולא זכו אל התיקון השלם ולירידת משכן בנוי ומשוכלל משמים, אלא היו צריכים לעסוק בהקמתו בפועל, על כן הוצרך משה להזהירם שאין בנין המשכן דוחה שבת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 136,
      "char_length": 420,
      "timestamp": "2025-02-06T19:15:00.141378"
    },
    {
      "id": "vayakhel_p137",
      "text": "ועל פי זה יתבאר מאה\"כ אלה הדברים אשר צוה ה' לעשות אותם, דקאי על מלאכת המשכן כדברי הרמב\"ן ז\"ל, אמנם כוונת הכתוב כאן להזהיר שאין מלאכת המשכן דוחה שבת, ומשו\"ה פתח במאמר אלה הדברים אשר צוה ה' לעשות אותם\", כלומר שצוה לעסוק בבנין מלאכת המשכן, דאילו היה הכתוב מקדים אזהרת שבת קודם מאמר אלה הדברים, לא הוי ידעינן טעמא דמילתא שאין המשכן דוחה שבת, שהרי בלימוד צורת המשכן סגי, על כן אמר הכתוב אלה הדברים, פירוש בנין המשכן, אשר צוה ה' לעשות\" אותם, דלא סגי בלימוד צורת המשכן אלא קודם חטא העגל, שהיו ראויים שיהי' עולם התיקון והמשכן ראוי לרדת בנוי ומשוכלל משמים. אבל אחר שחטאו בעגל המה חייבים לבנותו בפועל, ולפיכך אסורים הם לבנותו בשבת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 137,
      "char_length": 621,
      "timestamp": "2025-02-06T19:15:00.370564"
    },
    {
      "id": "vayakhel_p138",
      "text": "ועל פי זה י\"ל הילקוט המובא בפתח דברנו רבותינו בעלי אגדה אומרים וכו' אמר הקב\"ה למשה עשה לך קהלות גדולות ודרוש לפניהם ברבים הלכות שבת וכו'. דהנה כל זמן שהיו ישראל במעלתם הגדולה שזכו לה במתן תורה, לא היו זקוקים כ\"כ לעסוק בדברי אגדה, אמנם אחר שחטאו בעגל וירדו ממדרגתם נתרופפה אמונתם במקצת, והוצרכו לעסוק בדברי אגדה המקרבים לבו של אדם ליראת ה', לפי שמלובשים בהם דברי מוסר המביאים ליראה מרוממות הבורא, כאמרם ז\"ל (ספרי עקב פמ\"ט) רצונך שתכיר את מי שאמר והיה העולם למוד אגדה. ועל כן אמר הילקוט רבותינו בעלי אגדה אומרים וכו' להורות על כוונה זו שנצטווה לדרוש לפניהם גם בדברי אגדה, כדי לקרבם ליראת השם הנכבד והנורא, לפי שנתקררה יראתם ע\"י החטא.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 138,
      "char_length": 631,
      "timestamp": "2025-02-06T19:15:00.669432"
    },
    {
      "id": "vayakhel_p139",
      "text": "והשתא מיושב גם מה שהקשינו למה רמז הכתוב ענין הקהלת קהלות לדרוש לפניהם בשבת בפרשה זו שנאמרה בה אזהרת שבת רק בדרך אגב. אמנם השתא מובן הדבר היטב כי אילו היה נרמז ענין הקהלת העדה לדרוש לפניהם בשבת בפרשיות הקודמות ששם נצטוו על עיקר מצות שבת, לא היה נשמע ענין הדרשה בדברי אגדה, שהרי באותו מצב שהיו בו קודם החטא לא היו צריכים לדרוש בדברי אגדה, על כן נטר קרא עד הכא, ורמז ענין הקהלת העדה בשבת בפרשה זו שנאמרה אחר מעשה העגל, לרמוז על החיוב לדרוש בדברי אגדה בשבת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 139,
      "char_length": 453,
      "timestamp": "2025-02-06T19:15:00.984645"
    },
    {
      "id": "vayakhel_p140",
      "text": "ולדרכינו יתבאר דברי המדרש הנ\"ל (קושיא ה') ויקחו לי תרומה הה\"ד כי לקח עוב נתתי לכם וגו' ד\"א ויקחו לי תרומה הה\"ד תורה צוה לנו משה מורשה וכו' ירושה היא לישראל לעולם. דהנה ביארנו לעיל כי בעת צוה ה' למשה פרשת ויקחו לי תרומה, לא היתה הכוונה על עסק בפועל בבנין המשכן, שהרי באותה העת היו ברום המעלות, ואילו זכו לעמוד במדרגתם היה מיד התיקון השלם, והיו זוכים שירד להם משכן של אש בנוי ומשוכלל משמי מרום ולא היה להם צורך לעסוק בבנין המשכן בפועל, אלא שהיה מתקיים ציווי הקב\"ה לבנות המשכן ע\"י שהיו עוסקים בלימוד צורתו ומדותיו, כמבואר בתנחומא הנ\"ל. וזאת כוונת המדרש עה\"פ ויקחו לי תרומה בא לבאר שלא יקשה כיצד היו ישראל מקיימים מצוה זו, והרי אז היו ראויים שיתגלה להם משכן בנוי ומשוכלל מן השמים, על כן אמר הה\"ד כי לקח טוב נתתי לכם תורתי אל תעזובו. כלומר שבידם לקיים מצות בנין המשכן, ע\"ו העסק והלימוד של צורת המשכן ומדותיו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 140,
      "char_length": 803,
      "timestamp": "2025-02-06T19:15:01.221966"
    },
    {
      "id": "vayakhel_p141",
      "text": "ובדרך זו יובן גם אידך מדרשא ויקחו לי תרומה הה\"ד תורה צוה לנו משה מורשה, כלומר שנצטוו לקיים מצות בנין המשכן ע\"י לימוד התורה, ומסיים המדרש אל תקרי מורשה אלא ירושה ירושה היא לישראל לעולם. כלומר אילו היו ישראל זוכים לקיים מצוות בנין המשכן ע\"ו לימוד התורה, אזי היה המשכן ירושה לישראל לעולם, ולא היה חרב, שהרי אילו היו במדרגה זו היה המשכן יורד להם בנוי ומשוכלל מן השמים, והיו זוכים מיד אל התיקון השלם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 141,
      "char_length": 395,
      "timestamp": "2025-02-06T19:15:01.601000"
    },
    {
      "id": "vayakhel_p142",
      "text": "ובבחינה זו יש לפרש גם כוונת התנא דבי אליהו (פי\"ז) בשעה שאמרו ישראל נעשה ונשמע מיד אמר הקב\"ה ויקחו לי תרומה, דהנה נשמע קאי על לימוד התורה, ואמרו נעשה שנקיים מצות בנין המשכן, ע\"ו מ נשמע\", פירוש ע\"ו לימוד התורה והעסק וההבנה בצורת המשכן. שהרי אז היו במדרגה גדולה שלא הוצרכו לבנות את המשכן בפועל, אלא היו ראויים שירד בנוי ומשוכלל מן השמים, והיו מקיימים מצות בנין המשכן ע\"י לימוד התורה, ועל כן אמיד' אמר הקב\"ה ויקחו לי תרומה, כלומר שלא הוצרך הקב\"ה להקדים ולהזהיר קודם שיצוה על מעשה המשכן שלא יבנוהו בשבת, שהרי באופן זה יותר להם לבנותו גם בשבת ע\"י לימוד התורה. ועל כן פתח הקב\"ה דבריו מיד במצות ויקחו לי תרומה לבנין המשכן.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 142,
      "char_length": 614,
      "timestamp": "2025-02-06T19:15:01.814281"
    },
    {
      "id": "vayakhel_p143",
      "text": "דרוש לפרשת שקלים ויקהל משה את כל עדת בני ישראל ויאמר אליהם אלה הדברים אשר צוה ה' לעשות אותם וגו'. קשה מה נשתנתה פרשה זו שנאמר בה ויקהל, והלא כל דיני התורה בהקהל נאמרו כדאיתא בעירובין (נ\"ד ע\"ב), ולא הוצרך הכתוב להודיענו בהם שנאמרו בהקהל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 143,
      "char_length": 236,
      "timestamp": "2025-02-06T19:15:02.127353"
    },
    {
      "id": "vayakhel_p144",
      "text": "ב) הקשו המפרשים דפשטות הכתוב מורה שמאמר אלה הדברים וגו' סובב על מצות שבת דכתיבא בתריה, וא\"כ למה נאמר אשר צוה ה' לעשות אותם, הו\"ל למימר שלא לעשות, דעיקר מצות שבת הוא שלילת העשיה. והרמב\"ן ז\"ל פירש דמאמר אלה הדברים נאמר על ציווי מלאכת המשכן, ולדבריו ניחא מה דכתיב לעשות אותם, אך הקשה הכלי יקר ז\"ל דע\"כ און לומר דאלה הדברים קאי על נדבת המשכן, שהרי להלן כתיב זה הדבר אשר צוה ה' קחו מאתכם, א\"כ ציווי נדבת המשכן אמור, ותרתי זמני למה לי.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 144,
      "char_length": 429,
      "timestamp": "2025-02-06T19:15:02.272231"
    },
    {
      "id": "vayakhel_p145",
      "text": "ג) רש\"י ז\"ל כתב הקדים להם אזהרת שבת למלאכת המשכן לומר שאינו דוחה שבת. הקשה הרא\"ם ז\"ל אמאי איצטריך קרא שאין מלאכת המשכן דוחה שבת, והלא מלאכת המשכן עשה ושבת עשה ול\"ת ואין עשה דוחה ל\"ת ועשה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 145,
      "char_length": 187,
      "timestamp": "2025-02-06T19:15:02.501166"
    },
    {
      "id": "vayakhel_p146",
      "text": "ד) היום קרינו פרשת שקלים. כי תשא את ראש בני ישראל לפקודיהם ונתנו איש כופר נפשו לה' וגו'. בגמרא מגלה (דף י\"ג ע\"ב) איתא אמר ר\"ל גלוי וידוע לפני מי שאמר והיה העולם שעתיד המן לשקול שקלים על ישראל לפיכך הקדים שקליהם לשקליו, ע\"כ. ויש להקשות לפי מאמר זה על הא דכתבו התוספות שם (דף ט\"ז ע\"ב) ד\"ה ודחי עשרה אלפי ככרי וז\"ל שמעתי שעשרה אלפי ככר כסף עולים חצי שקל לכל אחד מישראל שהיו ת\"ר אלף כשעלו ממצרים ואמר שיתן לאחשורוש כל פדיונם, ע\"כ. והנה לפי דברי התוספות נמצא שכל מה שנתן המן עשרת אלפים ככרי כסף היה כדי לבטל כח השקלים שנתנו ישראל, ולולא נתנו ישראל שקלים בכל שנה לא היה עולה על דעתו לשקול שקלים על ישראל, ואילו מדברי הגמרא משמע דאף שלא היו נותנין ישראל מחצית השקל בכל שנה, היה המן עתיד לשקול שקלים על ישראל, ומשום כך הקדים הקב\"ה שקלי ישראל לשקליו, להפר עצתו ולבעל כח השקלים שהוא עתיד לשקול וצ\"ע ליישב דברי התוספות.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 146,
      "char_length": 808,
      "timestamp": "2025-02-06T19:15:02.629584"
    },
    {
      "id": "vayakhel_p147",
      "text": "ה) במדרש תנחומא פ' תשא (סי' ג') איתא בפרשת שקלים אמר משה לפני הקב\"ה רבש\"ע משאני מת אין אני נזכר אמר לו הקב\"ה חייך כשם שאתה עומד עכשיו ונותן להם פרשת שקלים ואתה זוקף את ראשם כך בכל שנה ושנה שקוראים אותה לפני כאילו אתה עומד שם באותה שעה וזוקף את ראשם וכו' עכ\"ל. וצ\"ב מדוע נתיירא משה בפרשת שקלים דוקא שלא יזכר לאחר מותו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 147,
      "char_length": 317,
      "timestamp": "2025-02-06T19:15:03.033647"
    },
    {
      "id": "vayakhel_p148",
      "text": "ו) זה יתנו כל העובר על הפקודים וגו' בירושלמי שקלים איתא ופ\"א ה\"ג) כל העובר על הפקודים ותן וגו' כל דעבר בימא יתן (ופירש בקרבן עדה כל מי שעבר בים יתן מחצית השקל ומרבינן מיניה גם כהנים ולויים למחצית השקל) וצ\"ב למה תלה הכתוב חיוב מצות מחצית השקל במה שעברו בים סוף, ומה שייכות איכא בינייהו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 148,
      "char_length": 285,
      "timestamp": "2025-02-06T19:15:03.217937"
    },
    {
      "id": "vayakhel_p149",
      "text": "ז) העשיר לא ירבה והדל לא ימעיט ממחצית השקל וגו'. רבותינו בעהתו\"ס נתנו שני טעמים לאזהרה זו, חדא כדי לכוון החשבון. שאם יתן כל אחד כנדבת לבו לא יוכלו למנותם ע\"י השקלים, ועוד טעם בדבר כדי שלא יוכל העשיר לומר חלקי גדול במקדש יותר ממך. עכ\"ד. ושני הטעמים קשים להלמם לטעם הראשון יש להקשות דא\"כ לא שייכא אזהרת העשיר לא ירבה והדל לא ימעיט אלא בחצאי השקלים שנמנו בהם ישראל, ואיתא במדרש תנחומא (פ' תשא ט') בעשרה מקומות נמנו ישראל תשעה בעוה\"ז ואחד שעתידין להמנות לעתיד לבא עיי\"ש. משא\"כ בחצאי השקלים שנתנו ישראל בכל שנה לקרבנות צבור ליכא למימר שלא יוכלו לכוון החשבון, שהרי לא נמנו בהם וא\"כ למה נצטוו באזהרת העשיר לא ירבה וגו' גם בחצאו השקלים שנתנו בכל שנה ולא נמנו בהם. ולעעם הב' שכתבו בעהתו\"ס, שע\"כ הושוו בתרומה זו עניים ועשירים שלא יתגאה העשיר לומר חלקי גדול מחלקך יש להקשות, שא\"כ למה לא הקפידה תורה על כך בנדבת המשכן, שאמר הכתוב כל איש אשר ידבנו לבו, והלא יש לחוש שותגאה העשיר לומר חלקי במשכן גדול מחלקך, וכקושיא זו יש להקשות גם על מה שיסד הפייטן ביוצר לשבת שקלים קצינים ורשום וחד בה שקולים קצין לבל יעוז מול מקהלים קרא לאמר הוני פדאני מעיקולים. ונראה שהכוונה שנתנו כולם בשוה מחצית השקל כדי שלא יתגאה העשיר לומר שחלקו גדול מחלק העני בקרבנות צבור, הבאים מן השקלים שנתנו ישראל בכל שנה, ולפיכך נפדה הוא מעוונותיו ע\"ו חלקו הגדול בקרבנות הבאים לכפרה. וגם לטעם זה יש להקשות כנ\"ל, שגם בנדבת המשכן יש לחוש שיאמר חלקי גדול מחלקך, ולפיכך נתכפרו לו עוונותי, שהרי גם המשכן בא לכפרה על עוון העגל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 149,
      "char_length": 1372,
      "timestamp": "2025-02-06T19:15:03.378162"
    },
    {
      "id": "vayakhel_p150",
      "text": "ונראה לבאר הענין בהקדם מה שכתב רש\"י ז\"ל בפרשת תשא כי המנין האמור שם היה בהתחלת נדבת המשכן כדי לידע מנין הנותרים מן הנופלים בעגל ואין זה מנין האמור בחומש הפקודים וכו' ששתים היו אחת בתחלת נדבתם אחר יום הכיפורים בשנה ראשונה ואחת בשנה שניה באייר משהוקם המשכן וא\"ת וכו אפשר שבשני המניינים היו ישראל שוים שש מאות אלף ושלשת אלפים וחמש מאות וחמשים והלא בשתי שנים היו וא\"א שלא היו בשעת מנין הראשון בני י\"ט שנה שלא נמנו ובשניה נעשו בנו כ' תשובה לדבר וכו' שנות האנשים מנויין למנין שנות עולם המתחילים מתשרי נמצאו שנו המנינים בשנה אחת וכו' עכ\"ד רש\"י ז\"ל. והרמב\"ן ז\"ל הרבה השיב על דבריו חדא שאיך יתכן שיהי' קהל גדול כ\"כ ולא ימותו בו בחצי שנה למאות ולאלפים, ועוד הקשה הרמב\"ן ז\"ל כי מנין שנות האנשים איננו למנין שנות עולם מתשרי אלא מעת לעת מיום הוולדם שכך נאמר בהם עשרים שנה ומעלה שיהיו שנים שלמות להם וכן כל מניני התורה בשנות האדם כך נמנים כדאיתא במס' ערכין (דף י\"ח ע\"ב) שנה האמורה בקדשים וכו' ושבבן ושבבת כולן מעת לעת וכו' ומפורש התם ושבבן ושבבת למאי הלכתא אמר רב גידל אמר רב לערכין והטעם מפני שכתוב בהם ומעלה וכו' ומנין המדבר כמנין הערכין לכל דבר כמו שאמרו בבבא בתרא גמר ומעלה ומעלה מערכין, וא\"כ כל הנולדים מתשרי ועד אייר השלימו שנה בינתים ונתרבו בין שני המנינים עם רב.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 150,
      "char_length": 1156,
      "timestamp": "2025-02-06T19:15:04.096310"
    },
    {
      "id": "vayakhel_p151",
      "text": "והרא\"ם ז\"ל ירד להציל את רש\"י ז\"ל מהשגות הרמב\"ן וכתב ואין מכל אלו טענה כלל, דמה שטען איך יתכן בקהל גדול כמוהו שלא ימותו בחצי שנה למאות ולאלפים אינה טענה, שהרי כמה נסים ונפלאות נעשו לישראל בצאתם ממצרים, וכל עניניהם שלא כנוהג העולם, ומה תימה שלא מתו מהם בחצי שנה וכו'. ומה שהשיג הרמב\"ן ז\"ל על רש\"י ז\"ל דמנין שנות האנשים מנינן מעת לעת כדאיתא בערכין, ישבה הרא\"ם ז\"ל דלא משמע מתיבת ומעלה אלא שכל זמן שלא שלמה שנת ששים אכתי הוא כלמטה מששים, וכן בשנת חמש ושנת עשרים, דערכין וה\"ה נמי שמעינן מקרא דמבן עשרים שנה ומעלה וכו', שכל זמן שלא שלמה שנת כ' הוא כלמטה מעשרים ואיננו בכלל הפקודים, ולא שיובנו ממנו שיהיו אותם השנים מעת לעת וכו', אלא ללמד ששנת עשרים דיוצאו מצרים וכן שנת ששים דערכין כל זמן שלא שלמה עד ר\"ח תשרי אינה נמנית במנין השנים, אלא שנת עשרים כשנת י\"ט ושנת ס' כשנת נ\"ט, והביא הרא\"ם ז\"ל ראי' מפורשת לדעת רש\"י ז\"ל, מדברי המדרש רבה פ' במדבר ופ\"א ח) עה\"פ ויהיו כל הפקודים שש מאות אלף שאין מונין להם אלא מתשרי שהוא ר\"ה לברייתו של אדם הראשון.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 151,
      "char_length": 935,
      "timestamp": "2025-02-06T19:15:04.632308"
    },
    {
      "id": "vayakhel_p152",
      "text": "ועל מה שכתב הרמב\"ן ז\"ל לתת טעם למה שהושוו שנו המנינים לפי שבמנין הראשון נמנה גם שבט לוי עמהם, משא\"כ במנין השני נצטוו אך את מטה לוו לא תפקוד (במדבר א), כתב הרא\"ם ז\"ל דרש\"י לא סבירא ליה הכי, אלא דעת רש\"י ז\"ל שגם במנין הראשון לא נמנו הלויים עמהם, לפי שמיד אחר מעשה העגל נפסלו הבכורות מלשמש בעבודה, ונבחרו הלויים תחתיהם, על כן לא נמנו ביחד עם ישראל, ואף שלא כתבה תורה במנין הראשון אזהרה שלא ימנה שבט לוי עמהם, י\"ל הטעם, שלא כתבה תורה בפירוש את המנין הראשון, ולפיכך נכתבה אזהרה זו במנין השני האמור בחומש הפקודים, ואין מוקדם ומאוחר בתורה, ואזהרה זו קאי גם על מנין הראשון ע\"כ. וגדולה מזו כתבו בעלי התוספות שהוקשה להם על פירש\"י ז\"ל כקושית הרמב\"ן ז\"ל שמנין שנות האנשים מנינן מעל\"ע דכתיב בהו ומעלה, וכתבו לכן נראה לי שלא נמנו אלא פעם אחת, וגם אלו שעלו בחדש השני וישלימו לכ' שנה, נתנו מיד במנין שאחר יוהכ\"פ של שנה ראשונה, וכ\"מ מתוך פירש\"י שכתב והשנית אף היא ע\"י מנין שמנאן משהוקם המשכן, ונמצא לפי זה שמנין השקלים שבאויר שוו לאלו, ע\"כ. ואף שדבריהם פלואים במה שפירשו בדברי רש\"י ז\"ל שהרי רש\"י ז\"ל כתב להדיא טעם אחר למה שהושוו המנינים, לפי ששניהם היו בשנה אחת, מ\"מ מבואר מדבריהם דס\"ל שגם אלו שלא הגיעו לשנת כ' במנין הראשון, נתחייבו לתת מחצית השקל משום שהם עתידים להיות בני כ' במנין השני, וא\"כ כ\"ש דיש לומר כסברת הרא\"ם ז\"ל שלא נמנו הלויים אף במנין הראשון, ואף שלא נאמרה אזהרה שלא למנות את הלויים עד המנין השני, מ\"מ לא נמנו אף במנין הראשון, לפי שהיו עתידים להצטוות במנין השני אך את מטה לוי לא תפקוד.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 152,
      "char_length": 1382,
      "timestamp": "2025-02-06T19:15:05.108905"
    },
    {
      "id": "vayakhel_p153",
      "text": "ועוד השיג הרמב\"ן ז\"ל על מה שכתב רש\"י ז\"ל כי חצאי השקלים שנתנו במנין השני בחומש הפקודים היו לקנות מהם קרבנות צבור. והקשה שהרי השקלים לקרבנות אינם מבני עשרים שנה ולמעלה, אלא משהביא שתי שערות חייב לשקול, וכן מפורש במסכת שקלים, עכ\"ד הרמב\"ן ז\"ל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 153,
      "char_length": 240,
      "timestamp": "2025-02-06T19:15:05.773188"
    },
    {
      "id": "vayakhel_p154",
      "text": "וכדי ליישב השגה זו נראה דהנה הך מילתא במחלוקת שנוי' דדעת הרא\"ה ז\"ל בספר החנוך כי מחצית השקל לקרבנות חייבים רק בנו עשרים ומעלה. וכתב עליו במנחת חינוך שנטה מדרך הרמב\"ם שכתב בהלכות שקלים (פ\"א ה\"ז) וז\"ל הכל חייבים ליתן במחצית השקל כהנים לויים וישראל וגרים ועבדים משוחררים אבל לא נשים ולא קטנים, ע\"כ. הרי מבואר שלא נתמעטו ממחצית השקל אלא קטנים, אבל הפחותים מבני כ' חייבים בו. אמנם הרע\"ב ז\"ל במסכת שקלים (פ\"א מ\"ז) כתב נמי כדעת ספר החינוך שאין חייבים במחצית השקל אלא בני כ' ולמעלה, וכן פסק הרמ\"א ז\"ל בהלכות מגלה סי' תרצ\"ד סעיף א' שאין חייבים לתת מחצית השקל אלא בני כ' ולמעלה, והמג\"א פליג עליה והביא דברי התוי\"ט במס' שקלים שם שחלק על הרע\"ב וס\"ל כדעת הרמב\"ם וההולכים בשיטתו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 154,
      "char_length": 665,
      "timestamp": "2025-02-06T19:15:05.918480"
    },
    {
      "id": "vayakhel_p155",
      "text": "תמצית הדברים כי מצינו כמה פוסקים דס\"ל שאין חייבים במחצית השקל לקרבנות כו אם בנו כ' ולמעלה. וא\"כ אף אנו נאמר דרש\"י ז\"ל ס\"ל ככל הנך פוסקים, וסרה תלונת הרמב\"ן ז\"ל מעליו דשפיר איכא למימר שמאותן השקלים שנתנו במנין השני האמור בחומש הפקודים נקנו קרבנות צבור, ואעפ\"כ לא נתחייבו בהם אלא בני כ' ולמעלה כדעת החינוך וההולכים בשיטתו. ואף אם נאמר דרש\"י ס\"ל כדעת הרמב\"ם וסייעתיה שחיוב מחצית השקל לקרבנות זמנו משהביא ב' שערות, מ\"מ יש ליישב דעת רש\"י ז\"ל כי אמנם נתנו מחצית השקל גם הפחותים מבני עשרים, אלא שלמנין לא באו, אלא חצאי השקלים שנתנו אותם שהגיעו לכלל עשרים וחלק הפחותים מבני עשרים נתנו לקופה אחרת לקנות מהם קרבנות צבור.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 155,
      "char_length": 610,
      "timestamp": "2025-02-06T19:15:06.237036"
    },
    {
      "id": "vayakhel_p156",
      "text": "היוצא מזה לעניינינו כו איכא פוסקים דס\"ל שנתחייבו ישראל במחצית השקל לקרבנות משהביאו ב' שערות, ואפי' הפוסקים דסברי שלא נתחייבו אלא בנו כ' ומעלה, מ\"מ גם הפחותים מבני כ' יכולים להביא עצמם לידי חיוב וכדתנן במתניתין (שקלים פ\"א) כל קטן שהתחיל אביו לשקול על ידו שוב אינו פוסק. ועל פי זה נבוא לביאור דברי הגמרא מגלה הנ\"ל ואות ד) גלוי וידוע לפני מי שאמר והיה העולם שעתיד המן לשקול שקלים על ישראל לפיכך הקדים שקליהם לשקליו. דהנה הבאנו לעיל דברי התוספות במגלה שהמן נתן לאחשורוש עשרת אלפים ככר כסף לפי שהם עולים מחצית שקל לכל אחד מישראל שהיו ששים רבוא כשיצאו ממצרים. וכתב הב\"ח בהגהותיו לבאר החשבון דהנה מחצית השקל לששים רבוא עולה מאה ככר של קודש כי ככר קודש הוא מאה ועשרים מנה והמנה כ\"ה סלעים וימי שנותינו בהם שבעים שנה ומבן עשרים שנה ומעלה נתנו מחצית השקל על כן נתן המן עשרת אלפים ככר כסף של חול שהם ה' אלפים ככר של קודש נגד חצאי השקלים שנתנו כל ישראל במשך חמשים שנה משנת עשרים עד שבעים. והבן. הרי מזה כי המן נתן שקליו לנגד שקלי ישראל לפי מה שעלה בחשבונו שישראל נותנים מבני כ' ולמעלה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 156,
      "char_length": 972,
      "timestamp": "2025-02-06T19:15:06.526288"
    },
    {
      "id": "vayakhel_p157",
      "text": "אכן כפי מה שנתבאר דלדעת הרבה פוסקים חייבים ישראל במחצית השקל מבני י\"ג ולמעלה, וגם אידך פוסקים דלא סברי הכי מ\"מ גם הפחותים מבני עשרים יש בידם להביא עצמם לידי חיוב, וכדתנן במתניתין כל קטן שהתחיל וכו' שוב אינו פוסק, ולפי זה טעה אותו רשע בחשבונו, שהרי לא היה חשבון השקלים שנתן מכוון נגד שקלי ישראל, כו נעלם ממנו והוא לא ודע שהמה שוקלים שקליהם גם בהיותם פחותים מבני עשרים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 157,
      "char_length": 367,
      "timestamp": "2025-02-06T19:15:07.006111"
    },
    {
      "id": "vayakhel_p158",
      "text": "וזאת אפשר לומר בכוונת הגמרא גלוי וידוע וכו' שעתיד המן לשקול שקלים על ישראל, כפירוש התוספות שהיה מכוון בחשבונו לתת נגד כל השקלים שנתנו ישראל מבני עשרים ועד בנו שבעים, עמד והקדים שקליהם לשקליו, כלומר שהקדים השי\"ת זמן חיוב נתינת השקלים שגם הפחותים מבני כ' חייבים בהו, או יש בידם להביא עצמם לכלל חיוב כדו שישתבש אותו רשע בחשבונו, ולא תעלה בידו לשקול שקלים במספר מכוון נגד שקלי ישראל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 158,
      "char_length": 379,
      "timestamp": "2025-02-06T19:15:07.219466"
    },
    {
      "id": "vayakhel_p159",
      "text": "ובזה מיושב שפיר מה שהקשינו לעיל על דברי התוספות הנ\"ל שדבריהם נראה כסותרים לדברי הגמרא, ולדברנו יובן היטב דשפיר יש לפרש גם בדברי הגמרא ששקלי המן באו לבעל כח שקלי ישראל, ולא תקשה שא\"כ למה סבב ה' ככה שיתנו ישראל שקלים ויעמוד אותו רשע לבטל שקליהם, דאין כוונת הגמ' על עצם מצות השקלים שבאה לבטל כח שקלי המן. אלא שדייק בלישניה לומר עמד והקדים שקליהם לשקליו, והיינו שבחסדי המקום עלינו הקדים זמן הנתינה שגם פחותים מבני כ' בכלל נתינה נינהו וכמבואר, וע\"י כך נתבלבלה מחשבתו והופרה עצתו של אותו רשע, כי לא ודע לכוון חשבון שקליו לנגד שקלי ישראל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 159,
      "char_length": 531,
      "timestamp": "2025-02-06T19:15:07.415255"
    },
    {
      "id": "vayakhel_p160",
      "text": "ובטרם נבא לבאר שאר המאמרים והדקדוקים הנ\"ל בפרשת שקלים נקדים ליישב הדקדוקים בפרשתנו. דהא שדקדקו המפרשים מדוע הוצרך הכתוב להודיע שפרשה זו נאמרה בהקהל, והלא כל התורה בהקהל נאמרה, ונראה ליישב דהנה מצינו שמשונה דין נדבת המשכן מדין מחצית השקל לקרבנות שהרי במחצית השקל נצטוו כל ישראל, משא\"כ בנדבת המשכן לא זכו לתת אלא בני העליה שבישראל, כדאיתא בזה\"ק (פ' תרומה דף קכ\"ח ע\"א) ויקחו לו תרומה מאת כל איש מההיא דאיקרי איש דאותגבר על יצריה וכל מאן דאיתגבר על יצריה איקרי איש אשר ידבנו לבו דיתרעי ביה קב\"ה וכו' עכ\"ל. עיי\"ש שמונה והולך כמה מדרגות גבוהות ורק מי שזכה לעלות בסולם העולה בית א\"ל, ראוי לתת תרומת ה'. לא זולת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 160,
      "char_length": 604,
      "timestamp": "2025-02-06T19:15:07.689088"
    },
    {
      "id": "vayakhel_p161",
      "text": "ברם דבר זה אינו מסור לבני אדם להבחין תכונת האדם ומעשהו, ולשקול בפלס מי הוא האיש אשר עלה ונתעלה להיות ראוי לתת תרומת ה', ואין מכיר בכך אלא הבוי\"ת לבדו החופש כל חדרי בטן ובוחן כליות ולב, ולפיכך צוה ה' לקחת נדבה למשכן מכל ישראל, ונעשה נס שהספיק חלק הנדבה שנתנו בני העליה לכל מלאכת המשכן, ונותר חלק האנשים שלא היו במדרגה זו להיות ראויים לתת תרומת ה', ובזה פירשנו להלן בפרשה מאה\"כ והמלאכה היתה דיים והותר עיי\"ש.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 161,
      "char_length": 406,
      "timestamp": "2025-02-06T19:15:07.985606"
    },
    {
      "id": "vayakhel_p162",
      "text": "ובדרך זה ביארנו הא דאיתא במדרש תנחומא פ' תרומה וסי' ד') עה\"פ והם הביאו אליו עוד נדבה בבוקר בבוקר א\"ר יוחנן וכו' מהו בבוקר בבוקר לשני בקרים הביאו את כל נדבת המשכן שנשתלחה ברכה בנדבותיהם. וקשה והרי לא עביד קב\"ה ניסא למגנא ועל מה עשה ה' ככה שתשתלח ברכה מרובה כ\"כ בנדבתם עד שיותירו. ועפ\"י האמור מובן היטב כי לא נעשה הנס על מגן, כי היה צורך בכך לשלוח ברכה בנדבתם כדי שיספיק לכל מלאכת המשכן חלק בנו העליה הראויים לתת תרומת ה ואילולא הנס לא היה חלקם מספיק לכל עבודת המשכן, כי זעירין אינון הזוכים להשיג מעלות רמות אלו, ומה שנשתייר היה חלק העם שלא היו ראויים שיבנה המשכן מנדבתם, ונעשה מן המותר שאר דברים שבקדושה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 162,
      "char_length": 603,
      "timestamp": "2025-02-06T19:15:08.212472"
    },
    {
      "id": "vayakhel_p163",
      "text": "ועפ\"י זה נראה לתת טעם שהוצרך הכתוב להודיענו שפרשה זו בהקהל נאמרה, כי לצד שאמר הכתוב ויקחו לי תרומה מאת כל איש דהיינו בני העלי' הקרויים איש דוקא, ולא פשוטי העם כדברי הזה\"ק, על כן הוה אמינא שלא אמר משה פרשה זו אלא לבני העליה, שהרי אליהם בלבד הדברים נוגעים ולא לכללות ישראל, על כן הוצרך הכתוב להודיענו כו גם פרשה זו בהקהל נאמרה, וכל ישראל נצטוו בה, כי אין ביד אדם להבחין מי הראוי לנתינה, אלא כולם חייבים לתת, ומן השמים הוכיחו בין הראויים לשאינם ראויים, דקמי שמיא גליא מחשבות אדם ותחבולותיו ותעלומות סתרי כל חי.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 163,
      "char_length": 507,
      "timestamp": "2025-02-06T19:15:08.533120"
    },
    {
      "id": "vayakhel_p164",
      "text": "ובדרך זו יש ליישב קושיית הרא\"ם ז\"ל (קושיא ג) דאמאי איצטריך קרא שאין מלאכת המשכן דוחה שבת הא פשיטא הוא דאין עשה דוחה ל\"ת ועשה. אמנם כלפי שכתבה תורה בפרשה זו מויקהל\" משה להודיע שפרשת נדבת המשכן נאמרה לכל ישראל הוה אמינא שדין מלאכת המשכן כדין קרבנות ציבור הדוחים את השבת, וכמ\"ש האלשיך הקדוש, לפיכך איצטריך קרא למעט שאין מלאכת המשכן דוחה שבת, ועעמא דמילתא דלא דמיא לקרבנות צבור, שהרי בקרבנות צבור נטלו כל ישראל חלק ע\"ו מחצית השקל שנתן כל אחד מהם, משא\"כ בנדבת המשכן לא נתקבל רק חלק בני העלייה, כמפורש בזוה\"ק ולפיכך אין דינו כדין קרבן צבור ואינו דוחה שבת. ועפ\"י זה נתבארו דברי הרמב\"ן ז\"ל שפירש מאמר אלה הדברים על מלאכת המשכן, ולא קשה קושית הכלי יקר ז\"ל (עיין קושיא ב) דאיצטריך לכתוב אלה הדברים סמוך למצות שבת כדי ללמוד שאין מלאכת המשכן דוחה שבת, שהרי ממאה\"כ ויקהל משה היה מקום לטעות שדינו כקרבנות צבור.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 164,
      "char_length": 796,
      "timestamp": "2025-02-06T19:15:08.804829"
    },
    {
      "id": "vayakhel_p165",
      "text": "והנה טעמא דמילתא שנטלו כל ישראל חלק בשוה בקרבנות צבור, יש לומר עפ\"י דברי ק\"ז זלה\"ה בישמח משה פרשת קרח עה\"פ אל תפן אל מנחתם וז\"ל, כי בקרבן צבור נכנסו ניצוצין מכל נשמות ישראל להקרבן, ע\"כ. ולפי זה י\"ל שעל כן חייבים כל ישראל לתת חלקם בשוה לקרבנות, כדי לתקן ניצוצי נשמותיהם ואם יתן אחד יותר מחבירו, יש לחוש שיבטל חלק חבירו ברוב, ובזה מצאנו טעם הגון לאזהרת העשיר לא ירבה והדל לא ימעיט אף במחצית השקל שנתנו ישראל לקרבנות ולא נמנו בהם, כו הוצרכו לתת חלק שוה לקרבנות צבור, כדי שלא יבעל חלק המרובה את חלק חבירו המועט ברוב.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 165,
      "char_length": 512,
      "timestamp": "2025-02-06T19:15:09.268434"
    },
    {
      "id": "vayakhel_p166",
      "text": "ובזה יתבאר גם מה שיסד הפייטן קצינים ורשום וחד בה שקולים עשיר בל יעוז מול מקהלים קרא לאמר הוני פדאני מעיקולים. כלומר שלא יתגאה העשיר בתתו יותר מן העני, לומר כי הונו פדאני מעיקולים, פירוש דרק הוא נפדה מן העבירות שבידו ולא העני, כי בטל חלק העני ברוב והוא זכה בחלקו ובחלק חבירו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 166,
      "char_length": 274,
      "timestamp": "2025-02-06T19:15:09.559942"
    },
    {
      "id": "vayakhel_p167",
      "text": "ועתה נבוא לפרש דברי המדרש תנחומא (עיין קושיא ה') בפרשת שקלים אמר משה משאני מת אין אני נזכר וכו'. ויתבאר בהקדם מה שפירשנו דברי הילקוט פרשת תשא ר' שמואל בר נחמן אמר בשם ר' יונתן ונתנו איש כופר נפשו בימי משה ולא יהי' בהם נגף בימי דוד ופירש בזית רענן ולא יהיה בהם נגף בימי דוד שאם היו נותנים שקלים בימי דוד לא היה בהם נגף וס\"ל דאפילו אם המנין הוא שלא לצורך, מ\"מ אם נותנים שקלים אין בהם נגף ע\"כ. והוא דוחק לפרש כן.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 167,
      "char_length": 409,
      "timestamp": "2025-02-06T19:15:09.738055"
    },
    {
      "id": "vayakhel_p168",
      "text": "ואפ\"ל הכוונה עפ\"י מה דאיתא בגמרא ברכות (ס\"ב ע\"ב) עה\"פ וכהשחית ראה ה' וינחם על הרעה (דברי הימים א' כ\"א כאשר צוה דוד למנות את ישראל כתיב ויתן ה' דבר בישראל וגו' וישלח האלקים מלאך לירושלים לשחתה וכהשחית ראה ה' וינחם) מאי ראה וכו' ר' יצחק נפחא אמר כסף כפורים ראה שנאמר ולקחת את כסף הכפורים מאת בני ישראל וגו' (ופירש\"י כסף כיפורים שנתן במנין הראשון של ישראל למשכן והוא כפר על מנין זה שהרי לזכרון ניתן כדכתיב והיה לבני ישראל לזכרון ועכשיו הוצרכה כפרתו) ע\"כ. וזאת כוונת הילקוט ונתנו איש כופר נפשו בימי משה, ובזכות זה ולא יהי' בהם נגף בימי דוד, כלומר שנעצר הנגף מישראל בימי דוד, בזכות מחצית השקל שנתנו ישראל בימי משה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 168,
      "char_length": 609,
      "timestamp": "2025-02-06T19:15:09.991377"
    },
    {
      "id": "vayakhel_p169",
      "text": "ועפ\"י זה יתבארו דברי התנחומא שאמר משה בפרשת שקלים משאנו מת אין אני נזכר, כי לפי שהשקלים באים לכפר על ישראל ולתקן נשמותיהם ע\"י הקרבנות הקרובים מהם, שבהם נכנסו ניצוצות נשמות ישראל, חשש משה שלא תהיה כפרה זו לדורות העתידים בזמן שאין בהמ\"ק קיים, לפי שלא יהיה בידם לתת שקלים לקרבנות, ובמה תהיה כפרתם, והשיב לו הקב\"ה שע\"י שיקראו ישראל פרשת שקלים יחזור ויתעורר להם זכות השקלים שנתנו בימי משה לכפר על נפשותם, כמבואר בפסוק ששקלים אלו הם לזכרון להם לפני ה'.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 169,
      "char_length": 446,
      "timestamp": "2025-02-06T19:15:10.306014"
    },
    {
      "id": "vayakhel_p170",
      "text": "ובזה יש לבאר גם דברי הירושלמי הנ\"ל (קושיא ו') כל העובר על הפקודים כל דעבר בימא. ולכאורה מה תליא מצות מחצית השקל במה שעברו בים סוף, אמנם נראה לומר כו הנה ע\"ו שעברו ישראל בים סוף וראו את האותות והמופתים והיד הגדולה אשר עשה ה' במצרים, נקבעה ונתחזקה בלבם האמונה בה' ובמשה עבדו כמאמר הכתוב ויאמינו בה' ובמשה עבדו, ובזכות אמונה זו שהאמינו ישראל בנבואת משה עבד ה' זכו ישראל שמתגלה ונשפע בכל דור זכותו וכוחו של משרע\"ה, ולפיכך מועילה זכות השקלים שנתנו ישראל בימי משה לדורות הבאים לכפר על נפשם, כאילו נתנו גם הם שקלים בפועל, וזכות זו מתעוררת ע\"י קריאת הפרשה, וכדאיתא במד\"ת כשם שאתה עומד וזוקף את ראשם כך בכל שנה ושנה שקוראים אותה לפני כאילו אתה עומד וזוקף את ראשם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 170,
      "char_length": 654,
      "timestamp": "2025-02-06T19:15:10.541900"
    },
    {
      "id": "vayakhel_p171",
      "text": "ונראה לפרש הפיוט במוסף שבת שקלים אור פניך עלינו אדון נשא ושקל אשא בבית נכון ונשא ובצדק הגה ערך כי תשא וכו'. דהנה אמרו ז\"ל (חגיגה י\"ב ע\"א ובב\"ר פ\"ג) אור שברא הקב\"ה ביום הראשון אדם מסתכל בו מסוף העולם ועד סופו ראה שאין העולם כדאי להשתמש בו עמד וגנזו לצדיקים לעתיד לבא ע\"כ. ועל כן אנו מפילים תחנתנו אור פניך, היינו אור שבעת הימים הגנוז לעת\"ל עלינו אדון נשא שיאיר עלינו באור הגנוז שהוא אורו של מלך המשיח, ויש לפרש מה שאמר אור שפניךד' דהנה החת\"ס זלה\"ה כתב לפרש מאה\"כ וראית את אחורי ופני לא יראו בדרך רמז, דהנה אנו רואים כמה דברים סבות מסבות שונות הנעשים בארץ מתחת, אשר אנו מתמיהים עליהם למה עשה השי\"ת ככה, אבל לאחר רבות בשנים אנו מבינין ורואין למפרע הכל כאשר לכל כל הסבות תכלית כוונתם, כו היו כולם הכנות כדי שיעשה דבר גדול כזה, וזהו וראית את מאחורי\", לאחר שנעשה תכלית הדבר תראה ותבין למפרע מה שהיה ומה שנעשה, אבל ופני\" לא יראו כלומר לפני עשיית הדבר לא יראו ולא יבינו תכליתו ע\"כ. ועל כן תפלתנו אור שפניך\" עלינו אדון נשא שיעביר השי\"ת מאתנו את הסתרת הפנים הגדולה, ונזכה לאור פניו יתברך, דהיינו שלפני בוא הדבר נדע תכלית הדבר ותועלתו, ואנחנו מקבלים עלינו ושקל אשא בבית נכון ונשאזצ דכאשר יתגלה לנו אורו של מלך המשיח, נחזור לשקול שקלים בבית הגדול והקדוש שנקרא שמו יתברך עליו, אכן עתה שעדיין לא זכינו לקץ הימין הננו מבקשים ובצדק הגה ערך כו תשא\", והכוונה דהנה כלל גדול הוא שכאשר אין ביד האדם להקריב קרבן בפועל, והוא בהכרח יוצא ידי חובתו בדבור בחינת ונשלמה פרים שפתינו, אזי צריך הוא לכוון מחשבתו שיהי' דבורו ראוי והגון בכוונה שלמה ורצויה, יותר מאילו הוה מקריב קרבנו בפועל, שהרי מי שמקריב בפועל קרבנו אף אם אינו מכוון מחשבתו כ\"כ, מ\"מ הרי מעשה הקרבן בידו, אך החפץ לצאת באמירה בעלמא אין בידו אלא המחשבה והרצון ואם לא יכוון מחשבתו לא עלתה בידו כלום. אכן אנחנו מכירים ויודעים שאין דבורנו כראוי ובמחשבה נכונה, כדי שנוכל כר לצאת ודי חובתנו כאלו שקלנו מחצית השקל בפועל, על כן אנו מתפללים ובצדק הגה ערך ני תשאל שיצדיק הקב\"ה את הגה פינו וניב שפתותינו, כאילו היינו מקיימים מצות מחצית השקל בפועל, ואף שאין ארשת שפתינו בכוונה הנכונה והרצויה, מ\"מ אנחנו נצטדק ש ערך כו תשא, כלומר שיעריך הקב\"ה שפלות דורנו ולפי ערך השפלות והסתרת הפנים בו אנו נתונים די לנו גם בדבור זה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 171,
      "char_length": 2037,
      "timestamp": "2025-02-06T19:15:10.855483"
    },
    {
      "id": "vayakhel_p172",
      "text": "וכענין זה פירשנו (בדברינו פ' נח) עה\"פ נח איש צדיק תמים היה בדורותיו פירש\"י ז\"ל בדורותיו יש דורשים אותו לשבח כ\"ש אילו היה בדור צדיקים היה צדיק יותר ויש שדורשים אותו לגנאי לפי דורו היה צדיק ואילו הוה בדורו של אברהם לא היה נחשב לכלום. ולכאורה כיון שיש מקום לדרוש על אותו צדיק לשבח, אמאי יש דורשין אותו לגנאי והרי התורה מעידה עליו איש צדיק תמים, אמנם י\"ל כי שני הדרשות צדקו יחדיו ולא פליגי, כי גם אלו דורשין אותו לגנאי מודו למה דקאמרי הנך שאילו היה בדורו של אברהם היה צדיק יותר, אלא שהם אומרים דאילו היה בדורו של אברהם במדרגה זו של צדקות שעמד בה לא היה נחשב לכלום, אבל ודאי שאילו היה בון צדיקים היה עולה ומתעלה במדרגות רמות יותר, אבל לפי גריעות ושפלות דורו גם מדרגה זו למעלה גדולה נחשבה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 172,
      "char_length": 683,
      "timestamp": "2025-02-06T19:15:11.840352"
    },
    {
      "id": "vayakhel_p173",
      "text": "ובדרך זו אפ\"ל מה שנתקן בתפלת מוסף לר\"ה אתה זוכר את כל המפעל וגם כל היצור לא נכחד ממך פירוש כי הקב\"ה זוכר את כל מפעלות האדם זכויותיו וצדקותיון ואף אם אין מעשיו בשלימות הראוי מ\"מ בגודל חסדיו יתברך אגם כל היצור לא נכחד ממך\" פירוש תכונת היצורים ומצבם, כי יצרם הרע מתגבר עליהם תמיד, ולפי שהם שוכני בתו חומר כמה קשה להם לעמוד כנגדו, ולפי גריעות היצורים ושפלותם גם עבודה קטנה יותר, אף שאינה בשלימות הראוי, רצויה ומקובלת היא לפני השי\"ת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 173,
      "char_length": 428,
      "timestamp": "2025-02-06T19:15:12.164498"
    },
    {
      "id": "vayakhel_p174",
      "text": "דרוש לפרשת החודש ויקהל משה את כל עדת בני ישראל ויאמר אליהם אלה הדברים אשר צוה ה' לעשות אותם ששת ימים תעשה מלאכה וביום השביעי יהי' לכם קדש וגו'. צריך ביאור אומרו אויקהל' משה, שהרי בכל עת אשר דבר משה אל ישראל להודיעם חוקי האלקים ותורותיו היה דבורו בהקהלת כל העדה, כדאיתא בעירובין (דף נ\"ד ע\"ב) כיצד סדר משנה וכו', ולמה הוצרך הכתוב להודיע הכא שפרשה זו בהקהל נאמרה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 174,
      "char_length": 360,
      "timestamp": "2025-02-06T19:15:12.387015"
    },
    {
      "id": "vayakhel_p175",
      "text": "ב) גם מאמר אלה הדברים וגו' צריך ביאור שלא נודע אל מה נתכוון בזה, ואם נאמר דקאי על מצות שבת הכתובה לאחריו, א\"כ קשה למה נאמר אשר צוה ה' אלעשות\"ג והרי עיקר מצות שבת הוא שביתה מן המלאכות, והול\"ל שלא לעשות\". אכן לדברי הרמב\"ן ז\"ל שפירש מאמר אלה הדברים על מלאכת המשכן א\"ש אומרו הלעשות\", אך לדבריו יקשה שהתחיל הכתוב דבריו בציווי מלאכת המשכן והפסיק באמצע והודיע על איסור מלאכה בשבת ואח\"כ חזר לצוות על מלאכת המשכן ומן הראוי היה שיסיים הכתוב פרטי ציווי מלאכת המשכן תחלה, ובתר הכו יצוה על שביתה ממלאכה בשבת, או איפכא שיצוה תחלה על איסור מלאכה בשבת ואח\"כ יצוה על מעשה המשכן.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 175,
      "char_length": 561,
      "timestamp": "2025-02-06T19:15:12.586363"
    },
    {
      "id": "vayakhel_p176",
      "text": "ג) עוד יש לדקדק במאמר הכתוב ששת ימים תעשה מלאכה וגו' דלכאורה יתירא הוא שהרי עשיית מלאכה בימות החול הוא רשות ולא מצוה, ודי שיזכיר הכתוב איסור עשיית מלאכה בשבת, ומה לו להזכיר היתר מלאכה בששת ימים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 176,
      "char_length": 194,
      "timestamp": "2025-02-06T19:15:12.874717"
    },
    {
      "id": "vayakhel_p177",
      "text": "ד) במדרש ילקוט ורמז ת\"ח) ויקהל משה רבותינו בעלי אגדה אומרים מתחלת התורה ועד סופה אין בה פרשה שנאמר בראשה ויקהל אלא זאת בלבד אמר הקב\"ה עשה לך קהלות גדולות ודרוש לפניהם ברבים הלכות שבת כדי שילמדו ממך דורות הבאים להקהיל קהלות בכל שבת ושבת ולכנוס בבתי מדרשות ללמד ולהורות לישראל דברי תורה איסור והיתר כדי שיהא שמי הגדול מתקלס בין בני מכאן אמרו משה תקן להם לישראל שיהיו דורשין בענינו של יום הלכות פסח בפסח הלכות עצרת בעצרת הלכות החג בחג אמר משה לישראל אם אתם עושים כסדר הזה הקב\"ה מעלה עליכם כאילו המלכתם אותי בעולמי שנא' ואתם עדי נאם ה' ואני א' (ישעי' מ\"ג) וכן דוד הוא אומר בשרתי צדק בקהל רב (תהלים מ') וכו מה בשורה היו ישראל צריכים בימי דוד והלא כל ימיו של דוד מעין דוגמא של משיח הוה אלא פותח ודורש לפניהם ד\"ת שלא שמעתן אוזן מעולם. עכ\"ד המדרש. והדקדוקים בדברי הילקוט רבו כמו רבו. חדא שפתח דבריו אמר רבותינו בעלי אגדה\" אומרים, וצ\"ב למה הודיע לנו כי בעלי המאמר הם רבותינו בעלי אגדה, ומאי נפקא לן אם הם בעלי הלכה או בעלי הגדה. גם מה דאמר עשה לך קהלות וכו' כדי שילמדו ממך דורות הבאים להקהיל קהלות וכו' קשה למה הוצרך לומר דטעם שצוה הקב\"ה למשה להקהיל קהלות הוא כדי שילמדו ממנו דורות הבאים, דמשמע כו לאותו הדור לא הוצרך לדרוש הלכות וכו', וכל מעשהו היה כדי שממנו יראו וכן יעשו ישראל בדורות הבאים, והוא תמוה שהרי גם לדורו היה שייך ענין הדרשה בשבת להודיעם הלכות שבת וכו'. וגם מה לו לצוות שילמדו ממנו דורות הבאים, והלא גם בלא שיצוה על כך היו הדורות הבאים לומדים ממנו להקהיל קהלות בכל שבת. והאלשיך הקדוש הקשה למה רמז לנו הכתוב ענין הקהלת קהלות בשבת בפרשה זו שנאמרה בה אזהרת שבת רק בדרך אגב, יותר היה ראוי שירמוז הכתוב זאת בפרשה שנאמרו בה עיקר דיני שבת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 177,
      "char_length": 1536,
      "timestamp": "2025-02-06T19:15:13.002165"
    },
    {
      "id": "vayakhel_p178",
      "text": "וכדי לבוא לביאור הענין נקדים דברי המדרש (דברים רבה פ\"ג א) וז\"ל א\"ר יוסי בר חנינא אימתי שמרו ישראל את השבת כשם שראוי לה תחלה כשנתנה להם באלוש שנא' (שמות י\"ז) וישבתו העם ביום השביעי ואת סבור שמא לרעתך נתתי לך את השבת לא נתתי לך אלא לטובתך כיצד א\"ר חייא בר' אבא את מקדש את השבת במאכל ובמשתה ובכסות נקיה ומהנה את נפשך ואני נותן לך שכר מנין (ישעי' נ\"ח) וקראת לשבת עונג וגו' מה כתיב אחריו, אז תתענג על ה' ויתן לך משאלות לבך וכו', עכ\"ד המדרש. והמדרש הזה אומר דרשוני וחיו, חדא מאי נפק\"מ אימתי שמרו ישראל שבת ראשונה אם באלוש או במקום אחר, גם מ\"ש את סבור שמא לרעתך נתתי לך את השבת וכו' תמוה הוא, מה מקום היה להרהר ולסבור שניתן השבת לרעתנו ח\"ו, עד שהוצרך המדרש להוציא מסברא זו, ואם באמת היה מקום להרהר שמא ניתן השבת לרעה ח\"ו, קשה איך נדחית סברא זו במה שאמר המדרש שמקדשין אותו במאכל ובמשתה וכו', וכי זה בלבד הוא נועמו וטובו של שבת קודש ותו לא. גם צ\"ב להבין קישור והמשך תחלת דברי המדרש שאמר אימתי שמרו ישראל שבת ראשונה באלוש, למ\"ש אח\"כ ואת סבור שמא לרעתך נתתי לך את השבת וכו'.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 178,
      "char_length": 963,
      "timestamp": "2025-02-06T19:15:13.708384"
    },
    {
      "id": "vayakhel_p179",
      "text": "ונראה לבאר דברי המדרש הנ\"ל דהנה איתא בשו\"ע ריש הלכות פסח וסי' תכ\"ט) שואלין ודורשין בהלכות הפסח קודם הפסח ל' יום וכתב המג\"א (שם ס\"ק א') דמשמע מפ\"ק דמגלה (דף ד' ע\"א) דביו\"ט עצמו מחויבים לדרוש בענינו של יום כגון בפסח ביציאת מצרים ע\"ש גבו פורים שחל להיות בשבת, ע\"כ. ופירש במחצית השקל דכוונתו להא דאיתא התם אריב\"ל פורים שחל להיות בשבת שואלין ודורשין בענינו של יום ופריך מאי אריא פורים אפילו יו\"ט נמי דתניא משה תיקן להם לישראל שיהיו דורשין בענינו של יום הלכות פסח בפסח הלכות עצרת בעצרת הלכות חג בחג ומשני פורים איצטריכא ליה ס\"ד נגזור משום דרבה וכו'. ופירש\"י שואלים ודורשים לדרוש אגרת פורים ברבים ע\"כ. ומשמע מלשונו שאין כוונת ריב\"ל על דרשת דינים כו אם באגרת פורים ובניסי פורים וכו', וא\"כ ע\"כ דומיא דהכא הא דתניא בשאר יו\"ט משה תיקן להם לישראל שיהיו דורשים הלכות\" פסח וכו' לאו דוקא הלכות אלא ר\"ל עניני היום, דאי לא תימא הכי לא פריך מידי מריב\"ל דאמר פורים שחל להיות בשבת דורשים, דהא ריב\"ל מיירי בדרשה מעניני פורים ובשאר יו\"ט ר\"ל דינים, אלא ע\"כ מהלכות\" שהוזכר בברייתא לאו דוקא: אלא ר\"ל עניני יו\"ט בפסח נסי יציאת מצרים וכדו' וכו'. עכ\"ד המחצית השקל ז\"ל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 179,
      "char_length": 1040,
      "timestamp": "2025-02-06T19:15:14.193525"
    },
    {
      "id": "vayakhel_p180",
      "text": "ולי נראה דא\"צ לדחוק ולומר דהא דאיתא בגמרא משה תיקן לישראל שיהיו דורשים הלכות וכו' הוא לאו דוקא כמ\"ש המחצית השקל, אלא אפי' נימא דהלכות הוא דוקא, לא קשה על דברי המג\"א שלמד מזה דשואלין ודורשין בענינו של יום בדברי אגדה, דהנה ידוע כי יסוד ההלכה המה האגדות והסודות הרמוזות בה ומי שמשיג בפנימיות הענינים יראה שפנומיות ההלכה הם האגדות והסודות הכלולים בה, ושניהם צדקו ויחדיו יהיו תמים. אלא שההלכה הוא חלק הנגלה, והאגדות המה חלק הנסתר של ההלכה, ולכן אף דאיתא בגמרא שיהיו דורשים הלכות, שפיר י\"ל דקאי על פנימיות ההלכות שהם האגדות, אשר גם הם בשם הלכה יתכנו, ואין צריך לומר דהלכות לאו דוקא.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 180,
      "char_length": 576,
      "timestamp": "2025-02-06T19:15:14.674542"
    },
    {
      "id": "vayakhel_p181",
      "text": "ועל פו הנחה זו יאירו אל עבר פנינו דברי רש\"י ז\"ל בסוף מס' מגלה (דף ל\"ב) על הא דאיתא בגמרא שם וז\"ל וידבר משה את מועדי ה' אל בני ישראל (ויקרא כ\"ג) ת\"ר משה תקן להם לישראל שיהו שואלין ודורשין בענינו של יום הלכות פסח בפסח וכו' ופירש\"י ז\"ל בד\"ה וידבר משה וגו' למה הוצרך לכתוב כאן וידבר משה וכי כל המצוות כולן לא אמרן משה לישראל מהו וידבר משה את מועדי ה' אל בנו ישראל מלמד שהיה מדבר עמהם הלכות כל מועד ומועד בזמנם להודיע חוקי האלקים ותורותיו וקבלו וקיימו שכר המצוות עליהם ועל בניהם בזה ובבא, עכ\"ל. ודברי רש\"י תמוהים לכאורה שכתב קיימו וקבלו שכר\" המצוות עליהם, וכי מה קבלה שייכא גבי שכר, הא לא שייך ענין קבלה אלא במצוות שקשה לקיימם. גם קשה שהרי חייב האדם להיות כעבד המשמש את הרב שלא על מנת לקבל פרס, ולמה קבלו המצוות עליהם בעבור תקות השכר.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 181,
      "char_length": 729,
      "timestamp": "2025-02-06T19:15:14.965609"
    },
    {
      "id": "vayakhel_p182",
      "text": "אמנם על פי מה שנתבאר כי פנימיות ההלכות המה האגדות נבין כוונת רש\"י ז\"ל דהנה האושר המופלא ביותר אשר יוכל האדם לזכות בו הוא שישיג ויבין פנימיות כל דבר איך שבכל ענין טמונה רמיזא דחכמתא וסודות טמירים ונעלמים נפלאים ונוראים גבוה מעל גבוה. ואין לך שכר גדול ומתנה טובה יותר מהשגת הדעת כמאה\"כ (משלי ב) כי ה' יתן חכמה מפיו דעת ותבונה. והנה איתא במסכת אבות שכר מצוה מצוה (רפ\"ד) ופירשו שהכוונה ששכר המצוה הוא שיזכה לעשות עוד מצוה כי מצוה גוררת מצוה. נמצא כי הזוכה להשיג פנימיות המצוות ושרשם הרי זה לו שכר על מצוות קודמות שקיים כי אין לך שכר גדול ממה שזכה לבוא בסודם של דברים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 182,
      "char_length": 563,
      "timestamp": "2025-02-06T19:15:15.353067"
    },
    {
      "id": "vayakhel_p183",
      "text": "וזאת אפ\"ל בכוונת רש\"י ז\"ל וקבלו וקיימו שכר המצוות עליהם ועל בניהם. היינו שקבלו על עצמם מה שתיקן להם משה לדרוש הלכות כל מועד בזמנו, שהכוונה על פנימיות ההלכות שהם האגדות והסודות הרמוזות, וזאת הוא להם שכר מצוה וקבלו על עצמם ועל זרעם לדורות עולם לדרוש גם בפנימיות הדברים שהם האגדות והסודות הכלולות בהלכות.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 183,
      "char_length": 301,
      "timestamp": "2025-02-06T19:15:15.634815"
    },
    {
      "id": "vayakhel_p184",
      "text": "ועל פי דברים אלו נבא לבאר דברי המדרש הנ\"ל ואת סבור שמא לרעתך נתתי לך את השבת, דהנה עיקר מצות שבת היא שביתה מל\"ט מלאכות נחייב האדם לדעת כל פרעי המלאכות ותולדותיהן וענפיהם, כדי שיוכל להנצל מאיסור מלאכה בשבת. והנה כל מה שהאדם צריך לעסוק בפרנסה בששת ומי המעשה הוא בסבת החטא כאמרם ז\"ל (קידושין פ\"ב ע\"א) הריעותי את מעשי וקפחתי את פרנסתי. ואמרו ז\"ל (ברכות ל\"ה ע\"ב) בזמן שישראל עושים רצונו של מקום מלאכתם נעשית ע\"י אחרים שנאמר (ישעי' ס\"א) ועמדו זרים ורעו צאנכם. וידוע מ\"ש האריז\"ל כו הל\"ט מלאכות המה נגד הל\"ט קללות שנתקלל אדה\"ר אחר החטא. וכתב בסה\"ק באר מים חיים (פרשת פקודי) עה\"כ ששת ימים תעבוד ועשית כל מלאכתך דלכאורה יפלא וכי חיוב על האדם לעבוד עבודה בששת ימי המעשה וביאר עפ\"י הידוע שכל הל\"ט מלאכות נתהוו מהל\"ט קללות שנתקללו אדם וחוה והנחש שבזה נתקללה האדמה שלא תוציא צמחה כ\"א ע\"ו עבודת המלאכות, ועל כן החיוב בששת ימי המעשה לברר ענפי הקדושה מכל דבר ודבר ע\"ו ל\"ט מלאכות, וע\"י זה ממתוקים את הקללות מעט מעט עד ביאת משיח צדקינו, ואי\"ה בעת התיקון לא יצטרכו לשום מלאכה, כי אז תצא הארץ מקללותיה ולא תהי' צריכה לעבודה. וזה אומרו ששת ימים תעבוד וכו', כי העבודה והמלאכה הכרחיות בהם לתקן העבודה והמלאכה מדיני האלקים, ולהמשיך הברכות לעולם את\"ד הבאר מים חיים זאל עיי\"ש באורך.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 184,
      "char_length": 1155,
      "timestamp": "2025-02-06T19:15:15.801174"
    },
    {
      "id": "vayakhel_p185",
      "text": "והנה יש להתבונן במה יוכר לעתיד לבא ההבדל בין יום השביעי לששת ימים, והרי אז לא יעשו מלאכה גם בימות החול, ובמה יוודע איפה כו יום השבת נבחר ומופלא משאר הימים מה יום מיומים. אכן האמת הוא שאעפ\"י שהמלאכות יתבטלו מ\"מ יהיה הבדל בין שבת לחול, כי בשבת תגדל ותרבה השפעת הקדושה ויושגו בו השגות רוחניות גבוהות יותר מאשר בשאר הימים, וזאת היא בחינת עונג שבת, שהעיקר בו הוא העונג הרוחני והאושר הבא אל הנשמה ע\"ו שתשיג השגות גבוהות בפנימיות התורה הם האגדות והסודות, ובזה יפליא ה' בין שבת לחול.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 185,
      "char_length": 475,
      "timestamp": "2025-02-06T19:15:16.339085"
    },
    {
      "id": "vayakhel_p186",
      "text": "ובזה יתבאר המדרש הנ\"ל אימתי שמרו ישראל שבת ראשונה באלוש וכו' ואת סבור שמא לרעתך נתתי לך את השבת וכו' דהנה בשעה שעמדו ישראל במעמד הנבחר לקבל התוה\"ק פסקה זוהמתן, והיו טהורים ונקיים מכל חטא ועוון, בבחינה שיזכו אליה בזמן התיקון השלם, וכאשר היו במדרגה עליונה זו לא היה שייך אצלם ענין ל\"ט מלאכות בשבת, שהרי גם בימות החול לא היו עסוקין במלאכה כאשר יהי' לעתיד, ועל כרחך לומר שאז היה בין יום השבת לחול כאשר יהיה ההבדל ביניהם לעתיד לבא, דהיינו שנתרוממו והתעלו בשבת קודש למדרגות גבוהות והשיגו בו סודות ופנימיות התורה הקדושה. אמנם בשבת ראשונה ששמרו ישראל אחרי צאתם ממצרים עדיין לא היו במדרגה זו, כי אז היה עדיין קודם מ\"ת ולא היו עדיין בבחינה שלא יצטרכו למלאכה בימות החול, ואז היה ניכר ההפרש בין שבת לחול ע\"י ששבתו בו מל\"ט מלאכות.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 186,
      "char_length": 717,
      "timestamp": "2025-02-06T19:15:16.585693"
    },
    {
      "id": "vayakhel_p187",
      "text": "וזאת כוונת המדרש את סבור שמא לרעתך נתתי לך את השבת וכו' כלומר דהוה אמינא דלא שייכא שמירת שבת אלא בזמן שישראל הם בבחינת שרעום\" שלא תיקנו פגמיהם, ועדיין צריכים הם לעשות מלאכה בחול, כדו לתקן הל\"ט קללות שנתקללה האדמה, דאז שייכא היכירא בין שבת לחול, משא\"כ בזמן שישראל עושים רצונו של מקום והם בבחינת טובים שאינם צריכים לעסוק במלאכה בחול היה מקום לומר שאין שייך גבייהו ענין שביתה בשבת, שהרי גם בימות החול הם בעלים ממלאכה, והפלאה זו בין שבת לחול איני יודע מה היא, על כן אמר המדרש לא תהא סבור כן כי לא נתתי לך את השבת אלא לטובתך. כלומר כאשר הם בבחינת טובים נמי שייך בהו ענין שמירת שבת, ומפרש המדרש כיצד את מקדש את השבת במאכל ובמשתה וכו' ומהנה את נפשך הכוונה על העונג הרוחני והנאת הנפש ע\"י ההשגות הגבוהות המושגות בשבת יותר מאשר בימות החול, וע\"ז אמר המדרש ואני נותן לך שכר כלומר שבחינת העונג והשגת הדעת שהנך זוכה לה בשבת, היא לך שכר טוב בעד מצוות אחרות שקיימת, כאשר נתבאר שאין לך שכר טוב כהשגת הדעת, וא\"כ גם בזמן שישראל הם בבחינה שאינם עושים מלאכה בחול שייך ענין שמירת שבת גבייהו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 187,
      "char_length": 969,
      "timestamp": "2025-02-06T19:15:16.917661"
    },
    {
      "id": "vayakhel_p188",
      "text": "ועל פי זה מבואר קישור תחלת דברי המדרש שפתח דבריו אימתי שמרו ישראל שבת ראשונה באלוש, למ\"ש אחריו ואת סבור שמא לרעתך נתתי לך את השבת, דכוונת המדרש לבאר מהיכן נצמח שורש הסברא לטעות ולומר דלא שייכא שמירת שבת אלא בזמן שישראל עסוקים במלאכה בחול, לז\"א שזה נצמח ממה ששמרו ישראל שבת ראשונה באלוש, ואז עדיין לא זכו לתקן כל חטאיהם, והיה שייך אצלם ענין שביתה מל\"ע מלאכות בשבת, והו\"א דדוקא באופן כזה שייך ענין שבת, ולא אחר מתן תורה שהיו בטלים ממלאכה גם בחול, ועל כן הוצרך המדרש להוציא מלב הסוברים לומר כן. ואמר לא נתתי לך את השבת אלא לטובתך, דבזמן שהם בבחינת טובים אעפ\"כ שייך גבייהו הבדל בין שבת לחול, ע\"י ההשגות הגבוהות המושגות בשבת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 188,
      "char_length": 620,
      "timestamp": "2025-02-06T19:15:17.372006"
    },
    {
      "id": "vayakhel_p189",
      "text": "ועתה נבא לבאר דברי הילקוט הנ\"ל (קושיא ד) רבותינו בעלי הגדה אומרים וכו' אמר הקב\"ה למשה עשה לך קהלות גדולות ודרוש לפניהם ברבים הלכות שבת כדי שילמדו ממך דורות הבאים להקהיל קהלות וכו'. ותחלה נבאר מה שכינה הילקוט שם בעלי המאמר באמרו רבותינו בעלי אגדה אומרים. ולדרכנו נראה לומר שנתכוין בזה לרמוז על אמרם עשה לך קהלות גדולות ודרוש וכו' הלכות\" שבת, שהכוונה ללמד ברבים בשבת את פנימיות ההלכות שהם האגדות, ועל כן פתח דבריו אמר רבותינו בעלי אגדה\" להורות על כך.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 189,
      "char_length": 448,
      "timestamp": "2025-02-06T19:15:17.677271"
    },
    {
      "id": "vayakhel_p190",
      "text": "והנה האלשיך הקדוש הקשה אמאי רמז הכתוב ענין הקהלת קהלות בשבת ללמדם הלכות שבת בפרשה זו: שנאמרה בה אזהרת שבת רק בדרך אגב, ולדרכינו יובן הדבר היטב דהנה אילו היה הכתוב רומז ענין הקהלה ללימוד האגדות בשבת במקום שנאמרו בה עיקר דיני שבת, כגון בפרשת יתרו וכו' היה מקום לטעות ולומר כו לא נצטוו ישראל לעסוק בדברי אגדה בשבת אלא בזמן שהם עושים רצונו של מקום, ואין הם צריכים לעסוק במלאכה בימות החול, ולפיכך עליהם לעסוק בדברי אגדה בשבת, כדי שישיגו בחינות גבוהות אשר לא יכלו להשיג בימות החול, ובכך יוודע ההבדל בין שבת לחול, מה שאין כן בזמן שאין ישראל זכאים, והם עוסקים במלאכה בששת ימי המעשה, א\"כ בלא העסק בפנימיות התורה נודע וניכר ההבדל בין שבת לחול, ע\"ו שהם שובתים בו מל\"ט מלאכות, והוה אמינא שאינם צריכים לעסוק בשבת באגדות, על כן רמז לנו הכתוב ענין ההקהלה בפרשה זו שנאמרה להם בה ציווי נדבת המשכן, וזמן אמירת משה לישראל פרשה זו היה אחר מעשה העגל, כפירש\"י ז\"ל בריש פ' ויקהל ממחרת יוהכ\"פ היה, וסמך לה הכתוב אזהרת שבת, כדי להודיענו מצות ההקהלה בשבת לדרוש לפניהם הלכות שבת שהם האגדות.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 190,
      "char_length": 963,
      "timestamp": "2025-02-06T19:15:17.896342"
    },
    {
      "id": "vayakhel_p191",
      "text": "ומעתה שוב אין מקום לטעות שלא נתחייבו לדרוש בשבת באגדות אלא בזמן שאינם עסוקים במלאכה, שהרי נצטוו על כך אחר מעשה העגל בזמן שהיו עסוקים במלאכת המשכן בחול, וכבר היה נודע ההיכר וההבדל בין שבת לחול, ע\"ו ששבתו בשבת מל\"ט מלאכות, ועל כרחך לומר כי נצטוו לדרוש בשבת באגדות ובפנימיות התורה, אפילו בזמן שנודעת וניכרת ההבדלה בין שבת לחול ע\"ו השביתה ממלאכה. וזאת כוונת הילקוט עשה לך קהלות וכו' כדי שילמדו ממך דורות הבאים. פירוש ע\"י שוקהיל קהלות גם אחר מעשה העגל, אף שכבר היו עסוקים במלאכות בימות החול, ילמדו ממנו גם דורות הבאים להקהיל קהלות בכל שבת כדי לעסוק באגדות, אף שהם עמלים במלאכתם בימות החול, וניכר החילוק בין שבת לחול גם מבלעדי לימוד האגדות, ואף שמעטים בני עליה הזוכים להשיג פנימיות הדברים מ\"מ כל אחד משיג לפי ערכו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 191,
      "char_length": 708,
      "timestamp": "2025-02-06T19:15:18.340944"
    },
    {
      "id": "vayakhel_p192",
      "text": "ובדרך זו יתיישב מאה\"כ אלה הדברים אשר צוה ה' מלעשות\" אותם. (עיין קושיא בא. גם מה שהוצרך הכתוב לומר ששת ימים תעשה מלאכה (קושיא ג) וכי לא סגי בלאו הכי. אמנם י\"ל דלפי שכוונת הכתוב במאמר אלה הדברים לרמוז גם על ענין הקהלת קהלות בשבת לדרוש לפניהם באגדות, משו\"ה הוצרך להזכיר כאן גם מלאכת המשכן, באמרו לעשות אותס\", כדי להורות שמצות הקהלת קהלות בשבת לדרוש לפניהם בדברי אגדה נוהג אפילו בזמן שישראל עסוקים במלאכת המשכן בימות החול, כדכתיב ששת ימים תעשה מלאכה, ותו לא קשה על דברי הרמב\"ן ז\"ל שאם מאמר אלה הדברים וגו' קאי על מלאכת המשכן, למה הפסיק הכתוב בציווי מלאכת המשכן וצוה במצות שבת ואח\"כ חזר לציווי המשכן, ולדברנו א\"ש כי מה שהתחיל הכתוב בציווי מלאכת המשכן לא בא אלא ללמד על ענין הקהלת קהלות בשבת, שהיא נוהגת אפילו בזמן שהיו ישראל עסוקים במלאכת המשכן, ואח\"כ חזר לצוות על מעשה המשכן, כי שם מקומה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 192,
      "char_length": 784,
      "timestamp": "2025-02-06T19:15:18.670660"
    },
    {
      "id": "vayakhel_p193",
      "text": "ועל פי האמור יתבאר גם המשך דברי הילקוט אמר משה לישראל אם אתם עושים כסדר הזה הקב\"ה מעלה עליכם כאילו המלכתם אותי בעולמי וכו'. וצ\"ב מדוע ע\"ו הדרשה מעלה עליהם הקב\"ה כאילו המליכוהו בעולם, אמנם הוא הדבר אשר דברנו שציווי הקהלת קהלות בשבת לדרוש לפניהם נאמר על הדרשה בעניני אגדה שהם פנימיות ההלכות, ועליהם אמר כאילו המלכתם אותי בעולמי, כמו שאמרו ז\"ל (ספרי פ' עקב) אם רצונך להכיר את מי שאמר והיה העולם לך אצל הגדות, ע\"כ. הרי כי בלימוד האגדה נודעת גדולתו של הקב\"ה ועל כן בשעה שישראל מקהילים קהלות לדרוש באגדה מעלה עליהם הקב\"ה כאילו המלוכוהו בעולם כו הם מפרסמים ומגלים מלכותו ואלקותו יתברך בעולם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 193,
      "char_length": 584,
      "timestamp": "2025-02-06T19:15:19.054504"
    },
    {
      "id": "vayakhel_p194",
      "text": "דרוש לפרשת שקלים ויקהל משה את כל עדת בני ישראל ויאמר אליהם אלה הדברים אשר צוה ה' לעשות אותם וגו'. פירש\"י ז\"ל ויקהל לשון הפעיל שאינו אוסף אנשים בידים אלא הם נאספין על פי דבורו וכו' עכ\"ל. הקשה הרא\"ם ז\"ל למה הוצרך הכתוב להשמיענו שלא אסף משה את ישראל בידים, והרי מילתא דפשיטא היא שבכל עת שנקהלו ישראל אל משה היו נאספים עפ\"י דבורו, ולא הוצרך לאספם בידים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 194,
      "char_length": 349,
      "timestamp": "2025-02-06T19:15:19.336825"
    },
    {
      "id": "vayakhel_p195",
      "text": "ב) במדרש ילקוט ר\"פ זו איתא מתחלת התורה וכו' אין בה פרשה שנאמר בה ויקהל אלא זו בלבד אמר הקב\"ה עשה לך קהלות גדולות ודרוש לפניהם ברבים הלכות שבת וכו' ע\"כ. וקשה שאם כוונת הכתוב באמרו ויקהל משה להשמיענו הוראה לדורות, שיעשו קהלות לדרוש לפניהם בכל שבת, א\"כ היה ראוי שיודיענו הכתוב ענין זה במקום שנכתבה עיקר מצות שבת. ומדוע רמז הכתוב ענין הקהלת קהלות בשבת בפרשה זו, שנאמרה בה אזהרת שבת רק אגב גררא.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 195,
      "char_length": 390,
      "timestamp": "2025-02-06T19:15:19.589223"
    },
    {
      "id": "vayakhel_p196",
      "text": "ג) ויאמר משה אל כל עדת בני ישראל לאמר זה הדבר אשר צוה ה' לאמר קחו מאתכם תרומה לה'. ויל\"ד חדא מדוע כתיב חלאמר\"ע למי יאמרו ישראל מצוה זו. ותו קשה, תרי זימני לאמר' למה לי ד) קראנו היום בתורה פרשת שקלים, כי תשא את ראש בני ישראל וגו'. בגמרא בבא בתרא (דף י' ע\"ב) א\"ר אבהו אמר משה לפני הקב\"ה במה תרום קרן ישראל אמר לו בכי תשא ע\"כ. וצ\"ב כוונת שאלת משה ומה שהשיבו הקב\"ה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 196,
      "char_length": 361,
      "timestamp": "2025-02-06T19:15:19.820202"
    },
    {
      "id": "vayakhel_p197",
      "text": "ה) בתנחומא פרשת תשא (ב) איתא זה יתנו כל העובר על הפקודים וגו' בא וראה חבתן של ישראל שעבירותיהן מביאן לידי מעלות גדולות ואם עבירותיהן כך זכויותיהן על אחת כמה וכמה וכו' א\"ר יהודה בר שלום ישיבה אחת שישבו בעצה אחת למכור את יוסף כלכלה את העולם שבע שנים בשני רעבון אם עבירותיהן כלכלה והעמיד את העולם זכיותיהן על אחת כמה וכמה ואף כאן מי גרם לשבעים שיתנו כופר נפשותיהן מעשה העגל ואם חטאה גדולה שעשו גרמה למצוה ולזכות מצוה שעושים עאכ\"ו עכ\"ל. וצריך ביאור להבין כיצד ניתן לדמות להדדי את הזכות שנתגלגלה ע\"י מכירת יוסף, למצות מחצית השקל שבאה מכח מעשה העגל, ולכאורה לא דמיין להדדי אפילו כי אכלא לדנא, שהרי מעשה מכירת יוסף הביא לזכות גדולה, ונתגלה לבסוף כי אלקים חשבה לטובה להחיות עם רב ולזון ולפרנס כל יושבי תבל, אך לא כן מעשה העגל שחטא בו העם חטאה גדולה, אלא שבגודל חסדי המקום מחל להם על חטאם, וצוה להם להביא מחצית השקל לכפר על נפשם, א\"כ מה היא הזכות הגדולה שנתגלגלה ע\"י מעשה העגל, והלא ודאי מוטב אילו לא נכשלו בחטא זה ולא היה צורך בהבאת מחצית השקל לכפר עליהם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 197,
      "char_length": 947,
      "timestamp": "2025-02-06T19:15:20.035331"
    },
    {
      "id": "vayakhel_p198",
      "text": "ו) עוד איתא במדרש תנחומא (ג) ובפרשת שקלים אמר משה לפני הקב\"ה רבש\"ע משאני מת אין אני נזכר א\"ל הקב\"ה חייך כשם שאתה עומד עכשיו ונותן להם פרשת שקלים ואתה זוקף את ראשן כך בכל שנה ושנה שקוראין אותה לפני כאלו אתה עומד שם באותה שעה וזוקף את ראשן מנין ממה שקרינו בענין וכו' כי תשא את ראש בני ישראל שא לא נאמר אלא תשא (לשון עתיד שלעולם יזכר שמו בקריאת פרשה זו) ע\"כ. וצ\"ב מדוע חשש משה בפרשת שקלים דייקא שלא יזכר ולא יפקד שמו לאחר מותו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 198,
      "char_length": 424,
      "timestamp": "2025-02-06T19:15:20.512685"
    },
    {
      "id": "vayakhel_p199",
      "text": "ז) עוד איתא בתנחומא (ד) כי תשא את ראש בני ישראל זש\"ה רבים אומרים לנפשי אין ישועתה לו באלקים סלה (תהלים ג) וכו'. ורבנן פתרי קראי באומות העולם רבים אלו אוה\"ע שכתוב בהון הוי המון גוים רבים (ישעי' י\"ז) שאומרים לישראל אומה ששמעה בסיני אנכי ה' אלקיך לא יהי' לך אלקים אחרים (שמות כ) ולבסוף מ' יום עשו את העגל אין ישועתה לו באלקים סלה ואתה ה' מגן בעדי וכו' ומרים ראשי תחת שהיינו חייבים לך הרמת ראש נתת לנו תלוי ראש ע\"י משה שנאמר כי תשא את ראש, ע\"כ. וצ\"ב כוונת המדרש אתחתצא שהיינו חייבים הרמת ראש נתת לנו תלוי ראש, דמשמע שניתן להם תלוי ראש במקום ובתמורת הראש שהיו חייבים בה, וקשה שהרי אין תלוי ראש חליפין ותמורה להרמת ראש, והיה ראוי לומר אע\"פ שהיינו חייבים הרמת ראש, לא פרע לנו המקום לפי מעשינו, אלא נתן לנו תלוי ראש.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 199,
      "char_length": 708,
      "timestamp": "2025-02-06T19:15:20.769675"
    },
    {
      "id": "vayakhel_p200",
      "text": "ח) עוד במד\"ת שם (ה) כי תשא וגו' ר' יונה פתח כי אלקים שופע זה ישפיל וזה ירום (תהלים ע\"ה) וכו' ר' יונה פתח קרא בישראל בלשון זה הוגבהו ובלשון זה הושפלו בלשון זה הושפלו כי זה משה האיש (שמות ל\"ב) ובלשון זה הוגבהו זה יתנו ע\"כ. וראוי להבין כוונת המדרש בלשון זה הושפלו ובלשון זה הוגבהו דוודאי יש בו כוונה חוץ מפשוטו ולא על שווי הלשון בלבד כוונתו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 200,
      "char_length": 338,
      "timestamp": "2025-02-06T19:15:21.149821"
    },
    {
      "id": "vayakhel_p201",
      "text": "ונראה לבאר הענין, בהקדם מה דאיתא בזה\"ק פ' ויקהל (דף קצ\"ה ע\"א) ת\"ח מה כתיב בקדמיתא מאת כל איש אשר ידבנו לבו וכו' בגין דהוו אינון ערב רב בגווייהו אתמר בהו מאת כל איש אשר ידבנו לבו לאכללא לון בינייהו דישראל וכו' לבתר וכו' ואתו אינון ערב רב ועבדו ות עגלא וכו' וגרמו לישראל מותא וקטולא אמר קב\"ה מכאן ולהלאה עובדא דמשכנא לא יהא אלא מסטרא דישראל בלחודוהי מיד ויקהל משה את כל עדת בני ישראל וגו' וכתיב בתריה קחו מאתכם תרומה לה' מאתכם ודאי ולא וכו' מאת כל איש ויקהל משה מאן אתר כניש לון אלא בגין דהוו אינון ע\"ר בינייהו איצטריך משה לאכנשא לון וליחדא לון מבינייהו ע\"כ. וכבר הארכנו לעיל בביאור דברי הזה\"ק דלכאורה קשה כיון שתכלית הכוונה בהקהלת ישראל היתה להפרידם מן הערב רבו א\"כ למה נאמר אויקהל\" משה, הו\"ל למימר שויפרד\" משה, שהרי ההפרדה היתה עיקר הפעולה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 201,
      "char_length": 740,
      "timestamp": "2025-02-06T19:15:21.364535"
    },
    {
      "id": "vayakhel_p202",
      "text": "ונראה בהקדם לפרש מה דאיתא בתורת כהנים פרשת שמיני (הובא בילקוט שם) עה\"פ זה הדבר אשר צוה ה' תעשו וירא אליכם כבוד ה' וז\"ל אמר להם משה לישראל אותו יצה\"ר העבירו מלבבכם ותהיו כולכם ביראה אחת ובעצה אחת לשרת לפני המקום וכו' ע\"כ. וצריך ביאור מה כוונתו באמרו אותו יצה\"ר\" העבירו מלבבכם, דמשמע שהוא כמורה באצבע על התגברות היצה\"ר שנתחדשה בו בפרק, ולא ידענו למה כוונתו. ובארנו בהקדם מה שכתב בחובת הלבבות (שער התשובה פו) בענין אם ישתווה הבעל תשובה אל הצדיק ויש בזה שלשה חלקים וכו' והחלק השני והוא שיש יתרון השב על הצדיק וכו' שיהי' השב חטא חטא קטן במצות ל\"ת שאין בה כרת ואח\"כ שב ממנה בתשובה שלמה בכל תנאיה ושם עוונו לעומתו לנוכח פניו ומבקש תמיד המחילה וכו' והוא נכנע ושפל לפני אלקים והיה חטאו סבה לכניעתו וכו' ולא יתגאה מאומה וכו' חוטא זה הוא שיש לו יתרון על הצדיק שלא חטא חטא ההוא והדומה לו כי הצדיק אין בטוחים בו שלא יתגאה ויגבה לבו וירום במעשהו וכבר נאמר כי יש חטא שמועיל לשב יותר מכל צדקות הצדיק ויש צדקה שמזקת לצדיק יותר מכל חטאות השב כשיפנה לבו מן הכניעה וידבק בגאוה ובחונף ואהבת השבח כמ\"ש אחד מן הצדיקים לתלמידיו אילו לא היה לכם עוון הייתי מפחד עליכם ממה שהוא גדול מן העוון אמרו לו ומה גדול מן העוון אמר להם הגאות והחונף ובשב כזה אמרו חז\"ל (ברכות ל\"ד ע\"ב) במקום שבעלי תשובה עומדין אין צדיקים גמורים יכולים לעמוד עכ\"ל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 202,
      "char_length": 1208,
      "timestamp": "2025-02-06T19:15:21.722080"
    },
    {
      "id": "vayakhel_p203",
      "text": "היוצא מדבריו כי היצר הרע מתאמץ בכל מיני תחבולות ואופנים לצוד את האדם ברשתו אשר עמן ובכל עת הוא זומם תחבולות חדשות ודרכים שונים להתגבר עליו. ואף גם כאשר האדם הוא צדיק גמור ונקי מכל חטא הוא מנסה להכשילו במדת הגאוה וכיוצא בה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 203,
      "char_length": 222,
      "timestamp": "2025-02-06T19:15:22.271255"
    },
    {
      "id": "vayakhel_p204",
      "text": "ובזה פירשנו דברי הגמרא (סנהדרין מ\"ג ע\"ב) איר יהושע בן לוי כל הזובח את יצרו ומתודה עליו מעלה עליו הכתוב כאילו כיבדו להקב\"ה בשני עולמות שנאמר (תהלים נ') זובח תודה יכבדנני, ע\"כ. ונדחקו המפרשים בכוונת מאמר הלז, שהרי הזובח את יצרו הוא צדיק גמור, ומה טעם הוא צריך להתודות עליו, הרי הוא מנוקה מכל עוון. ולפי מ\"ש בחובת הלבבות יובן. כי לצד שהתגבר על יצרו וזבחו, יש מקום לחשוש פן ירום לבבו מאחיו ויפול במדת הגאוה, ועל זאת צריך הוא להתודות אחרי זביחת יצרו, פן חטא ונלכד במצודת הגאוה. והוא לא ידע ואשם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 204,
      "char_length": 490,
      "timestamp": "2025-02-06T19:15:22.405469"
    },
    {
      "id": "vayakhel_p205",
      "text": "ובדרך זה יש לבאר קישור שני מאמרי ריב\"ל בגמרא שם דבתר מימרא דריב\"ל הנ\"ל איתא ואריב\"ל בזמן שביהמ\"ק קיים אדם מקריב עולה שכר עולה בידו מנחה שכר מנחה בידו וכו' אבל מי שדעתו שפלה מעלה עליו הכתוב כאילו הקריב כל הקרבנות כולן שנא' (תהלים נ\"א) זבחי אלקים רוח נשברה וגו' ע\"כ. ולפי מה שפירשנו שפיר שייך מאמר זה אל המאמר הקודם לוג שהרי גם שם מיירי בגנות מדת הגאוה והחובה להתוודות עליה, ועל כן סמיך ליה מימרא זו המדברת בשבח מדת הענוה ושפלות הרוח.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 205,
      "char_length": 432,
      "timestamp": "2025-02-06T19:15:22.652977"
    },
    {
      "id": "vayakhel_p206",
      "text": "ועל פי מימרא הנ\"ל דקאמר ריב\"ל שהעניו ושפל הרוח מעלה עליו הכתוב כאילו הקריב כל הקרבנות, נראה לומר בדרך רמז בכוונת הכתוב עולת תמיד העשויה בהר סיני וגו' (במדבר כ\"ח) דהכתוב ירמוז שיש ביד האדם להקריב עולת תמיד אפי' בזמן שאין ביהמ\"ק קיים, על כן אמר עולת תמיד דניתן להקריב קרבן תמיד, העשויה בהר סיני\", כלומר ע\"י שיעשה האדם עצמו ענותן ושפל רוח כהר סיני השפל מכל ההרים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 206,
      "char_length": 360,
      "timestamp": "2025-02-06T19:15:22.863095"
    },
    {
      "id": "vayakhel_p207",
      "text": "ועל פו זה נבוא לביאור דברי הת\"כ הנ\"ל, דהנה אחר חטא העגל נתגלתה פחיתותם של הערב רב שהכשולו את ישראל במעשה העגל, והיה הכרח להפריד את ישראל מביניהם, אך עדיין היה מקום לחשוש כי ע\"י שוצטוו ישראל להפרד ולהתבדל מן הערב רב, ימצא השען מקום להכשילם במדת הגאוה, ולגרום לפירוד ומחלוקת גם בקרב בני ישראל הכשרים, ולאידך גיסא היה מקום לחשוש בהיפוך, כי ע\"ו שהיה לבם נשבר בקרבם ונפשם מרה עליהם מחמת מעשה העגל, פן יבא היצה\"ר לפתותם להתנהג בענווה ובשפלות, ולא תקום בהם רוח להתפרד מן הע\"ר, ובאמת ענוה כזו היא ענוה פסולה וכמו שפירשו אמרם ז\"ל (סוטה ה' ע\"א) ת\"ח צריך שיהא בו אחד משמינות שבשמינית גאוה דהכוונה שצריך הת\"ח לאחוז במדת הגאוה באופן המבואר בדברי הכתוב השמיני שבשמינית והיינו פסוק ח' שבתמניא אפי בתהלים (המכונה כך ע\"ש שכפולום בו ח' פעמים אלפא ביתא כדאמרינן בריש ברכות) והתם כתיב חבר אני לכל אשר יראוך וגו', כלומר דוקא עם יראי ה' חייבים להתחבר, משא\"כ לנגד הרשעים ופורקי עול חייב הת\"ח להתנהג במדת הגאווה ולהתבדל מהם, כדברי הכתוב (דה\"י ב' י\"ז) ויגבה לבו בדרכי ה\"נ ואת הענווה יזרה הלאה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 207,
      "char_length": 968,
      "timestamp": "2025-02-06T19:15:23.058625"
    },
    {
      "id": "vayakhel_p208",
      "text": "וע\"ד זה ביארנו גם הא דאיתא במד\"ר פ' מצורע (פט\"ז ב) מעשה ברוכל אחד שהיה מחזר בעיירות הסמוכות לצפורי והיה מכריז ואומר מאן בעי למזבן סם חיים וכו' ר' ינאי הוה יתיב וכו' א\"ל תא סק זבין לי וכו' הוציא לו ספר תהלים מכורך הראה לו פסוק זה מי האיש החפץ חיים וגו' נצור לשונך מרע וכו' ע\"כ. ודקדק הכלי יקר ז\"ל בפ' מצורע למה הוצרך המדרש להשמיענו שהוציא לו ספר תהלים אמכורך\" ואיני יודע מה מלמדנו בזה. ופרשנו כי לצד שהאי רוכל בא להורות לר' ינאי חומר איסור לשון הרע וכי הנשמר ממנו זוכה לחיים, על כן הוצרך ללמדו דבר זה בספר תהלים שמכורך' דייקא, לרמוז לו בזה דאף שאיסור חמור מאד הוא לדבר לשון הרע והאיש החפץ חיים אוהב ימים לראות טוב חייב לנצור לשונו ממנו, מ\"מ במה דברים אמורים בספור לשון הרע נגד צדיקים ויראי ה\"ג אך לא שייך דבר זה בספור לה\"ר על הרשעים, ואדרבה מצוה לספר בגנותם ולגלות חרפתם בקהל רב, כמאמר אדוננו המלך דוד הלא משנאיך ה' אשנא ובתקוממוך אתקוטט תכלית שנאה שנאתים לאויבים היו לי (תהלים קל\"ט) ולרמז על כוונה זו הוציא לו ספר תהלים אמכורך\"ל כלומר ששני המדות כרוכים יחד בספר תהלים ולא סגי בחדא מינייהו: אלא האיש החפץ חיים יאחז בשניהם כאחד, וינצור לשונו מלדבר לשון הרע על צדיקים ויראי ה', ולעומת זה ישנא את הרשעים תכלית שנאה ויתקוטט עמהם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 208,
      "char_length": 1124,
      "timestamp": "2025-02-06T19:15:23.544235"
    },
    {
      "id": "vayakhel_p209",
      "text": "תמצית הדברים כי חייב האדם להשתמש בשני מדות הפכיות, לגבי הצדיקים ויראי ה' יתנהג בענוה ובשפלות ויתחבר עמהם, ולנגד הרשעים יחזיק במדת הגאוה וירחיק מעליהם דרכו, וצא יאמר להם, וצריך האדם להשמר מאד מפיתויו היצה\"ר המסיתו לאחוז רק באחת מב' מדות אלו ולהרפות מחברתה לגמרי, והשומע לעצת יצרו בזה יכשל ונלכד באחת משתי אלה, או שיתחבר גם עם רשעים ומשנאי ה\"נ או שיאחז במדת הגאוה במקום שחייבים להרחיק ממנה וידבר סרה על צדיקים ויראי ה'. והוא כעין מ\"ש ק\"ז זלה\"ה בישמח משה פרשת לך עה\"פ ויאמר אברם אל לוט וגו' הפרד נא מעלי אם השמאל ואומונה ואם הימין ואשמאילה. ופירש ע\"ד הזה\"ק (פ' לך ע\"ע ע\"ב בסתרי תורה) דאברהם דא נשמתא קדישא לוט דא יצה\"ר וכו' שיש שני מיני הסתה של יצה\"ר, אחד עפ\"י מדת הדין וכו', שמועץ לאדם למנוע אותו מדרכי התשובה, ואומר לו שהדין נותן שלא יקבלנו בתשובה, וצריך האדם להשיב לו כי הקב\"ה חפץ חסד הוא וכו', וגם יש הסתה להיפוך עפ\"י מדת הרחמים כמו שדרשו ז\"ל וכו' (חגיגה ט\"ז ע\"א) אם יאמר לך יצה\"ר חטא והקב\"ה מוחל לך אל תאמין, וצריך להשיב לו כל האומר הקב\"ה ותרן הוא וכו' ובבא קמא נ' ע\"א) וידוע דימין הוא חסד ושמאל הוא דין וכו' וזה פירוש אם מהשמאל\" שופתה אותך במדת הדין ואימינה' תתגבר כנגדו מצד הרחמים וכן להיפוך עכ\"ד.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 209,
      "char_length": 1101,
      "timestamp": "2025-02-06T19:15:24.090464"
    },
    {
      "id": "vayakhel_p210",
      "text": "והשתא מבוארים דברי הת\"כ פרשת שמיני הנ\"ל אותו יצה\"ר העבירו מלבבכם וכו'. דהנה כפו מה שנתבאר לעיל שנצטוו להפרד מן הערב רב אחר חטא העגל, היה מקום לחוש שתתחדש עליהם הסתת היצר באחד משני פנים, או יפתה אותם לאחוז במדת השנאה והפירוד גם בתוך עדת בני ישראל הכשרים וגם יש לחוש להיפך להתנהג במדת השפלות והענוה בכל עת, ולהיות ענותן ושפל ברך כלפי כל אדם, ולגודל ענוותנותם ושפלות רוחם לא יתנם לבם להפרד מן הערב רב. על כן הזהירם משרע\"ה אותו יצה\"ר העבירו מלבבכם, והכוונה על היצה\"ר של התחברות לרשעים או פירוד ומחלוקת עם הצדיקים שהתחדש עכשיו עליכם, ע\"ו שעשו הע\"ר את העגל ונצטוויתם להתבדל מהם. ומסיים בתורת כהנים ותהיו כולכם ביראה אחת ובעצה אחת לשרת לפני המקום וכו' כלומר ע\"י שתעבירו אותו היצה\"ר מלבבכם תהיה התחברות ועצה אחת ביניכם, ובזה יתכפר לכם על אותו עוון, כי צדיקים במה שחוטאים בו מתרצים כאמרם ז\"ל (שמו\"ר פכ\"ג ו), וכשם שהחטא נגרם ע\"י התחברות עם העיר, כן הכפרה תהי' ע\"י התחברות בון הצדיקים והתבדלות מן העיר. וז\"ש הכתוב זה הדבר אשר צוה ה' תעשו, כלומר להתבדל מן הרשעים ולעשות התחברות בין יראי ה', אזי וירא אליכם כבוד ה\"ל כי יתכפר לכם עון העגל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 210,
      "char_length": 1025,
      "timestamp": "2025-02-06T19:15:24.631688"
    },
    {
      "id": "vayakhel_p211",
      "text": "ובזה מבוארים דברי הזה\"ק שפירש מאה\"כ ויקהל משה שהפרידם מן העיר. והקשינו דא\"כ למה נאמר ויקהל משה, הלא עיקר התכלית היה ההפרדו מן הע\"ר ולא ההקהלה, אמנם לדברינו יובן כי לצד שהפרידן משה מן הע\"ר היה מקום לחוש שיתגרה בהם וצר הפירוד והמחלוקת, ולא ישרה השלום גם בין ישראל הכשרים, לפיכך הוצרך משה להקהיל את בני ישראל הכשרים ולעשות אחדות וחבור ביניהם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 211,
      "char_length": 339,
      "timestamp": "2025-02-06T19:15:25.140870"
    },
    {
      "id": "vayakhel_p212",
      "text": "ועל פו דרכנו י\"ל דברי רש\"י ז\"ל ויקהל לשון הפעיל שאינו אוסף אנשים בידים אלא הם נאספים על פי דבורו. בהקדם מה שכתבנו לפרש דברי המד\"ר ר\"פ בחקותי עה\"פ חשבתי דרכי ואשיבה רגלי אל עדותיך (תהלים קי\"ט) אמר דוד לפני הקב\"ה רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני אני הולך לבית דירה פלונית אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות הה\"ד ואשיבה רגלי אל עדותיך ע\"כ. וביארנו עפ\"י מה דאיתא בגמרא (מו\"ק דף ע\"ז ע\"ב) יצא רבי חייא ושנה לשני בני אחיו בשוק וכו' א\"ל רבו מ\"ט עביד מר הכי א\"ל דכתיב חכמות בחוץ תרונה (משלי א) וכו' א\"ל וכו' כדרבא דאמר רבא כל העוסק בתורה מבפנים תורתו מכרזת עליו מבחוץ ע\"כ. וי\"ל דהפלוגתא דרבי ור' חייא היתה דר\"ח סבר כו טוב והגון הוא לסובב בעיר בשוקים וברחובות כדי לתקן ולעשות נפשות לתורה, ועל כך השיבו רבי כו לא זו הדרך להרבות פעלים לתורה, אלא צריך לעסוק בתורה בפנים, ומי שמשיג ומבין נעימות התוה\"ק בא מאליו להדבק בה, כו תורתו מכרזת עליו מבחוץ.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 212,
      "char_length": 869,
      "timestamp": "2025-02-06T19:15:25.351430"
    },
    {
      "id": "vayakhel_p213",
      "text": "וזאת כוונת המדרש שאמר דוד בכל יום הייתי מחשב למקום פלוני אני הולך. כלומר שחשב מחשבות לצאת קרית חוצות כדי לקרב את הבריות לתורה וליראת שמים, אבל בסופו של דבר נמלך והיו רגליו מוליכות אותו לביהמ\"ד ללמוד תורה, וע\"י שלמד דהמע\"ה תורה בביהמ\"ד, נאספו אליו מעצמם עדרים עדרים הצמאים לתורת ה' וחפצים להדבק במקור החיים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 213,
      "char_length": 306,
      "timestamp": "2025-02-06T19:15:25.764812"
    },
    {
      "id": "vayakhel_p214",
      "text": "ועל דרך זה אפ\"ל בכוונת רש\"י ז\"ל ויקהל משה שאינו אוסף אנשים בידים, ר\"ל שלא היה דרכו של משה להיות מסבב בקרב מחנה ישראל לאסוף ולכנוס בידים אנשים ולעשות התקרבות ביניהם, אלא הן נאספין על פי דבורו והוא ע\"ד הא דאיתא במד\"ר פ' ויחי (פצ\"ח ב) עה\"פ האספו ואגידה לכם את אשר יקרא אתכם באחרית הימים וכו' ורבנן אמרי צוה אותם על המחלוקת אמר להון תהוון כולכון אסיפה אחת וכו' עיי\"ש. הרי כי אסיפה יש לפרשו קירוב לבבות והרחקה ממחלוקת, וז\"ש רש\"י ז\"ל הם נאספים על פי דבורו, פירוש שדבוריו הקדושים עשו רושם בלבותם והביאו לאסיפה והתחברות ביניהם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 214,
      "char_length": 519,
      "timestamp": "2025-02-06T19:15:25.939521"
    },
    {
      "id": "vayakhel_p215",
      "text": "ובדברנו יש ליישב מאה\"כ ויאמר משה אל כל עדת בנו ישראל לאמר זה הדבר אשר צוה ה' לאמר (עיין קושיא ג) וקשה למי יאמרו בני ישראל מצוה זו וגם מדוע כתיב פעם ב' לאמר. אמנם יובן עפ\"י דברי הילקוט הנ\"ל עשה לך קהלות גדולות וכו' כדי שילמדו ממך דורות הבאים להקהיל קהלות בכל שבת וכו'. הרי כי פרשה זו היא הוראה לדורות הבאים להיותם מקהילים קהלות כשם שהיה משרע\"ה מקהיל קהלות, ומינה נלמוד כי כשם שמשרע\"ה עשה הקהלה וחבור רק בין בני ישראל הכשרים וצוה אותם להתפרד מן הע\"ר, כן בכל דור ודור חייבים ישראל להתנהג בשני מדות אלול לעשות קירוב והתחברות בין בני ישראל הכשרים, ולהתבדל מבין הרשעים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 215,
      "char_length": 563,
      "timestamp": "2025-02-06T19:15:26.210079"
    },
    {
      "id": "vayakhel_p216",
      "text": "ובזה אפ\"ל הא דכתיב לאמר' נרמז בזה אמירה לדורות הבאים לנהוג כמותו, ולפיכך כתיב לאמר ב' פעמים דלאמר הראשון מורה על הציווי שיעשו בני ישראל חבור והתקרבות ביניהם, והדר כתיב פעם ב' זה הדבר אשר צוה ה' לאמר קחו מאתכם, זאת היא הוראה לדורות העתידים לאחוז במדה ההפכיית ולהתבדל מן הרשעים, ולא זו בלבד שאסור להתחבר עמהם, אלא שאסור להנות מהם בהנאת ממון וכדומה, כמו שמצינו שנאסר לקחת מהם תרומה למשכן כמאה\"כ קחו מאתכם למעט הערב רב מכלל נתינה, וכדאיתא בזה\"ק הנ\"ל, והטעם כי ע\"י שלוקחים מהם ממון וסיוע נמשכים אחריהם ובאים לידי התחברות, ויוצא מה שיוצא.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 216,
      "char_length": 532,
      "timestamp": "2025-02-06T19:15:26.505411"
    },
    {
      "id": "vayakhel_p217",
      "text": "ובעיני יפלא מה שעלה ונסתפק במנחת חינוך (מצוה ק\"ה) אם מותר לקחת נדבת המשכן ממומרים לע\"ז או לחלל שבתות עיי\"ש. והמהר\"ם שיק ז\"ל בספרו על תרי\"ג מצוות כתב לאסור והוכיח כן מדברי הגמרא. ולכאורה אין צורך בכל זה שהרי מבואר בדברי הכתוב פרשת פקודי שמנין חצאי השקלים שנתנו ישראל למשכן עלו למנין שש מאות אלף שלשת אלפים חמש מאות וחמשים שהוא מספר בני ישראל לבדם שהרי הע\"ר היו מרובים במספרם מבני ישראל כמה פעמים. הרי בפירוש שלא נתנו הערב רב נדבת מחצית השקל ולא באו למנין עם ישראל, ובזה נפשט ספיקו של המנחת חינוך.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 217,
      "char_length": 495,
      "timestamp": "2025-02-06T19:15:26.777394"
    },
    {
      "id": "vayakhel_p218",
      "text": "ועל פי מה שנתבאר כי לא נצטוו במחצית השקל אלא ישראל ולא הערב רב, נחזור ליישב המדרשים הנ\"ל בפרשת שקלים, ותחלה נקדים מ\"ש האלשיך הקדוש בשם החכם מהר\"ש בן אלקביץ ז\"ל שמצות מחצית השקל הוא להורות את בני ישראל וחס אחדותם בל יעלה על לב איש מהם שהוא נפרד מחבירו כי אם כל אחד חצי ובהתחברו עם כל אחד ואחד מישראל נעשה אחד שלם על כן כל אחד יביא מחצית. ויותר מזה כתב ק\"ז זלה\"ה בישמח משה כו המנין מפריד כל אחד לבדו והשקלים מאחדים אותם, ע\"כ. היוצא מזה כי מצות מחצית השקל הביאה להתחברות בין ישראל הכשרים ולעומת זאת נעשה ע\"ו מצות מחצית השקל פירוד והתבדלות מן הערב רב שאינם בכלל מצוה זו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 218,
      "char_length": 566,
      "timestamp": "2025-02-06T19:15:27.024909"
    },
    {
      "id": "vayakhel_p219",
      "text": "ועל פי זה יתבאר היטב דברי התנחומא הנ\"ל (קושיא ה') בא וראה חבתן של ישראל שעבירותיהן מביאות לידי מעלות גדולות וכו' ישיבה וכו' שישבו למכור את יוסף כלכלה את העולם ז' שנים וכו' אף כאן מי גרם לשבטים בפ' שקלים שיתנו כופר נפשותם מעשה העגל וכו' חטאה גדולה שעשו גרמה למצוה ולזכות ע\"כ. והקשינו שהרי לא ניתן לדמות מעשה מכירת יוסף שנמשך ממנו זכות וטובה שכלכל יוסף את כל העולם אבל כיצד ניתן לומר שמעשה העגל גרם למצוה ולזכות גדולה שהרי אף שמצות מחצית השקל הוא המכפרת על מעשה העגל מ\"מ מוטב שלא היו חוטאים ולא היו צריכים לכפרה זו. ועל פי האמור י\"ל כי הנה בצאת ישראל ממצרים וגם ערב רב עלה אתם לא נשמרו ישראל מלהתחבר עמהם, כי לא ידעו גודל ההפסד הכרוך בהתחברות עמהם, ואמנם הביאה ההתחברות עמהם שהכשילו את ישראל בעגל, ולפיכך נתנה להם מצות מחצית השקל אחר שחטאו בעגל כי על ודי מצוה זו נעשה פירוד והתבדלות ביניהם לבין הערב רב, שלא היו בכלל מצוה זו כמבואר, וגם נעשה ע\"י מצות מחצית השקל חבור ואחדות בין בני ישראל הכשרים כמ\"ש האלשיך הקדוש, נמצא מזה כי מעשה העגל גרם לכך שנצטוו לתת מחצית השקל, ועל ידה נעשה פירוד בין ישראל לע\"ר והתחברות בקרב ישראל הכשרים. וזאת כוונת התנחומא חטאה גדולה שעשו הוא חעא העגל גרמה לטובה ולזכות, שהרי ע\"י כך התבדלו מן הערב רב ונעשה חבור ודבקות בון יראי ה\"ג ושפיר דמיא למעשה מכירת יוסף שגרמה טובה וזכות גדולה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 219,
      "char_length": 1206,
      "timestamp": "2025-02-06T19:15:27.317526"
    },
    {
      "id": "vayakhel_p220",
      "text": "וזאת אפ\"ל גם בכוונת התנחומא (קושיא ח) בלשון זה הושפלו ובלשון בזה הוגבהו בלשון זה הושפלו כי זה משה האיש ובלשון זה הוגבהו בלשון זה הושפלו כי זה משה האיש ובלשון זה הוגבהו זה יתנו. כי הן אמנם מעשה העגל השפילם למאד אך מעשה זה עצמו היה הסבה להגבהתם כי ע\"ו מעשה העגל התפרדו מן הע\"ר ונעשתה התחברות בין ישראל הכשרים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 220,
      "char_length": 307,
      "timestamp": "2025-02-06T19:15:27.891176"
    },
    {
      "id": "vayakhel_p221",
      "text": "ועתה הבא נבוא לבאר דברי התנחומא (קושיא ו) בפ' שקלים אמר משה משאני מת אין אני נזכר וכו'. דהנה תיבת תשא פשטות פירושה לשון קבלת מנין כמו שפירש\"י ז\"ל, אמנם כלולים בה עוד ב' פירושים, כדאיתא במד\"ר פ' במדבר (פ\"א ע) איר פנחס בר אידי מה כתיב בראש הספר שאו את ראש כל עדת בני ישראל רומם את ראש גדל את ראש לא נאמר אלא שאו את ראש כאדם האומר לקיסטנר (ההורג חייבי מיתה למלך) סב רישיה דפלן (חתוך ראשו של פלוני) כך נתן רמז למה שאו את ראש שאם יזכו יעלו לגדולה כמ\"ד (בראשית מ') ישא פרעה את ראשך והשיבך על כנך אם לא יזכו ימותו כולם כמה דתימא ישא פרעה את ראשך מעליך ותלה אותך על עץ וכו'. עכ\"ד המדרש, הרי כו תיבת תשא סובלת ב' משמעות, אם יזכו ישראל תתפרש שיעלו לגדולה, ואם ח\"ו לא יזכו פירושה לשון מיתה וכליוה ח\"ו, ועל כן נתיירא משה בשמעו פרשת שקלים שנאמר בה כי תשא את ראש, שמא ח\"ו לא יזכו ישראל ויתקיים בהם הפירוש השני בתיבת תשא שהוא לשון כלייה ח\"ו, ולכן אמר משאני מת אין אני נזכר.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 221,
      "char_length": 858,
      "timestamp": "2025-02-06T19:15:28.085787"
    },
    {
      "id": "vayakhel_p222",
      "text": "השיב לו הקב\"ה כשם שאתה עומד וזוקף את ראשם כך בכל שנה ושנה בשעה שקוראים אותה לפני כאילו אתה עומד עמהם וזוקף את ראשם. כי בזכות קריאת הפרשה בכל שנה ושנה נזכרים ומתעוררים ההשפעות שזכו להם ישראל ע\"י השקלים שנתנו בימי משה, ובזכותו ינצלו ישראל מכלייה. ומסיים במדרש תנחומא שם מנין ממה שקרינו בענין כי תשא וגו' שא לא נאמר אלא תשא.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 222,
      "char_length": 321,
      "timestamp": "2025-02-06T19:15:28.534135"
    },
    {
      "id": "vayakhel_p223",
      "text": "ונראה לפרש הכוונה עפ\"י מה שפירש בסה\"ק קדושת לוו בדרוש לר\"ה מה שיסד הפייטן בפיוט ונתנה תוקף ויכון בחסד כסאך ותשב עליו באמת. וז\"ל, כי כשהקב\"ה דן את עולמו בחסד אזי יש קיום וזהו באמת כי אמת הוא דבר הקיים אבל ח\"ו כשהקב\"ה דן וכו' אזי הצדיקים שבדור יש להם כח לבעל וזהו מי מושל בי צדיק ונמצא כביכול אינו מתקיים וכו' אבל כשהקב\"ה דן עולמו בחסד אז יש לו קיום ואין מי שיבטל וזהו ויכון בחסד כסאך ותשב עליו באמת כיון שכונן בחסד כסאך אז הוא באמת עכלה\"ק. ועל פי זה יבואר כוונת המדרש שא לא נאמר אלא תשאר פירוש מנין שאין לפרש תיבת תשא לשון כלייה ח\"ו, ע\"כ אמר אשא\" לא נאמר אלא אתשא\", כלומר תשא הוא לשון עתיד, ואילו היה פירושו מיתה וכלייה ח\"ו לא יתכן לומר כן על העתיד, כמ\"ש בקדושת לוי דאם הקב\"ה דן במדת הדין הוא דבר שאין לו קיום לעתיד שהרי הצדיקים מבעלים הגזרה, ועל כרחך שפירוש כי תשא הוא מלשון נשיאות ראש וגדולה ולפיכך נאמר תשא\" לשון עתיד שהבטיח הקב\"ה שבשעה שיקראו פרשת שקלים כאלו משרע\"ה עומד שם באותה שעה וזוקף את ראשם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 223,
      "char_length": 901,
      "timestamp": "2025-02-06T19:15:28.713971"
    },
    {
      "id": "vayakhel_p224",
      "text": "ויש לפרש עוד מה שהבטיחו הקב\"ה כאלו אתה עומד באותה שעה שם וזוקף את ראשם דהנה השל\"ה הקדוש (בדרוש על פרשת פרה) כתב כי רבותינו ז\"ל אמרו שהתורה כולה בלשון זכר נאמרה אבל בגלות התורה מתמעטת בעוה\"ר עד עת קץ שיתקיים ומלאה הארץ דעה, ואעפ\"י שנאמר כי לא תשכח מפי זרעו, מ\"מ תשש כחה והיא בבחי' נקבה ולפיכך כתיב לא שתשכח\" לשון נקבה ולא כתיב לא שישכח\". והכוונה בזה כי באחרית הימים אין השפעת התורה בבחי' זכר שיוכלו להשפיע בה השפעות חדשות אלא בחינת נוקבא שהיא בחי' מקבל שאנו מקבלים השפעות שהשפיעו הראשונים ז\"ל. ולפיכך הבטיח הקב\"ה למשה כי אף באחרית הימים שלא יתגלו לישראל השפעות חדשות, מ\"מ יקבלו ישראל השפעות מכוחו, ובשעה שישראל קורים בתורה מתגלים ההשפעות לכלל ישראל, וכאלו הוא עומד שם וזוקף את ראשם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 224,
      "char_length": 681,
      "timestamp": "2025-02-06T19:15:29.145231"
    },
    {
      "id": "vayakhel_p225",
      "text": "וזאת אפ\"ל בכוונת הגמרא ב\"ב הנ\"ל אמר משה לפני הקב\"ה במה תרום קרן ישראל, כי צפה משרע\"ה מה שיהי' בדורות האחרונים שיתמעט כח התורה וא\"כ במה יתרומם קרנם, והשיב לו הקב\"ה בכי תשא, כלומר שיתגלו להם השפעות בזכותו של משה, וכדברי התנחומא הנ\"ל דיליף לה מדכתיב כי תשא שהבטיחו הקב\"ה כי בעת קריאת הפרשה תתעורר זכותו וההשפעות הבאות מכוחו ובזכותו תרום קרננו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 225,
      "char_length": 340,
      "timestamp": "2025-02-06T19:15:29.464659"
    },
    {
      "id": "vayakhel_p226",
      "text": "אלה הדברים אשר צוה ה' לעשות אותם ששת ימים תעשה מלאכה וביום השביעי יהיה לכם קודש וגו'. הקשו המפרשים ז\"ל שהרי לפי משמעות הכתוב קאי מאמר אלה הדברים על אזהרת שבת דכתיבא בתריה, וא\"כ למה נאמר אשר צוה ה' לעשות\" אותם, והרי עיקר מצות שבת בשלולת העשייה, והול\"ל אשר צוה ה' שלא לעשותז.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 226,
      "char_length": 273,
      "timestamp": "2025-02-06T19:15:29.648543"
    },
    {
      "id": "vayakhel_p227",
      "text": "ב) הרמב\"ן ז\"ל כתב כו מאמר אלה הדברים וגו' קאי על מלאכת המשכן וכל כליו וכל עבודתו והקדים השבת לומר שאינו דוחה שבת. עכ\"ד. וקשה דלדבריו למה הפסיק הכתוב אחר מאמר אלה הדברים שנאמר על מלאכת המשכן באזהרת שבת, והוה ליה להקדים אזהרת שבת טרם מאמר אלה הדברים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 227,
      "char_length": 248,
      "timestamp": "2025-02-06T19:15:29.825425"
    },
    {
      "id": "vayakhel_p228",
      "text": "ג) הכלי יקר ז\"ל הקשה דאו קאי אלה הדברים על מלאכת המשכן, למה נכפל ציווי זה פעמיים, שהרי נאמר להלן בפרשה זה הדבר אשר צוה ה' וגו' קחו מאתכם וגו'.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 228,
      "char_length": 142,
      "timestamp": "2025-02-06T19:15:30.033655"
    },
    {
      "id": "vayakhel_p229",
      "text": "ד) רש\"י ז\"ל כ' הקדים להם אזהרת שבת לציווי מלאכת המשכן לומר שאינו דוחה את השבת עכ\"ל. והקשה הרא\"ם ז\"ל למה הוצרך הכתוב להודיע שאין מלאכת המשכן דוחה שבת, והרי בנין המשכן הוא עשה גרידא ושבת עשה ול\"ת ואין עשה דוחה ל\"ת ועשה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 229,
      "char_length": 217,
      "timestamp": "2025-02-06T19:15:30.161606"
    },
    {
      "id": "vayakhel_p230",
      "text": "ונראה ליישב בהקדם מה דאיתא בגמרא (שבת מ\"ט ע\"ב) הא דתנן אבות מלאכות ארבעים חסר אחת כנגד מי א\"ל ר' חנינא בר חמא כנגד עבודות המשכן וכו' תניא כמ\"ד כנגד עבודות המשכן דתניא אין חייבין אלא על מלאכה שכיוצא בה היתה במשכן הם זרעו ואתם לא תזרעו וכו' עכ\"ל הגמרא. ולכאורה יש לחקור כיון שמלאכות האסורות בשבת ממשכן ילפינן להו, איך שמרו ישראל את השבת משעת מתן תורה עד שנצטוו על מלאכת המשכן, והרי על מעשה המשכן נצטוו רק ממחרת יום הכיפורים ברדת משה מן ההר, וכמ\"ש רש\"י ז\"ל בריש פ' זו כי פרשה זאת נאמרה להם למחרת יום הכיפורים ברדתו מן ההר ע\"כ. ואז התחיל לצוותם על מעשה המשכן כדכתיב להלן בפרשה קחו מאתכם וגו', וא\"כ מאין ידעו בני ישראל בטרם נצטוו על מעשה המשכן, איזה פעולה היא בגדר מלאכה ואסור להם לעשותה בשבת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 230,
      "char_length": 688,
      "timestamp": "2025-02-06T19:15:30.302311"
    },
    {
      "id": "vayakhel_p231",
      "text": "ואפשר לומר עפ\"י דברינו לעיל (פ' תרומה) להשוות דעת הראשונים ז\"ל והמדרשים שנחלקו אם ציווי המשכן קדם למעשה העגל. ובארנו כי הקב\"ה צוה למשה על מעשה המשכן במתן תורה, וכן מבואר בלשון התנדב\"א פי\"ז בשעה שאמרו ישראל נעשה ונשמע מיד\" אמר הקב\"ה ויקחו לו תרומה ע\"כ. אלא שמשה לא צוה לבני ישראל על מעשה המשכן עד למחרת יוהכ\"פ ברדתו מן ההר, ע\"ש באורך. ולפי זה נמצא כו ודע משרע\"ה בשעת מ\"ת מה הם המלאכות אשר יעשו במשכן, ואפשר שמסר מיד ציווי זה ליחידי סגולה ראשי הדור, אלא שלכללות ישראל לא צוה על מעשה המשכן עד למחרת יוהכ\"פ. אמנם יחידי סגולה אלו אשר כבר ידעו שצוה הקב\"ה לבנות משכן, ומתוך כך גם נודעו להם איזה מלאכות אסורות בשבת, הם לימדו דעת את העם איזה פעולה היא בגדר מלאכה וחייבים עליה בשבת, ומשם ידעו כל ישראל ל\"ט מלאכות האסורות בשבת עוד בטרם רדת משה מן ההר.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 231,
      "char_length": 740,
      "timestamp": "2025-02-06T19:15:30.638068"
    },
    {
      "id": "vayakhel_p232",
      "text": "אך עדיין חלה עלינו חובת ביאור בטעם הדבר שאין קרויים בגדר מלאכה אלא אותם המלאכות שהיו במשכן, לא זולת, ואף שכך גזרה חכמתו ות', מ\"מ רשאים אנחנו לחקור בטעמא דמילתא עד מקום שיד שכלנו מגעת. ונראה לומר שהטעם הוא משום דרחמנא אחשבינהו לאותם מלאכות שהיו במשכן להקרא מלאכה, ולהתחייב עליהם בשבת, ואותם מלאכות שלא היו במשכן לא החשיבה אותן תורה להתחייב עליהם. וראיה שהרי איכא מלאכות שמצד הסברא אינם בגדר מלאכה, כגון הא דכתבו התוספות בריש מסכת שבת ודף ב' ע\"א ד\"ה פשט בעה\"ב) דהוצאה מלאכה גרועה היא דמה לו מרה\"י לרה\"ר דמחייב ומה לי מרה\"י לרה\"י דמיפטר. וכמו כן יש דברים שמצד הסברא הנם מלאכה, ואעפ\"כ לא אסרתן תורה, כגון אם ועמול האדם כל יום השבת בעבודת פרך, וישא משאות כבדים מפנה לפנה, ואפ\"ה אינו עובר באיסור דאורייתא כלל, אלא שיש עליו איסור דרבנן משום טירחא יתירא ועובדא דחול. ועל כרחך לומר דטעמא הוא משום דלא הויא דומיא דמלאכת המשכן לא אחשביה רחמנא מלאכה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 232,
      "char_length": 838,
      "timestamp": "2025-02-06T19:15:30.999181"
    },
    {
      "id": "vayakhel_p233",
      "text": "ולפי זה יש מקום להיות עולה ומסתפק במלאכות אלו, אשר מצד הסברא לא חשיבי מלאכה, אימת קבלו חשיבותן להיות חייבים עליהם בשבת. וצדדי הספק הם, אם נאמר דמיד שצוה השי\"ת על מעשה המשכן בשעת מ\"ת קבלו כל הל\"ט מלאכות חשיבות, כיון שהם עתידות להעשות לצורך המשכן, וחייבים עליהם בשבת, או דילמא לא קבלו מלאכות אלו חשיבותן אלא אחר הקמת המשכן, שכבר נעשו המלאכות בפועל לצורך המשכן, ולא קודם לכן. ואם נתפוס כצד זה, נמצא דמותר לעשות מלאכות קלות אלו לצורך המשכן בשבת, שהרי עדיין לא נחשבו למלאכה. על כן כדי להוציא מן הספק הקדים הכתוב אזהרת שבת למלאכת המשכן, לומר שאינו דוחה שבת, כמ\"ש רש\"י ז\"ל, והכונה להשמיענו שאף אותם מלאכות שמצד הסברא אינם בגדר מלאכה, אסור לעשותם בשבת לצורך המשכן, כו מיד בעת בא ציווי ה' למשה על עשיית המשכן, קבלו מלאכות אלו חשיבות, וחשיבי מלאכה גם לענין שבת. ומיושבת בזה שפיר קושית הרא\"ם ז\"ל, שהוצרך הכתוב להודיענו שאין מלאכת המשכן דוחה שבת אף במלאכות הקלות, דחשיבי מלאכה אף בטרם הוקם המשכן.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 233,
      "char_length": 884,
      "timestamp": "2025-02-06T19:15:31.374300"
    },
    {
      "id": "vayakhel_p234",
      "text": "ועפי\"ז יתפרש הכתוב היטב, ומיושבים דברי הרמב\"ן ז\"ל (קושיא ב' ג') שפיר, כי מאמר אלה הדברים וגו' קאי על מעשה המשכן, כמ\"ש הרמב\"ן ז\"ל, ובא להודיענו במאמר זה כי ע\"י ציווי הקב\"ה לעשות מלאכות אלו לצורך המשכן, קבלו חשיבות ונאסר לעשות בשבת לצורך המשכן אף מלאכות הקלות, שמצד הסברא לא חשיבי מלאכה. וז\"פ הכתוב אלה הדברים אשר צוה ה' לעשות אותם. ר\"ל ע\"י שצוה ה' לעשות מלאכות אלו לצורך המשכן, על כן ששת ימים תעשה מלאכה לצורך המשכן וביום השביעי יהי' לכם קודש. שאין מלאכת המשכן דוחה שבת, אפי' במלאכות הקלות, אשר מצד הסברא מותר לעשותם בשבת. ומיושב שפיר מה שהקשה הכלי יקר ז\"ל, מדוע חזר הכתוב לצות על מלאכת המשכן פעם שנית, כדכתיב זה הדבר. ולדברנו ובא על נכון, כי מאמר אלה הדברים אף שקאי על מלאכת המשכן, אבל לא בא לצוות על מעשה המשכן, אלא להודיענו כי ע\"י שנצטוו על מלאכות אלו במשכן, נאסר לעשותם בשבת לצורך המשכן, ע\"כ בא ציווי זה הדבר וגו' לצוות על מלאכת המשכן. ודו\"ק.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 234,
      "char_length": 845,
      "timestamp": "2025-02-06T19:15:31.807419"
    },
    {
      "id": "vayakhel_p235",
      "text": "אלה הדברים אשר צוה ה' לעשות אותם וגו'. הקשו המפרשים שהרי פשטות הפסוק משמע דקאי על איסור מלאכה בשבת דכתיב בתריה, וא\"כ הול\"ל אשר צוה ה' שלא לעשות אותם. והרמב\"ן ז\"ל כ' אשר צוה ה' לעשות וגו' פי' מלאכת המשכן ולדבריו קשה למה חזר הכתוב פעם שנית לומר בציווי מלאכת המשכן זה הדבר אשר צוה ה'.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 235,
      "char_length": 281,
      "timestamp": "2025-02-06T19:15:32.232566"
    },
    {
      "id": "vayakhel_p236",
      "text": "ונראה בהקדם מ\"ש ק\"ז זלה\"ה בישמח משה פרשת תשא על הפסוק אות הוא לעולם, לבאר למה נקרא השבת אות על פו מה שכתב בשל\"ה הקדוש שמצא במגלת סתרים (הובא בראש הספר גאון צבי בשאלות שם) כו כל נשמה של אדם מישראל נאצלה משבת אחת. והנה מבואר בספה\"ק כי ס\"ר נשמות נחצבו מס' רבוא אותיות, ודעת לנבון נקל כי השבתות הם אותיות התורה, ומזה סיוע למ\"ש דכמו שוש שלש מאות אלף שבתות גלוים בשית אלפי שנין ושלש מאות אלף נסתרים באלף השביעי וכו'. וא\"כ כל שבת בפני עצמו הוא אות ממש מאותיות התורה ולא נדמה שבת לשבת מעולם והבן. ולכך נקרא שבת אות וכו' ונמצא בכל שבת ושבת מאיר אות אחד מה שלא האיר עדיין מימות עולם ולא יאיר עוד עד עולם. ועפי\"ז מבואר אמרם ז\"ל (תענית כ\"ז ע\"ב) שבת וינפש כיון ששבת וי אבדה נפש. דהא הנפש של שבת זו לא יהיה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 236,
      "char_length": 693,
      "timestamp": "2025-02-06T19:15:32.391503"
    },
    {
      "id": "vayakhel_p237",
      "text": "ובזה יש להבין כמה יש להזהר בכל שבת בפני עצמו ומתיקות כל שבת בפני עצמו, ונמצא לפי\"ז אותו האדם שהשבת מתייחס לו ביום השבת ההוא עונשו גדול מכל מחללי שבתות שהיו בעולם ושיהיו בעולם, דהרי הוא פוגם בעצם אותו השבת במקומו ושעתו וכו', ופוגם בכל ישראל וההיפוך אם שמרו שכרו גדול מכל שומרי שבתות שהיו ושיהיו. והנה מזה נצמח תוכחה גדולה איך יש ליזהר בשמירת שבת, ועל כולם ידמה כל אחד מישראל בנפשו שמא זה הוא השבת שמתיחס לו ואם משמרו בקדושה ובטהרה הרי יוכל לתקן יותר ויותר ממה שיוכל לתקן בכל ומי חייו וההיפך בהיפך ח\"ו, ויחרד לפגום בו אף כחוט השערה, עכת\"ד הקדושים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 237,
      "char_length": 545,
      "timestamp": "2025-02-06T19:15:32.741906"
    },
    {
      "id": "vayakhel_p238",
      "text": "ועפ\"י דבריו הקדושים פירשנו מאמרם ז\"ל בילקוט (פ' תשא רמז שצ\"א) ר' נתן אומר מנין אתה אומר כל מי שמשמר את השבת כתקנה מעלין עליו כאלו שמר כל שבתות מיום שברא הקב\"ה עולמו עד שיחיו המתים שנא' ושמרו בני ישראל את השבת. (פי' בזית רענן מדכתיב ברית עולם דריש). ולכאורה למה דוקא במצות שבת מעלה עליו הכתוב כאלו שמר כל השבתות וכו' ולא בשאר מצות, כגון אם מניח תפלין כתקונם יחשב לו כאלו הניח תפלין מיום בריאת העולם וכו'.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 238,
      "char_length": 403,
      "timestamp": "2025-02-06T19:15:32.999615"
    },
    {
      "id": "vayakhel_p239",
      "text": "ולדברי ק\"ז היש\"מ זלה\"ה יובן שפיר, כי כיון כל שבת הוא נגד אות אחת בתורה, וכל השבתות של ימות עולם הם כנגד כל התורה, א\"כ כיון שאמרו ז\"ל (מנחות דף ל' ע\"א) ואמר ר' יהושע בר אבא אמר רב גידל אמר רב הלוקח ספר תורה מן השוק כחוטף מצוה מן השוק כתבו מעלה עליו הכתוב כאלו קבלו מהר סיני א\"ר ששת אם הגיה אפילו אות אחת מעלה עליו כאלו כתבו, ע\"כ. כן הוא גם בשמירת שבת קודש, שכל שבת הוא נגד אות אחת בתורה, אם זכה אדם לשמור אפילו שבת אחד כראוי, היינו אותו שבת שנשמתו מתיחסת אליו, נמצא כי הגיה אות אחת בתורה, ע\"י שזכה לתקן השבת ההוא המכוון נגד אות אחת בתורה. וזאת כוונת הילקוט כל מי שמשמר את השבת כתקנה היינו שהוא זוכה לשמור את השבת המכוון לשורש נשמתו, מעלה עליו הכתוב כאילו שמר כל השבתות מיום שברא הקב\"ה עולמו, שהרי הוא כמגיה אות אחת בתורה, היא האות המכוונת נגד השבת שתקן. ולכן מעלה עליו הכתוב כאלו שמר כל השבתות, שהרי הם מכוונים נגד אותיות התורה, והמגיה בו אות אחת כאלו כתבו כולו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 239,
      "char_length": 861,
      "timestamp": "2025-02-06T19:15:33.208873"
    },
    {
      "id": "vayakhel_p240",
      "text": "ועפ\"י הקדמה זו נבוא לפרש מאה\"כ אלה הדברים אשר צוה ה' לעשות אותם וגו'. דהנה באותו מעמד היו מכונסים יחד כל קהל עדת ישראל שהם ששים רבוא נשמות ישראל, המכוונים נגד ס' רבוא אותיות התורה, על כן אמר להם משה רבינו ע\"ה כי כללות נשמותיהם המכוונים נגד כללות התורה הם הדברים אשר צוה ה' לעשות אותם, ומפרש והולך כי תקון הנשמות יהיה על ידי שמירת שבת, ועל כן אמר ששת ימים תעשה מלאכה וגו' וביום השביעי יהי' לכם קודש. וא\"ש שאמר הכתוב לעשות\" אותם אף ששמירת שבת היא שלילת העשייה מ\"מ כוונת הכתוב לתיקון הנשמות הנעשה ע\"ו שמירת שבת דעשייה לשון תיקון.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 240,
      "char_length": 526,
      "timestamp": "2025-02-06T19:15:33.642857"
    },
    {
      "id": "vayakhel_p241",
      "text": "באופן אחר נראה לבאר מאה\"כ אלה הדברים אשר צוה ה' לעשות אותם. בהקדם מה שנחלקו קדמונינו מוני המצוות אם אנכי ולא יהי' לך נמנים בכלל תרי\"ג מצוות או לא, דעת הרמב\"ם ז\"ל בספר המצות, כי הנם נחשבים בכלל תרי\"ג מצוות, וראיתו מדברי הגמרא (מכות כ\"ג ע\"ב) דרש ר' שמלאי שש מאות ושלש עשרה מצוות נאמרו לו למשה וכו' אמר ר' המנונא מאי קרא (דברים ל\"ג) תורה צוה לנו משה מורשה וגו' תורה בגימטריא שית מאה וחד סרי הוו אנכי ולא יהיה לך מפי הגבורה שמענום (פירש\"י והיינו דכתיב תורה\" צוה לנו משה ושתים מפי הגבורה הרי שית מאה ותליסרי). עכ\"ד הגמרא. הרי בפירוש דס\"ל לר' שמלאי דאנכי ולא יהי' לך הם בכלל תרי\"ג מצוות.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 241,
      "char_length": 581,
      "timestamp": "2025-02-06T19:15:33.899757"
    },
    {
      "id": "vayakhel_p242",
      "text": "אמנם הרמב\"ן ז\"ל בהשגותיו לספר המצוות נחלק על הרמב\"ם ז\"ל, וס\"ל שאין שייך למנות אנכי ולא יהיה לך בכלל המצוות לפי שהאמונה היא יסוד ושורש הכל, ומבלעדי האמונה באחדות ה' אין שייך לצוות על שמירת המצוות, וכמו דאיתא במדרש ולקוט פרשת יתרו עה\"פ לא יהי' לך אלהים אחרים וגו' משל למלך בו\"ד שנכנס למדינה אמרו לו עבדיו גזור עליהם גזירות אמר להם לכשיקבלו מלכותי אגזור עליהם גזירות שאם מלכותי אין מקבלין גזרותי אין מקיימין וכו' עכ\"ל. וכן דעת שאר הראשונים ז\"ל שאין למנות אנכי ולא יהי' לך בין תרי\"ג מצוות. והר\"ר חסדאי בספרו אור ה' הוסיף להקשות על שיטת הרמב\"ם ז\"ל, שאין למנות רק מצוות שהם תלויות ברצון האדם ובבחירתו, והאמונה אינה דבר התלוי בבחירה, שהרי מו שאינו מאמין און שייך לצוות עליו שיאמין, רק אם הוא מאמין בהכרח מה שהשיג בשכלו שייך לצוות עליו שאר המצוות.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 242,
      "char_length": 739,
      "timestamp": "2025-02-06T19:15:34.189879"
    },
    {
      "id": "vayakhel_p243",
      "text": "ואא\"ז זללה\"ה בתפלה למשה (תהלים ס\"ב) האריך למעניתו בענין זה, וישב דעת הרמב\"ם ז\"ל מקושית ר' חסדאי, וז\"ל דאף שהאמונה באמת מוכרחת, וממש מוטבעת בלב אנשי ישראל מאז שעמדו על הר סיני, מ\"מ כיון שוש כמה וכמה מתפקרים דניחא להו בהפקירא, ע\"כ בזדון הם מדברים על לבם להסיר האמונה, ומרגילים עצמם עד שעוקרים שורש האמונה מלבם, ודבר זה נתבאר בחוש שיש יכלת ביד הבחירה להסיר האמונה מלבו מכל וכל, רק שאם אינה מסירה מלבו בזדון הרי היא מוטבעת בלב אנשי ישראל וכו' עכ\"ל. וכדבריו ז\"ל כתב הרמב\"ם ז\"ל עצמו באגרת תימן וז\"ל וכבר הבטיחנו הבורא יתברך כאדם הנכנס ערב לחבירו ודי לנו בערבותו והודיענו שכל מי שעמד על הר סיני שהם מאמינים בנבואת משרע\"ה בכל מה שבא על ידו הם ובניהם ובני בניהם עד עולם שכן אמר הקב\"ה (שמות י\"ט) וגם בך יאמינו לעולם, עכ\"ל. הרי מפורש בדבריו כמ\"ש הישמח משה זלל\"ה כי האמונה מושרשת בטבע בלב האיש הישראלי, וע\"כ לומר כי מצות אנכי ולא יהיה לך היא שלא יעשה בזדון להסיר האמונה מלבו, ופלא שלא זכר שר ה\"ה ק\"ז זלה\"ה את דברי רמב\"ם באגרת תימן.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 243,
      "char_length": 919,
      "timestamp": "2025-02-06T19:15:34.527798"
    },
    {
      "id": "vayakhel_p244",
      "text": "ברם אכתי קשה על תירוץ היש\"מ ז\"ל, שהרי אזהרה זו שלא יעשה בזדון להסיר האמונה מלבו למדנו ממאמר הכתוב אל תפנו אל האלילים (ויקרא י\"ט), ודרשו חז\"ל (שבת קמ\"ט ע\"ב) איר חנין אמר קרא אל תפנו אל האלילים אל תפנו אל מדעתכם. וכ' הרמב\"ם ז\"ל ופ\"ב מהלכות עבודת כוכבים ה\"ב ג') וז\"ל ספרים רבים חברו עובדי כוכבים בעבודתה היאך עיקר עבודתה ומה מעשיה ומשפטיה צונו הקב\"ה שלא לקרות באותן הספרים כלל וכו' ולא נהרהר בה ולא בדבר מדבריה וכו' שנא' אל תפנו אל האלילים וכו' ולא עבודת כוכבים בלבד וכו' אלא כל מחשבה שהוא גורם לו לאדם לעקור עיקר מעיקרי התורה מוזהרים אנו שלא להעלות על לבנו ולא נסיח דעתנו לכך ונחשוב ונמשך אחר הרהור הלב ואם ימשך כל אדם אחר מחשבות לבו וכו' ונמצא בא לידי מינות וכו' עכ\"ל. הרי שאזהרה זו שלא יסיר בזדון האמונה מלבו היא בכלל אל תפנו אל האלילים, וא\"כ קשה על דברי היש\"מ זלה\"ה דאמאי איצטריך אנכי ולא יהי' לך להזהיר על כך והרי כבר אנו מוזהרים ועומדים על כך מקרא דאל תפנו אל האלילים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 244,
      "char_length": 871,
      "timestamp": "2025-02-06T19:15:34.957166"
    },
    {
      "id": "vayakhel_p245",
      "text": "ואפ\"ל דתרוייהו איצטריכי כי אנכי ולא יהיה לך הוא ציווי שלא יתחבר עם אותם שאינם מאמינים כי זה מזיק להאמונה, ולאו דאל תפנו אל האלילים הוא אזהרה לבל יהרהר בלבו דברים המזיקים אל האמונה. או י\"ל עפ\"י מ\"ש בספר חות דעת (יו\"ד סי' ק\"י) דאף לדעת הרמב\"ם ז\"ל הסובר ספיקא דאורייתא מן התורה לקולא אין זה אלא בל\"ת אבל היכא שאמרה התורה קום ועשה צריך להיות עשייה ודאית ולא מקילינן בספיקא (ועי' בספרי ויואל משה מאמר ישוב א\"י סו' ס' שהארכנו בזה דאפי' כמה ספיקות אינם פוטרות במ\"ע) ואם כן אילו הזהירה תורה רק בלאו דאל תפנו אל האלילים, הוה ידעינן אזהרה לדבר המזיק ודאי לאמונה, אבל דבר שספק אם מזיק הוה אזלינן לקולא, ע\"כ נצטוינו גם בעשה אנכי ה' אלקיך, להורות כי אף בדבר שהוא רק בגדר ספק אם מזיק לאמונה אסור להרהר, וכדברי החו\"ד ז\"ל כי במצות עשה אזלינן לחומרא בספיקא.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 245,
      "char_length": 740,
      "timestamp": "2025-02-06T19:15:35.391459"
    },
    {
      "id": "vayakhel_p246",
      "text": "ועפ\"י כל האמור נראה לפרש דברי המדרש פליאה (הביאו א\"א זלל\"ה בקדושת יו\"ט פ' יתרו) כיון ששמע משה אנכי ה' אלקיך פתח ואמר ברוך שלא עשני גוו. והוא פלאי. ויבואר בהקדם עוד דברי הט\"ז ז\"ל (או\"ח סי' מ\"ו ס\"ק ד') שכ' רבים מקשים למה תקנו לברך שלא עשני גוי בלשון שלילה, ומדוע לא תקנו לברך ברוך שעשני ישראל, ותירץ עפ\"י דאיתא בגמ' (עירובין י\"ג ע\"ב) נמנו וגמרו נוח לו לאדם שלא נברא יותר משנברא ועכשיו שנברא יפשפש במעשיו וכו', ועל כן אין לברך שעשני ישראל כי נוח לו שלא נברא משנברא. ולכאורה קשה שהרי מקרא מלא דבר הכתוב וירא אלקים את כל אשר עשה והנה טוב מאד, וגם בריאת האדם בכלל, ואיך יתכן לומר נוח לו שלא נברא, וגם צ\"ב בלשון הגמ' ועכשיו שנברא יפשפש במעשיו, מה שייך זה להך נמנו וגמרו נח לו שלא נברא, והרי דבר זה הוא חיוב בפ\"ע שופשפש האדם במעשיו ויעשה תשובה אם חטא.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 246,
      "char_length": 743,
      "timestamp": "2025-02-06T19:15:35.760724"
    },
    {
      "id": "vayakhel_p247",
      "text": "ונראה דהנה המהרש\"א ז\"ל כתב לפרש לשון הגמרא שנמנו' וגמרו. שהכונה שמנו את העשין ואת הלאוין וראו שהלאוין יתרין במנינם מן העשין, וא\"כ קרוב האדם להכשל בחטא, ע\"כ נוח לו שלא נברא יותר משנברא. ועפי\"ד נראה לפרש סוף דברי הגמרא ועכשיו שנברא יפשפש במעשיו, והכונה שהרי עזו תשובה מאהבה זדונות נעשין לו כזכיות, וא\"כ אף שהלאוין מרובים מן העשין, מ\"מ ע\"ו תשובה מאהבה שמהפך הזדונות לזכיות נמצא כי הזכיות מרובות, אבל להיפך לא יתכן שיעשו מהמצות עבירות, וכדאיתא בגמרא (קידושין דף מ' ע\"ב) רשב\"י אומר אפי' צדיק גמור כל ימיו ומרד באחרונה איבד את הראשונות ואוקמה ר\"ל בתוהא על הראשונות. הרי דנקט ואיבד את הראשונות, אבל אינם נהפכים לו לחובה. ועל כן קאמר בגמ' ועכשיו שנברא יפשפש במעשיו שיעשה תשובה מאהבה, וא\"כ נמצא כי הזכיות מרובין מן הזדונות, וע\"י כך נוח לו שנברא. ושפיר מקושר סיפא דגמרא עם רישא דנמנו וגמרו, ומיושב גם שאין דברי הגמרא נגד דברי הכתוב וירא אלקים וגו' והנה טוב מאד, שהרי גם מסקנא דגמרא הוא דנוח לו שנברא, ע\"ו שיפשפש במעשיו.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 247,
      "char_length": 909,
      "timestamp": "2025-02-06T19:15:36.138702"
    },
    {
      "id": "vayakhel_p248",
      "text": "אמנם עדיין קשה לדברי הט\"ז ז\"ל איך אנו מברכים ברכות התורה בכל יום והרי מה שנוח לו שלא נברא הוא ע\"י התורה שהלאוין מרובין מן העשין, ואיך שייך לברך ע\"ז. וגם קשה לפי\"ז איך מברכים בכל יום ברכת המחזיר נשמות לפגרים מתים. ונראה דהנה המג\"א תירץ קושיא זו על פי מ\"ש בכתבי האר\"י ז\"ל וכן כתב הרמ\"ק בסידורו כו ברכת שלא עשני גוי לא נתקנה על תחלת בריאת האדם, שהרי לא מצינו שתקנו ברכה על דבר ההוה בתמידות ואינו משתנה, אלא תקנו ברכה זו כי נשמת האדם יוצאת מגופו בכל לילה בשנתו. ואם האדם עובר עברות ביום, אזו ח\"ו נדחית נשמתו למקום טומאה, ומתעברת עמו נשמת גוי, או שמתחלפת נשמתו לגמרי בנשמת גויי ועל כך נתקנה ברכת שלא עשני גוי וכן שלא עשני עבד ושלא עשני אשה בלשון שלילה, להודות לה' שלא נתחלפה נשמתו בנשמת גוי או עבד או אשה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 248,
      "char_length": 700,
      "timestamp": "2025-02-06T19:15:36.560725"
    },
    {
      "id": "vayakhel_p249",
      "text": "אך הרמ\"ק ז\"ל בעצמו הקשה על טעם זה, כי לפי\"ז לא יוכלו לברך ברכה זו רק השרידים אשר ה' קורא, משא\"כ פשוטי העם לא ידעו להבחין אם נתחלפה נשמתם או לא, וא\"כ איך יברכו ברכה זו, ותירץ כי שנו סימנים בדבר להבחין אם עוד נשמתו בו או נתחלפה בנשמת גוי, הסימן האחד כי הדבר ניכר בכונתו בעת אמירת ברכת שלא עשני גוי, לפי שישראל מברך ברכה זו בכוונה אחרת מאשר מברך איש אשר נתחלפה נשמתו בנשמת גוי. וסימן שנו כי ניתן להבחין זאת בהתנהגות האדם ובמעשיו, כי פעמים רואים אדם אשר בפתע פתאום נשתנו מעשיו לגריעותא, זה פרק בא סימן כי נהפכה רוחו בקרבו ורוח אחרת היתה עמו, שנתחלפה נשמתו בנשמת גוי, ובבא עת חליפתו נשתנו מעשיו כמו רגע, עכ\"ד הרמ\"ק ז\"ל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 249,
      "char_length": 614,
      "timestamp": "2025-02-06T19:15:36.903075"
    },
    {
      "id": "vayakhel_p250",
      "text": "אך עדיין לא מצאנו מנוחה בזה כי אין סימנים אלו מספיקים לנו לדעת קושטא דמילתא, כלפי היכן הדבר נוטה, כי הסימן הראשון שנתן הרמ\"ק ז\"ל שהדבר יוכר בכוונת האדם, זה היה סימן מובהק אצל הרמ\"ק ז\"ל, אשר לגודל קדושתו ודע להבחין בעת אמירת הברכה, אם היא בכוונה הראויה, אמנם מה נעביד אנן שאין מכוונים אפילו פירוש המלות, וכדאיתא בשולחן ערוך או\"ח (סי' ק\"א ס\"א) כי מעיקר הדין מי שלא כיוון לבו בג' ברכות ראשונות של תפלת ו\"ח לא יצא ידי חובתו ועליו לחזור ולהתפלל, אלא שכתב הרמ\"א ז\"ל דהאידנא שאין מכוונין אין לחזור ולהתפלל בעבור חסרון כוונה, כי גם בפעם שנית קרוב שלא יכוון ע\"כ. ומה נעני אנן אבתריה בדורות הללו, דכ\"ש דלא שכיחא שמתפללין בכוונה, ומה סימן הוא זה שיבחין בכוונת הברכה הנתחלפה נשמתו אם לא. גם הסימן השני שנתן הרמ\"ק שניתן להבחין זאת במעשה האדם ובהתנהגותול אין בו כדי להבחין בכך בזמנינו, שהרי האדם אינו מבין אפילו על מעשי עצמו, לדעת באיזה בחינה הם, ואיך יוכל להשיג על פי מעשיו אם נתחלפה נשמתו או לא, ותו דאם יבא לפנינו איש אשר בעל עבירה הוא, ועתה בא להתפלל, ונפשו בשאלתו אם עליו לברך ברכת שלא עשני גוי, האם עלינו לפסוק לו כי אין לו לברך ברכה זו, אתמהה, והלא כמו זר נחשב המורה כן.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 250,
      "char_length": 1063,
      "timestamp": "2025-02-06T19:15:37.224601"
    },
    {
      "id": "vayakhel_p251",
      "text": "ונראה ליישב הענין כו ברכת שלא עשני גוי כוללת ב' הכוונות גם יחדו חדא היא ברכת הודאה להשי\"ת על תחלת הבריאה שנולד ישראל, ברם על כוונה זו לחוד לא היו מתקנים ברכה בכל יום, כי הוא דבר ההוה בתמידות ואינו משתנה לעולם, אלא שנכללת בה כוונה נוספת להודות להשי\"ת על שלא החליף בלילה נשמתו בנשמת גוי, כמ\"ש המקובלים, וכדי לכלול בברכה גם כוונה זו תקנוה חכמים בלשון שלילה, כי אם היו מתקנים לברך שעשני ישראל לא היתה במשמע כוונה זו, שהרי על מה שלא נתחלפה נשמתו לא שייך לברך שעשני ישראל, כי לא נעשה עמו דבר, ועליו לשבח ולפאר על שנשאר במעמדו ובמצבו הקדום ולא חל בנשמתו חילוף ותמורה וע\"כ אילו היו מברכים שעשני ישראל היתה כוונת הברכה על תחלת היצירה שנוצר ישראל, ולפיכך תיקנו לאמרו בלשון שלילי שלא עשני גוי, ושפיר נכללת בה גם הכוונה להודות על שעוד בו נשמתו, ולא אבדה ממנו בן לילה ונתחלפה בנשמת גוי.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 251,
      "char_length": 773,
      "timestamp": "2025-02-06T19:15:37.751629"
    },
    {
      "id": "vayakhel_p252",
      "text": "והשתא מיושב מה שהקשו דאיך יתכן להבחין אם נתחלפה הנשמה בלילה. דבאמת יכול לברך ברכה זו גם מי שנתחלפה נשמתו בלילה, ולא הויא ברכה לבטלה, שהרי נכללת בה הודאה על תחלת היצירה שנולד ישראל, ואף שעל כוונה זו לחוד לא היו מתקנים ברכה בכל יום, כי הוא דבר ההוה בתמידות, מ\"מ כיון שנתקנה ברכה זו עבור רוב בני ישראל הכשרים שומרי מצות התורה, להודות להשי\"ת השומר נשמותיהם לבל יתחלפו בנשמות גוים, לא פלוג רבנן בתקנתייהו, וצריך לברך ברכה זו כל אדם מישראל, ואף אם ח\"ו נתחלפה נשמתו. ומצינו כיוצא בזה בברכת שעשה לי כל צרכי שנתקנה להודות להשי\"ת על נעילת הסנדל, ועל כן ביוהכ\"פ ובת\"ב שאסורין בנעילת הסנדל אין לברך ברכה זו, ואעפי\"כ מברך ברכה זו גם אבל, ואף שהוא אסור בנעילת הסנדל, מ\"מ כיון שכללות העולם הולכים במנעלים, מודה להשי\"ת על הטובה שהשפיע לעולם, ואף שמטבע הברכה שעשה ולי כל צרכי דמשמע דעליה קאי, מ\"מ יכול לברכה, וא\"כ ק\"ו בברכת שלא עשני גוו שנכללת בה גם הכונה להודות על תחלת הבריאה שנולד ישראל, ודאי שיכול לברך אף מי שנתחלפה נשמתו, כי עדיין דין ישראל עליו מחמת שנולד ישראל וחייב הוא בתורה ובמצות, ועדיין בכחו לתקן הכל. ועוד שהרי ביו\"ט שנו של גליות מברכינן כל הברכות כמו ביו\"ט ראשון, אף שעיקרו נתקן רק משום ספיקא. ובודאי חד מינייהו חול הוא, ואין שייכים בו ברכות אלו, וכ\"ש בזה\"ז דידעינן בקביעא דירחא, אעפי\"כ עבדינן תרי יומי משום דשלחו מתם הזהרו במנהג אבותיכם בידכם (ביצה דף ד' ע\"ב) וכו'. הרי שאך משום התקנה עבדינן יו\"ט שני ומברכינן כל הברכות, וכ\"ש בברכת שלא עשני גוי שיש בה כונה על תחלת הבריאה שנולד ישראל, אף שעיקרו נתקן להודות להשי\"ת שלא החליף נשמתו בנשמת גוו, מ\"מ על סמך התקנה יכול לברך אף מי שאינו יודע ההימיר נשמתו בנשמת גוי או לא.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 252,
      "char_length": 1513,
      "timestamp": "2025-02-06T19:15:38.121410"
    },
    {
      "id": "vayakhel_p253",
      "text": "ועתה נבא לביאור המדרש הנ\"ל עפ\"י מ\"ש לעיל בשם חכמי האמת כי ברכת שלא עשני גוי נתקנה להודות להשי\"ת על אשר שמר נפשו שלא תתחלף בלילה בנשמת גוו, ועפי\"ז פסק המג\"א להלכה שגם גר יכול לברך ברכה זו אף שלא נולד ישראל. והנה לכאורה הוא קשה ההבנה איך תתחלף נשמת ישראל בנשמת גוי על ידי הס\"א, והרי הקב\"ה הוא אדון כל הנשמות אשר בידו נפש כל חי ורוח כל בשר איש, והוא אשר גזר על הנשמה שתכנס בגוף פלוני, ומי הוא אשר יוכל לשנות ח\"ו מעשי היוצר. ועל כרחך לומר כי בא לו זאת בתורת עונש מהשי\"ת הדן מדה כנגד מדה, ותחת אשר בחרה נפשו להתחבר עם עושי רשעה המסיתים ומדיחום אותו מדרכי השי\"ת, יבא על ענשו אשר ינתן לו מן השמים שותף פנימי דהיינו שתתחלף נשמתו בנשמת גוי, או שתתעבר עמו נשמת גוי ויסיתו אותו לרע, כי כך הוא מדתו יתברך לדון בכל הענינים מדה כנגד מדה כמבואר בסה\"ק בנו יששכר (מאמרי חודש סיון מאמר ב') כי בני ישראל המתנהגים בדרך התורה מדה כנגד מדה גם הקב\"ה מתנהג עמהם על פו משפטי התורה ונושא כובש ומעביר עונותיהם כמשפט התורה דאזלינן בתר רובא, ע\"כ.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 253,
      "char_length": 917,
      "timestamp": "2025-02-06T19:15:38.825367"
    },
    {
      "id": "vayakhel_p254",
      "text": "אמנם מי שאינו מתנהג בדרך התורה כ\"א על פי חוקי עכו\"ם מתנהגין עמו מן השמים במדה כנגד מדה, ואין דנין אותו עפ\"י משפטי התורה, ועל כן ענשו של המתחבר עם הרשעים הוא מדה כנגד מדה שמתחלפת נשמתו בנשמת גוי, כו המתחבר לרשעים אעפ\"י שאינו עושה כמעשיהם מקבל פורעניות כיוצא בהם (אדר\"נ פ\"ל ג) ועי' באה\"ח הקדוש פ' ראה עה\"פ אחרי ה' אלקיכם תלכו שכ' וז\"ל ואומרו ובו תדבקון וכו' וכאן צוה שלא ידבק אלא בקרובי ה' וקדושיו ולשלול בא שלא ידבק בקרובי ע\"ז ואם בא נביא ואמר במאמר ה' לעשות כן יומת הנביא ההוא, עכ\"ל הק'. הרי כי נביא המצוה להתחבר עם עוע\"ז ולהשתתף עמהם דינו ממש כמצוה לעבוד ע\"ז.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 254,
      "char_length": 560,
      "timestamp": "2025-02-06T19:15:39.267406"
    },
    {
      "id": "vayakhel_p255",
      "text": "והנה דבר זה שאסור להתחבר עם הרשעים נצטוינו במ\"ע אנכי ה' אלקיך, וכמו שביארנו לעיל כוונת הישמח משה ז\"ל שכ' לישב דעת הרמב\"ם המונה אנכי ולא יהי' לך בין התרי\"ג מצות, והקשו היאך שייך לצוות על אמונה, וע\"כ לומר כו האמונה מושרשת בטבע בלב ישראל, והציווו הוא שלא לעשות פעולות להסיר האמונה מלבו ע\"ו התחברות עם פועלי און המסיתים ומדיחים את האדם ומסירים לבו מאחרי ה'. וזה כונת המדרש בשעה ששמע משה אנכי ה) אלקיך, וע\"כ לומר שהציווי הוא שלא להתחבר עם עוברי עבירה, שהרי על אמונה אין שייך לצוות. פתח ואמר ברוך שלא עשני גוו ולא אמר שעשני ישראל, וכוונת ברכה זו להודות לה' על שלא הוחלפה נשמתו בנשמת גוי, שהוא עונש מדה כנגד מדה על אשר עבר על אזהרת אנכי ה' אלקיך, והלך והתחבר עם זדים ועוברי עברה, ועל כן נתקנה ברכת שלא עשני גוי בלשון שלילה, כי אם היו מברכין שעשני ישראל לא היתה במשמע כוונה זאת, כי אפ\"ל דקאי על תחלת הבריאה שנולד ישראל.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 255,
      "char_length": 811,
      "timestamp": "2025-02-06T19:15:39.548118"
    },
    {
      "id": "vayakhel_p256",
      "text": "ועפ\"י האמור נבא ליישב הדקדוקים בפרשה בהקדם דברי הגמ' (הוריות דף ח' ע\"א) דיליף מקראי שאין ב\"ד חייבין קרבן בהעלם דבר בע\"ז עד שיורו על דבר שזדונו כרת ושגגתו חטאת וקאמר שם מאי משמע דהני קראי בעבודה זרה כתיבי וכו' דבי רבי תנא אמר קרא (במדבר ט\"ו) אשר דבר ה' אל משה וכתיב (שם) אשר צוה ה' אליכם ביד משה איזו הוא מצוה שהיא בדבורו של הקב\"ה וצוה ע\"ו משה הוו אומר זו ע\"א דתנא ר' ישמעאל אנכי ולא יהי' לך מפי הגבורה שמענום (ופירש\"י ז\"ל ד\"ה כל אשר צוה ה' אליכם ביד משה. דמשמע שצוה על ודי משה וכתיב אשר דבר ה' דמשמע שהוא בדבורו של הקב\"ה כלומר ששמעו ישראל מפיו כשדבר עם משה. איזוהי מצוה שהיא בדבור של הקב\"ה וגו', דאנכי ולא יהיה לך מפי הגבורה שמענום דהיינו ששמע בדבורו של הקב\"ה וצוה ע\"ו משה בכמה פרשיות שבתורה כגון לא תשתחוה לאל אחר דלא שמענו אלא בדבורו של משה עכ\"ל).",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 256,
      "char_length": 749,
      "timestamp": "2025-02-06T19:15:39.952127"
    },
    {
      "id": "vayakhel_p257",
      "text": "ועפי\"ז י\"ל כי מאמר אלה הדברים אשר צוה ה' וגו' האמור בפ' ויקהל נכללים בה דברי ה\"נ דהיינו ששמעו ישראל מפי הקב\"ה כשדבר אל משה, והוא צווי אנכי ולא יהיה לך, ומדכתיב מאשר צוה\" משמע שצוה ע\"י משה ולא שמעו ישראל מפי הקב\"ה והיינו שאר הציוויים של ע\"ז, והכונה כו אחר חטא העגל רצה משה להפרידם מן הערב רב כדאיתא בזוה\"ק ויקהל משה, מאן אתר כניש לון אלא בגין דהוו אינון ערב רב בינייהו איצטריך משה לאכנשא לון וליחדא לון מבינייהו. עכ\"ל. ע\"כ הורה להם חומר הענין של התחברות לרשעים כי הוא בכלל מצות אנכי ה' אלקיך, וזהו אומרו אלה הדברים אשר צוה ה' לעשות אותם, כונתו על מצות אנכי ולא יהיה לך, שהרי על אמונה און שייך לצוות, וע\"כ לומר שבאה המצוה שלא לעשות פעולות להסיר האמונה מלבם והיינו שלא להתחבר עם הרשעים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 257,
      "char_length": 683,
      "timestamp": "2025-02-06T19:15:40.376517"
    },
    {
      "id": "vayakhel_p258",
      "text": "ששת ימים תעשה מלאכה וביום השביעי יהיה לכם קודש וגו'. פירש\"י ז\"ל הקדים להם אזהרת שבת לציווי מלאכת המשכן לומר שאינו דוחה את השבת. הקשה הרא\"ם ז\"ל למה איצטריך קרא שאין מלאכת המשכן דוחה שבת, והלא פשיטא הוא כיון דמשכן הוא עשה ושבת עשה ול\"ת אין עשה דוחה ל\"ת ועשה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 258,
      "char_length": 256,
      "timestamp": "2025-02-06T19:15:40.754424"
    },
    {
      "id": "vayakhel_p259",
      "text": "ב) קשה מדוע הסמיך הכתוב אזהרת שבת למצות הבאת הנדבה לצורך המשכן האמורה אחריו דכתיב קחו מאתכם תרומה לד', והרי מקום יש לטעות כו הא דאין המשכן דוחה שבת היינו דוקא הבאת הנדבה למשכן שהוא כמכשירי מצוה, אבל בנין המשכן גופיה מנא לן שאינו דוחה שבת, והוה ליה להסמיך אזהרת שבת להלן בפרשה סמוך לציווי הקמת המשכן, להורות שאף בנין המשכן אינו דוחה שבת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 259,
      "char_length": 336,
      "timestamp": "2025-02-06T19:15:40.895481"
    },
    {
      "id": "vayakhel_p260",
      "text": "ג) ותו קשה למה הוצרך הכתוב להקדים אזהרת שבת למשכן, לומר שאינו דוחה שבת, והרי כתיב להלן בפרשה ויצו משה ויעבירו קול במחנה וגו' אל יעשו עוד מלאכה לתרומת הקדש ויכלא העם מהביא, וילפינן מיניה (שבת צ\"ו ע\"ב) איסור הוצאה בשבת עיי\"ש. ומיניה ידעינן שאין המשכן דוחה שבת, שהרי נאסר להם להוציא מרה\"י לרשות הרבים להביא נדבתם למשכן. ולמה לי קרא דששת ימים תעשה מלאכה וגו'.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 260,
      "char_length": 355,
      "timestamp": "2025-02-06T19:15:41.075411"
    },
    {
      "id": "vayakhel_p261",
      "text": "ד) קחו מאתכם תרומה לה' וגו' בזוה\"ק רי\"פ ויקהל איתא מעיקרא כתיב מאת כל איש אשר ידבנו לבו וגו' לרבות הערב רב לנדבת המשכן לבתר וכו' ואתו אינון ערב רב ועבדו ית עגלא וכו' אמר קב\"ה מכאן ולהלאה עובדא דמשכנא לא יהא אלא מישראל בלחודייהו מיד ויקהל משה וגו' וכתיב בתריה קחו מאתכם תרומה לה' מאתכם ולא כקדמייתא דכתיב מאת כל איש אשר ידבנו לבו ויקהל משה וגו' בגין דהוו אינון ערב רב בינייהו איצטריך משה לאכנשא לון וליחדא לון מבינייהו, עכ\"ד הזה\"ק. וצ\"ב שהרי לדברי הזה\"ק כונת הכתוב להשמיענו שהפרידן מן הע\"ר, וצוה להם קחו מאתכם וגו' ולא מן הע\"ר, וא\"כ הול\"ל ויקהל משה סמוך למאמר קחו מאתכם תרומה לה', ולמה הפסיק ביניהם באזהרת שבת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 261,
      "char_length": 609,
      "timestamp": "2025-02-06T19:15:41.264566"
    },
    {
      "id": "vayakhel_p262",
      "text": "ונראה דהנה עפ\"י דברי הזה\"ק הנ\"ל שנאסר להם לקחת ממון לבנין המשכן מן הערב רב, יש לומר דבר חדש, כי כשם שצוה להם משה לבל יקחו נדבה מן הערב רב לבנין המשכן על אשר עבדו ע\"ז בעשותם את העגל, ה\"נ צוה להם לבל יקחו ממון לצורך המשכן ממחללי שבתות, והטעם כמו שכתבו הספה\"ק והאריך בזה בסה\"ק אגרא דכלה פ' שופטים כי און ליהנות מממון שמקורו מאנשים שאינם כשרים משום שכח הפועל בנפעל והממון הבא ממקור רע עושה רושם רע בנפש המקבלו, ע\"כ. וא\"כ ק\"ו בן בנו של ק\"ו שאין לבנות את המשכן שהוא מקום להשראת השכינה מממון הבא ממקור לא טהור, כי המשכן הוא המקום אשר דרכו באו כל ההשפעות הטובות לישראל, וממון שאינו כשר יכול לקלקל צנורי השפע.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 262,
      "char_length": 600,
      "timestamp": "2025-02-06T19:15:41.560996"
    },
    {
      "id": "vayakhel_p263",
      "text": "ועפי\"ז י\"ל דברי רש\"י ז\"ל הקדים אזהרת שבת לומר שאין מלאכת המשכן דוחה שבת, פירוש שלא יחשבו לקחת ממון ממחללי שבת לצורך מלאכת המשכן, ע\"כ הקדים להם אזהרת שבת, להזהירם כו חמירא שבת, ואין לקחת ממון ממחלל שבת לצורך המשכן. וא\"ש מה דכתיב ויקהל משה קודם אזהרת שבת, ועי' קושיא ד') כי הקהילם משה והפרידם ממחללי שבת, כשם שהפרידן מן הערב רב שעשו את העגל. ומיושבים נמי שאר הקושיות ועי' קושיא ב' ג') כו על כן נסמכה אזהרת שבת למאמר קחו מאתכם להורות שלא יקחו נדבה ממחללי שבתות. ומה שהקפידה תורה על עובדי ע\"ז ומחללי שבתות דוקא, לבל יהיה להם חלק במשכן, ולא מצינו שהקפידה על ממון שאר בעלי עבירות, מצינו דוגמתו גבי קרבנות כדאיתא במס' חולין (דף ה' ע\"א) אדם כי יקריב מכם וגו' (ויקרא א') מכם ולא כלכם וכו' מכאן אמרו מקבלין קרבנות מפושעי ישראל כדי שיחזרו בהן בתשובה חוץ מן המומר לנסך את היין ולחלל שבתות בפרהסיא, ע\"כ. הרי כו אף לענין קרבן הקפידה תורה על ע\"ז וחילול שבת דייקא.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 263,
      "char_length": 848,
      "timestamp": "2025-02-06T19:15:41.863811"
    },
    {
      "id": "vayakhel_p264",
      "text": "וזה אפ\"ל בכונת רש\"י ז\"ל בפ' תשא עה\"פ ואתה דבר אל בני ישראל אך את שבתותי תשמורו. ופירש\"י ואתה אעפ\"י שהפקדתיך לצוותם על מלאכת המשכן אל וקל בעיניך לדחות את השבת מפני אותה מלאכה. אך את שבתותי וכו' כל אכין ורקין מיעועין למעט שבת ממלאכת המשכן ע\"כ. ויל\"ד למה נקט רש\"י בלשונו אל וקל בעיניך. שהרי אף אם היתה מלאכת המשכן דוחה שבת, אין זה כקולא וזלזול לגבי שבת, שהרי מצינו כמה דברים שהשבת נדחית מפניהם. ותו יל\"ד דדרשינן אך למיעוט, והרי כתיב את שבתותי ואת' רבוייא הוא, ומה מרבינן מיניה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 264,
      "char_length": 474,
      "timestamp": "2025-02-06T19:15:42.284614"
    },
    {
      "id": "vayakhel_p265",
      "text": "ועפ\"י דברינו י\"ל בכונת רש\"י ז\"ל שאל יקל בעיניך לדחות שבת מפני אותה מלאכה, דהיינו שתרצה לקחת ממון לנדבת המשכן ממחללי שבתות, מפני שתבא לדמות מחללי שבת לשאר בעלי עבירות שלא נאסר לקחת מהם לצורך המשכן, דשאני שבת החמורה ואל וקל בעיניך לדמותה לשאר עבירות וכשם שאסור ליקח מעוע\"ז לצורך המשכן, כך נאסר לקחת ממחללי שבתות. ועפי\"ז י\"ל ריבויא דאאת\" שבתותי, כי הבעוחה התורה את ישראל לבל יחושו, ומורא לא יעלה על ראשם, שאם לא יקחו ממון ממחללי שבת לא יהיה בידם ממון די הצורך לבנין המשכן, כי אדרבה ע\"י שלא יקחו מהם ויבנה המשכן רק מממון כשר, יבא ריבוי בכל הענינים, כי תכנס ברכה בנדבתם, ויהיה די לכל המלאכה, וע\"י שיבנה המשכן ממקור טהור, יהיה ראוי להשראת השכינה, ולהשפיע השפעות טובות לישראל, וז\"כ הכ' אך לשון מיעוט שלא יקחו לצורך המשכן ממחללו שבתות, ועי\"כ את וגו' יהיה רבוי ממון כו תכנס בו ברכה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 265,
      "char_length": 773,
      "timestamp": "2025-02-06T19:15:42.534601"
    },
    {
      "id": "vayakhel_p266",
      "text": "בסעודת ברית מילה ששת ימים תעשה מלאכה וביום השביעי יהיה לכם קדש וגו'. פירש\"י ז\"ל הקדים להם אזהרת שבת לציווי מלאכת המשכן לומר שאינו דוחה את השבת. הקשה הרא\"ם ז\"ל למה לו מיעוטא שאין מלאכת המשכן דוחה שבת, והלא פשיטא הוא כיון שבנין המשכן הוא עשה ושבת עשה ול\"ת אין עשה דוחה ל\"ת ועשה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 266,
      "char_length": 276,
      "timestamp": "2025-02-06T19:15:42.936169"
    },
    {
      "id": "vayakhel_p267",
      "text": "ב) והאלשיך הקדוש הקשה להיפוך, מדוע אין בנין המשכן דוחה שבת, למה יגרע מתמידין ומוספין הדוחים שבת, כ\"ש הקמת המשכן שהוא הגורם המכשיר את הקרבתם אינו דון שידחה שבת, ע\"כ. ואם תמצא לומר דשאני תמידין ומוספין, שהם חובות שקבוע להם זמן, ע\"כ דוחין שבת, משא\"כ מלאכת המשכן שאין קבוע לו זמן. אינו בדין שידחה שבת, א\"כ הדרא קושית הרא\"ם לדוכתא, דפשיטא היא שאינו דוחה את השבת, כיון שאתה מחשבו כחוב שאין קבוע לו זמן.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 267,
      "char_length": 396,
      "timestamp": "2025-02-06T19:15:43.100795"
    },
    {
      "id": "vayakhel_p268",
      "text": "ונראה בהקדם לפרש דברי המדרש ילקוט פ' תשא עה\"פ (שמות ל\"א) ושמרו בני ישראל את השבת לעשות את השבת וגו' ברית עולם ר\"א אומר דבר שהברית כרותה לו ואיזו זו מילה. והוא פלאי לכאורה. עוד איתא במדרש (הביאו האוה\"ח הק' פ' שמיני) ויאמר משה זה הדבר וגו' תעשו וירא אליכם כבוד ה' (ויקרא ע) זה הדבר זו מילה כדכתיב (יהושע ה') וזה הדבר אשר מל יהושע וכתב האהחה\"ק שדברי המדרש סתומים וחתומים, דכו באותו יום מל אותם משה או באותו יום צוה על המילה, עיי\"ש.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 268,
      "char_length": 428,
      "timestamp": "2025-02-06T19:15:43.310905"
    },
    {
      "id": "vayakhel_p269",
      "text": "ונראה לומר דהנה איתא בגמ' (יבמות ע\"ב ע\"א) כל אותן מ' שנה שהיו ישראל במדבר לא מלו מ\"ט משום דלא נשיב להו רוח צפונית וכו' משום דנזופים היו. ופירש\"י ז\"ל נזופים היו ממעשה העגל. והתוס' כתבו אומר רבינו יצחק דנזופים הוו ממעשה מרגלים ולא כמו שפי' בקונטרס ממעשה העגל שהרי מחל להם הקב\"ה ואמר להם סלחתי שאח\"כ נעשה משכן והשרה שכינתו ביניהם, עכ\"ל. נמצא לפי דברי התוס' כי מזמן שהוקם המשכן עד שילוח המרגלים לא היו ישראל נזופים. ונשבה להם רוח צפונית, והא דקאמר בגמ' כל מ' שנה וכו' לא נשבה להם רוח צפונית, לאו דוקא כל מ' שנה, אלא לפי שזמן קצר הי' מיום הקמת המשכן בר\"ח ניסן עד כ\"ט סיון שנשלחו המרגלים ע\"כ קאמר כל מ' שנה. ובזה יתפרש המדרש הנ\"ל זה הדבר תעשו זו מילה על נכון. כי ביום הקמת המשכן הרי נתכפר להם על מעשה העגל, וחזרה לנשוב להם רוח צפונית, ע\"כ הזהירם משה זה הדבר וגו' תעשו, זו מילה, שחייבים אתם מעכשיו במצות מילה, כו עד אותה שעה נזופים היו ולא מלו בניהם.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 269,
      "char_length": 843,
      "timestamp": "2025-02-06T19:15:43.545486"
    },
    {
      "id": "vayakhel_p270",
      "text": "והנה אמרו חז\"ל (שבת קי\"ח ע\"ב) כל המשמר שבת כהלכתו אפילו עובד ע\"ז כדור אנוש מוחלין לו וגו' אר\"י א\"ר אלמלי שמרו ישראל שבת ראשונה לא שלטה בהן אומה ולשון וכו' אר\"י ארשב\"י אלמלי משמרין ישראל שנו שבתות כהלכתן מיד נגאלין וכו'. ע\"כ. נמצינו למדים כמה גדול כח שמירת שבת למחילת עון ולכפרת פשע.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 270,
      "char_length": 282,
      "timestamp": "2025-02-06T19:15:43.963218"
    },
    {
      "id": "vayakhel_p271",
      "text": "וזה אפ\"ל בכוונת המדרש ושמרו בנו ישראל את השבת זו מילה, כי אם היו ישראל משמרין שבת כהלכתה, מיד היה נמחל להם על מעשה העגל, ושוב לא יהיו נזופים ותחזור רוח צפונית לנשב להם, ויוכלו לקיים מצות מילה, וז\"פ המדרש שע\"י שמירת שבת כהלכתה יזכו לקיים מצות מילה שנמנעה מהם ע\"ו מעשה העגל, אמנם כיון שלא זכו לשמור שבת אחת כהלכתה, לא נמחל לה על מעשה העגל עד הקמת המשכן.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 271,
      "char_length": 351,
      "timestamp": "2025-02-06T19:15:44.127425"
    },
    {
      "id": "vayakhel_p272",
      "text": "והשתא שפיר מיושבת גם קושית הרא\"ם ז\"ל דמאי צריך מיעוט שאין מלאכת המשכן דוחה שבת, והרי פשיטא הוא שאין עשה דוחה ל\"ת, וי\"ל כי לולא מיעטה תורה שאין מלאכת המשכן דוחה שבת, הו\"א כי כשם שמילה דוחה שבת, כך תהא מלאכת המשכן דוחה שבת כסברת האלשיך הנ\"ל, שהרי הקמת המשכן הוא הגורם המביא לידי קיום מצות מילה, שע\"י הקמתו מחל הקב\"ה על מעשה העגל, וחזרה רוח צפונית לנשב, והיה בידם למול בניהם, ומצות מילה היו ישראל מצווים ועומדים עליה קודם לכן. על כן סמכה תורה אזהרת שבת להקמת המשכן להודיענו שאין בנין המשכן דוחה שבת. והטעם כי שמירת שבת כהלכתה נמי כפרה גדולה היא על מעשה העגל וא\"כ און בדין שתדחה הקמת המשכן את השבת בשל קיום מצות מילה, שהרי גם בזכות שמירת שבת כהלכתה בידם להגיע לקיום מצות מילה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 272,
      "char_length": 672,
      "timestamp": "2025-02-06T19:15:44.319062"
    },
    {
      "id": "vayakhel_p273",
      "text": "במסיבה להחזקת הישיבה והמלאכה היתה דום לכל המלאכה לעשות אותה והותר. איתא במדרש תנחומא ופ' תרומה ד) א\"ר יוחנן ראה מה כתיב והם הביאו אליו עוד נדבה בבקר בבקר וכו' לשני בקרים הביאו את כל נדבות המשכן שנשתלחה ברכה בנדבותם וכו'. עכ\"ל. וקשה שהרי לא עביד קב\"ה ניסא למגנא, וא\"כ על מה עשה השי\"ת ככה שתכנס ברכה בנדבותם ויותירו, וסגי אם נשתלחה הברכה בנדבותם שיהיה דים.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 273,
      "char_length": 354,
      "timestamp": "2025-02-06T19:15:44.635904"
    },
    {
      "id": "vayakhel_p274",
      "text": "ונראה בהקדם מה דאיתא במדרש ולקוט ריש פ' פקודי א\"ר יוחנן לשני בקרים הביאו כל המשכן והותירו אמר משה לפני הקב\"ה רבש\"ע עשינו כל המלאכות של המשכן והותרנו שנא' והמלאכה היתה דים וגו' מה נעשה בנותר אמר ליה לך ועשה מהם משכן לדברות וכו', וכ' היפה תואר דהיינו בהמ\"ד ללמוד תורה עכ\"ל. ואפ\"ל כו טעם שהוצרך להקים ביהמ\"ד ללמוד תורה מיד עם הקמת המשכן. כי המשכן היה מקום מוכן להשראת השכינה, וכדי שיהיו ישראל ראוין להשראת השכינה צריכין הם להכנה גדולה, והראש וראשון הוא לימוד התורה, כי התורה מלמדת את האדם לשמור מצות השי\"ת, ולעבוד את השי\"ת בכל לבבו וע\"י כך יוכל לזכות להשראת השכינה ובלא לימוד התורה לא ידע איך לעבוד את השי\"ת, וכדי שתתקיים השראת השכינה בקרב ישראל, חייבים לגדל את הבנים לת\"ת, ולהעמיד דורות קדושים, שיהיו ראוים להשראת השכינה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 274,
      "char_length": 719,
      "timestamp": "2025-02-06T19:15:44.826691"
    },
    {
      "id": "vayakhel_p275",
      "text": "היוצא מזה כי כל זמן שלא היה מקום מוכן לת\"ת לא נשלמה מלאכת המשכן. שהרי מבלעדי המשכן לדברות שהוא המקום ללימוד התורה לא שרתה השכינה על המשכן. נמצא כי ע\"י שהקימו את המשכן לדברות מן הנותר, נגמרה מלאכת המשכן. ושפיר מיושבת קושית האוה\"ח הקדוש כי באמת למשכן היה דים רק ע\"י קוהותר\", ולא סתרי להדדי, כי גמר מלאכת המשכן תלוי במשכן לדברות, ואם לא היה נותר לעשות משכן לדברות, לא הוה דים למשכן. וגם מיושב מה שהקשינו וכי עביד קב\"ה ניסא למגנא שיוותר, כי אמנם היה הכרח שיוותר, כדי לבנות מקו לת\"ת, ויתכן שזו היתה שאלת משרע\"ה מה נעשה בנותר, כי ידע אשר לא עביד קב\"ה נס על חנם ובודאי חייבים הם עדיין לעשות איזה דבר. והשיב הקב\"ה לך ועשה מהם משכן לדברות, כי חסר עדיין להשלמת המשכן, וכדי שיהיה ראוי להשראת השכינה חייבים אתם לבנות משכן לדברות. ובזה פרשנו ג\"כ הכ' בפ' שמיני ויאמר משה זה הדבר אשר צוה ה' תעשו וירא אליכם כבוד ה'. וצ\"ב על מה קאי חזה הדברא, אם על הקרבנות הכתובים לפני כן, הרי כבר נאמר ויקחו כל אשר צוה משה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 275,
      "char_length": 892,
      "timestamp": "2025-02-06T19:15:45.154712"
    },
    {
      "id": "vayakhel_p276",
      "text": "ולדרכנו אפ\"ל כי אחר שהקריבו כל הקרבנות לחנוכת המשכן. נגמרה מלאכת המשכן, אמנם עדיין לא שרתה שכינה, עד שיקומו את המשכן לתלמוד תורה, כי תשב\"ר הם הגורמים להשראת השכינה בון בביהמ\"ק בין בהיותנו בגולה. וכדאי' במדרש איכה רבתי (פ\"א לג) א\"ר יהודה בא וראה כמה חביבין תינוקות לפני הקב\"ה גלתה סנהדרין ולא גלתה שכינה עמהם גלו משמרות ולא גלתה שכינה עמהם וכיון שגלו תינוקות גלתה שכינה עמהם הה\"ד עולליה הלכו שבי לפני צר מיד ויצא מבת ציון כל הדרה, ע\"כ. ולפיכך צוה להם משה זה הדבר אשר צוה ה' תעשו, היינו הקמת תלמוד תורה, שצוה ה' לעשות מהכסף שנותר מנדבות המשכן, וע\"י כך וירא אליכם כבוד ה', כי רק באופן זה יכולים אתם לזכות להשראת השכינה. והנה אנחנו בגולה ואין לנו מקדש מקום להשראת השכינה כמו שהיה מקדם, ונותר לנו רק המקדש מעט שאנחנו יכולים להקהל ולהתפלל בו ביחד ואם המשכן לא נחשב כלום עד אשר הקימו תלמוד תורה, ק\"ו שביהמ\"ד בלי ת\"ת ובלי תשב\"ר אי אפשר, כי התינוקות של בית רבן הם המביאים השראת השכינה.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 276,
      "char_length": 876,
      "timestamp": "2025-02-06T19:15:45.620908"
    },
    {
      "id": "vayakhel_p277",
      "text": "ומרגלא בפי תמיד כי זה גרם לירידה הגדולה במדינה זו, דאף שהיו כאן יראים ושלמים אבל לא דאגו כלל לחנך בניהם לתלמוד תורה. ואנו צריכים לעבוד בכל כוחותינו להחזיק שלשלת מסורת אבותנו הקדושים, ודבר זה א\"א כ\"א ע\"ו חינוך תשב\"ר, ולא בחנם נצלנו מגיא ההרגה ונשלחנו לכאן, רק למען שליחות זו. וחלילה לא יהיה כאן הלאה מה שהיה עד עתה, והכרח גדול עלינו להחזיק את החנוך שלנו, כו בעזהשי\"ת נתרבה גבולינו בתלמידים ובכל יום מוסיף והולך כן ירבה וכן יפרוץ, ואנו מצפים שבעזהשי\"ת במשך הזמן יתרבה לשם ולתפארת, ואפשר שיצא מזה טובה לכל המדינה, כי אם נהיה מסודרים בשלימות ונעמיד דור יראים ושלמים, ממנו יראו וילמדו אחרים לעשות כמונו, ותהיה מזה השפעה רבה לכל המדינה. ואפשר שרק בשביל זה שלחו אותנו למדינה זו, ועכ\"פ לעצמנו ליכא דרך אחרת, וצריכין להתעמל בעמל רב להחזיק החינוך שלנו בכוחות עצמנו, וכל הטורח והעול מוטל עלינו ואין עלינו לצפות לסיוע מן החוץ, כי דרכנו שנאוי בתכלית בעיניהם, ע\"כ צריכין אנחנו לעשות כל מה שבכוחינו, ולהתאמץ בהחזקה ולנסות הכל ואז נצליח בעזהשי\"ת.",
      "source_file": "Vayakhel.txt",
      "chumash": "שמות",
      "parsha": "vayakhel",
      "paragraph_index": 277,
      "char_length": 930,
      "timestamp": "2025-02-06T19:15:46.040899"
    }
  ],
  "shape": [
    278,
    768
  ],
  "created_at": "2025-02-06T19:15:46.482195"
}