{
  "paragraphs": [
    {
      "id": "tetzaveh_p0",
      "text": "במדרש תנחומא ריש הסדר עה\"כ ואתה תצוה, ילמדנו רבינו קטן לכמה נימול, כך שנו רבותינו קטן נימול לשמונה, מה טעם כשם שנימול יצחק אבינו, והוא תמוה מה שייכות הלכה זו לואתה תצוה, גם מה זו שאלה ולמה הוצרך לומר כשם שנימול יצחק הלא זול קרי בי' רב הוא דכתיב ביום השמיני ימול והרבה נדחקו בזה המפורשים.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 0,
      "char_length": 287,
      "timestamp": "2025-02-06T19:31:23.961013"
    },
    {
      "id": "tetzaveh_p1",
      "text": "ונראה לפרש דהנה נתקשו המפורשים מה ענין מצוה זו של הדלקת נרות לכאן כי עיקר מקומה אחר עשיית המשכן והנחת המנורה ומהר\"י אברבנאל פי' כי עיקר מצוה זו בפ' אמור וכאן נאמר תצוה, ר\"ל אתה עתיד לצוות את בני ישראל והקשה עליו בכלי יקר דלדבריו כל פסוק זה מיותר כו מה הגיד לנו בזה שסופו לצוות ועיי\"ש מה שהאריך לתרץ. אמנם באמת לפי המבואר בילקוט פרשה זו וז\"ל, ואתה תצוה למדנו שהציווי מיד בשעת מעשה, לדורות מנין, ת\"ל צו את בני ישראל ויקחו אליך שמן וגו' הא למדנו שהציווי מיד ולדורות, מציווי הזה למדנו לכל הצוואות שבתורה, ופי' שם בזית רענן מרבינו המג\"א ז\"ל דמדחזר שני פעמים מצוה זו כאן בפ' תצוה ובפ' אמור, קמ\"ל שינהוג גם לדורות ומציווי זה למדנו לכולם ור\"י ס\"ל דילפינן מדכתיב מן היום אשר צוה ה' והלאה לדורותיכם כדאיתא בקידושין ד' כ\"ט עכ\"ל, נמצא דלדעת המדרש לק\"מ קושית המפורשים שאין שום יתור בקרא דואתה תצוה שהוצרך לכפלו שמזה למדין על כהת\"כ שלשון ציווי הוא לדורות ואך לדעת ר\"י שלמד זה מקרא אחרינא קשה קושית המפורשים והוצרכו לתירוצים שונים.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 1,
      "char_length": 916,
      "timestamp": "2025-02-06T19:31:24.138463"
    },
    {
      "id": "tetzaveh_p2",
      "text": "והנה מבואר בגמ' שבת (דף קל\"ב ע\"א) גבי מילה דוחה שבת ראב\"י אמר אמר קרא שמיני אפילו בשבת הא שמיני מיבעי לי' למעוטי שביעי, שביעי מבן שמונת ימים נפקא ואכתי מיבעי לי' חד למעוטי שביעי וחד למעוטי תשיעי דאי מחד הו' אמינא שביעי היא דלא דלא מטא זמני' אבל משמיני ואילך זמני' הוא יעיי\"ש, ומבואר בגמ' זו דלא סגי בקרא דביום השמיני ללמד שקטן נימול לשמונה דוקא דמחד קרא אפשר לומר שלא בא אלא למעט שביעי אבל אח\"כ יכול למול בכל יום שירצה אלא כיון דכתיב גם קרא דבן שמונת ימים ימול שמעינן דמילה בזמנה אינו אלא בשמיני.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 2,
      "char_length": 496,
      "timestamp": "2025-02-06T19:31:24.577102"
    },
    {
      "id": "tetzaveh_p3",
      "text": "ומבואר בגמ' קידושין (דף כ\"ט) עה\"כ דוימל אברהם את יצחק בן שמונת ימים כאשר צוה אותו וגו' אשכחן מיד, לדורות מנלן תדבר\"ו כל מקום שנאמר צו אינו אלא זירוז מיד ולדורות, ומבואר במדרש ילקוט עה\"כ דכאשר צוה והיכן צוה ובן שמונת ימים ימול, נמצא לפי\"ז דגם מהקרא דבן שמונת ימים ימול לא הוי ידעינן למעט תשיעי דאפשר לא נאמר קרא זה אלא לאברהם וצריך עוד קרא לדורות, אך יען דכתיב ביצחק שנימול לשמונה כאשר צוה אותו אלקים ויש לימוד דכ\"מ שנא' ציווי היא לדורות, א\"כ קרא דבן שמונת ימים ימול קאי גם על לדורות כיון דעלה קאי הך דכאשר צוה כמבואר בילקוט ונמצא שוש לנו שני קראי גם על לדורות ושפיר שמעינן למעט גם תשיעי, אלא שמיני דוקא. וכבר הבאתי דלדעת המדרש און לנו לימוד דכ\"מ שנאמר ציווי היא לדורות אלא מקרא דואתה תצוה, ובזה מיושב היטב דברי המדרש שהביא לקרא דואתה תצוה הלכה זו דקטן נימול לשמונה שלמדין זו ממה שנימול יצחק דשם כתיב כאשר צוה שפירושו לדורות כמה דגמרינן מואתה תצוה, ושפיר יש לנו שנו כתובים דמילה בזמנה הוא בשמונה, (ע\"כ ).",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 3,
      "char_length": 903,
      "timestamp": "2025-02-06T19:31:24.826625"
    },
    {
      "id": "tetzaveh_p4",
      "text": "ואתה תצוה את בני ישראל ויקחו אליך שמן זית וגו', הקשו המפורשים מה ענין מצוה זו לכאן, ועיקר מקומה אחר עשיית המשכן והנחת המנורה ומהר\"י אברבנאל פי' כי עיקר מצוה זו בפ' אמור וכאן נאמר תצוה ר\"ל אתה עתיד לצוות את בנ\"י וגו' והקשה עליו הכלי יקר דלדבריו כל פסוק זה מיותר כו מה הגיד לו בזה שסופו לצוות, ולא מצינו כן בשאר מצות התורה שיקדים הבוי\"ת להודיעו שהוא עתיד לצוותם אח\"כ.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 4,
      "char_length": 365,
      "timestamp": "2025-02-06T19:31:25.261160"
    },
    {
      "id": "tetzaveh_p5",
      "text": "ב) בבעה\"ט כתב לא הזכיר משה בזה הסדר משא\"כ בכל החומש, שמשעה שנולד משה אין סדר שלא הוזכר בה, והטעם משום שאמר מחני נ מספרך אשר כתבת, וקללת חכם אפילו על תנאי באה ונתקיים בזה עכ\"ל, ויש להבין למה דייקא בפרשה זו לא הוזכר מטעם זה, ובפרט שבסידור הפסוקים באה פרשת תצוה קודם חטא העגל שעדיין לא אמר מחני נא, הגם שיש פלוגתא בין הראשונים אם פרשיות אלו נכתבו כסדרן או לא, מ\"מ בסידורן בתורה קודם חטא העגל נכתבו, ולמה בא הרמז הזה בפרשה זו דייקא.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 5,
      "char_length": 428,
      "timestamp": "2025-02-06T19:31:25.460204"
    },
    {
      "id": "tetzaveh_p6",
      "text": "ג) במדרש תנחומא וא) ילמדנו רבינו קטן לכמה נמול, כך שנו רבותינו קטן נמול לשמונה, מה טעם כשם שנמול יצחק אבינו, ארשב\"י בא וראה שאין חביב לפני האדם יותר מבנו והוא מל אותו, וכ\"כ למה כדי לעשות רצון בוראו וכו', אמר הקב\"ה לישראל בנו עשו לי כשם שעשיתי לכם, האכלתי אתכם במדבר אף אתם היו מקריבים לפני וכו', וה' הולך לפניהם יומם וכנגדו צו את בנ\"י להעלות נר תמיד עכ\"ד המדרש, וצ\"ב קישור שאלה זו קטן לכמה נמול למצות המנורה, גם כל עיקר השאלה צ\"ב, דזיל קרי בי רב הוא, ומקרא מפורש בתורה וביום השמיני ימול בשר ערלתו. ודרשו רז\"ל (שבת קל\"ב ע\"ב) שני פעמים כתיב בתורה ביום השמיני וגו', חד למעוטי שביעי וחד למעוטי תשיעי, ומה מקום להסתפק עוד בשאלה זו קטן לכמה נמול, גם מה צורך לטעם כשם שנמול יצחק אבינו, ומפורש בפסוק שזהו זמן מצותו לכל ישראל.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 6,
      "char_length": 717,
      "timestamp": "2025-02-06T19:31:25.709044"
    },
    {
      "id": "tetzaveh_p7",
      "text": "ד) במדרש תנחומא (ב) ואתה תצוה זש\"ה תקרא ואנכי אענך למעשה ידיך תכסוף, אמרה כנסת ישראל לפני הקב\"ה, רבש\"ע תקרא ואנכי אענה, כל מה שאתה גוזר אני מקיימה, אלא למעשה ידיך תכסוף, יש אדם מתאוה למעשה ידיו וכו' אתה מאיר לכל העולם ואתה מצוה להעלות נר תמיד וכו', אמר הקב\"ה חביב עלי נרות שאהרן מדליק, מן המאורות שקבעתי בשמים, למה שבשעה שהקריבו הנשיאים חנוכת המזבח ולא הקריב שבט לוי הי' אהרן נפשו עגומה וכו', א\"ל הקב\"ה חייך כל השבעים הקריבו חנוכה אחת, ואתה לעצמך תעשה חנוכה, מחוץ לפרוכת העדות באוהל מועד יערוך אותו אהרן ובניו עכ\"ד המדרש, ויש להבין במה ניחם הקב\"ה את אהרן על שלא הקריב בחנוכת המזבח, ובמה היתה הדלקת הנרות יתירה עליהם, וכעין דרש זה הביא רש\"י ז\"ל בפ' בהעלותך למה נסמכה פרשת המנורה לפרשת נשיאים, לפי שכשראה אהרן חנוכת הנשיאים חלשה דעתו וכו' א\"ל הקב\"ה חייך שלך גדולה משלהם, ובמדרש שם (פרשה ע\"ו סי' ו') איתא א\"ל הקב\"ה אל תתוירא לגדולה מזאת אתה מוכן, הקרבנות כל זמן שביהמ\"ק קיים הן נוהגין אבל הנרות לעולם, והקשה שם הרמב\"ן הלא כשאין ביהמ\"ק קיים והקרבנות בעלים אף הנרות בעלות, ופי' שם דקאי על נרות חנוכה שהי' בזמן בית שני עיי\"ש, וכמו\"כ קשה כאן שלא נתבאר פווסו של אהרן מהו.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 7,
      "char_length": 1063,
      "timestamp": "2025-02-06T19:31:26.111544"
    },
    {
      "id": "tetzaveh_p8",
      "text": "ולבאר הענין נקדים דברי הגמ' ושבת דף כ\"ב ע\"ב) מחוץ לפרוכת העדות יערוך, וכי לאורה הוא צריך והלא כל ארבעים שנה שהלכו ישראל במדבר לא הלכו אלא לאורו, אלא עדות הוא לבאי עולם שהשכינה שורה בישראל, והקשו בתוס' תימה אמאי נקט מ' שנה, לעולם כל העולם כולו לאורו של מקום הולכין, וי\"מ וכו אהרן כשהי' נכנ לפנים לאורה הי' צריך. והלא מ' שנה הי' מאיר להם עמוד הענן בכל המקומות, כדאמרינן בברייתא דמלאכת המשכן, הי' מסתכל בטפיח ויודע מה בתוכו וכן משמע בתו\"כ דאכהנים קאי, דגרס התם וכי צריכים לנר והלא כל אותן מ' שנה לא הוצרכו לנר, שנאמר כו ענן ה' על המשכן וגו', ומיהו בשלהי כל הקרבנות (מנחות פ\"ו ע\"ב) משמע דאשכינה קאי, דמייתי לה גבי הא דא\"ר אליעזר לא לאכילה אני צריך ולא לאורה אני צריך. וקאמר נמי התם לפרכת העדות, עדות הוא לכל באו עולם שהשכינה שורה בישראל, וא\"ת לאורה אני צריך והלא כל אותם מ' שנה עכ\"ד התוס', ולכאורה יש כאן כמה סתירות דבגמ' שבת איתא וכי לאורה הוא צריך בלשון יחיד ולפי הי\"מ הקושיא על אהרן וכי אהרן כשהי' נכנס לפנים לאורה הי' צריך, אמנם בתורת כהנים שהביאו התוס' מבואר שהתמי' על כל הכהנים וכי צריכים לנר וכו', ובגמ' מנחות משמע דאשכונה קאי, והגם דכולהו איתנייהו מ\"מ צ\"ב טעם השינוי ממקום למקום.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 8,
      "char_length": 1083,
      "timestamp": "2025-02-06T19:31:26.711158"
    },
    {
      "id": "tetzaveh_p9",
      "text": "ונראה לתרץ סתירה הראשונה דהנה מברייתא דמלאכת המשכן הובא בילקוט (סו\"פ פקודי) מוכח שמה שלא הוצרכו לאור הנר הי' עזו ענני הכבוד שהי' מאיר להם דאיתא שם רשב\"י אומר כל מ' שנה שהיו ישראל במדבר לא נצרך אחד מהם לאור החמה וכו', מסתכל בחבית ויודע מה בתוכו מפני ענן שכינה שביניהם. שנאמר לעיני כל בית ישראל בכל מסעיהם. ואף לעתיד לבוא כן שנאמר (ישעי' ס') קומי אורי כי בא אורך וגו', ואומר (שם) לא יהי' לך עוד השמש לאור יומם וגו' כי ה' יהי' לך לאור עולם עכ\"ד המדרש, והנה מבואר שהעננים היו בזכות אהרן. שכשמת אהרן נסתלקו ענני כבוד, אלא שחזרו אח\"כ בזכות משה, א\"כ אפ\"ל דמה שאמרו כאן וכי לאורה הוא צריך על אהרן בלבד הקשו כן, דאה\"נ גם שאר הכהנים לא היו צריכים לאורה, אלא מפני שהעננום שעל ידם היו רואין הכל היו בזכות אהרן לזה נקטו אהרן: ואפשר עוד שעל כל כהנים לא קשה כ\"כ קושיא זו וכי לאורה הם צריכים, דאע\"פ שהיו רואים הכל ע\"ו העננים מ\"מ יש לחוש שמא יגרום החטא ויסתלקו ענני הכבוד לכך הוצרכה המנורה להאיר להם. משא\"כ אהרן הכהן שהעננים היו בזכותו וודאי הי' בטוח שכל ימי חיותו לא יופסק עמוד הענן א\"כ לא הי' צריך לעולם לאור המנורה לזה הקשו בגמ' על אהרן וכי לאורה הוא צריך דזהו מוכרח יותר שאהרן לא הי' צריך לאורה לעולם משא\"כ שאר הכהנים.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 9,
      "char_length": 1105,
      "timestamp": "2025-02-06T19:31:27.263737"
    },
    {
      "id": "tetzaveh_p10",
      "text": "וליישב הסתירה השני' גם לתרץ קושית התוס' נראה לפרש דלכאורה יש להקשות על קושית הגמ' דמנחות א\"ת לאורה אני צריך והלא כל מ' שנה וכו', דאיך יעלה על הדעת ח\"ו לומר שאצל הקב\"ה יש ח\"ו חסרון השלימות. שבני אדם צריכין להדליק לו נר, הלא זה הוא כפירה בעיקרי האמונה ואיך יעלה על הדעת לומר ח\"ו שלאורה הוא צריך ומדוע צריך להביא ראי' לדחות סברא זו מהמ' שנה שהלכו ישראל לאורו, וחלילה לחשוב כן על הבורא ית\"ש שהוא העדר השלימות ח\"ו.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 10,
      "char_length": 409,
      "timestamp": "2025-02-06T19:31:27.807148"
    },
    {
      "id": "tetzaveh_p11",
      "text": "אמנם נראה בביאור ענין זה דבר ברור עפי\"מ דאיתא בשאלתות דר' אחאי גאון ופ' בהעלותך) אמר ר' יהושע בן לוי מנין שהקב\"ה צריך לברכת כהנים שנאמר ושמו את שמי על בני ישראל ואני אברכם, וכעי\"ז בגמרא (סוטה דף ל\"ח ע\"ב) בשינוי לשון קצת אריב\"ל מנין שהקב\"ה מתאוה לברכת כהנים שנאמר וכו' ופי' המהרש\"א ז\"ל שם שהוכחתו הוא מדכתיב ואני אברכם שהקב\"ה מברך את ישראל, א\"כ למה צוה לכהנים לברכם כלל ומה תועלת בברכתם, אלא שהקב\"ה מתאוה לברכת כהנים שיתברכו ישראל גם מפי הכהנים, ורש\"י ז\"ל פי' ושמו את שמי תלה הכתוב הדבר בהן, להיות ברכה זו שימת שמו על עמו, ולא עשאה צורך ישראל אלא צורך מקום עכ\"ל, נראה מדבריו ז\"ל שכיון לגירסת השאלתות שהקב\"ה צריך לברכת כהנים שיש בו צורך המקום ולכאורה צ\"ב מאי צורך להקב\"ה בברכת כהנים.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 11,
      "char_length": 681,
      "timestamp": "2025-02-06T19:31:28.073948"
    },
    {
      "id": "tetzaveh_p12",
      "text": "ויתבאר בהקדם דברי אאמו\"ר זלה\"ה בקדושת יו\"ט (פ' נשא) שכתב לפרש דברי השאילתות הנ\"ל עפי\"ד ק\"ז הישמח משה זלה\"ה עה\"פ ה' אלקי אבותיכם יוסף עליכם ככם אלף פעמים ויברך אתכם כאשר דבר לכם, פירש\"י א\"ל משה אתה נותן קצבה לברכתנו, א\"ל זה משלי אבל הוא יברך אתכם כאשר דבר לכם, והקשו המפרשים א\"כ מה צורך בברכתו הרי בכלל מאתים מנה, ופי' עפימ\"ש בפ\"ק דכתובות (דף ה' ע\"א) גדולים מעשי צדיקים יותר ממעשה שמים וארץ ולזה כפו שהי' ידו משגת בירך אותם משלו שתהא הברכה מעשה צדיקים עכ\"ד, וכמו שאמר הקב\"ה ישמעאל בני ברכני ובירך אותו וכו' הרי שהקב\"ה הטוב והמטיב לעמו ישראל רוצה ומתאוה לברכתן של צדיקים שיברכו אותו כביכול, כדי שיהי' אח\"כ ברכתו על ישראל בבחינת מעשה צדיקים ג\"כ, וזה כוונת השאלתות מנין שגם הקב\"ה צריך לברכת כהנים שנאמר ושמו את שמי על בנ\"י, היינו שבנ\"י יברכו את שמי ואח\"כ ואני אברכם לישראל, א\"כ מוכח מזה שהקב\"ה צריך לברכת כהנים כדו שישלח ברכתו אח\"כ על ישראל בבחינת מעשה צדיקים ובחי' מעשה שמים וארץ, עכ\"ד ז\"ל.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 12,
      "char_length": 887,
      "timestamp": "2025-02-06T19:31:28.462027"
    },
    {
      "id": "tetzaveh_p13",
      "text": "נמצא לפי זה שמה שהוא צורך ישראל הוא ג\"כ צורך המקום ב\"ה, מפני שהקב\"ה טוב ומטיב לישראל ורוצה להשפיע להם כל טוב, ואם יחסר להם דבר לישראל ח\"ו הוי כמו חסרון כביכול להקב\"ה כיון שרצונו להשפיע לישראל ולזה צריך אתערותא דלתתא שיהי' מבחינת מעשה צדיקים, ובזה א\"ש שאין כאן שום סתירה בדבריהם ז\"ל דמה שאמרו במנחות וא\"ת לאורה אני צריך אין הכוונה ח\"ו שהקב\"ה בעצמו צריך לאור המנורה, חס מלהעלות על הדעת כלל, אלא מפני שהוא צורך ישראל הי' סברא לומר שהדלקת המנורה יש בו צורך לתכלית השפעת האורה שיהי' נעשה עי\"ז אתערותא דלתתא ובבחי' מעשה צדיקים.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 13,
      "char_length": 521,
      "timestamp": "2025-02-06T19:31:28.882647"
    },
    {
      "id": "tetzaveh_p14",
      "text": "ומעתה גירסת התו\"כ וגמ' דמנחות בקנה א' עולין, והמכוון בשניהם א' הוא, דאף הכהנים לא היו צריכים לאור המנורה כי הי' ענן השכינה מאיר לפניהם, אלא דאלמלי הי' צורך הכהנים הוי צורך המקום ג\"כ, לזה אמרו בגמ' מנחות וא\"ת לאורה אני צריך, והיינו ג\"כ לצורך ישראל להמשיך להם השפעת האורה, ולטעם זה הי' צורך כהנים ג\"כ, שיהי' המשכת האורה באתערותא דלתתא ובבחי' מעשה הצדיקים, ודחו בגמ' טעם זה כי לא היו הכהנים צריכים להמשכת האורה ע\"י הדלקת המנורה, כו כל מ' שנה שהלכו ישראל במדבר לא הלכו אלא לאורו ית', שהי' מאיר להם בענן שכינתו ית' באתערותא דלעילא לבד, אלא עדות הוא לבאי עולם שהשכינה שורה בישראל.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 14,
      "char_length": 574,
      "timestamp": "2025-02-06T19:31:29.135234"
    },
    {
      "id": "tetzaveh_p15",
      "text": "ונקדים מ\"ד במדרש ילקוט ורמז שע\"ו) ואתה תצוה למדנו שהציווי מיד בשעת מעשה, לדורות מנין ת\"ל צו את בנ\"י ויקחו אליך שמן זית וגו', הא למדנו שהציווי מיד ולדורות, מצווי הזה נמצינו למדין לכל הצוואות שבתורה, ופי' בזית רענן דמדחזר ואמר שנית צו את בנ\"י ויקחו אליך וגו' קמ\"ל שינהוג גם לדורות, ומציווי זה למדין לכולם עכ\"ד ז\"ל, וראוי להבין למה צריך ילפותא שנוהג מצוה זו גם לדורות, ומה\"ת לא יהי' נוהג לדורות כמו כל המצות שהם נצחיות ונוהגים בכל הדורות גם דבגמ' (קידושין כ\"ט ע\"א) איכא עוד ילפותא תנא דבי ר' ישמעאל כל מקום שנא' צו אינו אלא זירוז מיד ולדורות, דכתיב מן היום אשר צוה ה' והלאה לדורותיכם וא\"כ למה צריך עוד קרא יתירה ללמוד על מצות המנורה שינהוג גם לדורות.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 15,
      "char_length": 647,
      "timestamp": "2025-02-06T19:31:29.425197"
    },
    {
      "id": "tetzaveh_p16",
      "text": "ונל\"פ בהקדם מ\"ד במד\"ר ופ' צו פר' ט' סי' ז) לע\"ל כל הקרבנות בטלין וקרבן תודה אינו בטל, ופי' היפ\"ת זה נאמר על קרבנות יחיד דבאים על חטא, ולעתיד כיון דיבוקש עון ואיננו לכן לא יובאו עוד עכ\"ד, ר\"ל דבוודאי א\"א שיחול השתנות בעצם המצות, כ\"א המציאות ישתנה שלא יהי' חטאים בעולם וממילא אזלא חיובם, וכמו\"כ הי' מקום לחשוב שמצות המנורה לא יהי' נוהג לעתיד, דמ\"ש בגמ' וכי לאורה הוא צריך והלא כל מ' שנה שהלכו ישראל במדבר לא הלכו אלא לאורו, דחויא זו אינו אלא לאותו הדור בלבד שזכו לענן כבוד שכינתו ית', אבל לדורות שיגרום החטא סילוק ענני הכבוד, אפשר שיהי' טעם מצות המנורה בשביל האורה ולהרבות כבוד הבית, גם להמשיך השפעת האורה ע\"ו מעשה הצדיקים כנ\"ל, וזה המציאות יתבעל (לעתיד לבא כמאמר הכתוב (ישעי' ס') לא יהי' עוד השמש לך לאור יומם וגו' והיה לך ה' לאור עולם וגו'. על כן למדו חז\"ל מקרא יתירא שציווי זו נוהג לדורות גם לע\"ל, דלא לטעם האורה הוא כ\"א עדות הוא לבאי עולם שהשכינה שורה בישראל, וטעם זה נוהג גם לעתיד, ואף דכבר איכא לימוד בגמ' דקדושין הנ\"ל דכ\"מ שנאמר צו מיד ולדורות, אפשר דזהו ללמוד שנוהג בכל הדורות בזמה\"ז וכאן ילפינן דנוהג אף לעתיד.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 16,
      "char_length": 1017,
      "timestamp": "2025-02-06T19:31:29.760051"
    },
    {
      "id": "tetzaveh_p17",
      "text": "ודרך אגב נל\"פ במאמה\"כ בתבנית בית המקדש שעשה שלמה (מלכים א' ו') ויעש לבית חלוני שקופים אטומים, ודרשו חז\"ל (מנחות פ\"ו ע\"ב) תנא שקופים מבפנים ואטומים מבחוץ לא לאורה אני צריך. פירש\"י שהמשקוף של חלונות היינו צר שבחלון היו מבפנים, והרוחב שבחלון מוחזר כלפי חוץ להוציא אורה לעולם, אמנם בתרגום יונתן פי' להיפך פתיחן מלגיו וסתימן מלברא, שהיו רחבים מבפנים וצרים לצד חוץ, ועיין בדברי הרד\"ק שם שתמה שהוא היפך מדברי רבותינו ז\"ל וצ\"ב, ואפ\"ל דאו\"א דא\"ח, דמבואר בדרז\"ל דשני מקדשות שנחרבו נשרפו רק למראית העין, אבל באמת נתעלו ונגנזו במקום גבוה עליון, ויהיו נכללים בבנין דלעתיד, ומעתה אפ\"ל דמ\"ש בגמ' דילן שהיו החלונות צרים מבפנים ורחבים מבחוץ להוציא אורה לעולם, שלא יטעו לומר לאורה הוא צריך, זה נאמר בזמה\"ז, ובתרגום יונתן מגלה איך שיהי' בחינתו לעתיד, שלא יהי' בעולם שום אור אחר זולת אורו ית' כמ\"ש לא יהי' לך השמש לאור יומם וירח וגו' והי' לך ה' לאור עולם ואז לא יהי' מקום לטעות דלהכניס אורה הוא עשוי דכל העולם יתמלא מאורו ות' ע\"כ יהיו רחבות מבפנים כשאר חלונות, וידוע דתרגום יונתן מגלה מסתירין דלעתיד, וכמ\"ש בגמ' (מגילה ג' ע\"א) דעל תרגום של נביאים נזדעזעה ארץ ישראל ד' מאות פרסה וכו' יצתה בת קול ואמרה מי הוא זה שגילה סתריי לבני אדם וכו' עיי\"ש. ע\"כ מסתבר דהתרגום יונתן מפרש בחינתו דלעתיד ול\"ק מידי.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 17,
      "char_length": 1177,
      "timestamp": "2025-02-06T19:31:30.244116"
    },
    {
      "id": "tetzaveh_p18",
      "text": "ולדרכינו יתורץ קושית הכלי יקר (בקושיא א') וא\"ש פי' מהר\"י אברבנאל ואתה תצוה ר\"ל אתה עתיד לצוות את בנ\"י במצות המנורה, והכוונה לדרכינו דמצוה זו יהי' נוהגת גם לעתיד, ומשרע\"ה עתיד לצוות את בנ\"י במצות המנורה גם לעתיד, ויתבאר דברי המדרש תנחומא (בקושיא ד') שניחם הקב\"ה את אהרן ואמר חביב עלי נרות שאהרן מדליק מן המאורות שקבעתי בשמים כי הם עתידים להבעל לעת\"ל כמבואר בפסוקים ובמדרשי חכז\"ל, משא\"כ המנורה תהי' קיימת לעולם, וז\"ש במדרש בהעלותך שהקרבנות בעלים והמנורה לעד קיימת ואין הכוונה על זמן שאין ביהמ\"ק קיים דאז גם המנורה בטלה אלא ר\"ל לעת\"ל לאחר שיבנה ביהמ\"ק יהיו ג\"כ מקצת הקרבנות בטלים וקרבנות הנשיאים היו חטאת ועולה ועתידים להבעל לעתיד לבוא שגם העולה באה לכפר על עשה, ושפיר נחם אותו הקב\"ה שהמנורה יהי' נצחית גם לעתיד יותר מן הקרבנות.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 18,
      "char_length": 725,
      "timestamp": "2025-02-06T19:31:30.811777"
    },
    {
      "id": "tetzaveh_p19",
      "text": "והנה איתא במד\"ר (שמות פ' א' סי' כ\"ו) עה\"פ ותקרא שמו משה מכאן אתה למד שכרן של גומלי חסדים, אעפ\"י שהרבה שמות היו לו למשה לא נקבע לו שם בכל התורה אלא כמו שקראתו בתי' בת פרעה, ואף הקב\"ה לא קראהו בשם אחר עכ\"ד המדרש, מבואר ששם משה מורה על גמילת חסדים, והנה לעת\"ל לא יהי' במציאות להשיג מצות גמילת חסדים לא בגשמיות ולא ברוחניות, שהרי אמרו חכז\"ל (שבת דף ל' ע\"ב) עתידה א\"י שתוציא גלוסקאות וכלי מילת ולא יצטרכו ישראל זה לזה גם ברוחניות דכתיב כי מלאה הארץ דעה את ה\"כ וכל ישראל ישמעו תורה מפי הקדוש ברוך הוא בעצמו, ומעתה לא יהי' עוד צורך ללמד שכרן של גומלי חסדים, ואפשר שלא יהי' אז שמו משה רק אחד משאר השמות שהי' לו, ואין יודעין עדיין השם שיקראו לו, כי זה תלוי לפי המדה שיהי' שולט אז, וכמו\"ש הרמ\"ק טעם שאין אומרים הלכתא למשיחא מפני שההלכה נקבע לפי המדה ששולט בעולם, ולעתיד לא נודע לנו עדיין איזו מדה תשלוט בעולם, וכן בקריאת שמו של משה אין אנו יודעים איזה שם יקרא לו, ובזה יש טעם נכון למה דייקא בפרשה זו לא נזכר שמו של משה, כיון דפרשה זו ירמוז על לעתיד לבוא, וכמו שפי' האוהחה\"ק ואז לא יהי' עוד שמו משה, ושם אחר לא נודע לנו עדיין לכן נכתב סתם ואתה תצוה ולא נזכר שמו כלל.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 19,
      "char_length": 1055,
      "timestamp": "2025-02-06T19:31:31.140692"
    },
    {
      "id": "tetzaveh_p20",
      "text": "נחזור לבאר דברי המדרש תנחומא קטן לכמה נימול, נ\"ל דוודאי אין כוונת השאלה כפשוטו לכמה ימים צריכין למולו לכתחילה דזיל קרי בי' רב הוא, אולם אפ\"ל הכוונה עפימ\"ד פלוגתא בדברי הראשונים בנמול תוך שמונה אי קיים המצוה בדיעבד, הרא\"ש ס\"ל שקיים המצוה בדיעבד ואין צריך להטיף ממנו דם ברית ביום השמיני, וכן הסכים הרמ\"א (ביו\"ד סי' רס\"ב) אולם הש\"ך שם הרבה להקשות עליו דאי ס\"ד נמול שלא כמצוותו כשר אמאי דוחה את השבת וכמ\"ש בגמ' בקצירת העומר אי ס\"ד נקצר שלא כמצוותו כשר, אמאי דחי שבת ע\"כ מסיק להלכה דנימול תוך ח' לא יצא וצריך להטוף ממנו דם ברית, והשאגת ארי' סובר דא\"צ להטיף דם ברית אבל לא מטעמי' דהרא\"ש, אלא שהוא סובר דאם נימול תוך ח' בטל כבר המצוה וא\"א עוד לקיימה ואינו מועיל הטפת דם ברית.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 20,
      "char_length": 668,
      "timestamp": "2025-02-06T19:31:31.682339"
    },
    {
      "id": "tetzaveh_p21",
      "text": "ואפשר דזהו כוונת המדרש כאן קטן לכמה נימול, ולא אמר קטן לכמה מלין אותו דזה אינה שאלה כלל וזיל קרי בי רב הוא, אלא כוונת השאלה לכמה ימים נחשב כנמול אם מלו אותו בדיעבד תוך זמנו דלשון נמול מורה על דיעבד, וזה הוא שאלת בעל המדרש אם נאמר שמה שאמרה התורה ביום השמיני ימול בשר ערלתו הוא רק לכתחילה אבל בדיעבד אינו מעכב, או דילמא גם בדיעבד מעכב.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 21,
      "char_length": 334,
      "timestamp": "2025-02-06T19:31:32.028996"
    },
    {
      "id": "tetzaveh_p22",
      "text": "אמנם שאלה זו יש לפקפק עלי', דהנה התוס' כתבו בכ\"מ דבדאורייתא אין שייך לכתחילה ודיעבד, דכיון שמבואר אופן עשיית המצוה בפסוק מעכב גם בדיעבד, וכ\"כ התוס' (מנחות ל\"ח ע\"א) על הא דתניא מצוה להקדים לבן לתכלת ואם הקדים תכלת ללבן יצא אלא שחיסר מצוה, וכתבו התוס' תימה כיון דמקרא הוא דדרשינן דלבן ברישא, נימא דמעכב דהא לא בעינן שנה הכתוב לעכב אלא בקדשים, וי\"ל דלית לן למימר דאסדר לבד יקפיד הכתוב לעכב וכו' עכ\"ד ז\"ל, מבואר דבגוף המצוה לא בעינן שנה הכתוב לעכב, א\"כ איך שייך לספוקי אם בדיעבד נמול תוך שמונה כשר, אחר שהכתוב הורה בפירוש ביום השמיני ימול בשר ערלתו וודאי דמעכב גם בדיעבד.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 22,
      "char_length": 567,
      "timestamp": "2025-02-06T19:31:32.227214"
    },
    {
      "id": "tetzaveh_p23",
      "text": "אכן נראה לבאר עפי\"ד האוהחה\"ק ופ' תזריע) טעם לעכבת המילה עד יום ח' ולא צוה למול ביומו, דאיתא בזוה\"ק שהוא כדי שיעבור עליו שבת ותגיעהו נפש החיונית הנשפעת בעולם ביום השבת כידוע, ואז יהי' בן קיימא, ותמצא שאמרו רז\"ל שקודם שבא שבת הי' העולם רופף ורועד, כיון שבא שבת נתחזק ונח ע\"כ, ופלא שלא הביא מדברי המדרש (פרשת אמור פ' כ\"ז סי' י') עה\"פ שור או כשב או עז כי יולד והי' שבעת ימים תחת אמו, משל למלך שנכנס למדינה וגזר ואמר כל אכסנין שיש כאן לא יראו פני עד שיראו פני המטרונא תחלה, כך אמר הקב\"ה לא תביאו לפני קרבן עד שתעבור עליו שבת שאין ז' ימים בלא שבת ואין מילה בלא שבת, הה\"ד ומיום השמיני והלאה ירצה ע\"כ, ולכאורה לפי\"ד הזוה\"ק שטעם המתנה עד יום השמיני הוא בשביל כדי שיעבור עליו שבת, א\"כ תינוק הנולד ביום הששי יהי' מותר למול אותו מיד אחר שבת, כיון דכבר עבר עליו שבת ביום שני ללידתו, ואפ\"ל משום לא פלוג נתנה תורה שיעור שוה לכל שיעבור עליו שבעה ימים מיום לידתו, שאז בוודאי יהי' בו שבת ולא חילקו בין נולד ביום א' או ביום ו'.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 23,
      "char_length": 908,
      "timestamp": "2025-02-06T19:31:32.533183"
    },
    {
      "id": "tetzaveh_p24",
      "text": "והנה כתב התרומת הדשן דבכ\"מ שגזרו חכמים משום לא פלוג מקילינן בה יותר משאר גזירות, כיון שעיקר הגזירה רק משום לא פלוג, וכמו\"כ אפשר לצדד בהך דנימול לח', אם נימא דעיקר טעמא משום לא פלוג אולי אפשר להקל בדיעבד אף אם נמול תוך שמונה, וזהו פי' המדרש קטן לכמה נמול ר\"ל אם בדיעבד כשר נמול תוך שמונה, כיון שכל הטעם הוא משום לא פלוג אי נחשב בדיעבד לנמול או לא, ע\"ז השיב כך שנו חכמים קטן נמול לשמונה, ר\"ל שאף בדיעבד לא קיים המצוה תוך שמונה. ובעל המדרש מביא ראי' כשם שנמול יצחק עפימ\"ד בזוה\"ק דתלמידי חכמים הם תמיד בבחינת שבת, ומסופר מפי מגידי אמת שאא\"ז הושמח משה זלה\"ה הי' לבוש בגדי שבת גם בימות החול, ופ\"א שלח אליו הרה\"ק בעל עטרת צבי זלה\"ה אגרת שלומים וכתב לו בין התוארים שבת דכולה שתא, וכאשר קרא אא\"ז זלה\"ה המכתב ענה בשחוק קל על שפתיו אהה הנה נודע לו\", ומי לנו גדול מהאבות הקדושים שוודאי היו בבחי' שבת דכולא שתא, א\"כ אין שייך אצלם הטעם לעכב המילה עד יום השמיני בשביל שיעבור עליו שבת וינתן בו בחינת הנפש, שהרי הם הוו תמיד בבחינת שבת, וא\"כ מדוע לא נמול יצחק עד יום השמיני, ואאע\"ה הי' משתוקק לקיים המצוה ואלמלי הי' אפשרות בוודאי הי' מקדימה, ועכ\"ח צ\"ל שישנם עוד טעמים כמוסים למילה ביום השמיני נוסף על טעם הנ\"ל ובאמת מהאי טעמא קיי\"ל דלא דרשינן טעמא דקרא, ואף ר\"ש שדורש טעמא דקרא אינו דורש בכל מקום אלא במקום שהי' לו הטעם בקבלה, ולדידן דלא דרשינן טעמא דקרא אף שהותר לנו לחתור ולחפש על טעמי המצות עד מקום שיד שכלנו מגעת אבל להחליט ולומר שאין בו טעם אחר זולתו וודאי דאסור, וכן כתב החינוך שאע\"פ שאומרים טעמים על המצוות יש בהם עוד טעמים כמוסים גבוה מעי גבוה שאין שכל אנושי משיג אותם, וכמו\"כ ענינינו מ\"ש הכתוב ביום השמיני ימול בשר ערלתו א נדע לדרוש טעמא דקרא ואפילו במקום שאין שייך טעם בשביל שיעבור עליו שבת כמו ביצחק אבינו, ולעתיד שיהי' יום שכולו שבת מ\"מ מחוייבין למול בשמיני, לכן אפילו בדיעבד נמול תוך שמונה לא קיים המצוה וצריך לחזור ולהעיף דם ברית ביום השמיני, וראי' ממה שנימול יצחק בשמיני.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 24,
      "char_length": 1768,
      "timestamp": "2025-02-06T19:31:33.005937"
    },
    {
      "id": "tetzaveh_p25",
      "text": "והשתא א\"ש קישור שאלה זו לפרשת תצוה דלפי דרכינו הנ\"ל באה פרשה זאת ללמדינו שמצות המנורה תהי' נוהגת גם לעת\"ל, ולכאורה למ\"ל להשמיע זאת ומהיכי תיתי תבטל, ומאי שנא משאר כל המצות שבתורה שלא יבטלו לעת\"ל, אלא עכ\"ח צ\"ל דסד\"א שטעם המנורה כדי להאיר לכהנים או להמשיך השפעת האורה, א\"כ לעתיד שלא יצטרכו לאור המנורה יבטל, קמ\"ל שאין זה הטעם אלא עדות הוא שהשכינה שורה בישראל הכל כנ\"ל, א\"כ לכאורה נשמע מכאן דדרשינן טעמא דקרא שהרי מהאי טעמא הוצרך הכתוב להודיענו שהמנורה תהי' נוהגת גם לעת\"ל, וא\"כ נולד לנו הספק אם נמול בדיעבד תוך שמונה ימים אם עלתה לו המילה, ע\"ז צריך להביא ראי' מיצחק אבינו ע\"ה שאינו מועיל אף בדיעבד דבזה לא דרשינן טעמא דקרא.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 25,
      "char_length": 621,
      "timestamp": "2025-02-06T19:31:33.874275"
    },
    {
      "id": "tetzaveh_p26",
      "text": "עוד אפ\"ל בטעם שלא נזכר משרע\"ה בפרשה זו דייקא (עיין לעיל בדרוש הקדום קושיא ב') בהקדם לבאר דברי הפסיקתא (הובא ביקו\"ש רמז שע\"ו) ואתה תצוה את בני ישראל: אמר משה לפני הקב\"ה רבש\"ע מע' אומות שלך אי אתה מצוני אלא על ישראל בלבד וכו', א\"ל מפני שהם דבוקים בי וכו', מפני שהמליכוני עליהם בים ואמרו ה' ימלוך לעולם ועד עכ\"ד הפסיקתא, והוא תמוה דמשרע\"ה רעיא מהימנא דישראל, והי' הסרסור בין ישראל לאבינו שבשמים ללמד זכות עליהם תמיד, ומדוע עכשיו השתדל בשביל האומה\"ע שיהי' גם להם חלק בטובה עם ישראל, גם מדוע בפרשה זו דייקא, ועוד הרי האומות לא רצו לקבל את התורה, ומדוע השתדל משרע\"ה לצוותם במצות התורה אשר מיאנו הם.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 26,
      "char_length": 592,
      "timestamp": "2025-02-06T19:31:34.173317"
    },
    {
      "id": "tetzaveh_p27",
      "text": "ויתבאר בהקדם דברי האוהחה\"ק בר\"פ זו וז\"ל ובדרך רמז יתבאר הכתוב ע\"ד מאמר הובא בס' זוהר חדש כי ד' גליות של ישראל כל א' נגאלו ממנו בזכות אחד, גלות הראשון נגאלו בזכות אאע\"ה, ב' נגאלו בזכות יצחק אבינו: ג' בזכות יעקב והד' תלוי בזכות משה, ולזה נתארך הגלות כי כל עוד שאין עוסקין בתורה ובמצות, און משה חפץ לגאול עם בטלנים מן התורה וזה הוא שרמז הכתוב כאן באומרו אתה תצוה את בני ישראל וכו' וע\"ד אמרז\"ל און צו אלא מלכות, כי הוא ימלוך עלינו לעתיד, ותנאי הוא הדבר שיעסקו ישראל בתורה וכו' עיי\"ש, ובפ' ויחי עה\"פ אוסרי לגפן כתב האוהחה\"ק הלא ידעת דברי הזוה\"ק כי משה הוא הגואל אשר גאל את אבותינו הוא יגאל אותנו וישיב בנים לגבולם דכתיב מה שהי' הוא שיהי' ר\"ת משה, ולא יקשה בעיניך דבר זה וכו' הלא מלך המשיח משבט יהודה, מזרעו של דוד המלך ע\"ה, וי\"א דוד עצמו מלך המשיח דכתיב ועבדי דוד מלך עליהם כמשמעו, וא\"כ האיך אנו אומרים שהוא משה הבא משבט לוו, יש לך לדעת כו בחי' משרע\"ה הוא כלולה מי\"ב שבטי ישראל, כי כל הס' רבוא היו ענפים, וענף שבעו של דוד במשה היא וכו', ולעתיד לבוא תתגלה בעולם שורש המלכות שבמשה שהוא עצמו מלך המשיח והוא דוד והוא ינון ושילה עכלה\"ק, ואפשר שבאתגליא יהי' שמו דוד כי הוא אשר זכה לכתר מלכות, וכמ\"ש האור החיים הקדוש, ולעתיד יהי' שם משה בהעלם ובאתכסיא, ולפי שהי' הכרח שיתקיימו דברי משה רבינו ע\"ה שאמר מחני נא וקללת חכם אפי' על תנאי באה, ע\"כ נתקיימה בפ' זו לרמוז על בחי' העתיד.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 27,
      "char_length": 1264,
      "timestamp": "2025-02-06T19:31:34.481973"
    },
    {
      "id": "tetzaveh_p28",
      "text": "ובזה יתבאר דברי הפסיקתא הנ\"ל, בהקדם מ\"ד במד\"ר פ' ויחי (פ' צ\"ח סי' ע') א\"ר חנין אין ישראל צריכין לתלמודו של מלך המשיח לעתיד לבוא, שנאמר (ישעי' י\"א) אליו גוים ידרושו לא ישראל א\"כ למה מלך המשיח בא ומה הוא בא לעשות, לכנס גליותיהן של ישראל וליתן להם שלשים מצות (פי' לאוה\"ע), ומבואר בדרז\"ל שלעת\"ל ילמדו ישראל תורה מפי הקב\"ה ואומה\"ע מפי מלך המשיח, ומעתה לפי\"ד האוהחה\"ק כי ירמוז הכתוב ואתה תצוה את בני ישראל על זמן המקוה אחר ביאת המשיח, שמשרע\"ה ימלוך עלינו והוא יהי' מלך המשיח, אמנם בזמן ההוא לא יהיו ישראל צריכין לתלמודו של מלך המשיח, ואליו גוים ידרושו כמבואר בפסוקים, שיבואו האומה\"ע וירצו לקבל עליהם עומ\"ש וילמדם ומלך המשיח ל' מצות. וז\"ש בפסיקתא אמר משה לפני הקב\"ה מע' אומות שלך אי אתה מצונו אלא על ישראל שנא' ואתה תצוה את בני ישראל, דלפי בחי' העתיד שעלי' ירמוז הכתוב, לא יהי' הציווי לבנ\"י כו לא יצטרכו אלי' כנ\"ל, והשיב לו הקב\"ה מפני שהם דבוקים בי וכו' מפני שהמלוכוני עליהם בים וכו', ואף שהציווי יהי' לאומה\"ע, מ\"מ השפעת הדיבור יהי' בשביל ישראל, כי הם המליכוני בים, וע\"כ יאתה להם הכבוד הזה, ולז\"א ואתה תצוה את בנו ישראל, כי כל הציוויים שבתורה לישראל ניתנו, והם קבלוהו עליהם בסיני, וכמ\"ש היפ\"ת דהמצות אלו שילמוד מלך המשיח לאומה\"ע אינן מחודשות, רק הן מאשר מפורשות כבר לישראל וילמדם לאומה\"ע, כי ישראל לא יהיו צריכין להצטוות כי כבר ישיגוהו וא\"ש דברי הפסיקתא.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 28,
      "char_length": 1247,
      "timestamp": "2025-02-06T19:31:35.088300"
    },
    {
      "id": "tetzaveh_p29",
      "text": "ואתה תצוה את בנו ישראל, דקדקו המפורשים דהול\"ל צו את בנ\"י כמ\"ש בשאר הצוויים ומדוע כתיב כאן תצוה בלשון עתיד.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 29,
      "char_length": 106,
      "timestamp": "2025-02-06T19:31:35.693322"
    },
    {
      "id": "tetzaveh_p30",
      "text": "ב) עוד הקשו המפורשים מה ענין מצוה זו לכאן כו עיקר מקומה אחר עשיית המשכן והנחת המנורה, גם שחזר ונשנה בפ' אמור פרשת מצות הנרות, צו את בנ\"י ויקחו אליך שמן זית זך וגו' ופירש\"י שם זו פ' מצות הנרות, ופ' ואתה תצוה לא נאמרה אלא על סדר מלאכת המשכן לפרש צורך המנורה. וכן משמע ואתה סופך לצוות את בני ישראל על כך עכ\"ל רש\"י ז\"ל, וגם לפירושו קשה דלא מצינו שיפרש הכתוב צורך המזבח ודיני הקרבנות בסדר מלאכת המשכן, ומ\"ט כפל ונשנה מצות הנרות ב\"פ, ומה צורך להקדים הודעה זו שסופך לצוות את בנ\"י על כך, ולא עשה כן בשאר הציוויים, וכבר ביארנו בזה ועוד לאלקי מילין.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 30,
      "char_length": 539,
      "timestamp": "2025-02-06T19:31:35.791090"
    },
    {
      "id": "tetzaveh_p31",
      "text": "ג) להעלות נר תמיד, פירש\"י ז\"ל כל לילה ולילה קרוי תמיד, כמו שאתה אומר עולת תמיד ואינה אלא מיום ליום וכו', וכתב הרמב\"ן ז\"ל ומדרש רבותינו אינו כך: אלא כך שנו בספרי יאירו שבעת הנרות שומע אני שיהיו דולקין לעולם ת\"ל מערב עד בוקר וכו' לפני ה' תמיד שיהא נר מערבי דולק תדיר וכו', ובתורת כהנים נמי אמרו כך להעלות נר תמיד שיהא נר מערבי תדיר עכ\"ל הרמב\"ן ז\"ל, וצ\"ב דברי רש\"י ז\"ל שהרי מפורש בתו\"כ ובספרי דנר תמיד קאי על נר מערבי ולא צריך לטעמא דכל לילה ולילה נקרא תמיד.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 31,
      "char_length": 455,
      "timestamp": "2025-02-06T19:31:36.065875"
    },
    {
      "id": "tetzaveh_p32",
      "text": "ד) במדרש תנחומא ואתה תצוה וגו', ילמדינו רבינו קטן לכמה נמול, כך שנו רבותינו קטן נמול לשמונה, מ\"ט כשם שנמול יצחק אבינו וכו' וצ\"ב קישור השאלה לכאן, גם הרי מפורש בקרא וביום השמיני ימול, ואין מקום להסתפק בו, ומה צורך להביא ראי' כשם שנמול יצחק.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 32,
      "char_length": 239,
      "timestamp": "2025-02-06T19:31:36.303410"
    },
    {
      "id": "tetzaveh_p33",
      "text": "ולבאר הענין נקדים דברי הה\"ק מלובלין זלה\"ה בס' זכרון זאת ופ' צו) לפרש דברי המד\"ר (פרשה ל\"ו סי' ב') לא שאני צריך להם, אלא שתאירו לי כשם שהארתי לכם, למה כדי להעלות אתכם בפני כל האומות, שיהיו אומרים ישראל מאירין למי שמאיר לכל, דהנה כבר אמורה שהבורא ב\"ה אמר שובו אלי ואשובה אליכם, ואנו אומרים השיבנו ה' אליך ונשובה, ומי ינצח, ועוד הלא שני הפסוקים הם רוח הקודש ושניהם יתקיימו והאיך הוא, אך האמת כך אנו מתפללים, יתן הבורא ב\"ה התעוררות כן ברחמיו, שנהי' אנו שבים אליו וישוב אלינו, וזה השיבנו ה' אליך באופן שנשוב אנו כי הוא הכל יכול כי יעזור לצדיקים שבכל דור לפעול נפלאותיו להגדיל אהבתו בלב ישראל לשוב עי\"ז מאהבה, והנה ידוע במצרים הי' מאת הבורא ב\"ה בלא התעוררות: כ\"א העלה אותנו בחפזון למדריגה עליונה וכו', וזה י\"ל שתאירו לי כמו שהארתי לכם קודם פי' במצרים וכו', ויאמרו האומה\"ע ישראל מאירין למי שמאיר לכל, פי' אנו הגורמים זה שמעוררין מן לו ית' להאיר לכל ולהשפיע לכל העולמות עכדה\"ק.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 33,
      "char_length": 869,
      "timestamp": "2025-02-06T19:31:36.460047"
    },
    {
      "id": "tetzaveh_p34",
      "text": "ואפ\"ל עוד שיכולין שניהם להתקיים דלאו כל העיתים שווים. ולפעמים עת רצון והבוי\"ת נותן התעוררות העליון תחילה, וכמו שהי' במצרים, ולפעמים צורך שיתחיל ההתעוררות מצידנו, ואפ\"ל עוד דבאמת ב' סוגי תשובה יש, ופי' בספה\"ק זרע קודש מ\"ש בפ' התשובה ושב ה' אלקיך את שבותך ורחמך ושב וקבצך מכל העמים וגו' ואתה תשוב ושמעת בקול ה' אלקיך, דלכאורה כיון שאמר ושב ה' אלקיך את שבותך ושב וקבצך, הרי כבר קדם אלי' התשובה בעכ\"ח, דאין ישראל נגאלים אלא בתשובה וכמ\"ש הרמב\"ם ז\"ל, ולמה אמר עוה\"פ ואתה תשוב ושמעת וגו', אמנם ב' בחי' תשובה יש, ובעוד שיהיו ישראל בגלות טרם שיגאלו יעשו תשובה בעזיבת החטא וחרטה, אבל אין זה עדיין תשובה השלימה ואמיתית, וכשיעזור השי\"ת ושב ה' אלקיך את שבותך וגו', יתן בנו דעת להשיג דרך תשובה השלימה, וע\"כ אמר הכתוב עוה\"פ ואתה תשוב ושמעת בקול ה', שאז נזכה לתשובה עילאה, ועד\"ז כתב בעקידה (פ' נצבים בשער המאה) לפרש הכתוב יעזוב רשע דרכו וגו' וישוב אל ה' וגו' דלכאורה כיון שעזב דרכו הרעה הרי עשה תשובה, ומדוע אמר אח\"כ וישוב אל ה', אלא שעזיבת דרך הרע בלבד אינו תשובה שלימה, וצריך אח\"כ עוד תשובה יותר גדולה עיי\"ש.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 34,
      "char_length": 994,
      "timestamp": "2025-02-06T19:31:36.878857"
    },
    {
      "id": "tetzaveh_p35",
      "text": "ובזה י\"ל ששניהם יתקיימו, שובו אלי ואשובה אליכם. ובקשת כנס\"י השיבנו ה' אליך ונשובה, דכ\"ז שמלוכלכין בעבירות ר\"ל, אין בנו כח ודעת להתחיל בהתעוררות תשובה, וצריך להיות השיבנו ה' אליך ונשובה, אבל כשזוכין לתשובה השני', כבר ניתוסף לו דעת וכח הקדושה ואפשר שתתקיים שובו אלי ואשובה אליכם, שיתחיל התעוררות מצידנו, וגם י\"ל להיפך דהתשובה הקטנה חרטה ועזיבת החטא אפשר שתהי' בבחי' שובו אלי ואשובה אליכם שיתעורר האדם ויתבונן במצבו ויעזוב דרכו הרעה, אבל להשיג תשובה עילאה צריך סייעתא דשמיא מרובין, וזהו השיבנו ה' אליך ונשובה, עכ\"פ באלו ב' בחי' של תשובה יתיישבו שני הפסוקים ויתקיימו שניהם.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 35,
      "char_length": 569,
      "timestamp": "2025-02-06T19:31:37.359251"
    },
    {
      "id": "tetzaveh_p36",
      "text": "ובזה יתבאר מה שנשנית מצות הנרות ב\"פ בתורה עפימ\"ש בס' זכרון זאת הנ\"ל, דשמן זית זך ירמוז אל התשובה, שתאירו לו בהתערותא דלתתא וכו' עיי\"ש, והנה כשהוצרכו ישראל לעשות המשכן אחר חטא העגל, הי' הצורך להקדים אלי' התשובה, וכמ\"ש בזוה\"ק (פ' תרומה קכ\"ח ע\"א) מאת כל איש אשר ידבנו לבו וגו', מההוא דאקרי איש דאתגבר על וצרי' וכו', אשר ידבנו לבו דיתרעי בי' קוב\"ה, כד\"א לך אמר לבי (תהלים כ\"ז) צור לבבי (שם ע\"ג), כלהו בהקב\"ה קאמר, אמנם לתשובה שלימה לא זכו רק אחר שנגמר המשכן וזכו להשראת השכינה, כמ\"ש רז\"ל עדות הוא שהשכינה שורה בישראל, וע\"כ הודיע הקב\"ה למשה רבינו ע\"ה ואתה תצוה את בנ\"י וגו', שסופך לצוות את בנ\"י על כך כפירש\"י ז\"ל וזה יהי' לאחר שיגמר המשכן, ואז יזכו ישראל לתשובה עילאה, וע\"ז ירמוז השמן ומצות המנורה כנ\"ל, ואיתא בתנחומא אמר הקב\"ה מה היונה הביאה אורה לעולם, אף אתם שנמשלתם כיונה הביאו שמן זית והדליקו לפני את הנר וכו', וע\"ד שפי' בספה\"ק זאת זכרון שתאירו לי בהארת התשובה, ועכשיו צוהו הקב\"ה ללמדם מעשה המנורה ובחי' השמן זית ולהכינם אל התחלת התשובה ע\"ו פעולת הצדיקים, והבחי' העליונה נשלם אח\"כ, וע\"כ חזרה ונשנית ב\"פ בתורה.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 36,
      "char_length": 1009,
      "timestamp": "2025-02-06T19:31:37.635038"
    },
    {
      "id": "tetzaveh_p37",
      "text": "עוד אפ\"ל עפ\"י אומרם ז\"ל דהמנורה ושמן ירמוז לחכמה, כמ\"ש רז\"ל (וב\"ב דף כ\"ה ע\"ב) הרוצה להחכים ידרים וסימנך מנורה בדרום, עוד אמרז\"ל (ברכות נ\"ז ע\"ב) הרואה שמן זית בחלום יצפה למאור תורה, והנה אמרז\"ל במתני' (אבות פ\"ג מ\"ט) כל שיראת חטאו קודמת לחכמתו, חכמתו מתקיימת וכו', והקשה המדרש שמואל שהוא סותר לכאורה דברי הלל (אבות פ\"ה מ\"ה) אין בור ירא חטא, דלדבריו איך יצוייר שתקדים יראת חטא לחכמת התורה, וכבר תרצתיו בכמה אנפין (עי' בדברינו פ' בראשית עמוד ל\"ז), וכעת נ\"ל בדרך פשוט דיש כמה מדריגות בין ת\"ח וע\"ה, דהרבה בחי' בחכמה ולא כל אנפין שווין, ועוד יש הממוצע שאינו בגדר ע\"ה, אבל למעלת ת\"ח לא הגיע, וכמו כן יש ממוצע בין בור לחכם בכמה מדריגות, והנה אמת הדבר דאין בור ירא חטא, וצריך שיקדים איזה בחי' חכמה, דאל\"כ לא ישיג מהו חטא ומהו יראה, אבל לחכמה עליונה ואמיתית לא יגיע אלא א\"כ יראת חטאו קודמת, וב' המאמרים קיימים ואמיתיים, ולזה נשנית מצות המנורה ב\"פ, ועכשיו א\"ל הקב\"ה ואתה תצוה את בנ\"י ויקחו אליך שמן זית וגו', וע\"י העסק בלימוד המצוה ישפיע עליהם בחי' חכמה, וזה יביאם ליראת חטא ולתשובה, ואחר עשיית המשכן יזכו להשפעת החכמה מבחי' העליונה, וע\"כ חזרה ונשנית שם עוה\"פ.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 37,
      "char_length": 1048,
      "timestamp": "2025-02-06T19:31:38.150221"
    },
    {
      "id": "tetzaveh_p38",
      "text": "וכתב התויו\"ט זלה\"ה בפירושו לצורת הבית דלעתיד בנבואת יחזקאל (סי' מ\"ג) בהפטורה פז זו, ובמדרש ילמדנו בשעה שנגלה הקב\"ה והראה ליחזקאל צורת הבית ותכונתו וכו', אמר הקב\"ה הגד לבית ישראל את הבית, א\"ל וכי עכשיו הם בונים, שאמרת וישמרו את כל צורתו ועשו אותם, א\"ל לאו אעפ\"י שאינם עושים אותו עכשיו יהיו קורין בצורת הבית, ואני מעלה עליהם כאלו בבנינו עסוקים, ובפסיקתא שמואל אמר ואם נכלמו מכל אשר עשו צורת הבית, וכי יש צורת הבית, אלא אמר הקב\"ה הואיל ואתם מתעסקין בו כאלו אתם בונים בו עכ\"ד המדרש, ונראה לדקדק מלשונו שאמר בונים בו ולא אמר בונים אותו וכו', מפני שעניני הבנין הזה סתומים בלתי מפורשים, והביא הרד\"ק ז\"ל במדות תנאי השער ובלשכות הקודש, מדברי רז\"ל שאמרו במקצת דברים מזו הנבואה עתיד אליהו לדרשה, כלומר שאין אנו יודעים לדרשה עכ\"ל, גם הרמב\"ם ז\"ל כתב (בפ\"א מה' בית הבחירה) וז\"ל בנין העתיד להבנות אע\"פ שהוא כתוב ביחזקאל אינו מפורש ומבואר, ועפ\"י הדברים האלה אמר שמואל כאלו אתם בונים בו כלומר קצת ממנו וכו' המקצת שיבינו, אותו המקצת יהי' כאלו בנאו עכ\"ל התויו\"ט זלה\"ה, וכמו\"כ י\"ל בענין מצות המנורה והשמן. שלא הו' במציאות עדיין לקיימה בפועל, עד אחר גמר בנין המשכן, אבל צוה הבוי\"ת לעסוק בלימוד המצוה מידו והעסק בו נחשב כעשו\"נ וגורם השפעת תשובה וחכמה שהם הכרחיים להקדים לבנין המשכן והציווי על העשי' בפועל בבחי' עליונה ניתנה לאחר בנין המשכן. וע\"כ א\"ל הבוי\"ת עכשיו הציווי בלשון עתיד, ואתה תצוה וגו' סופך לצוות את בנ\"י.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 38,
      "char_length": 1294,
      "timestamp": "2025-02-06T19:31:38.751133"
    },
    {
      "id": "tetzaveh_p39",
      "text": "ובזה יתבארו דברי רש\"י ז\"ל במאמה\"כ להעלות נר תמיד, (עיין קושיא ג') בהקדם מה שפירשתי במאמה\"כ ופ' בהעלותך) אל מול פני המנורה יאירו שבעת הנרות, פרש\"י אל מול נר האמצעי שאינו בקנים אלא בגוף של מנורה, יאירו שבעת הנרות, ששה שעל ששת הקנים, שלשה המזרחיים פונים למול האמצעי וכו' וכן שלשה המערביים וכו', והקשו המפורשים דהול\"ל יאירו ששת הנרות, דהאמצעו זהו פני המנורה בעצם ונל\"פ דהנה יש פלוגתא בין הראשונים, בעשה מצוה דאורייתא ולא קיימה כתיקונה, ששינה או החסיר מפרטי המצוה אם וצא י\"ח המצוה כלל, וכמ\"ש העור (או\"ח סי' קפ\"ז) בהלכות ברהמ\"ז כל מו שמשנה המטבע או שלא הזכיר מה שחייבו חכמים להזכיר לא וצא י\"ח, כתב אחי הר' יחיאל מסופקני בהא דאמר לא וצא י\"ח אי לעיכובא קאמר או למצוה, והדעת נוטה דלמצוה קאמר ע\"כ, ונ\"ל כיון דברהמ\"ז דאורייתא לעיכובא קאמר וצריך לחזור, וכתב בחי' הגהות ס\"ל לרבינו דכיון דשינה המטבע הו\"ל כאילו לא אמר כלל עיי\"ש.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 39,
      "char_length": 814,
      "timestamp": "2025-02-06T19:31:39.331567"
    },
    {
      "id": "tetzaveh_p40",
      "text": "וכמו\"כ לענינינו דהנה שבעת הנרות כ\"א יש לו כוונה מיוחדת וחלק מכללות המצוה. ומעתה הי' סברא לומר שאף אם לא כיון המדליק להיות פונים ששת הנרות מול פנו האמצעי, ולא יצא י\"ח ו' הנרות, אבל מ\"מ קיים מצות נר האמצעי שהדליקו כמצותו, לזה שלל הכתוב לומר אל מול פני המנורה יאירו שבעת הנרות שכולן מצוה א' הם, ואם לא הדליק ו' הנרות כמצותו להיות פונים מול פני האמצעי, גם האמצעי שהוא נר המערבי לא יחול בו הנס להיות מאיר יומם ולילה, וכמ\"ש רז\"ל פעמים כבה וכו' ותליא בכח שלימות המצוה וקדושת המדליק, וז\"א אל מול פנו המנורה יאירו שבעת הנרות, כלל גם נר האמצעי בתנאי דאל מול פני המנורה, דאם שינה הו\"ל כאילו לא עשה כלום.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 40,
      "char_length": 592,
      "timestamp": "2025-02-06T19:31:39.729324"
    },
    {
      "id": "tetzaveh_p41",
      "text": "ויובן בזה דברי רשיז\"ל להעלות נר תמיד כל לילה ולילה קרוי תמיד, דבאמת מלת תמיד קאי על נר מערבי שהי' דולק תמיד לילה ויום כדאיתא בספרי ותו\"כ, אמנם נס התמידית בנר המערבי תליא בהדלקת הלילה וכח המצוה של כל שבעת הנרות כנ\"ל, ולז\"א כל לילה ולילה קרוי תמיד, אף שבפועל הי' התמידוות רק בנר המערבי, אבל ההכנה בכח הי' ע\"י הדלקת כל לילה, ולזה כל לילה ולילה קרוי תמיד, ועד\"ז יל\"פ לענינינו ואתה תצוה את בנ\"י וגו' להעלות נר תמיד, דע\"י הציווי והעסק במצות המנורה, נחשב להם כמעשה כמו בבנין ביהמ\"ק כנ\"ל, ויחול עליהם השפעת האור וכח התמידיות מעכשיו: וז\"א להעלות נר תמיד.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 41,
      "char_length": 545,
      "timestamp": "2025-02-06T19:31:40.023473"
    },
    {
      "id": "tetzaveh_p42",
      "text": "ונבוא לבאר דברי התנחומא קטן לכמה נמול וכו' (לעיל קושיא ד') דהנה פליגי הפוסקים הרא\"ש והרמ\"א והש\"ך בנימול תוך שמונה אם יצא בדיעבד אי צריך להטיף ממנו דם ברית, הרא\"ש והרמ\"א פסקו דיצא בדיעבד, ויש חולקים והביאו כמה ראיות דלא יצא דאל\"כ בנולד בין השמשות למה הצריכוהו חז\"ל להמתין על יום ט' יעיי\"ש, ואפשר דזה תליא בפלוגתא אם דרשינן טעמא דקרא אף להקל, ואף היכא שנגלה לנו טעם המצוה מ\"מ אולי יש עוד טעמים הכמוסים מודועתינו וכמ\"ש החת\"ס, וטעם המילה שניתנה לשמיני איתא במדרש במקו\"א דהקב\"ה חס עליו עד שיהי' בו כח ולמה דייקא ביום ח' יהי' בו כח. כתב האוהחה\"ק דביום הח' כבר עבר עליו שבת והשבת נותן הכח. וכמו שאמרו רז\"ל שכל העולם הי' רופף עד שבא שבת ונתחזק, ובמקו\"א איתא במדרש בחי' אחרת ע\"פ משל למטרונא עיי\"ש, וי\"ל שאלו הטעמים לא היו שייכים אצל יצחק אבינו דכל ענין לידתו הי' בדרך נס נפלא.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 42,
      "char_length": 767,
      "timestamp": "2025-02-06T19:31:40.297056"
    },
    {
      "id": "tetzaveh_p43",
      "text": "ומעתה י\"ל דספוקת המדרש הוא בנימול תוך שמונה אם וצא בדיעבד, ולכן לא אמרו קטן לכמה ימול לכתחילה, דזה מפורש בקרא וביום השמיני ימול ורק שואל לכמה נימול פי' אם נימול בדיעבד קודם זמנו אם יצא י\"ח ופשטו לי' דנימול לשמונה, דאף בדיעבד לא יצא כהכרעת הפוסקים הנ\"ל, והראי' כשם שנימול יצחק דאלמלי יוצאין בדיעבד גם לפני זמנו, אזי הו' אאע\"ה עושה כן לכתחילה דאצלו לא היו שייכים כל אלו הטעמים, דלגודל תשוקתו הי' ממהר להקדים המצוה, ועכ\"פ יש ללמוד מהלכה זו דאף שמשתוקקין לקיום המצוה כמו אאע\"ה, מ\"מ אין להקדים לפני הזמן המוגבל בתורה.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 43,
      "char_length": 512,
      "timestamp": "2025-02-06T19:31:40.665440"
    },
    {
      "id": "tetzaveh_p44",
      "text": "ובזה יובן דהבוכ\"ע אמר למרע\"ה פרשת המנורה, ואפשר דלגודל תשוקתו ירצה לקיימה מיד, דהרי הי' הצורך להקדים הציווי מטעמים שנזכרו לעיל, וכיון שנאמרה לו ישתוקק לקיימה מיד, לזה דקדק הקב\"ה להודיעו ואתה תצוה את בנ\"י בלשון עתיד דקיום המצוה בפועל יהי' רק לעתיד ועדיין לא הגיע הזמן לעשותו, וזהו בנין אב לכל מקום שהגבילה התוה\"ק זמן אין לנו רשות להקדימו ואף בדיעבד וליכא בזה משום זריזין מקדימין למצות, והבוכ\"ע יעזור שנזכה במהרה לראות האור האמיתי והגאולה שלימה בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו במהרה בימינו אמן.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 44,
      "char_length": 512,
      "timestamp": "2025-02-06T19:31:40.933144"
    },
    {
      "id": "tetzaveh_p45",
      "text": "ואתה תצו' את בנ\"י ויקחו אליך וגו' דקדק הכלי יקר ז\"ל דמלת ואתה מיותרת, והול\"ל צו את בני ישראל וגו', ומ\"ש הרמב\"ן ז\"ל לומר שהקפיד ד' שלא יעשה זה ע\"י שליח וכו', הא גופא קשיא למה הקפיד במצו' זו יותר מבכל המצות, וכן בסמוך נאמר ואתה הקרב אליך את אהרן אחיך וגו', גם שם צריך ישוב מלת ואתה.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 45,
      "char_length": 280,
      "timestamp": "2025-02-06T19:31:41.172894"
    },
    {
      "id": "tetzaveh_p46",
      "text": "ב) במד\"ר ור\"פ ל\"ח) וזה הדבר אשר תעשה להם הה\"ד (תהלים קי\"ט) לעולם ד' דברך נצב בשמים, אמר דוד כשם שאתה אמת וכו' כך דברך אמת שנאמר לעולם ד' דברך נצב בשמים א\"ת בשמים אלא כשמים, כשם שמתחלה גזר ונעשו שמים אף דבר שדברת לקדש את אהרן ואת בניו קיים לעולם, שנא' והיתה לו ולזרעו אחריו ברית כהונת עולם וכו' לכך נאמר זה הדבר עכ\"ד המדרש, ראוי להבין מדוע צריך ילפותא על זה, ומה\"ת שאינו קיים לעולם, והבטחה לטובה מפי הקב\"ה אף על תנאי אינו חוזר, גם איך נלמד מקרא וזה הדבר שקיים לעולם.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 46,
      "char_length": 465,
      "timestamp": "2025-02-06T19:31:41.346447"
    },
    {
      "id": "tetzaveh_p47",
      "text": "ונל\"פ בהקדם דברי ק\"ז הישמח משה זלה\"ה (בפ' מעות) לפרש דברי המדרש שכל הנביאים התנבאו בכה, כך משה התנבא בכה, מוסיף עליהם משה שהתנבא בזה הדבר, וביאר הוא ז\"ל כי בעת שאמר בבחי' כה בדיבור של עצמו היה ע\"ו שליח, אבל בעת שאמר בבחי' זה הדבר, שכינה הי' מדברת מתוך גרונו, והו\"ל ע\"י עצמו כביכול, ולבני עלי' אמר משרע\"ה בבחי' זה הדבר, ולפשוטי עם בבחי' כה עיי\"ש עפ\"י דרכו, ולדרכנו אפ\"ל דראתה חכמתו ות' שעתידין קרח ועדתו לחלוק על כהונתו של אהרן, והמשיך לדעתו את כל העדה, כמ\"ש ויקהל עליהם קרח את כל העדה וגו' וכבר ביארנו (בדברנו פ' קרח) שטענתו הי' לילך אחר הכרעת הרוב, ומטעם דאין ממנין פרנס על הצבור אא\"כ נמלכים בצבור, ובאמת לא שייך בזה למיזל אחר רובא, כיון שהקב\"ה צוה כן למנות את אהרן, וכך הי' רצונו ית' שבמינוי זה לא יהיו נמלכים בצבור, ודעת הרוב לא מעלה ולא מוריד, ואולי דלכן נמסר להם ציווי זה בבחי' זה הדבר, כדי שישמעו דיבורו ות' דשכינה הי' מדברת מתוך גרונו, ודיבורו ית' נצחי ולא יחול בו שינוי לעולם.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 47,
      "char_length": 884,
      "timestamp": "2025-02-06T19:31:41.597688"
    },
    {
      "id": "tetzaveh_p48",
      "text": "וז\"ש במדרש הנ\"ל וזה הדבר אשר תעשה להם הה\"ד לעולם ד' דברך נצב בשמים וכו' א\"ת בשמים אלא כשמים וכו' אף דבר שדברת לקדש את אהרן וכו' קיים לעולם וכו' לכך נאמר זה הדבר, רי\"ל דע\"כ נאמרה בבחי' זה הדבר, שהוא דיבורו ית' והוא נצחי וקיים לעולם: ולז\"א ואתה הקרב אליך את אהרן וגו', וע\"ד שפי' הרמב\"ן ז\"ל עה\"פ ואתה תצו' וגו', שהקפיד אד' שלא יעשה זה ע\"י שליח, ולדרכנו אפ\"ל הכוונה, כי בחי' זו שהי' השכינה מדברת מתוך גרונו לא הי' אלא במשרע\"ה לבדו. וכדי שתהי' קדושתו של אהרן ובניו נצחי וקיים לעולם, הוצרך להיות ע\"י משרע\"ה לבדו לא ע\"י שליח והבן.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 48,
      "char_length": 523,
      "timestamp": "2025-02-06T19:31:42.047006"
    },
    {
      "id": "tetzaveh_p49",
      "text": "ועד\"ז יתבאר בענין המנורה אומרו ואתה תצו' את בנ\"י וגו', וכדברי הרמב\"ן ז\"ל שהקפיד ד' שלא יעשה זה ע\"י שליח. דלפי שהי' שכינה מדברת מתוך גרונו ה\"ה דיבורו ית' כביכול בעצמו ועי\"ז המשיך בו קדושה נצחי לדורות ומאמרו להעלות נר תמיד קיים לעולם מה שא\"א ע\"י שליח.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 49,
      "char_length": 249,
      "timestamp": "2025-02-06T19:31:42.322610"
    },
    {
      "id": "tetzaveh_p50",
      "text": "באופן אחר י\"ל למה נכתבה מצות הדלקת המנורה בפרשה זו, שהיה מקומה ראוי להיות אחרי גמר עשיית המשכן וכליו. והאברבנאל ז\"ל כתב לפרש דברי הכתוב ואתה תצוה כלומר סופך לצוות את בני ישראל, כי עיקר מצוה זו הלא היא כתובה בפרשת אמור, וכאן הודיעו הקב\"ה שהוא עתיד לצוותו עליה. (והם דברי רש\"י ז\"ל בפ' אמור שם) ודבריו תמוהים כמו שהקשה בכלי יקר מפני מה הודיעו הקב\"ה מראש מקדם שהוא עתיד לצוותו במצוה זו, ולא מצינו כזאת בשאר מקומות, אלא בעת שעלה ברצונו יתברך לצוות את בני ישראל, היה בא דברו למשה להגיד להם דבר ה', ולא הקדים לבשר למשה שהוא עתיד לצוותם.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 50,
      "char_length": 529,
      "timestamp": "2025-02-06T19:31:42.464760"
    },
    {
      "id": "tetzaveh_p51",
      "text": "ב) בילקוט פרשה זו ורמז שע\"ג) איתא ריב\"ב אומר אין צו בכל מקום אלא זירוז וכו' רשב\"י אומר אין ציווי בכל מקום אלא חסרון כיס שנא' צו את בני ישראל ויקחו אליך שמן זית זך וכו' ע\"כ. וצריך ביאור למה הוצרך הכתוב לזרז במצות הדלקת המנורה, והלא כמה מצוות איכא שוש בהם חסרון כיס ולא כתיב בהו לשון זירוז.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 51,
      "char_length": 288,
      "timestamp": "2025-02-06T19:31:42.740046"
    },
    {
      "id": "tetzaveh_p52",
      "text": "ולענינינו נראה לומר בהקדם דברי האה\"ח הקדוש לפרש אומרו ויקחו אליך וגו' ע\"ד שאמרו ז\"ל במס' שבת (דף כ\"ב ע\"ב) וז\"ל מחוץ לפרוכת העדות עדות היא לכל באי עולם שהשכינה שורה בישראל וכו' מאו עדות אמר רבא זה נר מערבי שנותן בה שמן כמדת חברותיה וממנה היה מתחיל ובה היה מסיים וכו'. והנה אמרו ז\"ל (ברבה ותנחומא פ' פקודי) שליצני הדור היו מתלוצצים על משה לאמר אפשר שהשכינה שורה על מעשה של משה וכו' ע\"כ. הרי כו לא היו מצדיקים אפילו מישראל שתשרה השכינה במשכן, וכפי זה הגם ששרתה השכינה ביום א' בניסן, עכ\"ז אין זה סימן לתמידות שתקבע השכינה מקומה במשכן, אבל בנס נר מערבי הוא עדות לכל באי עולם שהשכינה שורה בישראל, והוא מאמר ה' ויקחו אליך פירוש אליך נוגע הדבר, כו בזה תתחזק נבואתך שיכירו ויצדיקו נבואתך וכו' ע\"כ דבריו. היוצא מזה כי המנורה היא לאות לישראל על אמיתת נביאותו של משה, שהרי ע\"ו הנס שנעשה בנר מערבי נודע לכל באי עולם שהשכינה שורה בישראל וקבעה משכנה בתוכם.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 52,
      "char_length": 841,
      "timestamp": "2025-02-06T19:31:42.922751"
    },
    {
      "id": "tetzaveh_p53",
      "text": "ומעתה נחזי אנן דהתינח אחר שהוקם המשכן והדליקו בו את המנורה, עיני כולם חזו כי השכינה שורה במשכן. ונסתתמו פיותוהם של ליצני הדור, אמנם בטרם הוקם המשכן לא נראה עדיין בעליל שהשכינה שרויה בישראל, וכיון שכן היה מקום לחוש פן ימצאו אנשים שלא ירצו לתת נדבתם לבנין המשכן, לצד שהם מפקפקים עדיין אם תשרה בו השכינה. והנה הקב\"ה צוה ויקחו לו תרומה לבנות המשכן מנדבותיהם של ישראל, ואילו לא ירצו לתת נדבתם לא תהיה עדות בישראל שהשכינה שורה בהם, שהרי בטרם הוקם המשכן לא יתכן להדליק המנורה שהיא עדות לכל באי עולם שהשכינה שורה בקרב ישראל. וכדי להוציא מחשש זה הודיע הקב\"ה למשה ואתה תצוה את בנו ישראל, פירוש שאתה עתיד לצוותם על הדלקת המנורה, וכמ\"ש האברבנאל ז\"ל, ואז יוודע לעיני כולם כי השכינה שורה במשכן ע\"ו הנר המערבי שנעשה בו נס. ומובן היטב הטעם שהוצרך הקב\"ה להודיע מראש שהוא עתיד לצוותו על הדלקת המנורה, כדי שוזדרזו בנו ישראל לתת נדבתם, שהרי מובטחים הם שאח\"כ בעת הדלקת המנורה עין בעין יראו כי השכינה שורה במשכן. ובזה נתיישב גם מה שאמר הכתוב תצוה לשון זירוז שהרי דבור זה נאמר להם לזרזם בנתינת נדבתם למשכן, והוא דבר שיש בו חסרון כיס גדול, כי נתנו נדבתם כסף וזהב וכל שאר צרכי המשכן.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 53,
      "char_length": 1058,
      "timestamp": "2025-02-06T19:31:43.374352"
    },
    {
      "id": "tetzaveh_p54",
      "text": "וכדבר הזה הנני אומר גם לענינינו. כי הנה כל מי שמוח לו בקדקדו רואה גודל הנחיצות של התאחדות הרבנים, אמנם ישנם גם שואלים ומקשים קושיות כו אין די בפעולות שהתאחדות הרבנים עושה, ומן הצורך להוסיף עליהם כהנה וכהנה, ואכן אמת נכון הדבר, אך דעו נא כי ישנם ענינים נחוצים רבים לאין שיעור שהיה ביכולתה לפעול והמניעה היא חסרון הממון, ויכולים לאמר כדלעיל שיביאו בני ישראל את הממון, ואם יהיה הממון לעזרתם יוכלו לפעול גדולות ונצורות, ויהי' עדות שהשכינה שורה בישראל, ומה שאפשר עוד לפעול, וכל זמן שיש חסרון ממון לא יתכן להראות זאת, וכמו שמצינו במשכן שהקב\"ה שם עדות ביעקב שהשכינה שורה במשכן ע\"ו נר מערבי, ואעפ\"כ לא נתגלתה עדות זו אלא ע\"י שהביאו בנו ישראל נדבתם כסף וזהב, ובעת שהביאו נדבתם הוצרכו להאמין, כי אחרי שיבנה המשכן יראו עיניהם השראת השכינה בו.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 54,
      "char_length": 731,
      "timestamp": "2025-02-06T19:31:43.870259"
    },
    {
      "id": "tetzaveh_p55",
      "text": "ואתה תצוה את בני ישראל ויקחו אליך שמן זית זך כתית למאור וגו', יש לדקדק באומרו ויקחו דהול\"ל ויתנו, גם מ\"ש אליך צ\"ב.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 55,
      "char_length": 114,
      "timestamp": "2025-02-06T19:31:44.209532"
    },
    {
      "id": "tetzaveh_p56",
      "text": "ב) במדרש רבה (פרשה ל\"ו סי' א') ואתה תצוה הה\"ד (ירמי' י\"א) זית רענן יפה פרו תואר קרא ה' שמך וכי לא נקרא ישראל אלא כזית הזה בלבד וכו', אלא מה הזית הזה עד שהוא באילנו מגרגרין אותו, ואח\"כ מורידין אותו מן הזית ונחבט, ומשחובטין אותו מעלין אותו לגת ונותנין אותן במטחן, ואח\"כ טוחנין אותן ואח\"כ מקיפין אותן בחבלים ומביאים אבנים ואח\"כ נותנין את שומנור כך ישראל באין עובדי כוכבים וחובטין אותם ממקום למקום וחובשים אותן וכו', ואח\"כ עושין תשובה והקב\"ה עונה להם וכו', הוי זית רענן ופה פרי תואר, ד\"א מה ראה ירמי' למשול אבותינו כזית, אלא כל המשקין מתערבים זה בזה והשמן אינו מתערב אלא עומד, כך ישראל אינם מתערבים עם העכו\"ם וכו', ד\"א כל המשקים אדם מערב בהם ואינו יודע איזה תחתון ואיזה עליון, אבל השמן אפילו אתה מערבו בכל המשקין שבעולם הוא נתון למעלה מהן, כך אבותינו בשעה שהיו עושים רצונו של מקום נצבים למעלה מן העכו\"ם, שנאמר (דברים כ\"ח) ונתנך ה' אלקיך עליון, הוי זית רענן יפה פרי תואר עכ\"ד המדרש וצ\"ב קישור דרשות אלו להכא.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 56,
      "char_length": 903,
      "timestamp": "2025-02-06T19:31:44.298475"
    },
    {
      "id": "tetzaveh_p57",
      "text": "ג) במדרש תנחומא ואתה תצוה וגו' זש\"ה (שיר ד') הנך ופה רעיתי הנך יפה עיניך יונים, מה יונה זו, כל העופות כשהן נשחטין הן מפרכסין אבל היונה זו פושטת צוארה, כך אין אומה בעולם נהרגת על קדושת שמו ומוסרת עצמה להריגה אלא ישראל שנא' (תהלים מ\"ד) כי עליך הורגנו כל היום עכ\"ד המדרש וצ\"ב הקישור.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 57,
      "char_length": 280,
      "timestamp": "2025-02-06T19:31:44.740887"
    },
    {
      "id": "tetzaveh_p58",
      "text": "ולבאר הענין נקדים דברי בעה\"ע כתית למאור, כתית רמז ת\"ו ת\"כ שנים הי' נוהג הדלקת המנורה, היינו ב' המקדשים שעמדו כ\"כ שנים, וק\"ז הישמח משה הקשה דעיקר חסר היינו הדלקת בית השלישי שיבנה ב\"ב, והאריך בהקדמה נפלאה לבאר עפ\"י משל דהב' מקדשות שנחרבו הוו הכנה לקבל אור קדושת הבית השלישי עיי\"ש, ובא הרמז במלת כתית לרמז שיכתתו ויחרבו אלו המקדשים, וכ\"ז הכנה להעלות נר תמיד בבית השלישי שיהי' נצחי ותמידי עכ\"ד ז\"ל, ובאמת בחינה זו מבוארת במדרש רבינו בחיי וז\"ל במדרש כתית זה מקדש ראשון שעמד ת\"י שנים, מקדש שני ת\"כ שנה. והמדרש הזה ירמוז לשני מקדשים, והי' ראוי לרמוז גם השלישי העתיד, אבל יתכן לומר כו המדרש הזה אפשר שירמוז על המקדשים שיהי' זמנם קצוב, ולפי ששניהם עתידים ליחרב ולהיותם מרמס, לכך נאמר הרמז בשניהם בלשון כתית שהוא לשון כתישה ומרמס, אבל הבית השלישי העתיד וכו', הנה נרמז במלת למאור וכו' והוא הבטחה לחזרת השכינה והוא שאמר דוד המע\"ה ה' אורי וישעי וכו', ולפי שאין זמן לעמידת בנינו. אבל הוא עומד לעד לעולם, לכך אמר להעלות נר תמיד, כלומר כי מעלתו תמידית ושוב אינה פוסקת עכ\"ל.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 58,
      "char_length": 957,
      "timestamp": "2025-02-06T19:31:44.916732"
    },
    {
      "id": "tetzaveh_p59",
      "text": "ואפ\"ל עוד ברמז הכתוב עפי\"ד המדרש הנ\"ל, למה נמשלו ישראל לזית וכו', ויתבאר עפימ\"ד במד\"ר (ר\"פ מעות) אמר משה רבון העולמים אם היינו ערלים או עובדי עבודת כוכבים או כופרי מצות לא היו שונאין אותנו, ואינן רודפין אחרינו, אלא בשביל תורה ומצות שנתת לנו הלכך הנקמה שלך עכ\"ד המדרש נמצא דע\"י שאין ישראל מתערבים באומות ונבדלים מהם וממעשוהם, ע\"כ סובלים מהם עול גליות, אמנם זהו הצלתם, ובזכות זה יהיו נגאלים, גם דהגלות צורך הגאולה כמ\"ש השלה\"קל ובזכות שסובלין ישראל עול הגלות ואינם דוחקין את הקץ יזכו אל הגאולה, נמצא דכל הג' פירושים שבמדרש הא בהא תליין, מה השמן אינו מתערב וכו', כך ישראל אין מתערבין עם עכו\"ם, ומה\"ט האומהאע חובטין אותן וחובשין אותן ונמשלו לזית שמוציא שמנו ע\"ו כתישה כך ישראל ע\"י יסורי הגלות באים לידי תשובה והקב\"ה עונה להם, ועי\"ז יזכו לגאולה וותעלו למעלה מכל האומות, כדמיון השמן שהוא נתון למעלה מכל המשקים, כך ישראל בשעה שעושין רצונו של מקום נצבים למעלה מן העכו\"ם, נמצא שרמז הכתוב כאן בחי' הגלות והגאולה, שע\"ש זה נמשלו ישראל לזית, ובזה אפ\"ל רמז הכתוב כתית למאור להעלות נר תמיד כתית רומז על החורבן והגלות כדברי המדרש הובא ברבינו בחיי, גם כתית הוא לשון כתישה, וישראל נמשלו בזה לזית שאינו מוציא שמנו אלא ע\"ו כתישה וע\"י שסובלין עול הגליות יזכו למאור להעלות נר תמיד, להשפעת אורו ות' ולבנין המקוה שתהי' מעלתו תמידית ונצחי.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 59,
      "char_length": 1213,
      "timestamp": "2025-02-06T19:31:45.368623"
    },
    {
      "id": "tetzaveh_p60",
      "text": "ובזה נבין דברי התנחומא הנ\"ל (בקושיא ג') זש\"ה הנך יפה רעיתי עיניך יונים, מה יונה זו פושטת צוארה, כך ישראל מוסרין עצמם להריגה על קדושת שמו ית', ובחי' זו נרמז במאמה\"כ כתית למאור כדמיון הזית שמוציא שמנו ע\"ו הכתישה, ובזכות זה יתעלו ישראל ויזכו אל הגאולה וא\"ש הקישור.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 60,
      "char_length": 261,
      "timestamp": "2025-02-06T19:31:45.937848"
    },
    {
      "id": "tetzaveh_p61",
      "text": "גם מצינו בנבואת זכרי' (זכרי' ד') שתרמוז המנורה על בנין השלישי ובחי' גאולה העתידה, ואמר הנביא ראיתי והנה מנורת זהב כלה וגלה על ראשה ושבעה נרותי' עלי' שבעה ושבעה מוצקות לנרות אשר על ראשה, ושנים זתים עליה אחד מימין הגלה ואחד על שמאלה ואען ואומר וגו' מה אלה אדוני ויען המלאך הדובר בי ויאמר אלו הלא ידעת מה המה אלה ואומר לא אדוני ויען ויאמר אלי לאמר זה דבר ה' אל זרובבל לאמר לא בחיל ולא בכח כי אם ברוחי אמר ה' צבאות (פרש\"י שבעה ושבעה מוצקות כל נר ונר באין שבעה צנורות קטנים שהשמן זב מן הגולה דרך אותן מוצקות לכל נר ונר, ושנים זתים עלי' אצלה שני אילנות שהזתים גדילים בהם אחד מימין הגולה וכו', מה אלה אדוני, מה זה שהזתים נמסקים מאליהם והשמן בא אל הנרות מאליו, זה דבר ה' אל זרובבל זה סימן לך להבטיח את זרובבל כשם שהזתום והשמן הזה נגמר מאליו לכל דבריו. כך לא בחיל ולא בכח שבכם תעשו את בנין ביתי, כי אם ברוחי, אני אתן את רוחי וגו' ולא תצטרכו לעזרת אדם עכ\"ל רשיז\"ל). ואען ואומר אליו מה שני הזתים האלה על ימין המנורה ועל שמאלה וגו' ויאמר אלה שנו בני היצהר העומדים על אדון כל הארץ, (פירש\"י שנו בני היצהר קרן כהונה ומלכות הנמשחים בשמן המשחה העומדים על אדון כל הארץ לבקש מלפניו להחזיר את גדולתם, עוד פי' שני בני היצהר וצר טוב ויצר הרע מתהפך לטוב בזכות התורה עכ\"ל רשיז\"ל), ועד\"ז פו' המצודות שירמוז על גאולה העתידה שלא תהי' בכח זרוע אדם דומה לעריכת נרות המנורה שהי' נעשה מאליו מבלי טורח אדם עורך את הנרות ומציק בהם את השמן כן יעשה בנין הבית בלא כח אדם אלא ברוח ה' וברצונו ית', אלה שני בני היצהר, ר\"ל המלך המשיח וכהן גדול אשר ימשחו בשמן המשחה זה למלכות וזה לכהונה גדולה, העומדים על אדון כל הארץ לבקש רחמים להחזיר הממשלה לבית ישראל, ובמעשה דריכת הזתים והמשכת השמן מעצמו ירמוז שיחזור הממשלה לא בחיל ולא בכח כי אם ברוחו ע\"כ, מבואר דפרשת המנורה רומזת על גאולה העתידה ובנין המקו' שלא יבואו באמצעות עזרת אדם כ\"א ברוח ה' וברצונו ית\"ש.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 61,
      "char_length": 1709,
      "timestamp": "2025-02-06T19:31:46.096270"
    },
    {
      "id": "tetzaveh_p62",
      "text": "ובזה יובן משה\"כ ויקחו אליך ולא אמר ויתנו, כי לא תהי' בעזרת בנ\"א כלל כ\"א בהשפעה מן השמים, וישראל יהיו המקבלים לא הנותנים, ואמר אליך ירמוז על משרע\"ה כו בזכותו ובזכות התורה יגאלו ישראל בגלות האחרון כמ\"ש האוהחה\"ק עה\"פ ויקחו אליך בשם זו\"ח עיי\"ש, ובזה אפ\"ל אמרם ז\"ל (במדבר רבה פ' ט\"ו סי' ד') נתקשה משה במעשה המנורה וכו' א\"ל הקב\"ה טול ככר זהב והשליכו לאור וכו' והיא מעצמה נעשית, וירמוז לדרכינו כי השיג משרע\"ה דוחקא דגלותא בתראה, ונתקשה במעשה המנורה היינו בחי' הגאולה הנרמז בה, איך יזכו ישראל להתרומם מתוך שפלות נוראה כזו, הראה לו הקב\"ה שתהי' נעשית מאלי' מן השמים בלי פעולה גשמית מעשה ידי אדם.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 62,
      "char_length": 585,
      "timestamp": "2025-02-06T19:31:46.917508"
    },
    {
      "id": "tetzaveh_p63",
      "text": "ואתה תצו' את בנ\"י וגו' במדרש ילקוט הנך יפה רעיתי הנך יפה עיניך יונים, א\"ל הקב\"ה דוגמא שלך דומה ליונה וכו', כיצד כשהי' נח בתיבה מה כתיב ותבוא אליו היונה לעת ערב והנה עלה זית וגו' א\"ל הקב\"ה מה היונה הביאה אורה לעולם, אף אתם שנמשלתם ביונה הביאו שמן זית והדליקו לפני שנא' ואתה תצו' עכ\"ד המדרש, וצ\"ב דלא נתבאר איך הביאה אורה לעולם בעלה הזית אשר טרף בפי', ומה ענינו אל מצות המנורה והשמן דעסיק בי'.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 63,
      "char_length": 391,
      "timestamp": "2025-02-06T19:31:47.202346"
    },
    {
      "id": "tetzaveh_p64",
      "text": "ואפ\"ל בדרך רמז עפי\"מ שפירשתי בדברי הגמ' ביצה ל\"ב ע\"א) א\"ר נתן בר אבא א\"ר כל המצפה לשולחן אחרים עולם חשך בעדו, דהכוונה על מאור עיני השכל שנחשך מלראות האמת, מפני שנעשה משוחד לנטות אל דעת המחזיקים בו, כי השוחד יעור עיני פקחים, ועד\"ז פירשנו (עיין בדברנו לעיל פ' משפטים באורך) במתניתין (סוף פאה) כל דיין שלוקח שוחד ומעה את הדין אינו מת מן הזקנה עד שעיניו כהות שנא' כי השוחד יעור פקחים והקשו המפרשים דהרי רואין בחוש כמה מקבלי שוחד שלא נתעוורו בימי זקנתם, ויש שתירצו דהכוונה על עין הנשמה בעוה\"ב, אולם פשטות הלשון אינו סובל פי' זה, שהרי אמרו רז\"ל אינו מת מן הזקנה וכו', משמע שיענש בעוורון בעוה\"ז לפני מיתתו, ולדרכנו הכוונה על עיני השכל שיהיו עיניו כהות ולא יראה האמת, ואף בדין שלא יקבל שוחד לא ישיג דרך האמת מפני שיחשיך מאור שכלו.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 64,
      "char_length": 722,
      "timestamp": "2025-02-06T19:31:47.408042"
    },
    {
      "id": "tetzaveh_p65",
      "text": "ובזה יל\"פ דברי המדרש המל שהיונה הביאה אורה לעולם, עפימ\"ש רז\"ל והנה עלה זית ערף בפיה, אמרה יונה מוטב שיהיו מזונותי מרורין כזית בידי הקב\"ה, ולא מתוקין כדבש בידי בשר ודם, ומי ששם מאמר זה לנגד עיניו תמיד: ובוטח רק על מתנתו ית' ולא למתנת בשר ודם, יראה אור לעולמים ולא ילקה בעוורון עיני השכל, וז\"ש שהיונה הביאה אורה לעולם, בעלה הזית שטרף בפיה, למדה דעת לבני אדם איך שיזכו לאורה ולא יחשיך מאור עיניהם והנה ענין המנורה והשמן ירמוז לחכמת התורה, וע\"כ הסמיכו חז\"ל דרשה זו שהיונה הביאה אורה לעולם. שבדרך זה תהי' חכמת התורה מתקיימת בידך והבן.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 65,
      "char_length": 529,
      "timestamp": "2025-02-06T19:31:47.767068"
    },
    {
      "id": "tetzaveh_p66",
      "text": "ואתה הקרב אליך את אהרן אחיך וגו' במד\"ר (פל\"ז ס\"ד) הה\"ד (תהלים קי\"ט) לולי תורתך שעשועי אז אבדתי בעניי, כשאמר הקב\"ה למשה ואתה הקרב אליך הרע לו, אמר לו תורה היתה לי ונתתי' לך שאלולי היא אבדתי עולמי עכ\"ד המדרש, וצ\"ב מ\"ש שהרע למשה ואדרבה מצינו שהי' שמח על גדולתו של אהרן, וכמ\"ש רש\"י ז\"ל (פ' שמות עה\"פ גם מתמול) שמה\"ט סירב משרע\"ה לילך בשליחותו ות' למצרים, שלא הי' רוצה ליעול גדולה על אהרן אחיו שהי' גדול הימנו ונביא הי', ומדוע כשא\"ל הקב\"ה ואתה הקרב אליך את אהרן אחיך הרע לו, גם במה נתקררה דעתו על שא\"ל הקב\"ה תורה היתה לי ונתתיה לך.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 66,
      "char_length": 525,
      "timestamp": "2025-02-06T19:31:48.046310"
    },
    {
      "id": "tetzaveh_p67",
      "text": "ואפ\"ל שכל זה היתה לצד ענותנותו הגדולה של משרע\"ה, וע\"כ החזיק את אהרן לגדול ממנו, ושהוא אינו כדאי להעשות שליח בדבר זה לקרב את אהרן ולקדש אותו, וראוי' להעשות ע\"י הבוית\"ש כביכול בעצמו וכעי\"ז מצינו במד\"ר פ' שמות (פ' ג' סו' ט\"ז) עה\"פ שלח נא ביד תשלח. אמר לפניו רבש\"ע בי אתה רוצה לגאול בניו של אברהם שעשה אותך אדון על כל בריותיך שלח נא ביד תשלח אמר לפניו איזה חביב לאדם בן אחיו או בן בנו הוי אומר בן בנו. כשבקשת להציל לוט בן אחי אברהם, ביד המלאכים שלחת להצילו, בניו של אברהם שהם ס' רבוא בידי אתה משלח להצילם, שלח ביד המלאכים שאתה רגיל לשלח עכ\"ד המדרש ובאמת אין זה קושיא, דהרי גדולים צדיקים יותר ממלאכי השרת ואמרז\"ל גדולים מעשה הצדיקים יותר ממעשה שמים וארץ. אבל משרע\"ה לגודל ענותנותו לא החזיק את עצמו ראוי וכדאי להיות השליח בדבר זה וכמו\"כ כשנצטוה ואתה הקרב את אהרן הרע לול שהוא יהי' השליח בדבר זה, שלגודל שפלותו בעיני עצמו חשב שיהי' זה לפחיתות כבוד לגדולתו של אהרן.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 67,
      "char_length": 857,
      "timestamp": "2025-02-06T19:31:48.349636"
    },
    {
      "id": "tetzaveh_p68",
      "text": "והשיב לו הקב\"ה תורה היתה לי ונתתי' לך וכו', ועפימאיד במד\"ר (ר\"פ נשא) הה\"ד יקרה היא מפנינים מדבר בקהת וגרשון, אע\"פ שגרשון בכור ומצינו שבכל מקום חלק הכתוב כבוד לבכור, לפי שהי' קהת טוען הארון ששם התורה הקדימו הכתוב לגרשון וכו', וכתב שם הכלי יקר ז\"ל דהיא גופא קשיא למה לא מסר משא הארון אל הבכור לכבדו ביתר שאת ועוז התורה וכו', ותירץ שרצה הקב\"ה ללמוד דעת את העם שיכבדו את לומדי התורה וכו' כדרך שמנה את קהת תחלה בעבור משא דבר ה' אשר אתו, ואלו הי' נותן הארון לגרשון הבכור, הייתי אומר שבעבור הבכורה מנאו תחלה, ע\"כ מסר הארון אל קהת ומנאו תחלה וידעו הכל חשיבות התורה שהוא מוקדם לכל עכת\"ד, וז\"ש לו הקב\"ה תורה היתה לי ונתתיה לך, ואף לפי דעתך שאהרן גדול ממך, מ\"מ להראות חשיבות התורה ראוי שיהי' לך קדימה עליו ושתהי' השליח לקרב אותו ולקדשו, ובזה נתקררה דעתו של משה, אע\"פ שהי' שפל בעיניו, אבל בכח התוה\"ק הי' לו התחזקות וחשיבות התוה\"ק הוא למעלה מכל דבר, וע\"כ בזה נח דעתו.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 68,
      "char_length": 854,
      "timestamp": "2025-02-06T19:31:48.893661"
    },
    {
      "id": "tetzaveh_p69",
      "text": "ואפ\"ל עוד עפ\"י אמרם ז\"ל דלע\"ל יהיו הלוים כהנים, וסמכו זה עה\"פ והכהנים הלוים בני צדוק, ופי' בספה\"ק דזה הי' טעותו של קרח שחשב שיהי' עולם התיקון מיד ויהיו הלוים כהנים, ומה\"ט חלק על כהונתו של אהרן. והנה גם משרע\"ה הי' מצפה שיהי' עולם התיקון מיד: דמה\"ט רצה ליכנס לארץ. שאם הי' הוא בונה ביהמ\"ק לא היו האויבים יכולים להחריבו, כאמרז\"ל (סוטה ט' ע\"א) דלא שלעו האויבים במעשה ידיו. וממה שצוהו הקב\"ה ואתה הקרב את אהרן אחיך וגו', שפט שעדיין לא הגיע זמן תיקון השלם, והכהנים בלבד יהיו כהנים ולא הלוים, וע\"כ הרע למשה כו השיג הירידה הגדולה שיקרה לישראל בסיבת החורבן והגלויות, ואיך יזכו ישראל להתרומם מהשפלות הנורא לזה ניחמו הקב\"ה וא\"ל תורה היתה לי ונתתיה לך, כי באמצעות התורה ישיגו ישראל להיגאל, וכמ\"ש האור החיים הק' (בפ' שמות) עה\"פ וארד להצילו וזל\"ק וטעם שנסתכנו ישראל במצרים בבירור שער הנו\"ן, לצד שלא הוו בני תורה, משא\"כ דורות האחרונים באמצעות תורתם ישיגו ליכנס לשער הנו\"ן ולהוציא בלעו מפיו, ואז ספו תמו בחי' הטומאה וכו' עכ\"ל, ובזה נתקררה דעתו של משרע\"ה, ולז\"א לולי תורתך שעשועי אז אבדתי בעניי, ורק בכח התוה\"ק נזכה להיגאל בב\"א.",
      "source_file": "Tetzaveh.txt",
      "chumash": "שמות",
      "parsha": "tetzaveh",
      "paragraph_index": 69,
      "char_length": 1010,
      "timestamp": "2025-02-06T19:31:49.314169"
    }
  ],
  "shape": [
    70,
    768
  ],
  "created_at": "2025-02-06T19:31:49.789310"
}