{
  "paragraphs": [
    {
      "id": "mishpatim_p0",
      "text": "ואלה המשפטים אשר תשים לפניהם, ברש\"י ז\"ל כל מקום שנא' אלה פסל את הראשונים ואלה מוסיף על הראשונים מה הראשונים מסיני אף אלו מסיני, הקשו המפורשים הלא בפ' בהר פירש רש\"י ז\"ל כדעת רע\"ק שכל המצות נאמרו כללותיהם ופרטותיהם מהר סיני, וא\"כ לפי\"ד מה צורך לרבות על פ' המשפטים שהוא מהר סיני וה\"ה מכלל התורה והמצות, והרא\"ם ז\"ל פי' אף אלו מסיני שנאמרו המשפטים בקולות וברקים כמו עשרת הדברות, ובאוה\"ח הק' כתב דברים אלו אין לשמוע להם יעיי\"ש.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 0,
      "char_length": 421,
      "timestamp": "2025-02-06T19:19:31.782770"
    },
    {
      "id": "mishpatim_p1",
      "text": "ב) הקשו רז\"ל (סנהדרין דף ז' ע\"ב) אשר תשים אשר תלמדם מבעי' לי', וברש\"י ז\"ל פי' אמר הקב\"ה למשה לא תעלה על דעתך לומר אשנה להם הפרק וההלכה ב' או ג' פעמים, עד שתהא סדורה בפיהם כמשנתה, ואיני מטריח עצמי להבינם טעמי הדבר ופירושו, לכך נאמר אשר תשים לפניהם כשלחן הערוך ומוכן לאכול לפני האדם עכ\"ל. והוא מדברי הגמ' עירובין (דף נ\"ד ע\"ב) מניין שחייב להראות לו פנים. שנא' ואלה המשפטים אשר תשים, פירש\"י ז\"ל להראות לו פנים ללמדו לתת טעם בדבריו, ולא יאמר כך שמעתי, הבן אתה הטעם מעצמך וכו', אשר תשים לפניהם ולא כתיב אשר תלמדם, צריך אתה לסדר ולשום לפניהם טעם המיישב תלמודם עכ\"ל. ועדיין צריך להבין הלא גם הטעמים המה לימודי ה' ודברי תורה, ומדוע שייך בזה יותר לשון אשר תשים ולא אשר תלמדם, גם מה\"ת הי' עולה על דעתו לשנות להם ההלכה ב' או ג' פעמים ולא להבינם הטעמים עד שהי' צורך להזהירו על ככה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 1,
      "char_length": 768,
      "timestamp": "2025-02-06T19:19:32.002929"
    },
    {
      "id": "mishpatim_p2",
      "text": "ג) גם מה שדרשו לפניהם ולא לפני עכו\"ם צריך ביאור וכי לא ידעינן שבגוים אין תורה, וכל המדות שמנו חז\"ל בדייני ישראל, אינם נמצאים בעכו\"ם, ובודאי שאין ביכלתם לדון דין אמת, ובפרט שהדיינים צריכים להיות סמוכים, ובוודאי שאין סמוכים בעכו\"ם, ובישראל שאין לנו סמוכים בזה\"ז, אמרו דשליחותייהו דקמאי עבדינן (גיטין פ\"ח ע\"ב) ולא שייך לומר כן בעכו\"ם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 2,
      "char_length": 331,
      "timestamp": "2025-02-06T19:19:32.393676"
    },
    {
      "id": "mishpatim_p3",
      "text": "ד) במד\"ר (סי' ע') ד\"א ואלה המשפטים הה\"ד (תהלים קמ\"ז) מגיד דבריו ליעקב אלו הדברות, חקיו ומשפטיו לישראל אלו המשפטים, לפי שאין מדותיו של הקב\"ה כמדת בשר ודם, מדת בשר ודם מורה לאחרים לעשות והוא אינו עושה כלום, והקדוש ברוך הוא אינו כן אלא מה שהוא עושה הוא אומר לישראל לעשות ולשמור, וצ\"ב שייכות מימרא זו לכאן הלא בכל התורה כולה כן הוא, כמו שהתחיל לומר מגיד דבריו ליעקב אלו הדברות וכן הוא בכל חוקי התורה, וצריך טעם מה שהביא זה לפרשת ואלה המשפטים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 3,
      "char_length": 438,
      "timestamp": "2025-02-06T19:19:32.584778"
    },
    {
      "id": "mishpatim_p4",
      "text": "ה) עוד שם במד\"ר (סימן י\"ב) הה\"ד מגיד דבריו ליעקב, והאריך שם בחשיבות התורה שאינו אלא בישראל, וסיים שכן כתיב מגיד דבריו ליעקב חקיו ומשפטיו לישראל לא עשה כן לכל גוי, ולמי לבני ישראל ע\"כ. ואינו מובן דכיון שכבר ביאר באריכות שאין התורה אלא לישראל, גם הביא לשון הקרא לא עשה כן לכל גוי וגו', האיך סיים אח\"כ בלשון שאלה ולמי לבנ\"י וזה לכאורה מיותר ובלי הבנה, גם לשון הקרא צריך להבין שהתחיל לומר מגיד דבריו שהוא לשון דיבור, וסיים במעשה לא עשה כן לכל גוי והוי כפתח בכד וסיים בחבית, גם לאיזה צורך הביא מימרא זו לכאן.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 4,
      "char_length": 503,
      "timestamp": "2025-02-06T19:19:32.822669"
    },
    {
      "id": "mishpatim_p5",
      "text": "ו) עוד שם במד\"ר (סי' כ\"ד) ואלה המשפטים הה\"ד (ישעי' נ\"ו) כה אמר ה' שמרו משפט ועשו צדקה והאריך שם בחשיבות המצות. שבעולם הזה אין יודעין מתן שכרן, אבל לעולם הבא כשיראו מתן שכרן של מצות הם תמהים שאין העולם כלו יכול לקבל את השכר וכו', אמר הקב\"ה אני מביא את הישועה שנאמר לה' הישועה, ומי שהוא עושה משפט כותב אני עליו שהוא מקרב הישועה וכו', לכך נאמר שמרו משפט ועשו צדקה, הוי ואלה המשפטים מה כתיב אחריו כי תקנה עבד עברי עכ\"ד המדרש, וצריך להבין דכיון שכתב שבעשיית המשפטים מקרבין הישועה, כל המשפטים בכלל, ומדוע טרח לכתוב אח\"כ מה כתיב אחריו כי תקנה עבד עברי, וסגי במה שאמר הוי ואלה המשפטים שכולל הכל, ומהו הכוונה במה שפרע דין ע\"ע דייקא.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 5,
      "char_length": 623,
      "timestamp": "2025-02-06T19:19:33.105163"
    },
    {
      "id": "mishpatim_p6",
      "text": "ז) קושית האלשיך הק' מדוע התחיל במשפט הראשון בדין עבד עברי, (ועי' מ\"ש הרמב\"ן בזה).",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 6,
      "char_length": 81,
      "timestamp": "2025-02-06T19:19:33.429826"
    },
    {
      "id": "mishpatim_p7",
      "text": "ח) במדרש ילקוט (צפני' א') עה\"כ והי' בעת ההיא אחפש את ירושלים בנרות, א\"ר אחא לא תהא קורא בסמ\"ך אלא בשי\"ן. אחפש אמר הקב\"ה מוציא אני אותה לחירות, כשם שהכתבתי בתורה וכי יכה איש את עין עבדו וגו' לחפשי ישלחנו, ואני הכיתי את שתי עיניהם של בני, שנאמר (ישעי' כ\"ט) כי נסך ה' עליהם רוח תרדמה ויעצם את עיניהם, אינו בדין שיצאו לחפשי, א\"ר ברכי' הכתבתי בתורה שש שנים יעבוד ובשביעית יצא לחפשי חנם עכ\"ד המדרש הובא בישמח משה פ' זו וסיים שהוא תמוה, ובאמת אינו מובן כלל דברי ר' ברכי' בזה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 7,
      "char_length": 468,
      "timestamp": "2025-02-06T19:19:33.520981"
    },
    {
      "id": "mishpatim_p8",
      "text": "ט) בפסיקתא הובא בתפלה למשה מק''ז זלה\"ה (תהלים י\"ט) משפטי ה' אמת זה סדר נזיקין צדקו יחדיו רשב\"ל אומר מק\"ו צדקו, ורבנן אמרי מגז\"ש צדקו, וק\"ז זלה\"ה פי' סדר נזיקין ר\"ל סדר העונשין על העונות, צדקו יחדיו שהם במדה למרק העונות, וע\"ז יש פלוגתא בגמ' ח\"א בק\"ו משן ועין וח\"א מגז\"ש דברית האמור במלח יעיי\"ש, ועוד לאלקי מילין.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 8,
      "char_length": 311,
      "timestamp": "2025-02-06T19:19:33.782343"
    },
    {
      "id": "mishpatim_p9",
      "text": "י) בגמרא קידושין (דף כ\"ב ע\"ב) ריב\"ז הי' דורש מקרא זה כמין חומר, מה נשתנה אוזן מכל האברים שבגוף. אמר הקב\"ה אוזן ששמעה קולי על הר סיני בשעה שאמרתי כי לי בנ\"י עבדים ולא עבדים לעבדים, והלך זה וקנה אדון לעצמו ירצע ור\"ש ב\"ר הי' דורש את המקרא הזה כמין חומר, מה נשתנה דלת ומזוזה מכל כלים שבבית, אמר הקב\"ה דלת ומזוזה שהיו עדי במצרים: בשעה שפסחתי על המשקוף ועל שתי המזוזות ואמרתי כי לי בנ\"י עבדים ולא עבדים לעבדים, והוצאתים מעבדות לחירות והלך זה וקנה אדון לעצמו ירצע בפניהם עכ\"ד הגמ', והקשה בס' מים יחזקאל על מה שאמר אוזן ששמעה בהר סיני כי לי בני ישראל עבדים, הלא פסוק זה לא נאמר בסיני אלא בפ' בהר, ובאמת יש לתרץ זה שהרי כהתו\"כ נאמרה בסיני, אלא שבישמח משה הקשה שהרי לא שמעו בסיני מפי הקב\"ה אלא עשרת הדברות, ולדעת כמה ראשונים לא הבינו אלא שני דברות הראשונות. כאמרם ז\"ל אנכי ולא יהי' לך מפי הגבורה שמענום ולא יותר ואיך שייך לומר אוזן ששמעה ''קולי' כי לי בנ\"י עבדים וביותר קשה מאי שאייטי' דקרא כי לו בנ\"י עבדים לדלת ומזוזה, היכן שמעו זה הא עדיין לא ניתנה התורה, וזהו קושית האלגזי והניחה בצ\"ע עיין ביש\"מ.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 9,
      "char_length": 990,
      "timestamp": "2025-02-06T19:19:33.962510"
    },
    {
      "id": "mishpatim_p10",
      "text": "ולבאר כ\"ז אקדים פסוקי הפטורה שבוע זו (ירמי' ל\"ד) כה אמר ה' אלקי ישראל אנכי כרתי ברית את אבותיכם ביום הוציאי אותם מארץ מצרים מבית עבדים לאמר, מקץ שבע שנים תשלחו איש את אחיו העברי אשר ימכר לך ועבדך שש שנים ושלחתו חפשי מעמך וגו', וזה לכאורה תמוה דהלא פרשת שילוח עבדים נאמרה בין המשפטים שניתנו בסיני או במרה וכריתת הברית הי' אחר מ\"ת, וצ\"ב אומרו כרתי ברית ביום הוציאי אותם מארץ מצרים, ובמצודת דוד נדחק לומר שאין הכוונה ביום היציאה אלא בעת היציאה, ועל מעמד הר סיני יאמר שאז כרת ברית על כל המצות בכללן, ובמלבי\"ם פי' דר\"ל שכמו שהוצאתים מבית עבדים כן יקיימו מצות שילוח עבדים, וכ\"ז דוחק גדול שהרי הכתוב צווח ואומר ביום הוציאי אותם ממצרים, הרי מבואר בקרא שנצטוו במצוה זו בעודם במצרים סמוך ליציאתם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 10,
      "char_length": 686,
      "timestamp": "2025-02-06T19:19:34.474010"
    },
    {
      "id": "mishpatim_p11",
      "text": "ותמהני שכולם לא הביאו דברי הירושלמי (ר\"ה פ\"ג הל' ה') וז\"ל אמר ר\"ש בר\"י וידבר ה' אל משה ואל אהרן ויצום אל בני ישראל על מה ציום על פרשת שילוח עבדים ואתיא כהאי דא\"ר הילא לא נענשו ישראל אלא על פרשת שילוח עבדים הה\"ד מקץ שבע שנים תשלחו איש את אחיו העברי, ופי' בקרבן העדה דלכן לא נענשו ישראל שגלו מן הארץ אלא על פרשת שילוח עבדים, לפי שהיא היתה מצוה ראשונה להם במצרים ובשבילה נגאלו ממצרים, ובמ\"ש בירושלמי הה\"ד מקץ שבע שנים וגו' פי' בקרבן העדה דלעיל מיני' כתיב כה אמר ה' וגו' אנכי כרתי ברית ביום הוציאי אותם ממצרים וגו' לאמר מקץ שבע שנים תשלחו, וקשיא היכן כרת ברית שעי\"כ יהיו נגאלים, אלא כדאמר ר\"ש ויצום אל בני ישראל, דר\"ל שהי' הציווי על שילוח עבדים עוד בהיותם במצרים יעיי\"ש, הרי מבואר בירושלמי פירושא דקרא כפשוטו, שהי' כריתות ברית על מצוה זו של שילוח עבדים בעודם במצרים, וצ\"ב להבין הדברים מדוע הקדים הקב\"ה לצוות לישראל מצוה זו במצרים יותר משאר מצות שבתורה, גם כי באמת עפ\"י שיטת ההלכה האיך הי' נוהג אז דין עבד עברי, הלא אין ע\"ע נוהג אלא בזמן שהיובל נוהג, גם הלא היו כולם עבדים לפרעה במצרים, ומנין היו עבדים לישראל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 11,
      "char_length": 1005,
      "timestamp": "2025-02-06T19:19:34.810148"
    },
    {
      "id": "mishpatim_p12",
      "text": "ולבאר הענין נקדים דברי הגמ' ברכות (דף ה' ע\"א) גבי יסורין ממרקין דרשו רז\"ל אשרי הגבר אשר תיסרנו י\"ה ומתורתך תלמדנו, א\"ת תלמדנו אלא תלמדנו דבר זה מתורתך תלמדנו, ק\"ו משן ועין מה שן ועין שהן א' מאבריו של אדם עבד יוצא בהן לחרות יסורין שממרקין כל גופו עאכו\"כ, והיינו דרשב\"ל דאמר רשב\"ל נאמר ברית במלח ונאמר ברית ביסורין וכו' מה מלח ממתקת את הבשר אף יסורין ממרקין כל עונותיו של אדם, ופירשתי דצריכא תרווייהו הק\"ו והגז\"ש, שמהגז\"ש יש ללמוד דאף יסורין קלים ממרקין, כמו המלח שממתקת הבשר כשהוא מועט, ואם מרבין במלח יותר על המדה מקלקל התבשיל ואינו ממתק, אבל מהק\"ו נלמד רק על יסורין שהם שקולין כנטילת שן ועין או ח\"ו יותר, אבל לעומת זה מהגז\"ש אין ללמוד אלא המתקה בעלמא ולא יציאה לחרות, ע\"כ צריכנא לק\"ו ללמוד על יציאה לחרות לגמרי, ובהצטרף שניהם יחד נלמוד מזה שיצאו לחרות לגמרי ק\"ו משן ועין וגם נילף שסגי ביסורין קלים כהמתקת המלח. אמנם קושיא גדולה הקשה הרי\"ף בעין יעקב דשן ועין אינו נוהג בעבד עברי כי אם בעבד כנעני, ואיך נלמוד בק\"ו לאיש מבני ישראל מעבד כנעני, בדבר שאינו נוהג בעברי, שהרי ע\"ע אינו יוצא בזה לחרות. וכתב שהוא באמת קושיא גדולה ומכח קושיא זו הוציא דברי הש\"ס ממשמעותן לפרשם בדרך דרוש ורמז יעיי\"ש, והנה קושיא זו קשה ג\"כ על הך מימרא שבילקוט צפני' שהבאתי עה\"כ אחפש ירושלים בנרות שר\"ל בנרות של תורה, יען שכתוב בתורה לחפשי ישלחנו תחת עינו, לכן בדין שיצאו ישראל לחפשי, הלא דין זה כתוב בתורה רק בעבד כנעני ואינו נוהג בעבד עברי, והאיך יליף משם על ישראל וירושלים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 12,
      "char_length": 1346,
      "timestamp": "2025-02-06T19:19:35.278151"
    },
    {
      "id": "mishpatim_p13",
      "text": "ולתרץ זה נ\"ל שהרי אם נדון עבדות ישראל בגלות כדין עבד עברי, אמרה תוה\"ק שש שנים יעבוד ובשביעית יצא לחפשי חנם, ולכל היותר בנרצע הוא עד היובל ולא יותר בשום אופן, ובעו\"ה לגלות ושעבוד ישראל ארכו הימים עד אין שיעור וערך: ונראה ח''ו כערך עבדים כנענים אשר אמר עליהם הכתוב לעולם בהם תעבודו, וה\"ז ח\"ו כמו שאה\"כ (בפ' עקב) כגוים אשר אני מאביד מפניכם כן תאבדון ופי' שם באוה\"ח הק' שזה דמיון כמו שאירע להם בימי מרדכי, שהיתה הגזירה להשמיד ולהרוג ולאבד את כל היהודים וזה מאמר כגוים שגזר עליהם ה' לא תחי' כל נשמה כן יהי' העונש ח\"ו, והי' כן בימי המן לולא זכות מרדכי ואסתר שעמדו וביטלו הגזירה יעיי\"ש, וכמו כן כתבו המפורשים (בפ' מסעי) בפסוק והי' כאשר דמיתי לעשות להם אעשה לכם, שהעונות יוכלו ח\"ו להיות גורמים לדונם כמשפטי הגוים חלילה, וע\"כ אמרו ז\"ל על אריכת הגלות הזה, שאין זה כדין עבד עברי אלא כדין עבד כנעני, שכל כך גרמו העונות והקטרוג הגדול בעו\"ה, אבל אחר שנענשו בסמיות עינים ובלקיחת עיני העדה זה כמה בעו\"ה, אף לפי הקטרוג לדונם כדין עבד כנעני, בדין הוא שיצאו לחירות כדת של תורה, אלא שעון הדור מחדש הגלות והגזירות בעו\"ה, אבל כשיעלה זכרונינו לפני השי\"ת לפקדינו בדבר ישועה ורחמים, זכות התורה יעמוד לנו ויוציא לאור משפטינו עפ\"י דיני התורה כנז\"ל",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 13,
      "char_length": 1120,
      "timestamp": "2025-02-06T19:19:35.914082"
    },
    {
      "id": "mishpatim_p14",
      "text": "ובזה מובן היטב דברי הילקוט כמין חומר, שאחר שאמר שיצאו לחפשי מכח הדין של סמיות עינים, כאן הבן שואל הלא אין זה אלא משפט עבד כנעני, דעבד עברי אינו יוצא בשן ועין, ע\"כ הסמיכו לזה מאמר ר' ברכי' כתבתי בתורה שש שנים יעבוד ובשביעית יצא לחפשי חנם וא\"כ ממ\"נ אם יטעון הטוען דין ע\"ע להם כבר היו צריכין לצאת לחפשי, וע\"כ שאין זה אלא בשביל הקטרוג לדונם כגוים שנאמר בהם ועבדו לעולם, א\"כ אחר הסמיות עינים ממ\"נ דינם מפורש בתורה לצאת לחפשי.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 14,
      "char_length": 420,
      "timestamp": "2025-02-06T19:19:36.471819"
    },
    {
      "id": "mishpatim_p15",
      "text": "ובזה מובן מה שכרת הקב\"ה ברית עם ישראל על ציווי זה של שילוח עבדים בעודם במצרים ולא המתין עד מתן תורה כמו בכל המצות שבתורה, כי באמת יצאו ממצרים קודם זמנם. שהי' הגזירה על ת' שנים ולא היו אלא רד\"ו כנודע, והוצרך לזה התירוץ של סמיות עינים שאף בעבד כנעני שנגזר עליו ועבדו לעולם יוצא בשן ועין, אבל יען שהמה עבריים וההכרח לצרף לזה גם דין ע\"ע שנאמר עליו בשביעית יצא לחפשי חנם כנז\"ל, וע\"כ הי' צורך בדבר שהקב\"ה כרת עמם ברית במצרים על מצות שילוח עבדים, וכשקבלו עליהם בכריתת ברית נחשב להם כאילו כבר עשו וכמ\"ש רש\"י ז\"ל בפ' בא בפסוק וילכו ויעשו, שיען שקבלו עליהם נחשב כאלו כבר עשו, והנה אמרו חכז\"ל, (ירושלמי ר\"ה פ\"א ה\"ג) דכל המצות שהקב\"ה גוזר על ישראל גם הוא עושה ומקיים שהקב\"ה שומר משמרתה של תורה, ולכן אחר שקבלו עליהם מצוה זו כראוי, הי' בדין שהקב\"ה יעשה כן ויוציאם לחירות מבית עבדים, וע\"כ דרשו בירושלמי בפסוק ויצום אל בני ישראל וגו' להוציא את בנ\"י ממצרים שזה הציווי הי' על מצות שילוח עבדים, וממצוה זו נצמח שורש הדין להוציא את בנ\"י ממצרים וזה שאמר הנביא שהי' כריתת ברית ע\"ז ביום הוציאי אותם מארץ מצרים שזה גרם יום היציאה, וע\"כ כשביטלו אח\"כ מצוה זו חזר הגלות למקומו בעוה\"ר.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 15,
      "char_length": 1057,
      "timestamp": "2025-02-06T19:19:36.707610"
    },
    {
      "id": "mishpatim_p16",
      "text": "ומה שאמר ריב\"ז אוזן ששמעה בהר סיני כי לי בנ\"י עבדים עבדי הם אשר הוצאתי אותם מארץ מצרים (עיין לעיל קושיא י'), נל\"פ דהנה עה\"כ אנכי ד' אלקיך אשר הוצאתיך וגו' מבית עבדים (שמות פ\"כ), כתב הרמב\"ן ז\"ל טעם מבית עבדים שהיו עומדים במצרים בבית עבדים שבוים לפרעה ואמר להם שהם חייבים שיעבדוהו כי הוא פדה אותם מעבדות מצרים, כטעם כי עבדי הם אשר הוצאתי אותם מארץ מצרים יעיי\"ש, וא\"כ מקרא זה דהוצאתיך מבית עבדים יש לו טעם א' עם הכתוב כי לי בני ישראל עבדים, וישראל כששמעו מפי הגבורה השני דברות בוודאי הבינו אותם בטעמם ושורשם, וכל מה שנכלל במאמר אנכי ותו לק\"מ, גם יתורץ קושית האלגזי על מה שאמרו דלת ומזוזה שהיו עדים במצרים שפסחתי עליהם ואמרתי כי לו בנ\"י עבדים שנתקשה טובא היכן שמעו זה במצרים הלא הי' עוד קודם מ\"ת, אבל לדרך הירושלמי א\"ש, שאף שהי' קודם מ\"ת אבל המצוה דשילוח עבדים נאמרה לישראל בעודם במצרים, ונזדרזו ע\"ז מן השמים עבור אותו התכלית להוציאם משם מבית עבדים, א\"כ השיגו מאז גם טעמא דקרא כי לי בני ישראל עבדים ולק\"מ.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 16,
      "char_length": 901,
      "timestamp": "2025-02-06T19:19:37.346800"
    },
    {
      "id": "mishpatim_p17",
      "text": "ומובן בזה מה שהתחיל הכתוב פרשת המשפטים במצות עבד עברי, שזאת המצוה היתה שורש הגאולה במצרים וגם שורש גאולה העתידה, כמבואר בילקוט צפני' עה\"כ בעת ההיא אחפש את ירושלים בנרות, ומרומז זה בקרא דאשר תשים לפניהם, עפי\"מ שדרשו רז\"ל לפניהם ולא לפני עכו\"ם, ומבואר בגמ' (יבמות דף מ\"ה ע\"ב, ובקידושין דף ע\"ו ע\"ב) וברמב\"ם הל' מלכים (פ\"א הלכה ה') וז\"ל אין מעמידין מלך מקהל גרים וכו' ולא למלכות בלבד אלא לכל שררות שבישראל וכו' אפי' ממונה על אמת המים ואצ\"ל דיין או נשיא שלא יהא אלא מישראל שנאמר מקרב אחיך תשים עליך מלך, כל משימות שאתה משים לא יהי' אלא מקרב אחיך עכ\"ל, א\"כ חזינן דכל ענין התמנות אף שררה קלה יקרא בלשון שימה, וכבר נתבאר שבכח מצוה זו של דין ע\"ע יצאו ישראל לחפשי משיעבוד העכו\"ם, ובזה יפטרו שלא יהי' עליהם שררה כ\"ד משום עכו\"ם שבעולם, כ\"א שררות ישראל קדושים מוסמכים, כאשר יהי' בעת הגאולה שיבוא מרע\"ה עם אלי' זל\"ט ויחדש ענין הסמיכה כמ\"ש הפוסקים, וע\"כ אמר ואלה המשפטים שע\"י משפטי ה' האלה המתחילים בדיני עבד עברי ועבד כנעני, יצא משפט ישראל לאורה ויתקיים אשר תשים, ר\"ל כל משימות לא יהי' אלא לפניהם ולא לפני עכו\"ם, שאחר שיצאו משעבוד לגאולה לא יהי' עוד עליהם שום שימה של עכו\"ם ואף הדיוטות נתמעטו בזה, אלא הכל יהיו פונים אך אל המוסמכים מפי מרע\"ה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 17,
      "char_length": 1128,
      "timestamp": "2025-02-06T19:19:37.791399"
    },
    {
      "id": "mishpatim_p18",
      "text": "והנה כבר נתבאר שיטת הירושלמי דמצוה של שילוח עבדים נאמרה לישראל בעודם במצרים וכרת הקב\"ה ברית עמהם ע\"ז, ושזה פי' הכתוב ויצום להוציא את בנ\"י שציווי זה הוא סיבת יציאתם משם, ויתכן שנשרש זה בלבם יותר מאלה המצות שניתנו במרה שלא הי' כ\"כ בפרטי' וטעמי', גם לא היה כריתת ברית עליהם אלא לאחר מ\"ת שכרת ה' ברית בחורב על כל המצות, וע\"כ הי' צורך לשנותם בסיני להודיע שגם עליהם קאי כריתת הברית, אמנם פ' זו של שילוח עבדים שהי' עלי' כריתת ברית בעודם במצרים, וכבר נעשה מעשה רבה בכח פ' זו שיצאו משעבוד לגאולה, והשיגו ישראל היטב טעמי' ושרשי' מעתה יש סברא שלא הי' צורך לשנותו עוה\"פ בסיני אלא שמרע\"ה ישנה להם פ' זו כמשנתה כמו שנצטוו כבר במצרים כדי להזהירם שלא יבטלוה, כמו שאירע אח\"כ בעו\"ה כמבואר בדברי הנביא, גם שידעו לצפות עי\"ז לגאולה העתידה, וע\"כ אמרו רז\"ל ואלה המשפטים מוסיף על הראשונים מה עליונים מסיני אף אלו מסיני שלא לחשוב כנז\"ל אלא שגם בסיני נשנו אלו הדברים כהוויתן.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 18,
      "char_length": 849,
      "timestamp": "2025-02-06T19:19:38.306676"
    },
    {
      "id": "mishpatim_p19",
      "text": "ויש בזה רמז עוד כי הר סיני הי' הוראה על החורבן כמבואר בקינה לת\"ב שיסד רבינו מאיר, סיני העל כן בחר בך אלקים ומאס בגדולים להיות לאות ולמופת לדת כי תמעט ותרד מכבודה וכו' תחת מעיל שק תתכס וכו', ובישמח משה (פ' יתרו) האריך לבאר ענין הרמז שמהר סיני הי' סימן על חורבן הדת עיי\"ש, ולכן הי' צורך ששם באותו המעמד יתראה להם סימן הגאולה העתידה בהזכרת אותה הפרשה של שילוח עבדים, למען לא יפול לבבם ויתנחמו במאמר הנביא בעת ההיא אחפש את ירושלים בנרות, וזה אומרו מה הראשונים מסיני אף אלו מסיני, ירמוז שבשביל שהראשונים נאמרו בסיני שזה סימן על חורבן הדת לכן נשנה להם גם זה בסיני לנחמם שיצפו על הגאולה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 19,
      "char_length": 580,
      "timestamp": "2025-02-06T19:19:38.724752"
    },
    {
      "id": "mishpatim_p20",
      "text": "והנה בסיני הבינו ישראל הכל בטעמם ושורשם כמו שהבאתי לעיל על מאמרם אוזן ששמעה בסיני כי באמת אז פסקה זוהמתן ולא הי' שום מסך המבדיל להשגתם והבינו הכל בסקירה אחת, וע\"כ אמר הקב\"ה למשה שלא תאמר איני מטריח עצמי להבינם הטעמים אלא יבינו הטעם מעצמם. כאשר באמת כן הי' בסיני שלא הי' צורך להבינם הטעמים, אמנם לא כל העתים שוות, כי בהימים שאחר מעמד הר סיני לא היו עוד במדריגה הנשגבה כמו שהיו בעמדם בהר סיני: ואמר לו הקב\"ה להבינם הטעמים אף בפרשה זו של שילוח עבדים שהבינו היטב בעודם במצרים, וע\"ד שאמרו חכז\"ל (עירובין נ\"ד ע\"ב) למה נמשלו דברי תורה כדד מה דד זה כל זמן שהתינוק ממשמש בו מוצא בו חלב, אף דברי תורה כל זמן שאדם הוגה בהן מוצא בהן טעם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 20,
      "char_length": 625,
      "timestamp": "2025-02-06T19:19:39.048757"
    },
    {
      "id": "mishpatim_p21",
      "text": "ומובן בזה דברי הפסיקתא המובא בתפל\"מ (עיין לעיל קושיא ט') משפטי ה' אמת זה סדר נזיקין צדקו יחדיו חד אמר בק\"ו וח\"א בגז\"ש ר\"ל כי סדר נזיקין שמתחיל בפרשת שילוח עבדים בשביל שיש בזה הצלת ישראל, הנה לא סגי בדין עבד כנעני שיוצא בשן ועין, כי יש ע\"ז פירכא שאין זה נוהג בעבד עברי, ובדין ע\"ע בלבד ג\"כ לא סגי, כי מאריכות הגלות נראה שנגזר עליהם דין עבד כנעני שאין יוצאין בשש, אבל בשני אלה ההלכות צדקו יחדיו, דממ\"נ הם ניצולים כאשר נתבאר לעיל, גם י\"ל צדקו יחדיו על ענין הפלוגתא אם הוא בק\"ו או בגז\"ש, כאשר ביארתי לעיל דהגז\"ש מלמדת על היסורין הממרקים אם הם כמו המלח שהוא ממתק רק כשהוא במדה ידועה לא ח\"ו גדושה, אבל על יציאה לחירות נצרך כח הק\"ו ובשניהם צדקו יחדיו שיצאו ישראל לחירות עולם ולא ע\"י יסורים קשים ח\"ו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 21,
      "char_length": 691,
      "timestamp": "2025-02-06T19:19:39.368129"
    },
    {
      "id": "mishpatim_p22",
      "text": "ויש לפרש בזה דברי המדרש הנ\"ל (קושיא ד') מ\"ש במד\"ר (סי' ט') ד\"א ואלה המשפטים הה\"ד מגיד דבריו ליעקב חקיו ומשפטיו וגו' שהקב\"ה מה שהוא עושה אומר לישראל לעשות ולשמור, הכוונה בזה דלכן לא אמר חוקים ומשפטים כמ\"ש בכ\"מ בתורה, דר\"ל דאלה המשפטים מה שהקב\"ה מגיד לישראל, המה גם חקיו ומשפטיו שגם הוא ית' עושה כן: והביא מימרא זו לכאן. שזהו הטעם שהתחיל פרשת המשפטים בדיני העבדים תחלה שע\"י שישראל מקבלים עליהם הלכות אלו לקיימם, גם הקב\"ה עושה כן להוציאם מבית עבדים, וכן הי' במצרים וגם לעתיד יהי' כן כמ\"ש הנביא אחפש את ירושלים בנרות של תורה, ויסוד הענין שהקב\"ה שומר משמרתה של תורה",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 22,
      "char_length": 560,
      "timestamp": "2025-02-06T19:19:39.707091"
    },
    {
      "id": "mishpatim_p23",
      "text": "ומ\"ש במד\"ר (סי' י\"ב) אחר שהאריך בחשיבות התורה שאינו אלא בישראל שכן כתיב חקיו ומשפטיו לישראל לא עשה כן לכל גוי וסיים ולמי לבני ישראל שזה פלא לכאורה כנז\"ל, ולדרכינו יש לפרש שמה שכתב למעלה הכוונה על השגת התורה שלא נמצא אלא בישראל לא בעכו\"ם, אבל נרמז עוד בקרא שגם הקב\"ה שומר משמרתה של תורה, ומדתו ית' להציל ולהושיע את ישראל כפי הנלמד מדיני התוה\"ק, ובזה יש מקום לטעות אולי גם הגוים יוכלו לזכות עי\"ז, שיגיע להם טובות ממה שידונו אותם עפ\"י דיני התוה\"ק יען שכן מדותיו של הקב\"ה, אבל האמת הוא שלא עשה כן לכל גוי, שכל מדותיו של הקב\"ה מדה כנגד מדה, וכמאמרם ז\"ל (מדרש הובא בשלה\"ק שער הגדול) עה\"כ (תהלים קכ\"א) ה' צלך שכמו שהצל עושה מה שהאדם עושה כמו כן הקב\"ה עושה מדה כנגד מדה מה שהאדם עושה, וע\"כ ישראל שקבלו את התוה\"ק בעשיית מצותיו, גם הקב\"ה מתנהג עמהם כן ובמקום שיש דין למטה אין דין למעלה, אבל הגוים שלא רצו לקבל את התוה\"ק אינם זוכים שהקב\"ה יתנהג עמם במשפטי התורה לזכותם כדרך שהוא עושה לישראל, וע\"כ אמרו רבנן בכפילא למי לבני ישראל שזה סובב על הקב\"ה, שמה שהוא עושה ומקיים את המשפטים האלה אין זה אלא לבני ישראל. ומתורץ בזה שינוי הלשון שהתחיל לומר מגיד דבריו ליעקב וגו' בלשון הגדה וסיים בלשון עשי' לא עשה כן לכל גוי וגו', שהתחלת הקרא קאי על מה שהגיד הקב\"ה לישראל והזהירם על החוקים והמשפטים, אבל מה שנרמז עוד בקרא שגם הקב\"ה עושה כן, ע\"ז סיים שפיר לא עשה כן לכל גוי, שמה שהקב\"ה עושה הצלה וישועה ע\"י המשפטים האלה זה וודאי מעשה רבה ועצומה ולא עשה כן לכל גוי, וע\"כ ביארו אח\"כ באמרם למי לבני ישראל שלא לטעות כנז\"ל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 23,
      "char_length": 1392,
      "timestamp": "2025-02-06T19:19:39.983865"
    },
    {
      "id": "mishpatim_p24",
      "text": "ומ\"ש עוד במד\"ר (סי' כ\"ד) שמרו משפט ועשו צדקה שהאריך שם במה שלעתיד לבוא יראו גודל שכרן של מצות. ומי שעושה משפט הקב\"ה כותב עליו שהוא מקרב הישועה, וסיים הוי ואלה המשפטים מה כתיב אחריו כי תקנה עבד עברי, ולדרכינו מובן מאליו מה שבנה היסוד על הכתוב אחריו כי תקנה עבד עברי, שע\"י אותה המצוה נזכה לראות בישועה ונחמה כנז\"ל וכמבואר בילקוט עה\"כ אחפש את ירושלים בנרות, כן יעזרינו השי\"ת עדכ\"ש ית'.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 24,
      "char_length": 382,
      "timestamp": "2025-02-06T19:19:40.627296"
    },
    {
      "id": "mishpatim_p25",
      "text": "ואלה המשפטים אשר תשים לפניהם. ברש\"י ז\"ל כ\"מ שנאמר ואלה מוסיף על הראשונים מה הראשונים מסיני אף אלו מסיני, והקשו ברא\"ם ובעה\"ת ושאר מפרשים דלר\"ע שסובר דכל המצות נאמרו כללותיהן ופרטותיהן מה\"ס אין צורך ללמדינו בכאן שהוא מסיני שהרי בכל המצות הוא כן ואין זה אלא לר\"י שסובר דכל המצות לא נאמרו אלא כללותיהן מה\"ס ופרטותיהם באוה\"מ, ובפ' בהר כתב רש\"י ז\"ל כדעת ר\"ע ולמה כתב כאן כדעת ר\"י, גם לדעת ר\"י שסובר דכל המצות לא נאמרו פרטותיהם בהר סיני צריך להבין מה נשתנה מצוה זו שנאמרו אף פרטותיה בה\"ס דא\"א לומר שסובב רק על הכללים, דהרי הכללים כל המצות נאמרו בהר סיני לכו\"ע ואין צורך ללמד זה כאן והרא\"ם כתב שהכוונה הוא שנאמרו בקולות וברקים כמו עשרת הדברות, ובאוה\"ח הק' דחה פי' זה בשתי ידים יעיי\"ש, ואפשר לפענ\"ד לומר בזה בכמה אנפי כאשר יתבאר.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 25,
      "char_length": 720,
      "timestamp": "2025-02-06T19:19:40.824903"
    },
    {
      "id": "mishpatim_p26",
      "text": "והנה כבר דקדקו חז\"ל באומרו אשר תשים לפניהם ולא אמר אשר תלמדם וברש\"י ז\"ל אמר לו הקב\"ה למשה לא תעלה על דעתך לומר אשנה להם הפרק וההלכה ב' או ג' פעמים עד שתהא סדורה בפיהם כמשנתה ואיני מטריח עצמי להבינם טעמי הדבר ופירושו לכך נאמר אשר תשים לפניהם כשולחן הערוך ומוכן לאכול לפני האדם, ומבואר בזה כי לימוד ההלכה אף ב' וג' פעמים עד שתהא סדורה כמשנתה אינו נקרא שימה אלא לימוד בעלמא, אך הטורח להבין טעם הדבר ופירושו זה נקרא שימה, וצריך הסבר בהבנת הגבול מה נקרא לימוד ומה נקרא שימה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 26,
      "char_length": 469,
      "timestamp": "2025-02-06T19:19:41.200360"
    },
    {
      "id": "mishpatim_p27",
      "text": "ובמד\"ר (פרשה ל' סי' עט') ואלה המשפטים הה\"ד (תהלים קמ\"ז) מגיד דבריו ליעקב וגו', פעם אחת אמר לו עקילס לאדריינוס המלך רוצה אני להתגייר ולהעשות ישראל א\"ל אומה זו אתה מבקש וכו' א\"ל הקטן שבהם יודע האיך ברא הקב\"ה את העולם וכו' ותורתן אמת, א\"ל לך ולמד תורתן ואל תמול, א\"ל אפילו חכם שבמלכותך וזקן בן מאה אינו יכול ללמוד תורתן אם אינו מל שכן כתיב מגיד דבריו ליעקב חקיו ומשפטיו לישראל לא עשה כן לכל גוי ולמי לבני ישראל ע\"כ. והנה צריך להבין גם גופי' דקרא, ראשית השינוי שהתחיל ליעקב וסיים לישראל וצ\"ב, גם למה חלקן בשתים שהתחיל לומר מגיד דבריו וסיים בחקיו ומשפטיו הלא דבריו המה חקיו ומשפטיו, וחקיו ומשפטיו המה דבריו, וכולהו חדא הוא. גם קשה שהתחיל לומר מגיד שאין זה אלא הגדה בעלמא וסיים לא עשה כן שזה עשיי' ולא הגדה בלבד, גם להבין מה שייכות דרשה זו לכאן.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 27,
      "char_length": 739,
      "timestamp": "2025-02-06T19:19:41.433039"
    },
    {
      "id": "mishpatim_p28",
      "text": "והנה ידוע דברי המדרש ילקוט בפ' במדבר (רמז תרפ\"ד) בשעה שקבלו ישראל את התורה נתקנאו בהם אומות העולם ואמרו מה ראו אלו להתקרב יותר מכל האומות, מיד סתם הקב\"ה פיהם ואמר להם הביאו לי ספר יוחסין שלכם כשם שמביאין בני, עכ\"ד המדרש, וכבר נתקשו בזה דהרי מתחלה רצה הקב\"ה ליתן להם התורה ולא רצו לקבלה ומה הקשו אח\"כ מה ראו אלו להתקרב יותר, גם התי' הביאו לי ספר יוחסין אינו מובן לכאורה דמה ענין יחוס לזה דהלא חזינן דרצה הקב\"ה ליתן את התורה לאומה\"ע אף שאינם מיוחסין.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 28,
      "char_length": 448,
      "timestamp": "2025-02-06T19:19:41.799864"
    },
    {
      "id": "mishpatim_p29",
      "text": "ולבאר כ\"ז נראה בהקדם דברי הגמרא (קידושין כ\"ב ע\"ב) עה\"כ ורצע אדוניו את אזנו במרצע אמר ר\"י ב\"ז אוזן ששמעה קולי בה\"ס בשעה שאמרתי כי לי בני ישראל עבדים והלך וקנה אדון לעצמו תרצע, והקשה בס' מים יחזקאל מבעל כנסת יחזקאל הרי הקרא דלי בני ישראל עבדים הוא בפ' בהר והאיך אמר ע\"ז ששמעה בהר סיני, ולפענ\"ד זה לק\"מ שהרי כל התורה כולה נאמרה בסיני אפי' כל מה שתלמיד ותיק עתיד לחדש כמו שאמרו ז\"ל (ירושלמי פאה פ\"ב ה\"ו), אבל ק\"ז בישמח משה פ' זו הקשה באופן אחר שהרי כל ישראל לא שמעו בהר סיני אלא שני דברות הראשונות אנכי ולא יהי' לך ושאר הדברות אף מעשרת הדברות לא שמעו ואפי' לאותן הדיעות ששמעו כל עשרת הדברות אלא שלא הבינו אך שתי דברות הראשונות, אבל יותר מעשרת הדברות לכל הדיעות לא שמעו כל ישראל אלא משה בלבד, והאיך אמר על זה שמכר עצמו אוזן ששמעה קולי בהר סיני בשעה שאמרתי כי לי בני ישראל עבדים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 29,
      "char_length": 773,
      "timestamp": "2025-02-06T19:19:42.050223"
    },
    {
      "id": "mishpatim_p30",
      "text": "ונראה לפענ\"ד בזה עפ\"י מ\"ש רש\"י ז\"ל בסוף הפרשה עה\"כ ואתנה לך את לוחות אבן והתורה והמצות, כל שש מאות ושלש עשרה מצות בכלל עשרת הדברות הן, ורבינו סעדי' פי' באזהרות שיסד לכל דיבור ודיבור מצות התלויות בו ובאוהחה\"ק פ' יתרו עה\"כ וידבר אלקים את כל הדברים האלה לאמור כתב שם בסוף דבריו וז\"ל, עוד אומרו לאמר יכוין אומרם ז\"ל (זוה\"ק פ' יתרו צ\"ג ע\"ב, במדבר רבה פי\"ג ט\"ו) שכל התורה כולה רמוזה בעשרת הדברות והוא אומרו לאמר פי' דברים אלו יש בהם אמרות אחרות כוללות ורמוזות והוסיף עוד שם וז\"ל וראיתי לתת טוב טעם בהשמעת ה' לישראל ב' דברים אנכי ולא יהי' לך כי הם ב' שרשים לב' כללות המצות מצות עשה ומצות ל\"ת, אנכי הוא עיקר ושורש כל מ\"ע, לא יהי' לך הוא עיקר ושורש כל מצות ל\"ת, לזה נטע ה' בהם מפי אל עליון שרשי ב' עיקרי המצות שבזה לא תמוש תורה מזרעינו לעולם ועד עכ\"ל, ובאמת אמרו חכז\"ל במכילתא פ' יתרו והובא ברש\"י ז\"ל שם שאמר הקב\"ה כל עשרת הדברות בדיבור א' מה שא\"א לאדם לומר כן אלא שחזר ופי' אח\"כ כל דיבור ודיבור בפ\"ע ובזה לא שמעו ישראל אלא השנים, יעיי\"ש ברש\"י ז\"ל במוסגר ובדברי רבותינו בעלי התוס' ז\"ל, וא\"כ בב' דברות הראשונות נכללו כל העשרת הדברות כיון שהכל הי' דיבור א' ושפיר עולין דברי האוהחה\"ק שבהשמיעם הקב\"ה ב' דברות הראשונות השמיעם שורש ועיקר כל התורה כולה שנכלל בזה, ונטע בהם הקב\"ה בזה כח כל המצות עשה ול\"ת שלא תמוש תורה מזרעינו לעולם ועד.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 30,
      "char_length": 1220,
      "timestamp": "2025-02-06T19:19:42.418187"
    },
    {
      "id": "mishpatim_p31",
      "text": "ומעתה לפי\"ז בעת ששמעו מפי הקב\"ה הדברות בהר סיני, הנה נשמע להם אז כל מה שנכתב בתורה כי הכל נכלל באלו הדברות ואף שלא הבינו כל מה שנכלל באותן הדברות קודש מלהבות אש, אבל השמיעה לאוזן אף מה שאינו מובן טעמו ופירושו, מ\"מ נקרא שמיעה לאוזן וכשלמדם אח\"כ מרע\"ה כל פסוקי התורה והסביר להם טעמם ופירושם האיך נכללו בהדברות ששמעו מפי הגבורה הבינו למפרע שכבר שמעו זה בסיני אלא שלא הבינו עד שלמדם מרע\"ה, והנה פרשת העבדים לא הי' נוהג במדבר כי אין דין ע\"ע נוהג אלא בזמן שהיובל נוהג (גיטין ס\"ה ע\"א), ואין היובל נוהג אלא בארץ, וא\"כ כשבאו לארץ כבר ידעו ממה שלמד עמהם מרע\"ה במדבר הכ' כי לו בני ישראל עבדים והבינו שכבר נשמע זה בסיני בדברות קודש, ומובן מה שאמרו אוזן ששמעה בסיני כי לי בני ישראל עבדים ובפרט שבוודאי הי' שם באותו הדור דיעה הרבה בני עלי' שהבינו בעמדם על הר סיני הרבה ענינים ממה שנכללו בהדברות קודש ששמעו והבינו גם אז ששמעו בזה המאמר דלי בני ישראל עבדים, אלא אפי' אותן שלא הבינו אז אלא אח\"כ כשלמד עמם מרע\"ה, נקרא ג\"כ שמיעה לאוזן מה ששמעו עיקרי ושרשי הדברים שהבינו אחר זמן.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 31,
      "char_length": 959,
      "timestamp": "2025-02-06T19:19:42.980401"
    },
    {
      "id": "mishpatim_p32",
      "text": "ומעתה לפי\"ז פ' זו דאלה המשפטים המתחלת בכי תקנה עבד עברי הוא מתנגד למה ששמעו בסיני כי לי בני ישראל עבדים, ובפרט אז בשעה שעמדו במעמד הנבחר שאמרו חכז\"ל (שבת קמ\"ו ע\"א) שפסקה זוהמתן ולפי מדריגתם אז לא הי' מציאות שיעברו על מה ששמעו בהר סיני, וא\"כ לפי מצבם אז לא הי' מציאות שיהי' ע\"ע בישראל נגד מה ששמעו בה\"ס ולא הי' מקום להגיד להם אז כי תקנה ע\"ע והי' סברא לומר די' לצרה בשעתה להגיד להם פ' זו אחר שנפלו ממדריגתם ובאו לידי מדה זו שנעשה אפשרות להעשות נגד מה ששמעו בהר סיני, וכמו שהי' בעת שאמר הקב\"ה למשה להגיד לישראל במצרים שיהי' עמהם בגלות אחר ובקש מהקב\"ה שלא להגיד זה אז כי די' לצרה בשעתה (ברכות ט' ע\"ב).",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 32,
      "char_length": 597,
      "timestamp": "2025-02-06T19:19:43.429824"
    },
    {
      "id": "mishpatim_p33",
      "text": "וכעין זה הוא בגמ' ע\"ז (ד' ה' ע\"א) למימרא דאי לא חטאו לא הוי מייתי והכתיב פ' יבמות ופ' נחלות, על תנאי, ומי כתיבי קראי על תנאי, אין, דהכי אמר רשב\"ל מ\"ד ויהי ערב ויהי בקר יום הששי מלמד שהתנה הקב\"ה עם מעשה בראשית וכו', וצריך להבין לכאורה הלא אפשר לומר דמש\"ה נכתב פ' יבמות ופ' נחלות אף שלפי מצבם אז לא הוי מייתי, אבל גלוי וידוע לפני הקב\"ה שעתידין לחטוא ויצטרכו לפ' יבמות ונחלות.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 33,
      "char_length": 373,
      "timestamp": "2025-02-06T19:19:43.721665"
    },
    {
      "id": "mishpatim_p34",
      "text": "ונראה לפי מה שנודע שאף שאין הידיעה מבטל הבחירה אבל הדיבור מכריח ומש\"ה צדיק ורשע לא קאמר כמו שאמרו ז\"ל (נדה ט\"ז ע\"ב), ולכן כיון שמה שעתידין לחטוא הוא תלוי בבחירה מש\"ה נתקשו במה שנכתבו אלו הפרשיות בתורה כיון שכל מה שנכתב בתורה הוא מפי הקב\"ה כמו שאמרו ז\"ל (בבא בתרא ט\"ו ע\"א) הקב\"ה אומר ומשה כותב וזה לכאורה מבטל הבחירה, וע\"ז תירצו שכתב על תנאי, ומה שהוא על תנאי אין זה דיבור מוחלט שיבטל הבחירה ועדיין נתקשו אם יש מציאות לכתוב קראי על תנאי עד שהוצרכו להביא ראי' לדבר ממאמרו של רשב\"ל, ומעתה לפי\"ז י\"ל בפרשת כי תקנה ע\"ע הי' סברא לומר שכיון שהוא מתנגד למה ששמעו בסיני ולא הי' אז מציאות לדבר לא נאמרה אז הפרשה על תנאי אלא אח\"כ בעת שהגיעו לידי מדה זו לכן גילה לנו הכ' דמה הראשונים מסיני אף אלו מסיני ונאמרה על תנאי.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 34,
      "char_length": 706,
      "timestamp": "2025-02-06T19:19:43.934336"
    },
    {
      "id": "mishpatim_p35",
      "text": "והנה ממה שמבואר במד\"ר שא\"ל עקילס לאדריינוס אפי' חכם שבמלכותך וזקן בן מאה אינו יכול ללמוד תורתן אם אינו מל שלא הגיד הקב\"ה תורתו אלא לישראל, מזה מבואר שלהשגת התורה לא סגי החכמה והלימוד בלבד אפילו כמה שנים, אלא צריך להתקדש בקדושת ישראל ואז מועיל לו הלימוד והיגיעה לבוא לידי השגת התורה. ומובן שמי שקדושתו גדולה יותר, גם השגתו בתורה חזקה יותר, וכמו שאמרו חכז\"ל (ירושלמי ברכות פ\"ה ה\"א) מתוך שחסידים היו תורתן מתברכת.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 35,
      "char_length": 410,
      "timestamp": "2025-02-06T19:19:44.294638"
    },
    {
      "id": "mishpatim_p36",
      "text": "ובזה מובן מה שכתב רשיז\"ל במה דכתיב אשר תשים ולא אשר תלמדם להורות שיטריח להבינם טעמי הדבר ופירושן כי להבין הדברים כפשוטן וכמשמען סגי בלימוד ב' או ג' פעמים, אמנם להבין מה שנכלל עוד מלבד פשטות הדברים כמו שנכלל כה\"ת כולה בעשרת הדברות וכדומה שזה תלוי בטעמי הדבר ופרושיהן מה שלאו כל מוחא סביל דא, זה תלוי עוד בקדושה וחסידות יתירה ע\"ד שאמרו תורתן מתברכת, ולכן אמר הקב\"ה למרע\"ה שיטריח לקדש אותם בקדושה יתירה שיבינו טעמי התורה ופירושן וזה וודאי נקרא מעשה רבה בתיקוני כוחות הנפשות, ולכן אמר ע\"ז אשר תשים ולא סגי בתלמדם בלבד ולכן הביא המדרש ע\"ז הקרא דמגיד דבריו ליעקב חקיו ומשפטיו לישראל, דפשוטי עם הנקראים יעקב הבינו הדברים ששמעו כמשמען, אבל מה שנכלל בה עוד חקים ומשפטים כמו שנכלל כהת\"כ בעשרת הדברות זה לא הבינו אלא בני עלי' הנקראים ישראל, וע\"ז סיים לא עשה כן לכל גוי שזה וודאי נקרא מעשה רבה להביאם לידי השגה זו ולא נעשה כזאת לכל גוי דאף שאמר להם הקב\"ה מדיני התורה בעת שהציע לפניהם לקבל התורה, אבל לא נאמר להם אלא הדברים כפשוטן ולא ניתן להם השגה זו לידע מה שנכלל עוד בזה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 36,
      "char_length": 961,
      "timestamp": "2025-02-06T19:19:44.511988"
    },
    {
      "id": "mishpatim_p37",
      "text": "ואפשר לפרש בזה דברי המדרש שנתקנאו בהם אוה\"ע ואמרו מה ראו אלו להתקרב יותר מן האומות, שלישראל ניתן התוה\"ק בהשגות גדולות מרובות, ולאוה\"ע אף שנאמר להם דברים כפשוטן אבל לא נודע להם שום השגה יותר ממשמעות הדברים, וע\"ז השיב להם הקב\"ה הביאו לי ספר יוחסין שלכם, שהשגות כאלו א\"א אלא בבני האבות הקדושים שמקור נשמתם ממקום גבוה, וגם הגרים כתבו שמינן נדחו ומקור נשמתם הוא מישראל, אבל א\"א זה באומה\"ע כמו שאמר עקילס הגר שלא ניתן הבנה זו אלא לישראל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 37,
      "char_length": 431,
      "timestamp": "2025-02-06T19:19:44.932072"
    },
    {
      "id": "mishpatim_p38",
      "text": "ואלה המשפטים אשר תשים לפניהם. בגמרא סנהדרין (דף ז' ע\"ב) מאי אשר תשים אשר תלמדם מיבעי ליה, ודרשו אלו כלי הדיינים מקל ורצועה וכו'. אמנם בפשטות עדיין צ\"ב מדוע כתיב לשון שימה ולא לשון לימוד.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 38,
      "char_length": 186,
      "timestamp": "2025-02-06T19:19:45.159297"
    },
    {
      "id": "mishpatim_p39",
      "text": "ונקדים מה שכתב אאמו\"ר זלה\"ה בקדושת יו\"ט לפרש המדרש ואלה המשפטים וגו' הה\"ד מגיד דבריו ליעקב וגו' לא עשה כן לכל גוי ומשפטים בל ידעום. דהנה הקב\"ה נתן לישראל את התורה, וברשותם לדרוש ולהוסיף בה כפי שכלי עיני העדה בכל דור ודור, וזאת לא מצינו אלא בישראל, אבל בעכו\"ם אף בשבע מצוות שלהם לא מצינו שיהא להם רשות להוסיף ולדרוש ולחדש בהם דבר, וז\"ש רש\"י ז\"ל ואלה מוסיף על הראשונים, ר\"ל מה שהחכמים שבכל דור ודור מוסיפים גדרים וסייגים על הראשונים, מה הראשונים מסיני אף אלו מסיני, כי הקב\"ה הראה למשה כל מה שתלמיד ותיק עתיד לחדש (שמו\"ר פכ\"ח ד) וז\"ש המדרש ואלה המשפטים וגו' ומיניה מרבינן כל מה שהחכמים מחדשים בכל דור ודור הה\"ד מגיד דבריו ליעקב וגו', שניתנה התורה לישראל לחדש בה כפי השגתם: אבל לא עשה כן לכל גוי ומשפטים בל ידעום שאין כח זה בידם, את\"ד ז\"ל. אמנם אף שכלולים כאן גם מה שעתידים החכמים לחדש בכל דור ודור, אבל לא לימד עדיין משה לישראל מה שעתיד להתחדש. כי עדיין לא היה אז הזמן לכך, וז\"ש הכתוב אשר תשים לפניהם ולא כתיב תלמדם, ר\"ל כי המשפטים העתידים להתחדש במשך הדורות שם משה לפניהם, כי כל מה שעתיד תלמיד ותיק לחדש מונח בתורה, אבל לא למד זאת עמהם, כי כל אחד ואחד מוכן לפניו חלקו שעתיד הוא לחדש בתוה\"ק,",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 39,
      "char_length": 1088,
      "timestamp": "2025-02-06T19:19:45.287074"
    },
    {
      "id": "mishpatim_p40",
      "text": "ואפשר לומר שע\"כ כתיב ''לפניהם\" ולא כתיב ''אליהם'', הכוונה ששם לפני כל אחד ואחד חלקו המוכן לו מאז מ\"ת ועל כן משכחת לפעמים שצריך להזדמן ולומר דרשה לקיבוץ עם רב, כי אם מוכן לאחד חלקו, א\"א לשום מרא דאתרא לומר זאת, והנה זכות הצדיק הולך עמו בכל מקום, ועושה רושם במקום ההוא לעולם, ואף ביציאת צדיק מן העיר נשאר רישומו, ובפרט כאן שהרבה פעמים היה מתגעגע אאמו\"ר זי\"ע הקדושת יו\"ט על הימים שהיה בטעטש, ובודאי גם זכותו נשאר פה. והשי\"ת ישים בפי שאכוון למה שמוכן לי וכמ\"ש אשר תשים לפניהם חלק המוכן לכאו\"א וע\"ד שפירש הדברי יחזקאל זי\"ע מאמה\"כ הקם לעבדך אמרתיך אשר ליראתיך, שכל אמרותי יהיו אשר ליראתך.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 40,
      "char_length": 582,
      "timestamp": "2025-02-06T19:19:45.810426"
    },
    {
      "id": "mishpatim_p41",
      "text": "להלן בפרשה (פכ\"ג י\"ג) ובכל אשר אמרתי אליכם תשמרו וגו', פירש\"י לעשות כל מצות עשה באזהרה שכל שמירה שבתורה אזהרה היא במקום לאו (מכילתא) עכ\"ל. והא דאין לוקין על מצות עשה כתב הרמב\"ן ז\"ל משום דהוי לאו שבכללות שכולל כל העשין שבתורה ולאו שבכללות אין לוקין עליו. ועפ\"י דרשה זו נתן החזקוני טעם למה דקיי\"ל עשה דוחה לא תעשה (יבמות ג' ע\"ב) משום דכל עשה ישנו גם באזהרה, וע\"כ אלים למדחי לא תעשה. אמנם הקשו המפרשים על דבריו, שהרי הא דעשה דוחה ל\"ת ילפינן ביבמות (שם) מכלאים בציצית, וא\"כ למה לי טעם החזקוני, ואפ\"ל שכוונת החזקוני לתת טעם וסברא למה דילפינן מכלאים בציצית דעשה דוחה ל\"ת, משום דבכל עשה איכא גם לאו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 41,
      "char_length": 592,
      "timestamp": "2025-02-06T19:19:46.120603"
    },
    {
      "id": "mishpatim_p42",
      "text": "עוד הקשו המפרשים דמנא לן למידרש ובכל אשר אמרתי אליכם תשמרו לעשות כל מ\"ע באזהרה, דילמא אתי לרבויי אזהרה ללאוין. וקושיא זו מעיקרא ליתא, שהרי אמרו ז\"ל (פסחים כ\"ד ע\"ב) כל היכא דאיכא לרבויי מרבינן ולא מוקמינן בלאוי יתירי, ע\"כ מוטב לדרוש ובכל אשר אמרתי אליכם תשמרו לעשות כל מ\"ע באזהרה, ומיניה ילפינן טעמא למה שנלמד מכלאים בציצית דעשה דוחה ל\"ת, מאשר נרבה אזהרה יתירה ללאוין.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 42,
      "char_length": 367,
      "timestamp": "2025-02-06T19:19:46.431854"
    },
    {
      "id": "mishpatim_p43",
      "text": "והנה איתא במס' שבת (דף י\"ח ע\"א) אין נותנין חטים לתוך הריחים של מים בע\"ש אלא בכדי שיטחנו מבעוד יום מ\"ט אמר רבה מפני שמשמעת קול א\"ל רב יוסף ולימא מר משום שביתת כלים דתניא ובכל אשר אמרתי אליכם תשמרו לרבות שביתת כלים אלא אמר ר' יוסף משום שביתת כלים, והשתא דאמרת ב\"ה אית להו שביתת כלים דאורייתא גפרית ומוגמר מ\"ט שרי משום דלא קעביד מעשה וכו'. ומסיק בגמרא והשתא דאמר ר' אושעיא אמר ר' אסי מאן תנא שביתת כלים דאויותא בית שמאי היא ולא ב\"ה לב\"ש בין קעביד מעשה בין לא קעביד מעשה אסור לב\"ה אע\"ג דקעביד מעשה שרי וכו', עכ\"ל הגמרא. והקשו התוספות (ד\"ה ולימא מר משום שביתת כלים) וא\"ת למאי דמסיק מאן תנא שביתת כלים דאו' ב\"ש היא מאי פריך ר' יוסף ולימא מר משום שביתת כלים וכי אינו יותר טוב כמו שמפרש רבה שמשמעת הקול ואתיא כב\"ה, ועיי\"ש מה שתירצו. והרשב\"א הוסיף להקשות דאמאי מוקי ר' אושעיא האי ברייתא כב\"ש, הלא אפשר לאוקמה כב\"ה מטעם שביתת כלים, וס\"ל לחלק בין עביד מעשה ללא עביד מעשה, ומה\"ת נוקי ברייתא כב\"ש.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 43,
      "char_length": 884,
      "timestamp": "2025-02-06T19:19:46.626328"
    },
    {
      "id": "mishpatim_p44",
      "text": "ונראה לתרץ הסוגיא, בהקדם מה שנחלקו ב\"ש וב\"ה במתניתין ריש מסכת ביצה השוחט חיה ועוף ביו\"ט ב\"ש אומרים יחפור בדקר ויכסה וב\"ה אומרים לא ישחוט אלא א\"כ היה לו עפר מוכן מבעוד יום ומודים שאם שחט שיחפור בדקר ויכסה. ואיתא בגמרא שם (דף ז' ע\"ב) א\"ר יהודה אמר רב לא שנו אלא שהיה לו דקר נעוץ מבעוד יום ופירש\"י ז\"ל דטעמא דב\"ה לאו משום דאתי עשה וכסהו בעפר ודחי ל\"ת דיו\"ט. אך הטו\"ז בהלכות יו\"ט סי' תצ\"ח (ס\"ק י\"א) כתב דבמסקנא לא סבירא ליה לגמרא כדר' יהודה אמר רב אלא דטעמא דשרי לשחוט חיה ועוף ביו\"ט ולחפור בדקר ולכסות דאתי עשה דכיסוי ודחי ל\"ת דיו\"ט אמנם כתבו התוספות (דף ח ע\"ב) דע\"כ לא אתיא כמאן דס\"ל דיו\"ט עשה ול\"ת, דא\"כ ודאי לא דחי עשה דכיסוי הדם לעשה ול\"ת דיו\"ט. ונראה לתרץ שגם לסברת האומר דיו\"ט עשה ולא תעשה א\"ש מה שמתירין ב\"ש לשחוט לכתחילה ולכסות כי אתי עשה דכיסוי ודחי עשה ול\"ת דיו\"ט. דהנה איתא במנחות (דף מ' ע\"ב) ת\"ר סדין בציצית בית שמאי פוטרין וב\"ה מחייבין (ופירש\"י ב\"ש פוטרין מן הציצית דלא דרשי סמוכין למשרי כלאים בציצית וב\"ה מחייבין ליה בציצית דדרשינן ביבמות (דף ד' ע\"א) סמוכין למשרי כלאים בציצית שנאמר לא תלבש שעטנז גדילים תעשה לך) ולכאורה לדברי ב\"ש דלא דרשי סמוכין מנא להו דעשה דוחה לא תעשה, שהרי הא דעשה דוחה ל\"ת ילפינן מדסמיך קרא כלאים לציצית, וב\"ש דלא דרשי סמוכין מנא להו דעשה דוחה ל\"ת.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 44,
      "char_length": 1182,
      "timestamp": "2025-02-06T19:19:47.076215"
    },
    {
      "id": "mishpatim_p45",
      "text": "וי\"ל דהנה ביבמות (דף ה' ע\"ב) פריך בגמרא אשכחן דאתי עשה ודחי ל\"ת גרידא ל\"ת שיש בו כרת היכא אשכחן דדחי וכ\"ת נילף ממילה (שדוחה שבת שהוא ל\"ת שיש בו כרת) מה למילה שכן נכרתו עליה י\"ג בריתות וכו' נילף מתמיד (שהקרבתו דוחה שבת) מה לתמיד שכן תדיר וכ\"ת נילף ממילה ותמיד מה למילה ותמיד שכן ישנן לפני הדיבור ואליבא דמ\"ד עולה שהקריבו ישראל במדבר עולת תמיד הוה (פירש\"י עולה שהקריבו ישראל במדבר, דכתיב (שמות כ\"ד) ויעלו עולות עולת תמיד הוה). והנה במס' חגיגה (דף ו' ע\"א) פליגי ב\"ש וב\"ה, ב\"ש ס\"ל עולה שהקריבו ישראל במדבר עולת ראיה הואי, וב\"ה ס\"ל עולה שהקריבו ישראל במדבר עולת תמיד הואי ע\"כ. נמצא כי לדברי ב\"ש דס\"ל דעולת ראיה הואי שפיר איכא למילף דעשה דוחה אפילו ל\"ת שיש בו כרת מתמיד שדוחה את השבת, וליכא למיפרך כפירכת הגמרא מה לתמיד שכן ישנו לפני הדבור, שהרי ס\"ל עולה שהקריבו ישראל במדבר עולת ראיה הואי, ועולת תמיד לא הואי לפני הדבור.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 45,
      "char_length": 815,
      "timestamp": "2025-02-06T19:19:47.743546"
    },
    {
      "id": "mishpatim_p46",
      "text": "ולפי\"ז א\"ש טעמא דב\"ש דסברי השוחט חיה ועוף ביו\"ט יחפור בדקר ויכסה, דכיון דילפי ב\"ש עשה דוחה ל\"ת מתמיד שדוחה את השבת, נשמע מיניה נמי דעשה דוחה ל\"ת ועשה, שהרי עשה דתמיד דחי ל\"ת ועשה דשבת, וא\"כ שפיר דחי עשה דכיסוי לעשה ול\"ת דיו\"ט. וגם א\"ש מה שהקשינו לב\"ש דלא דרשי סמוכין מנ\"ל עשה דוחה ל\"ת, שהרי ילפי מתמיד שדוחה את השבת.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 46,
      "char_length": 316,
      "timestamp": "2025-02-06T19:19:48.152353"
    },
    {
      "id": "mishpatim_p47",
      "text": "ועתה נבא ליישב קושיית התוספות והרשב\"א הנ\"ל, דהנה בחגיגה (דף ו' ע\"א) איתא אמר אביי ב\"ש ור' אלעזר ור' ישמעאל כולהו ס\"ל עולה שהקריבו ישראל במדבר עולת ראיה הואי וב\"ה ור\"ע ור' יוסי הגלילי כולהו ס\"ל עולת תמיד הואי. וכתבו התוספות (ד\"ה ור' ישמעאל) ואין להקשות ושבקי ב\"ה ועבדי כבית שמאי הלא ב\"ש במקום ב\"ה אינה משנה וי\"ל דס\"ל לא נחלקו ב\"ש וב\"ה בדבר זה עכ\"ל. הרי מצינו תרי תנאי דס\"ל לא נחלקו ב\"ש וב\"ה בדבר זה וכולהו ס\"ל עולה שהקריבו ישראל במדבר עולת ראיה הואי, וכן עלינו לתפוס דלא פליגי, ואף דבברייתא שם פליגי ב\"ש וב\"ה בזה, מ\"מ נאמר סמי חדא ברייתא דסבירא דפליגי, מקמי תרתי תנאי דס\"ל לא נחלקו ב\"ש וב\"ה בדבר זה, וא\"כ שפיר איכא למילף עשה דוחה לא תעשה מתמיד, שכן תמיד הוא עשה שאחר הדבור, ושוב ליכא למימר כדברי החזקוני דטעם עשה דוחה ל\"ת הוא משום דבכל עשה איכא נמי אזהרה דובכל אשר אמרתי אליכם תשמרו, כי דברי החזקוני אמורים רק אם נאמר דעשה דוחה ל''ת גרידא וילפינן לה מסמיכות כלאים לציצית, אזי איכא למימר דאתי אזהרת ובכל אשר אמרתי אליכם תשמרו לתת טעם וסברא למה דילפינן מסמוכין עשה דוחה ל\"ת, כי כל עשה ישנו גם באזהרה, משא\"כ אי ילפינן עשה דוחה ל\"ת מתמיד שדוחה שבת, ליכא למימר דטעמא דמילתא משום דבכל עשה איכא לאו, שהרי ילפינן מתמיד שעשה דוחה אפילו ל\"ת ועשה, ומאי אולמיה דעשה מפני שישנו באזהרה לדחות ל\"ת ועשה, אלא ע\"כ דלא אתי אזהרת ובכל אשר אמרתי אליכם תשמרו לרבות אזהרה לעשין, וא\"כ אייתר האי קרא למידרש מיניה לרבות שביתת כלים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 47,
      "char_length": 1304,
      "timestamp": "2025-02-06T19:19:48.342609"
    },
    {
      "id": "mishpatim_p48",
      "text": "והנה כתב הרמב\"ם ז\"ל בהקדמתו לספר הי\"ד, כי אביי ורבא קבלו מרבה ור' יוסף. ע\"כ. וכיון שמצינו דאביי ס\"ל במס' חגיגה שם דר\"א ור' ישמעאל ס\"ל כב\"ש דעולה שהקריבו ישראל במדבר עולת ראייה הואי, ועל כרחך לומר כמ\"ש התוספות דס\"ל לא נחלקו ב\"ש וב\"ה בדבר זה, וכולהו ס\"ל עולת ראייה הואי, וא\"כ שפיר ילפינן מתמיד עשה דוחה לא תעשה, שהרי עולת תמיד לאחר הדיבור הואי, ואם כן ליכא למימר דאתי בכל אשר אמרתי אליכם תשמרו לתת טעם למאי דאמרינן עשה דוחה ל\"ת, שהרי ילפינן מתמיד שעשה דוחה גם ל\"ת ועשה כנ\"ל, ואייתר לן קרא דובכל אשר אמרתי אליכם תשמרו לרבות שביתת כלים, וא\"כ כיון שע\"כ לומר דאביי ס\"ל דמרבינן מבכל אשר אמרתי אליכם תשמרו שביתת כלים, מסתמא קבל כן מרבה ור' יוסף רבותיו ואינהו נמי ס\"ל עולת ראיה הואי, ואייתר ובכל אשר אמרתי אליכם תשמרו לרבות שביתת כלים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 48,
      "char_length": 726,
      "timestamp": "2025-02-06T19:19:48.951956"
    },
    {
      "id": "mishpatim_p49",
      "text": "והשתא מובן היטב מה שהקשה ר' יוסף לרבה ולימא מר משום שביתת כלים שנאמר ובכל אשר אמרתי אליכם תשמרו. ולא קשה קושיית התוספות דאמאי פריך ולוקמה משום שביתת כלים דאתיא כב\"ש, שהרי רבה ור\"י ס\"ל דעולה שהקריבו ישראל במדבר עולת ראיה הואי כאביי, וע\"כ לומר דלא נחלקו ב\"ש וב\"ה בדבר זה, וגם ב\"ה ס\"ל הכי, וא\"כ אייתר קרא דובכל אשר אמרתי אליכם תשמרו לרבות שביתת כלים גם לב\"ה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 49,
      "char_length": 355,
      "timestamp": "2025-02-06T19:19:49.317018"
    },
    {
      "id": "mishpatim_p50",
      "text": "אמנם מסקנת הגמרא בחגיגה היא. דר' ישמעאל ס\"ל עולה שהקריבו ישראל במדבר עולת תמיד הואי, וסמי מכאן ר' ישמעאל, נמצא דלדברי ר' ישמעאל פליגי ב\"ש וב\"ה בזה, וגם בברייתא שם חזינן דפליגי ב\"ש וב\"ה בדבר זה, ורק ר' אליעזר לחודיה ס\"ל עולת ראיה הואי ולא נחלקו ב\"ש וב\"ה בדבר זה, וא\"כ ר\"א יחידאה הוא נגד הברייתא וכולהו תנאי, דסבירא להו עולת תמיד הואי לפני הדבור כדברי ב\"ה, וא\"כ ליכא למילף עשה דוחה ל\"ת מתמיד, דאיכא למיפרך מה לתמיד שכן ישנו לפני הדבור, וע\"כ לומר דילפינן עשה דוחה ל\"ת מסמיכות כלאים לציצית, וא\"כ איכא למימר דאתי ובכל אשר אמרתי אליכם תשמרו לתת טעם למאי דאמרינן עשה דוחה ל\"ת כדברי החזקוני, ולא אייתר קרא לרבות שביתת כלים לדעת ב\"ה. שהרי איצטריך קרא לעשה דוחה ל\"ת, ע\"כ מסיק בגמרא מאן תנא שביתת כלים ב\"ש הוא, דס\"ל עולת ראייה הואי, ואיכא למילף מתמיד עשה דוחה ל\"ת ואייתר בכל אשר אמרתי אליכם תשמרו לרבות שביתת כלים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 50,
      "char_length": 803,
      "timestamp": "2025-02-06T19:19:49.527857"
    },
    {
      "id": "mishpatim_p51",
      "text": "ומיושב שפיר מה שהקשה הרשב\"א ז\"ל אמאי מסיק ר' אושעיא מאן תנא שביתת כלים דאורייתא בית שמאי היא. הלא אפשר לאוקמה כבית הלל וסבירא ליה לחלק בין עביד מעשה ללא עביד מעשה, והשתא ניחא, דמסקנת ר' אושעיא הכא היא כמסקנת הגמרא בחגיגה, דב\"ה ס\"ל עולה שהקריבו ישראל במדבר עולת תמיד הואי, וא\"כ ליכא למילף עדל\"ת מתמיד, שכן ישנו לפני הדבור, וע\"כ ילפינן ליה מכלאים בציצית, ואיצטריך קרא דובכל אשר אמרתי אליכם תשמרו לתת טעם וסברא למאי דילפינן מכלאים עדל\"ת, ולית להו לב\"ה שביתת כלים דאורייתא ואף ר' ישמעאל דס\"ל למסקנת הגמרא בחגיגה כב\"ה דעולת תמיד הואי, על כרחך ס\"ל דילפינן עשה דוחה ל\"ת מקרא דובכל אשר אמרתי אליכם תשמרו, שהרי לדידיה ליכא למילף עדל\"ת מדסמיך קרא כלאים לציצית, דכתב הר\"ש מקינון ז\"ל בספר הכריתות דלא דריש ר' ישמעאל סמוכין מדלא מני ליה בהדי שלש עשרה מדות שהתורה נדרשת בהן, ועל כרחך יליף עדל\"ת מבכל אשר אמרתי אליכם תשמרו",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 51,
      "char_length": 807,
      "timestamp": "2025-02-06T19:19:49.961252"
    },
    {
      "id": "mishpatim_p52",
      "text": "ועל פי האמור דלא דריש ר' ישמעאל סמוכין, נראה לפרש דברי המדרש פליאה (הובא בישמח משה פ' בשלח) הים ראה וינוס, מה ראה, ברייתא דר' ישמעאל ראה. דהנה איתא במד\"ר (שמות פכ\"ג ז') ואני אשיר עוזך (תהלים נ\"ט). אימתי בשעה שעמדו ישראל על הים ואומרים שירה שנאמר אז ישיר משה (שמות ט\"ו), ומה אמרו עזי וזמרת יה. וארנן לבקר חסדך וכו'. אותו הבקר של מתן תורה שנאמר (שמות י\"ט) ויהי ביום השלישי בהיות הבקר, ופי' אא\"ז זלה\"ה בייטב לב פ' בשלח, דהנה השר קטרג מה נשתנו אלו מאלו וכו', כי באמת מצד העבר עדיין לא. היו ישראל ראוים לנס גדול כקריעת ים סוף, אמנם ישראל קבלו עליהם מהיום והלאה מלכותו יתברך בנפש חפצה, לשמור מצוותיו חקותיו ותורותיו אשר יצוה להם בהר סיני, ובזכות זה נקרע הים לפניהם כי כך מדתו יתברך להיטיב לישראל אף אם לפי מעשיהם אינם ראוים עדיין לאותה טובה, צופה ומביט במה שהם עתידין להיטיב ואינו מביט על מה שעתידין לחטוא, כדאיתא בגמרא ר\"ה (דף ט\"ז ע\"ב) א\"ר יצחק אין דנין את האדם אלא לפי מעשיו ולכן אף שהיו ישראל עתידין לחטוא בעגל לא דנם הקב\"ה אלא לפי מעשיהם באותה שעה, ולעומת זאת חשב להם זכות שעתידין הם לקבל התורה, ומצורף לזה גם מחשבתם הטובה שקבלו עליהם מיד לשמור ולעשות מצוות ה' שעתיד הוא לצוותם, ובזכות זאת קרע הים לפניהם, וז\"ש המדרש ואני אשיר עוזך שזכו שיקרע הים לפניהם ויאמרו שירה, ואף שלא היו ראוים לכך לפי מעשיהם באותה שעה, צירף להם הקב\"ה זכות של וארנן לבקר חסדך, זה בקרו של מתן תורה עכת\"ד ז\"ל",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 52,
      "char_length": 1278,
      "timestamp": "2025-02-06T19:19:50.339922"
    },
    {
      "id": "mishpatim_p53",
      "text": "אך אכתי קשה, שהרי אמרו ז\"ל במס' סנהדרין (דף ע\"א ע\"ב) בן סורר ומורה נידון על שם סופו ותניא ר' יוסי הגלילי אומר וכי בשביל שאכל זה תרטימר בשר וכו' אמרה תורה יצא לב\"ד ליסקל אלא הגיעה תורה לסוף דעתו וכו'. ע\"כ. הרי להדיא שדנין את האדם ע\"ש העתיד אף לרעה, וקושיא זו הקשה הרא\"ם ז\"ל (בפ' תצא) ממה שאמרו ז\"ל גבי ישמעאל (בראשית רבה פנ\"ג י\"ט) שהיו מלאכי השרת מקטרגים לפני הקב\"ה רבון העולמים אדם שהוא עתיד להמית בניך בצמא את מעלה לו באר, א\"ל עכשיו מה הוא צדיק או רשע אמרו לו צדיק, א\"ל איני דן את האדם אלא בשעתו, ותירץ דיש חילוק בדבר אם התחיל כבר להזיד ולהרשיע, אזי דנו השי\"ת גם לפי מעשיו הרעים שהוא עתיד לעשות, משום דחזי לאיצטרופי עם המעשים הרעים שכבר החל לעשות, ועל כן נידון בן סורר ומורה על שם סופו, לפי שהתחיל כבר להרשיע, והא דאמרינן שאין האדם נידון אלא בשעתו היינו היכא שלא חטא עדיין. ע\"כ. ועפי\"ז א\"ש שלא חשבה להם ה' לרעה מה שהם עתידים לחטוא בעגל, כי עדיין לא החלו בחטא.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 53,
      "char_length": 860,
      "timestamp": "2025-02-06T19:19:50.965392"
    },
    {
      "id": "mishpatim_p54",
      "text": "אמנם המהר\"ם גלאנטי ז\"ל כתב טעמא אחרינא למה דאמרינן בן סורר ומורה נידון על שם סופו כי החמירה תורה לפי שנולד מאיסורי ביאה, ולפי טעם זה איכא למימר דבעלמא אין הקב\"ה דן את האדם ע\"ש סופו אף היכא דהתחיל כבר בעבירה, כי שאני בן סורר ומורה שנולד מאיסורי ביאה, ברם הא דבן סורר ומורה נולד מאיסורי ביאה ילפינן מדנסמכה פרשת בן סורר ומורה לפרשת יפת תואר, כדאיתא במדרש תנחומא (ריש פ' תצא) וא\"כ ר\"י דלא דריש סמוכין כמ\"ש בספר הכריתות, לית ליה הך דרשה דבן סורר ומורה בא מאיסורי ביאה, וע\"כ לומר כי טעם שהוא נידון ע\"ש העתיד, כמ\"ש המזרחי משום שכבר החל בעברה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 54,
      "char_length": 536,
      "timestamp": "2025-02-06T19:19:51.445666"
    },
    {
      "id": "mishpatim_p55",
      "text": "והשתא יובנו דברי המדרש פליאה כמין חומר הים ראה וינוס מה ראה וכו', פירוש הוקשה לו דלכאורה לא היו ישראל ראויים עדיין באותה שעה שיקרע הים לפניהם, ובאיזה זכות נעשה להם נס גדול כ\"כ, וע\"כ לומר שצירף להם הקב\"ה מה שעתידים הם לקבל את התורה, כיון שכבר התחילו לעשות מעשים טובים וקבלו עליהם לקיים מצוות ה' אשר יצוום בהר סיני, חזי לאיצטרופי עם זכות התורה שהם עתידים לקבל ומנא לן סברא זו דהיכא שהתחיל בדבר הקב\"ה דן ע\"ש העתיד, ונראה דילפינן ליה מבן סורר ומורה שנהרג ע\"ש סופו, וקשה הא אין הקב\"ה דן את האדם ע\"ש העתיד, וי\"ל כתירוץ המזרחי ז\"ל דשאני בן סורר ומורה שכבר החל לעשות מעשים רעים, ע\"כ נידון הוא ע\"ש סופו. וא\"כ א\"ש מה שנקרע הים לפני ישראל בזכות שעתידין הם לקבל את התורה, אף שבאותה שעה לא היו ראויים לנס גדול כ\"כ, מ\"מ כיון שכבר התחילו במעשים טובים חזי לאיצטרופי עם מה שעתידים הם לקבל את התורה, וק\"ו הוא מבן סורר ומורה כי מרובה מדה טובה. אמנם אם נאמר כי טעם שבן סורר ומורה נידון על שם סופו משום שנולד מאיסורי ביאה כסברת המהר\"ם גלאנטי, א\"כ ליכא למילף מינה דבעלמא דנין על שם העתיד, דשאני בן סורר ומורה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 55,
      "char_length": 987,
      "timestamp": "2025-02-06T19:19:51.747903"
    },
    {
      "id": "mishpatim_p56",
      "text": "וזאת כונת המדרש מה ראה ברייתא דר' ישמעאל ראה, ר\"ל ברייתא דר' ישמעאל אומר בשלש עשרה מדות התורה נדרשת בהם, שממנה נשמע דלא דריש ר' ישמעאל סמוכין, כמ\"ש הר\"ש מקינון, וא\"כ ליכא למימר כסברת המהר\"ם גלאנטי ז\"ל דטעם שבן סורר ומורה נידון ע\"ש סופו משום שנולד מאיסורי ביאה, שהרי לא דרשינן סמיכות פרשת בן סו\"מ לפרשת יפ\"ת וע\"כ דהטעם הוא משום דהתחיל בעבירה חזי לאיצטרופי, וא\"כ מרובה מדה טובה שצירף הקב\"ה לישראל זכות שעתידים הם לקבל התורה, כיון שכבר התחילו במצוה וקבלו עליהם לשמור התורה וע\"כ נקרע הים בפניהם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 56,
      "char_length": 491,
      "timestamp": "2025-02-06T19:19:52.218355"
    },
    {
      "id": "mishpatim_p57",
      "text": "ועפ\"י זה יש לפרש דברי המדרש (בראשית רבה פפ\"ד) עה\"פ וישנאו אותו וגו' (בראשית פל\"ז) למה וישנאו אותו כדי שיקרע הים בפניהם. דהנה איתא בשל\"ה הקדוש (פ' וישב) כי השבטים דנו את יוסף למיתה עפ\"י ד\"ת כחולק על מלכות בית דוד כי יהודה היה מלך באחיו והחולק על מלכות ב\"ד חייב מיתה. ולכאורה היה יהודה יכול למחול לו, ואף דקיי\"ל (כתובות י\"ז ע\"א) מלך שמחל על כבודו אין כבודו מחול, היינו טעמא מפני שאינו יכול למחול כבוד העם, משא\"כ הכא שכל העם דהיינו השבטים היו באותו מעמד והיו כולם יכולים למחול, וע\"כ צ\"ל כדאיתא במד\"ר פ' וישב עה\"פ הנה בעל החלומות הלזה בא, א\"ר לוי זה עתיד להשיאם לבעלים (ופירש במתנות כהונה להשיאם לבעלים, להשתחוות לבעל ובעל קדריש לשון בעלים ורמז לירבעם ואחאב שבאו מיוסף ע\"כ) ועל שם שעתידין לצאת ממנו עובדי ע\"ז דנוהו השבטים למיתה, ולכאורה הא אין דנין את האדם אלא לפי מעשיו באותה שעה כדכתיב גבי ישמעאל (בראשית כ\"א) באשר הוא שם, ועל כרחך לומר דהתחיל בעבירה שאני, ולזה כיון שיוסף התחיל בעבירה לדעתם, שמרד במלכות בית דוד, חזי לאיצטרופי עם מה שעתיד הוא להשיאם לבעלים, וע\"כ דנוהו ע\"ש העתיד.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 57,
      "char_length": 978,
      "timestamp": "2025-02-06T19:19:52.478966"
    },
    {
      "id": "mishpatim_p58",
      "text": "וזאת כונת המדרש למה וישנאו אותו, הרי מה שדנוהו למיתה היה משום שמרד במלכות בית דוד, והיו יכולים למחול לו, וע\"כ לומר שדנוהו על שעתידים לצאת ממנו ירבעם ואחאב שישיאו את ישראל לעבוד ע\"ז, ולכאורה אין דנים ע\"ש העתיד, וצ\"ל כי כיון שהתחיל בעבירה שמרד במלכות ב\"ד חזי לאיצטרופי ודנין גם על העתיד, וז\"ש המדרש כדי שיקרע הים בפניהם, כי גם לנס קריעת ים סוף לא היו ישראל ראוים באותה שעה, אלא כיון שהתחילו במצוה במה שקבלו עליהם לשמור מצוות השי\"ת צירף להם הקב\"ה זכות שעתידים הם לקבל את התורה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 58,
      "char_length": 474,
      "timestamp": "2025-02-06T19:19:52.941822"
    },
    {
      "id": "mishpatim_p59",
      "text": "היוצא מדברנו כי מאד מאד חייב האדם להזהר בכל תנועה ותנועה לבל יחטא ואשם אפילו בחטא כל דהו, כי גם חצי שיעור חזי לאיצטרופי ויבא ח\"ו לידי איסור שלם, וז\"פ הפסוק ''ובכל'' אשר אמרתי אליכם תשמרו, דהנה תיבת ''כל'' אתי לרבויי חצי שיעור, ע\"ד דאיתא ביומא (דף ע\"ג ע\"ב) אמר ר' יוחנן חצי שיעור אסור מן התורה ויליף לה מדכתיב כל חלב וגו' לרבות חצי שיעור, ועל זאת בא הכתוב להזהיר ''ובכל\" אשר אמרתי אליכם אפילו חצי שיעור ונדנוד עבירה כל שהוא תשמרו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 59,
      "char_length": 429,
      "timestamp": "2025-02-06T19:19:53.176815"
    },
    {
      "id": "mishpatim_p60",
      "text": "וכיון שכל תנועה קטנה של חטא מצטרפת, מה מאד על האדם להשגיח עם מי הוא מתחבר וישנא קהל מרעים ועם רשעים לא ישב, וביותר צריך האדם להתרחק מחברת הכשרים המתחברים עם הרשעים, וכמ\"ש החיד\"א ז\"ל בספרו חסדי אבות עמ\"ס אבות לפרש המשנה (אבות פ\"א מ\"ז) הרחק משכן רע ואל תתחבר לרשע, דלכאורה מה טיבו דהאי שכן רע אם הוא רשע א\"כ למה כפל התנא דבריו לומר פעם שנית ואל תתחבר לרשע, גם למה ברשע אמר אל תתחבר, ובשכן רע הזהיר ביתר שאת להתרחק ממנו. וביאר דהאי שכן רע פירושו שהוא שכן לרע, אבל הוא בעצמו נראה כצדיק במעשיו, ומאיש כזה חייבים להרחיק יותר ממי שהוא רשע בפרהסיא, כי ממעשה הרשע לא יבאו ללמוד לפי שהוא גלוי ומפורסם ברשעו ודי באזהרה שלא להתחבר עמו, אבל מי שהוא נראה כצדיק למדים ממעשיו, וכיון שהוא שכן לרע יבוא להשפיע ממעשיו הרעים ומדרכיו המקולקלים על אחרים, על כן הזהיר התנא להתרחק ממנו עד קצה האחרון עכת\"ד ז\"ל. וצריך האדם להרחיק מלהתחבר עם הכשרים המתחברים עם הרשעים אפילו כשההתחברות היא בדברים שנראה לעין שאין בהם נדנוד עבירה, כי כל הכתות שקמו לעשות חדשות הם שוא ותוהו ולא תצמח כל תועלת ממעשיהם, ואין גם אחד אשר ידע באיזה אופן תבא ישועת ה' לישראל, אמנם זה ברור אשר באותו אופן שמדמים בודאי לא תהיה, וכמו שמצינו בקריעת ים סוף שנחלקו ישראל לארבע כתות אחת אומרת נפול לים ואחת אומרת נחזור למצרים ואחת אומרת נעשה מלחמה כנגדן ואחת אומרת נצווח כנגדן (ילקוט פ' בשלח). והישועה היתה באופן שלא חשב גם אחד מהם שנקרע הים לפניהם וכמו כן הגאולה העתידה תבא בדרך שלא חשב אדם מעולם, וכמ\"ש בספר בינה לעתים עה\"פ (תהלים ט) כי לא לנצח ישכח אביון תקות עניים תאבד לעד, דהכי פירושו כי מבטיח הכתוב שלא לנצח ישכחנו השי\"ת ובבא העת תהיה הגאולה השלמה אמנם תקות עניים, היינו האופן שמקוים ומחשבים שתבא הישועה, תאבד לעד, כי לא תבא הישועה בדרך שחושבין, אלא בדרך נעלמה מעין כל חי, יה\"ר שנזכה לה במהרה בימינו. אבל צריך התחזקות והתאמצות גדולה בזמן הקצר שעדיין נותר לנו לבל נפול ברשת זו טמנו פועלי און וחייבים לעמוד על המשמר בכל תנועה כי חזי לאיצטרופי אל העתיד.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 60,
      "char_length": 1798,
      "timestamp": "2025-02-06T19:19:53.414032"
    },
    {
      "id": "mishpatim_p61",
      "text": "עוד יש לפרש דברי המדרש הים ראה וינוס מה ראה ברייתא דר' ישמעאל ראה עפ\"י מה שאמרנו לפרש דברי המדרש פליאה עה\"פ ויעבידו מצרים את בני ישראל בפרך (שמות א) חד אמר בק\"ו וחד אמר בגז\"ש עוד איתא במדרש רבה ר\"פ שמות ויעבידו מצרים את בני ישראל בפרך ר\"א אומר בפה רך ר\"ש בר נחמן אומר בפריכה בעבודה המפרכת את הגוף ומשברתו. ובארנו (עי' בדברינו לעיל פ' בראשית דף פ\"ד) דפלוגתתן תליא בפלוגתא דר\"י וריש לקיש במס' ברכות (דף ה' ע\"א) דר' יוחנן ס\"ל יסורין ממרקין עוונותיו של אדם בק\"ו משן ועין ומה שן ועין שהם אחד מאיבריו של אדם עבד יוצא בהם לחרות יסורין שממרקין כל גופו של אדם על אחת כמה וכמה ור\"ש בן לקיש יליף לה מגז\"ש נאמר ברית במלח ונאמר ברית ביסורין מה ברית האמור במלח מלח ממתקת את הבשר אף ברית האמור ביסורין יסורין ממרקין עוונותיו של אדם ע\"כ. ואפ\"ל כי חלוק יש אי ילפינן לה מקל וחומר או מגז\"ש, דאי ילפינן לה מק\"ו א\"כ כל מה שהיסורין קשים יותר הם ממרקין יותר, שהרי הק\"ו אלים יותר ומה אם יסורין מועטין כשן ועין מועילים לעבד שיצא לחרות, כ\"ש יסורין מרובין מועילין למרק עונות, אמנם אי ילפינן יסורין ממרקין בגז\"ש ברית ברית ממלח די למרק העונות במעט יסורין. דוגמת המלח הממתיק את הבשר רק בפיזור מלח מעט, אבל אם יזרה עליו מלח יתר על המדה יתקלקל המאכל וכמו כן מעט יסורין בבחינת חצי שיעור דיים למרק עונות.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 61,
      "char_length": 1170,
      "timestamp": "2025-02-06T19:19:54.274612"
    },
    {
      "id": "mishpatim_p62",
      "text": "ובזה אפ\"ל דברי המדרש פליאה ויעבידו מצרים וגו' בפרך ח\"א בק\"ו וח\"א בגז\"ש, דפליגי בפלוגתת ר\"י וריש לקיש מהיכא ילפינן יסורין ממרקין עוונותיו של אדם, דלמאן דיליף בק\"ו משן ועין פירוש תיבת פרך הוא כפשוטה, כי כל מה שהרבו יסורים על ישראל הועיל להם לכפרת עונותיהם, ומ\"ד בגז\"ש ס\"ל כריש לקיש דדי ביסורין מעטים ופירוש תיבת פרך הוא בפה רך והני אמוראי פליגי בפלוגתא דהני אמוראי במדרש רבה ר\"א אמר בפה רך דס\"ל שדי ביסורים מעטים ור\"ש ב\"ר נחמן ס\"ל בפריכה בעבודה המפרכת את הגוף, והנה כתבו התוספות דהיכא דאיכא למילף מילתא בק\"ו וגם בגז\"ש הק\"ו איננו עיקר ונסתר בפירכא כל דהו. והכא איכא למיפרך האי ק\"ו משן ועין דשן ועין אין יוצא בו אלא עבד כנעני, וליכא למילף מינה מילתא לישראל, וא\"כ נותרה לנו רק הגז\"ש ברית ברית ממלח, ומכח הגזרה שוה די ביסורים מעטים, וא\"כ בדין יצאו ישראל קודם זמנם, כי השלים קושי השעבוד את הזמן כמ\"ש הפר\"ד ז\"ל, שהרי היה די להם ביסורין מעטים דוגמת מלח הממתק את הבשר רק במעט, וע\"י ששעבדו בהם מצרים בעבודה קשה יצאו לחרות לפני הזמן.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 62,
      "char_length": 921,
      "timestamp": "2025-02-06T19:19:54.816590"
    },
    {
      "id": "mishpatim_p63",
      "text": "וזאת כונת המדרש הים ראה וינוס מה ראה ברייתא דר' ישמעאל ראה. דהיינו ברייתא דשלש עשרה מדות שהתורה נדרשת בהם, וביניהם ק\"ו וגז\"ש דמינייהו ילפינן יסורין ממרקין עוונותיו של אדם, ולפי דברי התוספות הנ\"ל היכא דאיכא ק\"ו וגזירה שוה הגזירה שוה עיקר, ונמצא שהיה די להם ביסורים קלים וקושי השעבוד השלים את הזמן. וזה כונת המדרש מה ראה הים להקרע בפניהם שהרי עדיין לא נשלם הזמן, ברייתא דר' ישמעאל ראה, דדרשינן גז\"ש, ודי ביסורין קלין וקושי השעבוד השלים וע\"כ נקרע הים בפניהם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 63,
      "char_length": 455,
      "timestamp": "2025-02-06T19:19:55.259420"
    },
    {
      "id": "mishpatim_p64",
      "text": "נחזור לעניננו שצריך להשגיח על כל פסיעה ופסיעה שלא להכשל בחטא, וזה אפ\"ל בכונת המשנה (ריש מס' שקלים) באחד באדר משמיעים על השקלים ועל הכלאים, דהנה כתבו הספרים דמחצית השקל רומז על אחדות, כי כל אחד מישראל הוא רק בבחינת חצי ונעדר השלימות, ושלימותו תהיה רק בהתחברות עם ישראל, ועל כן כיון שהזהירנו על האחדות ע\"י נתינת חצאי השקלים, רמז לנו כי כשם שמצוה להתחבר עם הצדיקים, כן אסור להתחבר עם הרשעים, וכמו דאיתא באבות דר\"נ (פ\"ל ג) ר' עקיבא אומר כל המדבק בעוברי עבירה אע\"פ שלא עשה כמעשיהם הרי זה מקבל פורעניות כיוצא בהם וכל המדבק בעושי מצוה אע\"פ שלא עשה כמעשיהם מקבל שכר כיוצא בהן, ע\"כ. וע\"כ השמיעו גם על הכלאים להזהר מאד מלהתערב ומלהתחבר עם הרשעים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 64,
      "char_length": 636,
      "timestamp": "2025-02-06T19:19:55.497229"
    },
    {
      "id": "mishpatim_p65",
      "text": "וזה אפ\"ל בכוונת המדרש פליאה (הביאו אאמו\"ר זלה\"ה בספרו קדוי\"ט) כשראתה שרה שמשה לא יכנס לארץ אמרה גרש האמה הזאת ואת בנה, דהנה מבואר בזה\"ק (בראשית כ\"ז ע\"ב ושם דף כ\"ח ע\"ב) דבגינייהו דערב רב נקבר משה בחו\"ל, ומזה ראתה מה מזקת היא ההתחברות עם הע''ר, על כן אמרה גרש האמה הזאת ואת בנה שלא תהיה התחברות בינו לבין יצחק.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 65,
      "char_length": 308,
      "timestamp": "2025-02-06T19:19:55.817585"
    },
    {
      "id": "mishpatim_p66",
      "text": "אור ליום ד' פרשת לך (תרפ\"ז) ראיתי בחלומי והנה הוא ליל שבת קודש פ' משפטים, ועלה בדעתי לפרש דברי המדרש ואלה המשפטים אשר תשים לפניהם, הה\"ד מגיד דבריו ליעקב חקיו ומשפטיו לישראל לא עשה כן לכל גוי ומשפטים בל ידעום, והנה יש להבין שהתחיל לומר חקיו ומשפטיו לישראל, ומסיים רק ומשפטים בל ידעום ולא הזכיר חקיו, דמשמע שרק המשפטים לא נתן להם אבל החוקים נתן להם וזה אינו (דאדרבה הוא בהיפך דבני נח מצווין על הדינין אבל החוקים לא נתן להם).",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 66,
      "char_length": 422,
      "timestamp": "2025-02-06T19:19:56.000139"
    },
    {
      "id": "mishpatim_p67",
      "text": "אלא נ\"ל דהנה באמת התוה\"ק שנתנה לישראל מפי הגבורה לא נתפרשו בה טעמי המצות אלא גזירת מלך היא. אך כל ת\"ח שעוסק בתורה ובמצות הוא מוצא בה טעמים חדשים בכל עת (עירובין נ\"ד ע\"ב) וא\"כ אף מה שהוא אצלו חק בלי טעם בתחילה, אבל ע\"י תורתו מחדש בה שכליות ומוצא בה ענינים נפלאים ושוב רואה שאינם חק בלי טעם, אלא הכל הוא שכליות וטעמים עמוקים עד אין חקר, אבל כל זה רק בישראל שקבלו התורה ודבוקים בשכלם בעצם התורה הק', לזה דעתם דעת תורה ומתחדש בשכלם במצות השם כמה ענינים, אבל אומות העולם אף כי גם להם נתן מצות, אבל שיחדשו בשכלם לאמיתתו במצות השם זה דבר שא\"א, כי אין דעתם מכוונת כלל למצותיו יתברך. ואף בישראל כתב הסמ\"ע בש\"ע חו\"מ (סי' ג' ס\"ק י\"ג) בשם תשובת מהרי\"ו דפסקי הלומדים ופסקי הבעה\"ב המה שני הפכים הרי שאף הבעה\"ב שאינם עוסקים בתורה הקדושה דעתם מכוונת היפך דעת התוה\"ק, וא\"א לכוין לעניני התורה אלא ע\"י דעת תורה ועאכו\"כ שק''ו הוא באוה\"ע שדעתם הוא היפך דעת תוה\"ק וא\"א שיכוונו בדעתם במצות השם לאמיתת הענין.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 67,
      "char_length": 884,
      "timestamp": "2025-02-06T19:19:56.222255"
    },
    {
      "id": "mishpatim_p68",
      "text": "והנה המצות שנמסרו מאתו יתברך ואף הז' מצות לא נתן בהם שום טעם רק גזירת המלך, וכיון שהאוה\"ע לא יוכלו לחדש משכלם שום טעם, א\"כ נשארו המצות אצלם הכל כחוק בלי טעם, ולא כן בישראל אשר בדעת שכלם מחדשים בה טעמים והוא דעת תורה ממש. והנה חק נקרא מה שהוא בלא טעם, ומשפט נקרא דבר שהשכל מחייבו, וז\"ש חקיו ומשפטיו לישראל, דבישראל אף מה שהוא חוקים מתחילה אח\"כ יהי' משפטים, דהשכל מחייבו לעשות. אבל לא עשה כן לכל גוי שיהי' להם דעת תורה, לכן ומשפטים בל ידעום, דהכל רק חק אצלם ואין להם משפע שכליות בשום מצוה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 68,
      "char_length": 487,
      "timestamp": "2025-02-06T19:19:56.667901"
    },
    {
      "id": "mishpatim_p69",
      "text": "ונראה לפרש דברי רש\"י ז\"ל אשר תשים לפניהם אמר לו הקב\"ה למשה לא תעלה על דעתך לומר אשנה להם הפרק וההלכה ב' או ג' פעמים עד שתהא סדורה בפיהם כמשנתה ואיני מטריח עצמי להבינם טעמי הדבר ופירושו לכך נאמר אשר תשים לפניהם כשלחן הערוך ומוכן לאכול וכו', ר\"ל שלא יעלה על דעתך שלא לשנות עמהם ההלכה אלא כמשנתה, היינו כמו שנישנית לו בהר סיני סתם, כי הטעמים והביאורים השיג מרע\"ה בדעתו הרחבה, ויהי' חושש בדבר שאין בכלל עצם התוה\"ק אלא גוף הגזירה שגזר מלכו של עולם יתברך בלי שום טעם לזה אמר לו אשר תשים לפניהם כשלחן הערוך, להבינם גם הטעמים שהכל הוא מעצם התורה אצל ישראל שיש להם דעת תורה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 69,
      "char_length": 565,
      "timestamp": "2025-02-06T19:19:56.944580"
    },
    {
      "id": "mishpatim_p70",
      "text": "ומובן בזה ג\"כ דברי רש\"י ז\"ל והוא מהמדרש ואלה המשפטים כל מקום שנאמר אלה פוסל את הראשונים ואלה מוסיף על הראשונים מה הראשונים מסיני אף אלו מסיני. ר\"ל הכוונה על מה שאמר שם אשר תשים לפניהם, והכוונה בזה על הבנת הטעמים כפירוש רש\"י, וזה נתחדש ונתבאר בשכלו הזך אחר ששנה עצם ההלכה בסיני, לזה אמר מה עליונים מסיני היינו גופי ההלכות כמשנתן שנתנו בהר סיני, כך אלו הבנות הטעמים והביאורים שנתבארו לו בכל פעם יותר הכל הוא מסיני, כל מה שהשיג בדעת התורה, ומובן היטב קישור הכתוב מגיד דבריו ליעקב כנ\"ל, (כל זה ראיתי בחלומי כאשר כתבתי פה מתחילה ועד סוף ואיקץ, והתבוננתי בדבר והנה הוא ענין פלא ודבר נחמד, לזה רשמתי לי למזכרת).",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 70,
      "char_length": 604,
      "timestamp": "2025-02-06T19:19:57.224747"
    },
    {
      "id": "mishpatim_p71",
      "text": "ונ\"ל לפענ\"ד לפרש בזה דברי חכז\"ל (איכה רבתי פ\"ב סי' י\"ז) אם יאמר לך אדם יש חכמה בגוים תאמין הה\"ד (עובדי' א') והאבדתי חכמים מאדום ותבונה מהר עשו, יש תורה בגוים אל תאמין דכתיב מלכה ושריה בגוים אין תורה, רצ\"ל דאף שיש ביניהם חכמים מופלגים בשאר חכמות, אבל שיחדשו בשכלן איזה ענין בתורה הק' זה אי אפשר כי לא עשה כן לכל גוי שיוכלו לכוין לדעת תורה, וז\"ש בגוים אין תורה כי לא נתן מתנה זו רק לישראל עם קרובו הדבקים בה' ובתורתו הקדושה, אשרי העם שככה לו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 71,
      "char_length": 440,
      "timestamp": "2025-02-06T19:19:57.584247"
    },
    {
      "id": "mishpatim_p72",
      "text": "ואלה המשפטים אשר תשים לפניהם. פירש\"י ז\"ל לפניהם ולא לפני עכו\"ם וצ\"ב. בגמרא סנהדרין (ז' ע\"ב) איתא מאי אשר תשים תלמדם מיבעי ליה א''ר ירמיה ואיתימא ר' חייא בר אבא אלו כלי הדיינים וצ\"ב.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 72,
      "char_length": 181,
      "timestamp": "2025-02-06T19:19:57.884712"
    },
    {
      "id": "mishpatim_p73",
      "text": "ונ\"ל לבאר הענין בהקדם דברי ק\"ז הישמח משה זלה\"ה (פ' מעות) עה\"פ וידבר משה אל ראשי המעות לבני ישראל וגו' איש כי ידור נדר לה' וגו' דהנה ע\"כ אין לומר שהכתוב מדבר בנדרי רשות שהרי אמרו ז\"ל (נדרים כ\"ב ע\"א) תניא ר' נתן אומר הנודר כאילו בנה במה (בשעת איסור הבמות) והמקיימו כאילו הקריב עליה (קרבן בשעת האיסור) ע\"כ. וא\"כ הנודר רעה הוא עושה, ואיך כתיב נדר לה', והלא אמרו ז\"ל (בראשית רבה פ\"ג ח') אין הקב\"ה מיחד שמו על הרעה, אלא ע\"כ לומר כי נדר לה' היינו לדבר מצוה, כדאיתא במס' נדרים (דף ז' ע\"ב) א\"ר גידל אמר רב מניין שנשבעין לקיים את המצוה שנאמר (תהלים קי\"ט) נשבעתי ואקיימה לשמור משפטי צדקך.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 73,
      "char_length": 577,
      "timestamp": "2025-02-06T19:19:58.008160"
    },
    {
      "id": "mishpatim_p74",
      "text": "והנה אמרו ז\"ל (נדרים ח' ע\"א) האומר אשכים ואשנה פרק אחד נדר גדול נדר לאלקי ישראל, וכן בכל המצות, נמצא כי בכל יום כשאדם מישראל קורא ק\"ש שהוא מ\"ע מדאורייתא הרי הוא מקבל עליו עול מלכות שמים ועול תורה ועול מצות, כי אין נקרא אמירה באמת אלא אם הוא ע\"מ לעשות וכו', וא\"כ אין לך נדר גדול לאלקי ישראל מזה וכו', ואם כל אחד מישראל היה מקיים מה שמקבל עליו בק\"ש ודאי הגאולה קרובה לבא, והנה בעת שישבו ישראל על אדמתם היו המלכים והשרים ושופטים ושוטרים הכל מישראל, מה שאין כן בגלות אנו נכנעים תחת מלכי ושרי האומות, וזה כונת הכתוב וידבר משה אל ראשי המטות לבני ישראל ר\"ל בשביל שיזכו שראשי המטות המלכים והשופטים יהיו מבני ישראל, איך יגיעו לכך איש כי ידור נדר לה' וגו', דהיינו שמקבל עליו עול מלכות שמים בקריאת שמע לא יחל דברו וגו' שיקיים מה שמקבל על עצמו. כנ\"ל, וע\"י כך יצאו מן הגלות, ויחזרו להיות ראשי המטות מבני ישראל, עכ\"ד ז\"ל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 74,
      "char_length": 807,
      "timestamp": "2025-02-06T19:19:58.313883"
    },
    {
      "id": "mishpatim_p75",
      "text": "והנה איתא במד\"ר כאן כי הגאולה תלויה בזכות המשפטים, וע\"י שאין שומרים משפטי התורה כראוי מתעכבת הגאולה, ועל אחת כמה וכמה אם ישראל בעצמן ממנים שופטים שישפטו עפ\"י חוקי עכו\"ם אין לך מרידה גדולה מזו במשפטי התורה, והם המעכבים גאולתינו ופדות נפשינו, ואיתא במכילתא פ' יתרו עה\"פ לא יהי' לך אלהים אחרים למה נקראו אחרים שמאחרין את הטובה מלבא בעולם ואותם הממנים שופטים כאלו הם המעכבים טובתם של ישראל, ובעוה\"ר מה מר הדבר שיש שומרי תורה ומצוות הנוטלים חלק בזה אוי להם ואוי לנפשם שהם מעכבים את הגאולה, ומרבים צער וגלות השכינה הקדושה ומאריכים גלות ישראל וצערם, השי\"ת יצילנו מהם ומהמונם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 75,
      "char_length": 568,
      "timestamp": "2025-02-06T19:19:58.702306"
    },
    {
      "id": "mishpatim_p76",
      "text": "ובזה פירשתי מטבע הברכה בתפלת י\"ח השיבה שופטינו כבראשונה ויועצינו כבתחלה, ונוסח זה תקנו אנשי כנה\"ג על פי דברי הנביא (ישעי' א) ואשיבה שופטיך כבראשונה ויועציך כבתחלה, ולכאורה יל\"ד מדוע כתיב כבראשונה וכבתחלה וסגי בהבטחה שהשי\"ת ישיב שופטינו ויועצינו, ובהבטחה זו כלול הכל, כי וודאי הוא שהשי\"ת ישיב לנו שופטים ויועצים אמיתיים, אמנם כיון שהיום מתעים את העולם ומסמין עיניהם לומר על שופטים אלו שהם טובים, על כן בא הכתוב להוציא מלב התועים והמתעים, כי רק שופטים כמו שהיו בראשונה ויועצים כבתחלה ההולכים בדרך התורה ועל פיה ישפוטו טובים הם לישראל, ולא זולת.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 76,
      "char_length": 542,
      "timestamp": "2025-02-06T19:19:58.968093"
    },
    {
      "id": "mishpatim_p77",
      "text": "ועפי\"ז אפ\"ל דברי הכתוב ואלה המשפטים וגו' כי דברי הכתוב הם גם הבטחה שע\"י שישמרו ישראל את המשפטים, נזכה שיתמנו שופטי ישראל אמיתיים שישפטו את ישראל על פי התורה הקדושה, וז\"ש הכתוב ואלה המשפטים ר\"ל ע\"י שמירת המשפטים יזכו ישראל אשר תשים לפניהם, שישימו שופטים אמיתיים שדיניהם עפ\"י התורה, וזאת אפ\"ל בדברי רש\"י ז\"ל לפניהם ולא לפני עכו\"ם, שע\"י מינוי השופטים הכשרים נצא מתחת יד שופטי עכו\"ם ומשפטיהם, אשר תחתיהם אנו נכנעים בזמן הגלות.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 77,
      "char_length": 422,
      "timestamp": "2025-02-06T19:19:59.233990"
    },
    {
      "id": "mishpatim_p78",
      "text": "ובזה מיושב למה נקוט תשים ולא כתיב תלמדם דהנה איתא בגמרא מגילה (דף י\"ז ע\"ב) כי תחלת הישועה בביאת המשיח תהיה בחזרת השופטים האמתיים לישראל וע\"כ כתיב לשון שימה כי מעשה רבה הוא, שע\"י מינוי השופטים האמתיים שהם לרצון לפני ה' להרחיב גבולות הקדושה ולרומם קרן התורה ולהחזיר את ישראל בתשובה, נזכה לגאולה השלמה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 78,
      "char_length": 299,
      "timestamp": "2025-02-06T19:19:59.438655"
    },
    {
      "id": "mishpatim_p79",
      "text": "ואלה המשפטים אשר תשים לפניהם. פירש\"י ז\"ל ואלה מוסיף על הראשונים מה הראשונים מסיני אף אלו מסיני ע\"כ. הקשו המפרשים והרי רש\"י ז\"ל ס\"ל בפ' בהר כשיטת ר\"ע שכל התורה נאמרו כללותיה ופרטותיה מסיני וא\"כ למאי איצטריך לרבות שהמשפטים נאמרו בסיני והלא בכלל התורה הם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 79,
      "char_length": 252,
      "timestamp": "2025-02-06T19:19:59.601972"
    },
    {
      "id": "mishpatim_p80",
      "text": "ב) אשר תשים לפניהם פירש\"י ז\"ל א\"ל הקב\"ה למשה לא תעלה על דעתך לומר אשנה להם הפרק וההלכה וכו' ואיני מטריח עצמי להבינם טעמי הדבר ופירושו לכך נאמר אשר תשים לפניהם כשולחן הערוך ומוכן לאכול לפני האדם ע\"כ. וצ\"ב כי על לימוד טעמי התורה והמצוות שייך יותר לכתוב אשר ''תלמדם''",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 80,
      "char_length": 264,
      "timestamp": "2025-02-06T19:19:59.739647"
    },
    {
      "id": "mishpatim_p81",
      "text": "ד) במד\"ר הה\"ד (תהלים קמ\"ז) מגיד דבריו ליעקב חקיו ומשפטיו לישראל לא עשה כן לכל גוי וגו' פ\"א א\"ל עקילס לאדריינוס המלך רוצה אני להתגייר וכו' א\"ל לך ולמד תורתן ואל תמול א\"ל עקילס אפי' חכם שבמלכותך וכו' אינו יכול ללמוד תורתן אם אינו מל שכן כתיב מגיד דבריו ליעקב וגו'. וצ\"ב שייכות מדרש זה לפ' משפטים דייקא. והרי איש אשר לא ימול בשר ערלתו לא יוכל להשיג גם שאר חלקי התורה, ולא רק את המשפטים בלבד. עוד יל\"ד על כפל לשון הפסוק מגיד דבריו ליעקב חוקיו ומשפטיו וגו', והלא דבריו הם חקיו ומשפטיו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 81,
      "char_length": 480,
      "timestamp": "2025-02-06T19:19:59.898130"
    },
    {
      "id": "mishpatim_p82",
      "text": "ה) במד\"ר (פ' ל' סי' א) הה\"ד (תהלים צ\"ט) ועוז מלך משפט אהב וכו' אמר להו משה לישראל הרי נתן לכם הקב\"ה את תורתו אם אין אתם עושין את הדינין נועל תורתו מכם וכו' ע\"כ. וקשה מה כונת המדרש באמרו נוטל תורתו מכם והרי בכל עת ובכל מצב חייבים ישראל לקיים מצוות התורה ולא יועילו כל טצדקי לפטרם ממנה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 82,
      "char_length": 284,
      "timestamp": "2025-02-06T19:20:00.148858"
    },
    {
      "id": "mishpatim_p83",
      "text": "ונראה לפרש הענין, עפ\"י מה שכתבו הקדמונים (עי' בעקרים מאמר ג' פכ\"ח) כי עיקר שלימות הנפש הבא מקיום המשפטים הוא ע\"י הכוונה שמקיימם לעשות נחת רוח לבוראו, אבל אם תהיה כוונתו לקיימם עבור שהשכל מחייבו כי בלתי קיום המשפטים ימלא העולם בעושק ובגזל ויהרס בנינו. אזי אינם מביאים שלימות לנפשו, ועפי\"ז פירש ק\"ז זלה\"ה בייטב לב ס\"פ אחרי דברי הכתוב ושמרתם את חקותי ואת משפטי אשר יעשה אותם האדם וחי בהם אני ה'. דהנה בבחינת הכוונה לשם שמים קל יותר לקיים את החוקים, כי הן עלומי הטעם ואין בהם תיקון העולם, ובודאי העושה אותם כוונתו לה' אבל במשפטים שהם תיקון העולם, כי אם יגנוב ויגזול ויעשוק את העולם יהרס בנין העולם, א\"כ יוכל המקיימם להתכוון לתועלתו ולהנאתו, על כן הזהיר הכתוב ושמרתם את חקותי כי שמירה רומז על ל\"ת ר\"ל שמעיקרא תקיימו החוקים על הכוונה לעשות רצון הבורא, כי זה יעלה לו בניקל, ואח\"כ ואת משפטי אשר יעשה אותם האדם וחי בהם, ר\"ל שמהראוי היה שיעשה אותם האדם מעצמו מחמת שיש בהם חיי העולם, ועל כן מזהירנו הכתוב שאעפי\"כ לא נעשה אותם לכוונת תיקון העולם, אלא אני ה' מכח גזרת מלך מלכי המלכים, עכת\"ד היטב לב זלה\"ה",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 83,
      "char_length": 991,
      "timestamp": "2025-02-06T19:20:00.322802"
    },
    {
      "id": "mishpatim_p84",
      "text": "ונקדים עוד דברי הירושלמי במס' ר\"ה (פ\"א ה\"ג) בנוהג שבעולם מלך בשר ודם גוזר גזרה רצה מקיימה רצה אחרים מקיימים אותה אבל הקב\"ה אינו כן אלא גוזר גזרה ומקיימה תחלה מ\"ט ושמרו את משמרתי אני ה' (ויקרא כ\"ב) אני הוא ששימרתי מצוותיה של תורה תחלה עכ\"ל הירושלמי. ולכאורה יש להפליא כי מקרא זה בפרשת עריות כתיב, ומה שייך לומר בענינים אלו שהקב\"ה שומר משמרת התורה ועל כרחך לומר שכוונת הירושלמי כי בכל מצוה יש פנימיות וטמונים בה סודות נעלמים, ושרש המצוה אחוז בגבהי מרומים, וזאת כונת הירושלמי כי הקב\"ה שומר מצוותיה של תורה, הכוונה על פנימיותם וזה הוא הטעם אשר המשפטים מביאים שלמות לנפש ישראל המקיימם, כי נצטווינו בהם עבור הטעמים והסודות הנעלמים אשר גנז בהם הבורא, ולא לקיום העולם, אמנם בני נח המקיימים את המשפטים למען קיום העולם בלבד אין קיום המשפטים גורם שלמות לנפשם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 84,
      "char_length": 748,
      "timestamp": "2025-02-06T19:20:00.814134"
    },
    {
      "id": "mishpatim_p85",
      "text": "ועפי\"ז י\"ל דברי רש\"י ז\"ל מה הראשונים מסיני אף אלו מסיני, ר\"ל כי כמו ששאר חלקי התורה שנתנו מסיני גנוזים בהם טעמים רבים ונסתרים, ואין הטעם בהם מחמת שהשכל מחייב לקיימם, כן גם המשפטים נתנו בסיני שיקיימו אותם ישראל לפי שכך צוה הבורא יתברך, ולא נצטוינו בהם בסיני לטעם קיום העולם כאשר בני נח מקיימים אותם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 85,
      "char_length": 298,
      "timestamp": "2025-02-06T19:20:01.176152"
    },
    {
      "id": "mishpatim_p86",
      "text": "והנה כ\"ק אבא מארי זלה\"ה בספרו קדושת יו\"ט פ' זו כתב לבאר שאלת יתרו למשרע\"ה (שמות י\"ח) מדוע אתה יושב לבדך וכל העם נצב עליך מן בוקר עד ערב ופירש\"י ז\"ל אפשר לומר כן, אלא כל דיין שדן דין אמת לאמיתו אפילו שעה אחת מעלה עליו הכתוב כאלו נעשה שותף להקב\"ה במעשה בראשית. ולכאורה קשה והלא כתיב להדיא וכל העם נצב עליך מן בקר עד ערב, ואיך אפ\"ל שדנם רק שעה אחת, אכן אפ\"ל שבדינים שבין אדם לחבירו לא היה דן רק שעה אחת, אבל העם באו אליו לשאול בדבר אלקים ולבקש עליהם רחמים שהקב\"ה ישפיע להם זה מזונו וזה פרנסתו כל איש בבקשתו הנצרך לו, וזה היה קשה ליתרו כיון שאתה יושב ודן כל הדינים ביניהם, ע\"כ אלקים נצב בעדת א\"ל ובזמן שיש דין למטה אין דין למעלה, וא\"כ למה צריכין הם לעמוד לפניך כל היום שתבקש עליהם רחמים, והלא בדין הוא שיוושעו אף בלא תפלה מכיון שאין דין למעלה והכל הוא רחמים וחסדים משמי מעונה עכת\"ד ז\"ל עיי\"ש מה שפירש תשובת משה ליתרו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 86,
      "char_length": 813,
      "timestamp": "2025-02-06T19:20:01.344514"
    },
    {
      "id": "mishpatim_p87",
      "text": "ולי נראה לפרש תשובת משה ליתרו בדרך אחר, בהקדם לפרש המדרש הנ\"ל אם אין אתם עושים את הדינין נוטל תורתו מכם דהנה בסה\"ק ראשית חכמה כתב כי תורה הוא מלשון הוראה, שהיא מורה לנו דרך נלך בה ואת המעשה אשר נעשה, ולפי זה י\"ל כי דין הנפסק בב\"ד של מעלה הוא בבחינת תורתו של הקב\"ה, כי בהוראה זו הוא מנהיג עולמו, וכאשר ישראל משמרים את הדינים מתנהגים גם בב\"ד שלמעלה עפ\"י הוראת בי\"ד שלמטה, כי כשיש דין למטה אין דין למעלה, נמצא כי כביכול מסר הקב\"ה כח ההוראה בהנהגת העולמות ליד בי\"ד שלמטה, וזאת כונת המדרש הרי נתן לכם הקב\"ה תורתו, ר\"ל הכח להורות לב\"ד שלמעלה את אשר יעשון אמנם אם אין אתם עושים את הדינים נוטל הקב\"ה תורתו ממכם דהיינו שנוטל מישראל כח זה שיקיימו בב\"ד שלמעלה הוראות ב\"ד שלמטה. כי כשאין דין למטה יש דין למעלה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 87,
      "char_length": 698,
      "timestamp": "2025-02-06T19:20:01.768456"
    },
    {
      "id": "mishpatim_p88",
      "text": "ועפי\"ז י\"ל כי תשובת משה ליתרו היתה בדרך זה כי אף שאני דן בין איש לרעהו לא סגי בכך לבעל תוקף דיני מעלה, אלא באים אלי העם לדרוש אלקים, ר\"ל כי כל זמן שהם משמרים את הדינים לצד תיקון העולם, כטעם שבני נח משמרים אותם עדיין יש דין למעלה, וע\"כ והודעתים את חקי האלקים ואת תורותיו, ר\"ל שיקיימו הדינים לפי שנצטוו עליהם מאת ה' ולא למען תיקון העולם, וכאשר ישיגו כונה זו בשלמות, ינתן כח ההוראה ביד ב\"ד שלמעלה, ויתבטלו מהם דיני מעלה ויהיו רק רחמים וחסדים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 88,
      "char_length": 439,
      "timestamp": "2025-02-06T19:20:02.106664"
    },
    {
      "id": "mishpatim_p89",
      "text": "ועפ\"י זה יתבארו לנו דברי רש\"י ז\"ל שלא תעלה על דעתך וכו' לא אטריח עצמי להבינם טעמי המצות וכו' לכך נאמר אשר תשים לפניהם, והכוונה שילמדם משה רבינו ע\"ה טעמי המצוות, שיקיימו את המשפטים לטעם שהם גזירות המלך מלכו של עולם, והוא טמן בהם טעמים עמוקים לאין חקר, ולא תהיה כוונתם בקיום המשפטים למען קיום העולם. ובזה מיושב לשון הכתוב אשר תשים לפניהם ולא כתיב אשר תלמדם, כי ע\"י שיקיימו את המשפטים עבור גזרת המלך נותן הקב\"ה כח ההוראה ביד ב\"ד שלמטה, וכשם שיגזרו בב\"ד שלמטה כך יקיימו למעלה, ושפיר שייך ביה לשון שימה כי מעשה רבה היא שתהי' הנהגת העולמות ביד בית דין שלמטה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 89,
      "char_length": 552,
      "timestamp": "2025-02-06T19:20:02.346706"
    },
    {
      "id": "mishpatim_p90",
      "text": "ואפ\"ל כי גם כונת רש\"י ז\"ל באמרו מה הראשונים מסיני אף אלו מסיני היא לבאר מה דכתב אשר תשים לפניהם ע\"כ קאמר מה הראשונים מסיני אף אלו מסיני, וכמו שפירשנו שהכוונה כי נצטווינו לקיים את המשפטים מחמת ציווי הבורא, ולא למען קיום העולם, ובשמירת המשפטים לכוונה זו נמסר ביד ב\"ד שלמטה כח ההוראה וגם בשמי מעלה יפסקו כמותם, וע\"כ כתיב תשים לפניהם, ופירש\"י ז\"ל ולא לפני עכו\"ם, כי כח זה שנמסר ביד הב\"ד שיעשו בב\"ד שלמעלה כהוראתם הרמוז במאה\"כ אשר תשים כנ\"ל, אינו אלא לפניהם ולא לפני עכו\"ם, שאף כאשר העכו\"ם שומרים את הדינים שנצטוו בהם, לא ניתן להם כח זה שיתנהגו בשמי מרום על פיהם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 90,
      "char_length": 558,
      "timestamp": "2025-02-06T19:20:02.619439"
    },
    {
      "id": "mishpatim_p91",
      "text": "וזאת גם כוונת המדרש ואלה המשפטים וגו' הה\"ד מגיד דבריו ליעקב, חקיו ומשפטיו לישראל לא עשה כן לכל גוי וגו', כי לפי מה שפירשנו שרמוז בדברי הפסוק כח ההוראה שמסר הקב\"ה ביד ב\"ד שלמטה, שעל פיהם תהיה הוראת ב\"ד שלמעלה, ולא נמסר כח זה אלא ביד ישראל, כמאה\"כ לפניהם, ולא לפני עכו\"ם, ע\"כ קאמר המדרש הה\"ד מגיד דבריו ליעקב, שמסר להם הקב\"ה את התורה, ולא רק שאר חלקי התורה נצטוו לקיימם עבור ציווי הקב\"ה אלא גם חקיו ומשפטיו לישראל, שגם קיום המשפטים יהיה לפי שכך צוה הבוי\"ת, ולכן נמסר בידם כח ההוראה שעל פיהם יתנהגו בב\"ד של מעלה, וז\"פ ''חקיו ומשפטיו\" לישראל שגם הוראות ב\"ד שלמעלה שהם חקיו ומשפטיו של הקב\"ה בידם נתנו, וזה שמסיים הכתוב לא ''עשה'' כן לכל גוי כי גם רישא דקרא מיירי בעשייה, כי מעשה רבה היא שתהי' התנהגות ב\"ד שלמעלה על פי הוראת ב\"ד שלמטה, והוראה זו לא עשה כן לכל גוי, שלא מסר בידם כח זה שעל פי הוראתם יתנהגו בב\"ד שלמעלה, לפי שמשפטים בל ידעום שאין הם מקיימים את המשפטים לצד ציווי הבורא אלא למען תיקון העולם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 91,
      "char_length": 897,
      "timestamp": "2025-02-06T19:20:02.924972"
    },
    {
      "id": "mishpatim_p92",
      "text": "וזאת אפ\"ל בכוונת המדרש ואלה המשפטים הה\"ד (ישעי' נ\"ו) שמרו משפט ועשו צדקה כי קרובה ישועתי לבא וצדקתי להגלות. כי הן היום בטלה מאתנו הסמיכה, ואין בידינו כח המשפט לדון ולהורות בב\"ד שלמטה, ולבעל בכך תוקף דיני מעלה, על כן מביא המדרש דברי הכתוב שמרו משפט, פירוש שתקיימו את המשפטים שעדיין בידינו לקיים ועשו צדקה וגדולה צדקה שמקרבת את הגאולה (ב\"ב דף י' ע\"א), וע\"י כך קרובה ישועתי לבא, ותחלת הישועה תהיה בהחזרת השופטים לישראל וכאשר יהיה בידם כח הדין יתבטלו תוקף דיני מעלה ויתגלו רחמיו וחסדיו יתברך, כדמסיים קרא וצדקתי להגלות.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 92,
      "char_length": 515,
      "timestamp": "2025-02-06T19:20:03.369335"
    },
    {
      "id": "mishpatim_p93",
      "text": "ואלה המשפטים אשר תשים לפניהם, פירש\"י ז\"ל כל מקום שנאמר אלה פוסל את הראשונים ואלה מוסיף על הראשונים מה ראשונים מסיני אף אלו מסיני, ע\"כ. וכ\"כ רש\"י ז\"ל במסכת שבת (דף י\"ג ע\"ב) על הא דאיתא במתני' שם ואלו מן ההלכות שנאמרו בעליית חנניה וכו', ומיבעיא בגמרא ואלו תנן או אלו תנן, וכתב רש\"י ז\"ל הכי גרסינן ואלו תנן הני דאמרן (פירוש ההלכות השנויות במשניות הקודמות), או אלו תנן הני דבעינן למימר קמן. וכתבו התוספות שם וז\"ל, רש\"י גריס ואלו תנן הני דאמרן ומביא ראיה דאמר במדרש כל מקום שנאמר ואלה מוסיף על הראשונים אלה פוסל את הראשונים. ועל המדרש קשה לר\"י דאלה דברי הברית (האמור בסוף פרשת התוכחה בכי תבא) קאי אמה שכתוב למעלה, ע\"כ. ועיין בדעת זקנים מבעהתו\"ס כאן שנדחקו ליישב דברי המדרש הנ\"ל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 93,
      "char_length": 673,
      "timestamp": "2025-02-06T19:20:03.624177"
    },
    {
      "id": "mishpatim_p94",
      "text": "ב) בגמרא סנהדרין דף ז' ע\"ב) איתא אשר תשים אשר תלמדם מיבעי ליה א\"ר ירמיה ואיתימא ר' חייא בר אבא אלו כלי הדיינין (פירש\"י דשייכא ביה שימה דבר המיטלטל) וצ\"ב.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 94,
      "char_length": 153,
      "timestamp": "2025-02-06T19:20:03.961270"
    },
    {
      "id": "mishpatim_p95",
      "text": "ג) בירושלמי (ע\"ז פ\"ב ה\"ז) איתא תני רשב\"י ואלה המשפטים אשר תשים לפניהם מה הסימה הזאת אינה נגלית לכל בריה כך אין לך רשות לשקע עצמך בדברי תורה אלא לפני בני אדם כשרים. (פירש בפ\"מ ודרש מל' סימא ואוצר שלפעמים צריך להסתיר אותה האוצר הזה) וצ\"ב והלא התוה\"ק ניתנה לכל ישראל ללמדם חוקים ומשפטים ולהורותם הדרך ילכו בה, ואיך אפשר להעלים מהם דיני התורה, וכן צ\"ב להבין הא דאיתא בגמ' (פסחים מ\"ט ע\"ב) תנא ר' חייא כל הלומד תורה לפני עם הארץ כאלו בועל ארוסתו בפניו שנא' תורה צוה לנו מורשה אל תיקרי מורשה אלא מאורשה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 95,
      "char_length": 496,
      "timestamp": "2025-02-06T19:20:04.078549"
    },
    {
      "id": "mishpatim_p96",
      "text": "ונראה לבאר דברי הירושלמי, שאין כוונתו באמרו שאין לגלות ד\"ת לכל אדם, על פשטות דיני התורה וגופי ההלכות, כי ד\"ת נמסרו לכל ישראל בשוה, אלא הכוונה על טעמי ההלכות ופנימיותם, שאין לגלותם לכל אדם, אלא כל חד לפום דרגיה דיליה מגלים לו רזי תורה ופנימיותה, ולאו כל אנפי שוין בזה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 96,
      "char_length": 267,
      "timestamp": "2025-02-06T19:20:04.347931"
    },
    {
      "id": "mishpatim_p97",
      "text": "ואפשר לומר כי דברי הירושלמי תואמים יחדיו עם דרשת חז\"ל שהביא רש\"י ז\"ל וז\"ל אשר תשים לפניהם אמר הקב\"ה למשה לא תעלה על דעתך לומר אשנה להם הפרק וההלכה ב' וג' פעמים וכו' ואיני מטריח עצמי להבינם טעמי הדבר ופירושו לכך נאמר אשר תשים לפניהם כשולחן הערוך ומוכן לאכול לפני האדם, ע\"כ. וכיון שנצטווה משה במאמר תשים לפניהם לגלות להם טעמי התורה ופירושיה, וכלול בזה גם פנימיות התורה, על כן כתיב בקרא לשון שימה המורה על דבר הסמוי מן העין, כדדריש בירושלמי, להודיע כי לא לכל אדם הותר לו לגלות פנימיות התורה, אלא לכ\"א כפי מדרגתו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 97,
      "char_length": 509,
      "timestamp": "2025-02-06T19:20:04.509133"
    },
    {
      "id": "mishpatim_p98",
      "text": "והנה אף כי דיני התורה ומצותיה שוים הם בכל דור ודור: ואי אפשר שישתנה מן התוה\"ק אף כקוצו של יו\"ד, אמנם פנימיות הענינים והבחינות והמדות תלוים ועומדים במצב הדור, וכמ\"ש בסה\"ק דגל מחנה אפרים (פ' וארא) עה\"כ וגם אני שמעתי את נאקת בני ישראל שהתורה נתנה תמיד להדרש לפי ענין ראשי הדור ובחינתם ומדרגתם, כמו שראיתי באיזה ספר וכו' וידוע דכל התורה כולה שמותיו של הקב\"ה, נמצא כי בודאי היא ג\"כ נדרשת בכל דור ודור לפי דורשיו, ולפי נשמת אותו הדור, וכתב שפסוק זה היה נדרש בימי הבעש\"ט זללה\"ה וגם אני שמעתי את נאקת בני ישראל שצועקים עבור השכינה כביכול לקרב את השכינה הקדושה, כך היה נדרש בימי הבעש\"ט ואנשי דורו, שהיו במדרגה גדולה כזו שלא להתפלל על חסרון עצמם רק על חסרון השכינה, ועתה לפי דורותינו נדרש הפסוק וגם אני שמעתי את נאקת בני ישראל אפילו אם הם צועקים עבור עצמם, אשר מצרים מעבידים אותם, אעפי\"כ לגודל רחמיו וחסדיו יתברך מקבל אפילו תפלה וצעקה שהיא עבור עצמם, עוד כתב שם בשם הבעש\"ט הקדוש שהסה\"ק ברית מנוחה מאיר בכל דור ודור לפי בחינתו עכת\"ד ז\"ל",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 98,
      "char_length": 925,
      "timestamp": "2025-02-06T19:20:04.767107"
    },
    {
      "id": "mishpatim_p99",
      "text": "ועל פי דברים אלו יש למצוא לימוד זכות על מה שמצינו בזה\"ק (ח\"א רי\"ט ע\"ב) שהחמיר כ\"כ בענין החטא הידוע שאין מועלת לו תשובה, ובמקו\"א כתב (ח\"ב דף רי\"ד ע\"ב) שאף שיש תשובה גם לחטא זה אבל רק תיובתא סגיא מהני. וכתבו הסה\"ק בכוונת הזה\"ק דתיובתא סגיא היינו תשובה מאהבה, וכבר כתבנו כי תשובה כזאת קשה היא מאוד, וכמעט מן הנמנע הוא להגיע אליה בדור שפל זה, כי קשה להגיע אפילו לתנועה קטנה של תשובה, ועל אחת כמה וכמה לתשובה גדולה כ\"כ.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 99,
      "char_length": 414,
      "timestamp": "2025-02-06T19:20:05.202900"
    },
    {
      "id": "mishpatim_p100",
      "text": "אמנם יש לומר כי מהות התשובה על החטאים תלויה במצב הדור, ודברי הזה\"ק אמורים לפי מצב הדורות ההם שהיו קדושים וטהורים, ולא היה קשה כ\"כ לחזור ולהתקרב לפני הבוכ\"ע, ולהגיע למדרגה גדולה של תשובה מאהבה. אבל לפי מצב דורנו וכובד הנסיונות, בניקל יותר להתקרב אל הקדושה אף במעט תשובה, כי הקב\"ה מביט על שפלות הדור ענים ולחצם, ודן אותם לפי בחינתם ולפי מצבם, וכפי מצב הדור אפשר לומר, כי אם שמים על לב גודל הפגם, ומתחרטים עליו, ומתקנים רק מעט מה שפגמו, מקובלת התשובה לפני השי\"ת יותר מתשובה גדולה בדורות הקודמים. וכדאיתא בספר חסידים (סי' תתקמ\"ה) שחשוב לפני הקב\"ה לב שאינם פקחים בדורות האחרונים כלב פקחים בדורות הראשונים ע\"כ. וכן בעת שהיו ישראל משועבדים במצרים כתיב ויאנחו בני ישראל וגו' ויזעקו ותעל שועתם אל האלקים וגו' וירא אלקים את בני ישראל וידע אלקים, פירוש כי אף שלא חזרו בתשובה שלמה בכל נפשם ומאודם, שמע אלקים זעקתם והקשיב לקול שועם, כי ראה ה' שפל מצבם, והיותם משוקעים בטומאת מצרים, על כן נתקבלה לפניו תפלתם אף שלא היתה מקרב לב ונפש. ולכן עלינו לדעת, כי לפי שפלות הדור נקל עלינו יותר להתקרב אל הבוכ\"ע, שאף שקיום התורה לא נשתנה אף כקוצו של יו\"ד, מ\"מ הענינים הפנימיים והבחינות והתשובה המועלת להתקרב לפני הבוכ\"ע קלה יותר, וכידוע המשל למלך וכו' שבהיותו בדרך נקל יותר להתקרב אליו ולהביאו אל ביתו, כי כאשר המלך שוכן בהיכלו, כבוד אומר כולו, וסביב לו שמירות ומחיצות רבות המונעים להתקרב אליו אבל כאשר המלך הוא נודד ממקומו בגולה ובמרחקים, אזי קל להתקרב אליו, כי בכל מקום שהמלך מוצא אכסניא נקיה ומכובדת קצת שוכן הוא בה. וכעין זו הבחינה אפ\"ל כי בשפלות הגדול ובעומק הגלות שהדור שקוע קל יותר להתקרב אל השכינה הקדושה במעט תשובה, שהרי גם היא עמנו בגלות כדכתיב (ישעיה נ') ובפשעיכם שולחה אמכם. שהוא כינוי לגלות השכינה הקדושה, אך עכ\"פ אותו מעט תשובה חייבים לעשות, ובעוה\"ר כל כך כבדו הנסיונות, עד שאפילו אותו המעט אין עושין, וברבות העתים מתרחקים יותר ויותר מן הקב\"ה. הבוכ\"ע יעזור שנזכה להתקרב אליו במקצת עכ\"פ, ונשים אל לבנו מה שפגמנו ורק בקצת בטחון אפשר להתקרב אל הקב\"ה, כי גדול מאד עול הגלות ברוחניות ובגשמיות.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 100,
      "char_length": 1877,
      "timestamp": "2025-02-06T19:20:05.431631"
    },
    {
      "id": "mishpatim_p101",
      "text": "ונבוא לבאר דברי הגמ' סנהדרין הנ\"ל שדרשו אשר תשים לפניהם אלו כלי הדיינין מקל ורצועה המוכנים לרדות ולהעניש י\"ל כי מרומזים בזה כוחות הדין הם כלי המשחיתים הנמצאים בעולם, ובאמת אם מתבוננים בזה קצת רואים כי יש פחד גדול ח\"ו לחרבן העולם, ה' ישמרנו, כי כלי הדיינים והמשחיתים מלאים עולם, אבל לא על מנת שישתמשו בהם בפועל נעשו, אלא האלקים עשה שיראו מלפניו, כדי שע\"י כך יוטל פחד על העולם ויתקרבו בתשובה אל הקב\"ה. אמנם בעוה\"ר מונחים כ\"כ בעומק הגלות, שגם זה אינו מועיל, אבל באמת לא סגי בלאו הכי, וזה מרומז במאה\"כ ואלה המשפטים הם כלי הדיינים המשחיתים שהם כחות הדין והמשפט אשר תשים לפניהם, פירוש שבשימה בעלמא לפניהם סגי. שבפחד בלבד די להם, וע\"י שמשמים השמעת דין, יתקיים ארץ יראה ושקעה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 101,
      "char_length": 668,
      "timestamp": "2025-02-06T19:20:06.360309"
    },
    {
      "id": "mishpatim_p102",
      "text": "ובבחינה זו יש ליישב קושית התוספות במס' שבת (דף י\"ג ע\"ב) הנ\"ל שהקשו על המדרש מדברי הכתוב אלה דברי הברית ששם אי אפשר לומר שפוסל את התוכחה שהרי עליה קאי, ואפ\"ל דהנה האמת הוא כי בדברי התוכחה טמונים גם ברכות עצומות, וכאשר מצאנו מקצת מן המפרשים שפירשו דברי התוכחה לברכות, ואילו היו ישראל ראוים היתה מתפרשת התוכחה לברכות.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 102,
      "char_length": 314,
      "timestamp": "2025-02-06T19:20:06.745700"
    },
    {
      "id": "mishpatim_p103",
      "text": "אמנם כשאין זוכין חלילה הפירוש הוא כפשוטו וכאשר ביארנו כי הפנימיות והבחינות בתוה\"ק תלויות במצב ובהנהגת ישראל כי אם הם הולכים בדרך האמת ודבוקים בתוה\"ק, יהפוך ה' להם את הקללה לברכה, וכמבואר במד\"ר פ' בחקותי (פל\"ה א) הה\"ד חשבתי דרכי ואשיבה רגלי אל עדותיך (תהלים קי\"ט) ר' אבא בריה דר' חייא בשם ר' יונתן אמר חשבתי ברכות חשבתי קללות ברכות מאל\"ף ועד תי\"ו קללות מן וי\"ו ועד ה\"א ולא עוד אלא שהן הפוכות א\"ר אבין אם זכיתם הריני הופך לכם קללות לברכות אימתי כשתשמרו את תורתי, ע\"כ. הרי כי אף שהתוכחה כתובה בתורה אילו זכו ישראל נהפכת היא להם לברכה, והטעם לפי שהתוה\"ק כולה צירופי שמות היא, ע\"ד הכתוב (תהלים י\"ח) אמרת ה' צרופה, וכמו שביאר הרמב\"ן ז\"ל בפתיחתו לפירוש התורה, על כן יתכן שאותיות התוכחה עצמן יקבלו צירוף אחר.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 103,
      "char_length": 700,
      "timestamp": "2025-02-06T19:20:06.913748"
    },
    {
      "id": "mishpatim_p104",
      "text": "והשתא מיושבת שפיר קושית התוספות הנ\"ל דכתיב אלה דברי הברית אשר נתן ה' ביד משה, ועל כרחך לומר דקאי על הכתוב למעלה שהם דברי התוכחה דהנה איתא בתיקונים (תיקון ס\"ט) איתפשטותיה דמשה בכל דרא ודרא, ונתן הקב\"ה כח ביד הצדיקים הקדושים שהם ניצוץ נשמת משה שע\"י שיחזירו את ישראל בתשובה יהפוך ה' להם את הקללות שבדברי התוכחה לברכות, וז\"ש הכתוב אלה דברי הברית אלה פוסל את הראשונות, כי אף דתיבת אלה קאי על התוכחה, מ\"מ בא לרמוז בזה כי בכח בני ישראל להפוך את התוכחה לברכה וזהו פוסל את הראשונות, כי מעיקרא נתפרשו דברי התוכחה לקללה, וע\"י מעשי בני ישראל בידם להפכה לברכה, וז\"ש הכתוב אשר נתן ה' ביד משה, כי כח זה מסור ביד הצדיקים שבכל דור ודור שהם בבחינת משה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 104,
      "char_length": 634,
      "timestamp": "2025-02-06T19:20:07.249796"
    },
    {
      "id": "mishpatim_p105",
      "text": "ובעוה\"ר עד עתה ראינו במשך השנים שחלפו ועברו כי את אשר יגורנו בא לנו. ונשארנו מעט מהרבה, נתונים בשפלות ברוחניות ובגשמיות, ונסתלקו מאתנו הצדיקים והקדושים, וכתב האה\"ח הקדוש בפ' כי תשא וז\"ל ובדרך רמז תתבאר עז\"ה כי בא הקב\"ה לגלות נסתרות לה' אשר יעשה בעולמו דבר שכל רואה יתמה בהלקח איש צדיק ישר קודם זמנו יחצו ימיו וכו' אשר ע\"כ אמר ה' כי תשא את ראש בני ישראל פירוש אם תראה שיסתלק ראש בני ישראל בלא עת וכו' הטעם הוא לפקודיהם וכו' לשון חסרון ע\"ד אומרו (במדבר ל\"א) ולא נפקד ממנו איש כי לצד חסרון ישראל שנתחייבו לזה אני נוטל ראשם בעדם לכופר נפשם שלא ימותו כל ישראל וכו'. עכ\"ל. ואם הוא כתב כן בימיו שאירעה סבה שנסתלק ראש הדור איש צדיק טרם זמנו, מה נענה אנן אבתריה שנסתלקו כל הצדיקים והקדושים שהיו בדורות הקודמים, ואין לנו השגה כמה כח והשפעה נמשך לישראל על ידם והתחממו לאורם, ובעוה\"ר כלו כל הקיצין ומה גדול השפלות בו אנו מונחים, ונמצאים בקרב ישראל אנשים אשר לבבם שותת דם מחמת רצונם להיות יהודים כדבעי, ואין זוכים לכך, כי אין השפעה, וזקוקים אנו לרחמי שמים, ונפיל תחנתנו לפני בורא כל העולמים, שיזכור לנו זכות הדורות הקודמים, כי אין שכחה לפני כסא כבודו, וזכותם יעמד לנו להנצל מכל צרה וצוקה, ונזכה להתדבק בבורא כל העולמים ולתקן את אשר פגמנו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 105,
      "char_length": 1125,
      "timestamp": "2025-02-06T19:20:07.559805"
    },
    {
      "id": "mishpatim_p106",
      "text": "ודכירנא מה שאמר כ\"ק אבא מארי זלה\"ה בשבת האחרון לפני הסתלקותו. שהיה שב\"ק פ' משפטים שנת תרס\"ד, ופתח דבריו בלשון התרגום עה\"פ ואלה המשפטים אשר תשים לפניהם, ואלין דיניא די ''תסדר\" קדמיהון, ופירש דבריו שהדינים של שנת תרס\"ד ''קדמיהון\" יחולו על אומות העולם. והנה אז אף שהיו הדינים שורים בעולם, אבל היו עוד צדיקי אמת: והיה במה להתחזק, אבל מה יהיה עם הדינים של השנים הבאות, הבוכ\"ע יעזור שיגין עלינו זכותם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 106,
      "char_length": 395,
      "timestamp": "2025-02-06T19:20:08.217589"
    },
    {
      "id": "mishpatim_p107",
      "text": "ובגמרא מגילה (דף י\"א ע\"א) איתא שמואל אמר לא מאסתים ולא געלתים לכלותם (ויקרא כ\"ו) לא מאסתים בימי יונים ולא געלתים בימי אספסיינוס קיסר לכלותם בימי המן וגו' כי אני ה' אלוקיהם בימי גוג ומגוג במתניתא תנא לא מאסתים בימי כשדים שהעמדתי להם דניאל חנניה מישאל ועזרי' ולא געלתים בימי יונים שהעמדתי להם שמעון הצדיק וחשמונאי ובניו ומתתיהו כה\"ג לכלותם בימי המן שהעמדתי להם מרדכי ואסתר וכו' כי אני ה' אלקיהם לעתיד לבא שאין כל אומה ולשון יכולה לשלוט בהם, ע\"כ. ופירשנו הכוונה (עי' בדברנו פ' מקץ דף שמ\"ז ע\"א) כי בדורות הקודמים היה לנו כח הצדיקים הקדושים שסייעו לבני ישראל להתגבר על הנסיונות, אמנם עתה בדורנו זה נראה כי כל הצרות והיסורין שישראל סובלים הכל הוא מלחמת גוג ומגוג, ואין לנו כח הצדיקים שיגן בעדנו, אלא אני ה' אלקיהם הבוי\"ת בעצמו ילחם עמהם ויקנא עלבון התוה\"ק וישראל. ועל כן עלינו לתקן עצמנו באמונה חזקה ולא נשכח מהבוכ\"ע וצדיק באמונתו יחיה (חבקוק) וזה בלבד נותר לנו להתחזק בכח האמונה וללכת בדרך האמת. וכמה סייעתא דשמיא מרובה צריכים אנו לבל נתפס אחרי כללות העולם שנמשכו בכוחות עוברי עבירה וסט\"א. הבוכ\"יע יעזור שיגן עלינו זכות וכח הצדיקים הקודמים האמיתיים, שננצל מכובד הגלות בכלל, שתבא הישועה לבני ישראל, ובזה מונח גם גלות הפרט, כי כל אחד מישראל מונח בעומק הגלות, והבוכ\"ע ירפא שברון לבבות בני ישראל השבורים כחרס הנשבר, ואין דורש ואין מבקש, ולפי הנראה הם כאובדו עצות בעוה\"ר וילכו אחרי ההבל ויהבלו, והבוכ\"ע יזריח אורה בלבבות בנ\"י וישמחם, ונזכה להיות מאותם שיתקיים בהם מקרא שכתוב שמחנו כימות עיניתנו, כי הישועה ודאי בא תבא לבני ישראל, אבל מי יודע מי יהיה בין הזוכים לראותה. ויעזור השי\"ת שכל ישראל שנשארו עדיין יזכו יחדיו לראות ישועת ישראל בחיים חיותם, וירחם ה' שנזכה להיות מאותם שיזכו לעבוד את השי\"ת בלב טהור, ונזכה לראות קדושת ישראל והתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו בב\"א.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 107,
      "char_length": 1676,
      "timestamp": "2025-02-06T19:20:08.447463"
    },
    {
      "id": "mishpatim_p108",
      "text": "או יאמר ליישב פירש\"י ז\"ל ואלה המשפטים וגו' ואלה מוסיף על הראשונים מה הראשונים מסיני אף אלו מסיני. והקשו המפרשים הלא דעת רש\"י ז\"ל בפ' בהר כר\"ע דס\"ל שכל התורה נאמרו כללותיה ופרטותיה מסיני, ומאי איצטריך לרבות המשפטים שנאמרו בסיני.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 108,
      "char_length": 227,
      "timestamp": "2025-02-06T19:20:09.219598"
    },
    {
      "id": "mishpatim_p109",
      "text": "ב) במד\"ר ואלה המשפטים וגו' הה\"ד מגיד דבריו ליעקב חוקיו ומשפטיו לישראל וגו' (תהלים קמז) וכו' ע\"כ. ודקדקו המפרשים במאמר הכתוב מגיד דבריו ליעקב חוקיו ומשפטיו לישראל, למה חלק הכתוב בין דבריו לחוקיו ומשפטיו, הלא החוקים והמשפטים בכלל דברי הקב\"ה הם, ותו יל\"ד דסיפא דקרא לאו היפוכא דרישא, דפתח דבריו בהגדה, וסיים לא עשה כן לכל גוי, עשייה מאן דכר שמיה. עוד יל\"ד מה כוונת הכתוב לא עשה כן לכל גוי, וכי רצה הקב\"ה למנוע מהם קבלת התורה, והרי הקב\"ה החזיר את התורה על כל אומה ולשון ולא רצו לקבלה, וא\"כ לא מצדו היתה המניעה, אלא הם מאנו בה ולא רצו לקבלה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 109,
      "char_length": 536,
      "timestamp": "2025-02-06T19:20:09.350638"
    },
    {
      "id": "mishpatim_p110",
      "text": "ג) אשר תשים לפניהם בגמרא סנהדרין (דף ז' ע\"ב) מאי אשר תשים תלמדם מיבעי ליה אמר ר' ירמיה ואיתימא ר' חייא בר אבא אלו כלי הדיינין (פירש\"י דשייכא בהו שימה דבר המיטלטל) וזה דרך דרש, אבל פשטות הכתוב צ\"ב מדוע כתיב תשים ולא כתיב תלמדם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 110,
      "char_length": 226,
      "timestamp": "2025-02-06T19:20:09.625245"
    },
    {
      "id": "mishpatim_p111",
      "text": "ד) בגמרא קידושין (דף כ\"ב ע\"ב) ר' יוחנן בן זכאי היה דורש את המקרא הזה כמין חומר מה נשתנה אוזן מכל איברים שבגוף אמר הקב\"ה אוזן ששמעה קולי על הר סיני בשעה שאמרתי כי לי בני ישראל עבדים (ויקרא כ\"ה) עבדי הם ולא עבדים לעבדים והלך זה וקנה אדון לעצמו ירצע, ע\"כ. והקשה ק\"ז זלה\"ה בישמח משה על לשון הגמרא אוזן ששמעה קולי על הר סיני וכו' כי לי בני ישראל עבדים, והרי בני ישראל לא שמעו מפי הגבורה אלא עשרת הדברות בלבד, וכל התורה מפי משה נאמרה להם, וא\"כ למה נקט בגמרא אוזן ששמעה קולי, והלא לא שמעה אזנם מפי הגבורה מאמר כי לי בני ישראל עבדים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 111,
      "char_length": 525,
      "timestamp": "2025-02-06T19:20:09.768435"
    },
    {
      "id": "mishpatim_p112",
      "text": "ונראה לבאר הענין עפ\"י מה שכתבנו לפרש כוונת המסורה (עיין בדברנו לקמן פרשת תרומה) כל אשר דבר ה' נעשה ונשמע, ונשמע קולו בבואו אל הקודש וגו' ונשמע פתגם המלך, בהקדם מ\"ש בסה\"ק קדושת לוי במאמר קדושה ראשונה לפרש מאמר בעל ההגדה אלו קרבנו לפני הר סיני ולא נתן לנו את התורה דיינו, דלכאורה קשה מה תועלת היה בקריבה אל הר סיני לולא קבלת התורה, וביאר עפ\"י מאמרם ז\"ל (יומא דף כ\"ח ע\"ב) קיים אברהם אבינו כל התורה עד שלא ניתנה, ולכאורה מאין ידע אברהם אבינו ע\"ה לקיים מצוות התורה, אך הענין כי נודע אשר רמ\"ח מצוות עשה הם מכוונים נגד רמ\"ח אברים הרוחניים שבאדם, ושס\"ה מצוות ל\"ת הם נגד שס\"ה גידים הרוחניים, והמביט ברוחניות אבריו וגידיו הוא משיג את הרמ\"ח מ\"ע ושס\"ה ל\"ת, וע\"י שזיכך אברהם אבינו ע\"ה אבריו וגידיו זכה להשיג כל התורה טרם נתנה, ובמעלה זו זכו גם בני ישראל מיד בעת הגיעם אל הר סיני ופסקה זוהמתן ונזדככו אבריהם, וזאת כוונת בעל ההגדה אלו קרבנו לפני הר סיני ולא נתן לנו את התורה דיינו, שהרי טרם קבלת התורה זכו להשיגה ע\"י הזדככות אבריהם, ובזה מובן שפיר מה שהקדימו נעשה לנשמע, כי גם טרם השמיעה השיגו כל המצוות עכ\"ד הקדושים. ועפי\"ז נבא לביאור המסורה כי הנה בני ישראל בעמדם על הר סיני ידעו והבינו כי לא כל העתים שוות, ויהיו זמנים אשר יפלו ממדרגתם ולא יוכלו לקיים המצוות ע\"י השגת אבריהם וגידיהם: על כן אמרו נעשה ונשמע, כי \"נעשה\" קאי על זמן היותם ברום המעלה שאז אינם זקוקים לציווי, כי אבריהם ירוצו מעצמם לעשות רצון קונם: \"ונשמע\" קאי על זמן שלא יהיו במעלה זו, להשיג מצוות ה' בלי ציווי, אזי נשמע, לקיים המצוות מכח גזירת המלך עלינו",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 112,
      "char_length": 1403,
      "timestamp": "2025-02-06T19:20:10.059874"
    },
    {
      "id": "mishpatim_p113",
      "text": "וזאת תורת המסורה נעשה ונשמע, דלכאורה למה הוצרכו לומר נשמע כיון שכבר השיגו אבריהם תוכן המצוות טרם נצטוו, וע\"ז בא כמשיב שע\"כ הוצרכו לומר ''ונשמע\" למען יהיה ונשמע קולו בבואו אל הקודש לפני ה' ''ובצאתו\", שאף בשעה שיצאו מבחינת לפני ה' ולא יוכלו לקיים המצוות מחמת השגת אבריהם, אעפ\"כ יקיימו מצוות ה' ע\"י ונשמע פתגם המלך, כי מצווים ועומדים הם מחמת ציווי המלך עליהם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 113,
      "char_length": 356,
      "timestamp": "2025-02-06T19:20:10.747253"
    },
    {
      "id": "mishpatim_p114",
      "text": "ונקדים לבאר עוד כי לא רק דבר הנשמע באזני האדם יקרא שמיעה אלא אף דבר המושג בשכל האדם אף על פי שלא שמעו באזניו שייך לכנותו בלשון שמיעה. והדבר יובן ע\"ד שכתב השל\"ה הקדוש על מה שמצינו בפסוקים ובדברי חז\"ל עיני ה' אזני ה' וכדומה, וקשה והלא אינו גוף ולא ישיגוהו משיגי הגוף ולא יתכן לכנות אליו צורת גוף וגויה, ופירשו הקדמונים כי הוא לשון מושאל ונכתב רק לסבר את האוזן, וכתב הוא ז\"ל להיפך כי עיקר שם עין ואוזן וכו' נאמר גבי הקב\"ה, כי שם עין הוא כינוי לכח הראייה, ושם אזן הוא כינוי לכח השמיעה, ושייך שפיר אצלו יתברך כי אין דבר נעלם ממנו, ועיני ה' משוטטות בכל הארץ, ומה שמכנים גם את חוש הראיה הגשמי של האדם עין, וחוש השמיעה בשם אוזן, הוא רק שם מושאל, כי לפי שהוא רואה ושומע בהם הושאל אליהם כינוי זה, אבל עיקר שם זה קאי על השגחת הבורא, וכן הוא בכל התורה, כי עיקר התורה הוא הפנימיות שבה. אלא שיש בה גם פשטות.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 114,
      "char_length": 793,
      "timestamp": "2025-02-06T19:20:10.937963"
    },
    {
      "id": "mishpatim_p115",
      "text": "ועפ\"י זה שפיר מיושב מה שאמרו ז\"ל אוזן ששמעה קולי על הר סיני וכו' כי לי בני ישראל עבדים (עי' קושי' ד') ולא קשה שהרי לא שמעו זאת מפי הקב\"ה אלא מפי משה, כי לא קאי על מה ששמעו מפי משה, אלא הכוונה על מה שהשיגו כאשר עמדו רגליהם על הר סיני טרם נצטוו, כי גם לזאת יקרא שמיעת קול ה' כי השיגו ציווי ה' מעצמם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 115,
      "char_length": 297,
      "timestamp": "2025-02-06T19:20:11.347085"
    },
    {
      "id": "mishpatim_p116",
      "text": "והנה אף שהוצרכו ישראל לציווי המצוות, ולא הספיק להם מה שהשיגו אבריהם תרי\"ג מצוות טרם נצטוו, כמו שביארנו כי לא כל העתים שוות: אמנם בכל דור ודור היו יחידי סגולה שכ\"כ גדלה מעלתם שלא הוצרכו לציווי, אלא השיגו את התורה מעצמם, הגם שאין אתנו יודע ומבין בחינה זאת מ\"מ אנו מאמינים שכן היו ונמצאו יחידי סגולה שהשיגו התוה\"ק בלא ציווי, ולעתיד יגיעו כלל ישראל לבחינה זו, שישיגו את התוה\"ק מעצמם, כמו שפירשו כוונת אמרם ז\"ל (נדה ס\"א ע\"ב) מצוות בטלות לעתיד לבא, שאין הכוונה שלא ינהגו דיני התורה, אלא שלא יצטרכו לצוות עליהם, כי מה שהוצרכו לציווי הוא מפני שניתנה הבחירה לאדם, ובידו לעשות נגד רצון הבורא, אמנם לעתיד תמלא הארץ דעה וכולם ירדפו לדעת את ה', וז\"פ מצות בטלות לעתיד לבא, שיחזרו כלל ישראל אל הבחינה שהיו בה קודם מתן תורה, ולא יצטרכו לציווי.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 116,
      "char_length": 727,
      "timestamp": "2025-02-06T19:20:11.551837"
    },
    {
      "id": "mishpatim_p117",
      "text": "והנה בשעה שעמדו על הר סיני לא נהגה בהו פרשת עבד עברי, שאינו כי אם ע\"י חטא כי מוכר עצמו עובר על כי לו בני ישראל עבדים וכן כמה דברים הכתובים בפרשה זו לא נהגו עדיין, כי נעקר היצה\"ר מלבם והיו כמלאכי השרת, וא\"כ הוה אמינא שלא נתגלתה להם פרשה זו עדיין, כאשר השיגו שאר חלקי התורה מיד בבואם אל הר סיני, שהרי אם היו משיגים פרשה זו היתה ידיעתם מכרחת את הבחירה שיבאו לידי חטא.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 117,
      "char_length": 364,
      "timestamp": "2025-02-06T19:20:11.945435"
    },
    {
      "id": "mishpatim_p118",
      "text": "אמנם כתב ק\"ז הישמח משה זלה\"ה פ' וישלח לבאר מה שאמרו ז\"ל (ב\"ב דף י\"ב ע\"א) חכם עדיף מנביא וז\"ל, שהצדיקים הגדולים המתדבקים בחכמה העליונה יוכלו להשיג גם מחשבתו של יוצר בראשית, משא\"כ הנביאים אין השגתם רק במה שיצא לפועל הדבור ולא בחינת מחשבה, ועל כן משיג החכם גם דברים התלויים בבחירה, אשר אין הקב\"ה מגלה אותם בבחינת דיבור, לפי שדבור של הקב\"ה מכריח את הבחירה, משא\"כ נביא אינו משיג דברים התלויים בבחירה עכ\"ד ז\"ל ועפ\"י זה יובן מה שלמדו בגמרא שם מקרא דחכם עדיף מנביא, שנאמר (תהלים צ) ונביא לבב חכמה מי נתלה במי הוה אומר קטן נתלה בגדול, ע\"כ. כי לולא קרא הו\"א שאף החכם א\"י להשיג דבר התלוי בבחירה, כי זה שהידיעה אינה מכרחת את הבחירה, הוא דייקא אם רק הקב\"ה יודע ואינו מגלה לאחרים, משא\"כ אם הקב\"ה גילה סודו לעבדיו, אף שלא גילה להם בדבור, לכאורה הוה מסתבר לומר שזוהי בחינת דבור אצלו יתברך, וכמו שפירשו המפרשים ז\"ל שבכל מקום שנאמר גבי הקב\"ה לשון דיבור הכוונה הוצאת הדבר מן ההעלם אל הגילוי, וכמאה\"כ (תהלים י\"ט) השמים מספרים כבוד א' וגו' אין אומר ואין דברים בלי נשמע קולם ואעפי\"כ בכל הארץ יצא קום ובקצה תבל מליהם הרי כי אף שדבר אין בפיהם ובלשונם מלה כיון שנתפרסם הדבר מקצה העולם ועד קצהו מכנהו הכתוב ספור, ועל כן הוצרכו חז\"ל ללמוד ממקרא דחכם עדיף מנביא כי כל כך גדלה מעלת החכם, שהשגתו היא בחינת מחשבה בלבד, ויכול הוא להשיג גם דברים התלויים בבחירה",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 118,
      "char_length": 1227,
      "timestamp": "2025-02-06T19:20:12.153626"
    },
    {
      "id": "mishpatim_p119",
      "text": "ועל פי זה א\"ש כי השיגו ישראל בבואם אל הר סיני גם פרשת משפטים ושאר המצוות התלויות בבחירה, כי השגתם היתה מבחינת חכמה שהיא בחינת מחשבה, ואין ידיעתם מכרחת הבחירה. וזה שכתב רש\"י ז\"ל ואלה מוסיף על הראשונים מה ראשונים מסיני אף אלו מסיני, כי אף דסבירא ליה כר\"ע שנאמרו המצוות פרטיהם ודקדוקיהם בסיני, הוה אמינא כי יצאה פרשה זו מן הכלל, לפי שכלולות בה מצוות התלויות בבחירה, ואילו נתגלתה להם פרשה זו היתה ידיעתם מכרחת את הבחירה, על כן כתיב ואלה וא\"ו מוסיף על ענין ראשון, לומר כי כשם ששאר חלקי התורה נתגלו להם מיד בבואם אל הר סיני, כי אין ידיעתם מכרחת את הבחירה, כן השיגו גם פרשיות התלויות בבחירה, ואין ידיעתם מכרחת את הבחירה, לפי שהשגתם היתה בבחינת חכמה שאינה מכרחת את הבחירה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 119,
      "char_length": 664,
      "timestamp": "2025-02-06T19:20:12.746011"
    },
    {
      "id": "mishpatim_p120",
      "text": "ומיושב גם מה שאמר הכתוב אשר תשים לפניהם ולא כתיב תלמדם, דהנה כדי שיגיעו ישראל למעלה זו שישיגו מעצמם מצוות התורה טרם נצטוו, בבחינת חכמה, ויוכלו להתדבק בחכמה עליונה, ולהשיג מחשבתו של יוצר בראשית, הוצרכו לעשות תשובה שלמה ולתקן מעשיהם כדי שיזדככו אבריהם מכל שמץ עון ואשמה. וידוע מה שכתב הרמב\"ם ז\"ל (הלכות תשובה פ\"ב ה\"ד) וז\"ל מדרכי התשובה להיות השב וכו' ומתרחק הרבה מן הדבר שחטא בו ומשנה שמו כלומר אני אחר ואיני אותו האיש שעשה אותן המעשים ומשנה מעשיו כולם לטובה, עכ\"ל. הרי כי בעל תשובה גמור הוא המשתנה לגמרי ונהפך והיה לאחר, וז\"ש הכתוב ואלה המשפטים אשר תשים לפניהם ולא כתיב תלמדם, כי כדי שיוכלו ישראל להשיג משפטים אלו מיד בבואם אל הר סיני, הוצרכו למעשה רב שיעשו תשובה שלמה, עד שישתנו לאנשים אחרים, וע\"כ כתיב לשון שימה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 120,
      "char_length": 713,
      "timestamp": "2025-02-06T19:20:13.078439"
    },
    {
      "id": "mishpatim_p121",
      "text": "ועפ\"י זה יש ליישב כוונת המדרש הה\"ד מגיד דבריו ליעקב חוקיו ומשפטיו לישראל וגו', דהנה בשם יעקב מכונים פשוטי העם, ושם ישראל מורה על בני העליה, והנה פשוטי העם שאינם במדרגה זו להשיג תמיד התוה\"ק מעצמם בלא ציווי, הוצרכו להגדה, אמנם בני העליה המכונים ישראל, לא הוצרכו לאמירה כלל, כי אבריהם משיגים מצוות הבורא מעצמם, וע\"כ חלקם הכתוב לתרתי, לפי שרישא דקרא דכתיב ביה מגיד דבריו ליעקב קאי על פשוטי העם, הצריכים לציווי, וחקיו ומשפטיו לישראל קאי על בני העליה, שאינם צריכים לציווי, וע\"כ לא כתיב בהו הגדה. והנה לפי מה שבארנו כי מאה\"כ אשר תשים לפניהם פירושו שצוה הקב\"ה שישתנו ישראל ויזדככו, כדי שיוכלו להשיג גם משפטי התורה מעצמם בלי ציווי, ע\"כ קאמר המדרש הה\"ד מגיד דבריו ליעקב חוקיו ומשפטיו לישראל, שפירושו כי בני העליה המכונים ישראל, משיגים התוה\"ק בלא הגדה, כי ע\"י שזככו עצמם ועשו מעשה רב, נתעלו למדרגה זו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 121,
      "char_length": 790,
      "timestamp": "2025-02-06T19:20:13.446382"
    },
    {
      "id": "mishpatim_p122",
      "text": "ויתיישב גם מה שדקדקו המפרשים שסיים הפסוק לא עשה כן לכל גוי וגו', עשייה מאן דכר שמיה, ולדברנו א\"ש כי מרומז עשייה ברישא דקרא דכתיב ביה חקיו ומשפטיו לישראל, ולא כתיב הגדה, ועל כרחך שזכו לכך ע\"י שעשו מעשה רב ושבו בתשובה שלמה, כנ\"ל. וע\"כ סיים קרא לא עשה כן לכל גוי, פירוש דאף שהחזיר הקב\"ה את התורה על כל אומה ולשון, מ\"מ בחינה זו של עשיה שיוכלו להשתנות לאנשים אחרים, וע\"י כך יהיה בידם להשיג את התורה מעצמם, לא רצה הקב\"ה לתת להם, אף אם היו מתרצים לקבל את התורה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 122,
      "char_length": 454,
      "timestamp": "2025-02-06T19:20:13.828729"
    },
    {
      "id": "mishpatim_p123",
      "text": "או יאמר באופן אחר קצת ליישב פירש\"י ז\"ל ואלה מוסיף על הראשונים וכו' ושאר הדקדוקים. דהנה אמרו ז\"ל (ירושלמי ר\"ה פ\"א ה\"ג) שהקב\"ה שומר משמרתה של תורה, וא\"כ קשה איך מכר הקב\"ה את ישראל להשתעבד בגלות בין האומות זה זמן רב כ\"כ, והלא מקרא מלא הוא שש שנים יעבוד ובשביעית יצא לחפשי חנם. אמנם י\"ל עפ\"י מה שכתבו התוספות (בבא מציעא דף י' ע\"א) ד\"ה כי לי בני ישראל עבדים דמ\"מ מותר אדם להשכיר עצמו דדוקא עבד עברי שאינו יכול לחזור בו ואינו יוצא קודם זמנו אלא בשטר שחרור עובר משום עבדי הם עכ\"ל התוספות. ולכן כיון שהקב\"ה בידו לגאול את ישראל בכל עת ורגע אשר יעלה רצון לפניו יתברך. והדבר תלוי רק בתשובה, וכאשר השיב משיח לריב\"ל ששאלו אימתי אתי מר א\"ל היום ופירש לו אליהו זל\"ט שכוונתו היתה (תהלים צ\"ו) היום אם בקולו תשמעו (סנהדרין צ\"ח ע\"א) ולפיכך אין אנחנו בבחינת עבדים כי אם בבחינת שכיר שיכול לחזור בו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 123,
      "char_length": 777,
      "timestamp": "2025-02-06T19:20:14.078445"
    },
    {
      "id": "mishpatim_p124",
      "text": "היוצא מזה כי בפרשת עבד עברי מרומזים אופני הגלות והגאולה, וכן פירש בזה\"ק פרשה זו על הגלות ועי' באה\"ח הקדוש שהאריך בזה. והנה כאשר עמדו ישראל על הר סיני לא היו בבחינה שיתחייבו גלות, כמו שדרשו ז\"ל (שה\"ש רבה פ\"ח ג) חרות על הלוחות, (שמות כ\"ו) אל תיקרי חרות אלא חירות חירות ממלה\"מ חירות משעבוד מלכיות וכן אמרו ז\"ל (ע\"ז דף ה' ע\"א) ר' יוסי אומר לא קבלו ישראל את התורה אלא על מנת שלא ישלטו בהן אומות העולם, וא\"כ קשה איך נתגלתה להם פרשה זו שהיא מרמזת על הגלות, והלא הוא דבר התלוי בבחירה אם יחטאו ויתחייבו גלות, ועל כרחך לומר כי השגתם היתה בבחינת חכמה שאינה מכרחת הבחירה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 124,
      "char_length": 559,
      "timestamp": "2025-02-06T19:20:14.463319"
    },
    {
      "id": "mishpatim_p125",
      "text": "וזה אפ\"ל בדברי הכתוב ואלה המשפטים וגו', כי הוא מורה על הגלות הקרוי משפט, וכמו שפירשו הכתוב משפטי ה' אמת צדקו יחדיו (תהלים י\"ט) ר\"ל אף שאין אנו משיגים בדעתנו על מה ולמה נתארך כ\"כ קץ גלותנו, מ\"מ בעת בוא הגאולה יבינו הכל למפרע כי כל הגליות והיסורים היו לטוב לנו, וז\"ש הכתוב משפטי ה' אמת, ר\"ל אף שמשפט הגלות שגזר עלינו הבורא הוא אמת, אבל אין הבריות משיגים להצדיקו עליהם, כי לא ידעו ולא יבינו על מה ארך כ\"כ קץ הגלות, ואימת ישיגו הכל אמיתת משפטי ה' ויצדיקו דין הגלות עליהם כאשר יגיע קץ גלותנו, ונזכה אל הגאולה, אזי כשיהיו בידינו שניהם יחדיו הגלות וגם הגאולה, נודה למפרע כי הגלות היה לטוב לנו וז\"ש הכתוב צדקו יחדיו שהבריות יצדיקו הגלות כאשר תהי' הגאולה השלמה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 125,
      "char_length": 652,
      "timestamp": "2025-02-06T19:20:14.747396"
    },
    {
      "id": "mishpatim_p126",
      "text": "ועפי\"ז יש ליישב הדקדוקים הנ\"ל, דהנה על כרחך לומר שישראל השיגו את המשפטים שכלול בהם גם דין הגלות בבחינת חכמה שאינה מכרחת הבחירה, ולהגיע לבחינה זו הוצרכו לזכך חומרם ולשוב בתשובה שלמה, וז\"ש הכתוב אשר ''תשים'' לפניהם, כי הוצרכו למעשה רב כדי שיוכלו להשיג הענינים התלוים בבחירה הכלולים בפרשה זו. וזאת כוונת רש\"י ז\"ל ואלה המשפטים מה הראשונים מסיני אף אלו מסיני, פירוש שגם בחינת הגלות הקרוי משפט כנ\"ל השיגו בסיני אף שהוא דבר התלוי בבחירה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 126,
      "char_length": 430,
      "timestamp": "2025-02-06T19:20:15.072317"
    },
    {
      "id": "mishpatim_p127",
      "text": "ועל פי האמור יש ליישב לשון הגמרא (אות ד') ר' יוחנן בן זכאי היה דורש מקרא זה כמין חומר ופירש\"י ז\"ל חומר, צרור המרגליות וצרור הבושם תלוי בצואר לתכשיט, והוא פלא לכאורה למה כינה דרשה זו שהיא כמין צרור של מרגליות וצרור של בושם דייקא. אמנם לדרכנו י\"ל כי כיון שר' יוחנן בן זכאי דרש טעם שעבד עברי נרצע לפי שמכר עצמו ועבר על אזהרת לי בני ישראל עבדים, א\"כ ע\"כ לומר שנתגלו לישראל בבואם אל הר סיני גם מצוות התלויות בבחירה, לפי שהיתה השגתם מבחינת חכמה שאינה מכרחת הבחירה, ע\"כ קאמר שהיה דורש מקרא זה כמין חומר שהוא צרור של בשמים, ור\"ל כמו שצרור זה מונחים בו כמה מיני בשמים, כך נתגלו לישראל בהגיעם אל הר סיני כל מצות התורה יחד, ואפילו אותם התלוים בבחירה",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 127,
      "char_length": 638,
      "timestamp": "2025-02-06T19:20:15.287113"
    },
    {
      "id": "mishpatim_p128",
      "text": "ולדרכנו יש לפרש גם דברי התוספות שם שכתבו וז\"ל ור\"ת פירש חומר מעשה וכן פירש הערוך, ובלשון ערבי האומר לחבירו מה מעשיך אומר לו מה אחמרך, עכ\"ל. והוא תמוה לכאורה מה מעשה שייך הכא, אמנם לפי שמדרשת ריב\"ז נשמע כי השיגו ישראל גם דברים התלוים בבחירה, ולכאורה איך נתגלו להם דברים התלויים בבחירה, והרי דבור מכריח את הבחירה, וע\"כ לומר שהשגתם היתה בבחינת חכמה ולהגיע למדרגה זו שאבריהם ישיגו מעצמם מצוות התורה בבחינת חכמה, היו צריכים לעשות מעשה רב ולהשתנות ע\"י תשובה. ע\"כ קאמר בגמרא שדרש מקרא זה כמין חומר, ופירשו התוספות מעשה כי נעשה בהם שינוי מעשה, וע\"י כן יכלו להשיג גם פרשה זו התלויה בבחירה. והשי\"ת יעזור שנזכה במהרה לאחרית ותקוה טובה בזכות אבותינו הקדושים שהיו עובדי ה' באמת זי\"ע, ובזכותם נזכה במהרה שיהיה צדקו יחדיו הגלות והגאולה, ובמהרה תהיה האחרית המקווה, ונזכה לישועה שלמה ואמיתית בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו בב\"א.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 128,
      "char_length": 832,
      "timestamp": "2025-02-06T19:20:15.604110"
    },
    {
      "id": "mishpatim_p129",
      "text": "ואלה המשפטים אשר תשים לפניהם. בגמרא (סנהדרין ז' ע\"ב) מאי אשר תשים תלמדם מיבעי ליה, ודרשו אלו כלי הדיינים מקל ורצועה וכו'. אמנם עדיין צ\"ב מדוע כתיב לשון שימה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 129,
      "char_length": 157,
      "timestamp": "2025-02-06T19:20:16.001802"
    },
    {
      "id": "mishpatim_p130",
      "text": "ב) דקדקו המפרשים למה מתחלת פ' זו בלשון רבים תשים ''לפניהם\" והרי כל הפרשה כתובה בלשון יחיד כי תקנה עבד עברי וכן להלן.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 130,
      "char_length": 116,
      "timestamp": "2025-02-06T19:20:16.116111"
    },
    {
      "id": "mishpatim_p131",
      "text": "ונראה לפרש עפ\"י מה שביארנו לעיל (פ' נח עמוד קצ\"ו קצ\"ז) לבאר הכתוב קץ כל בשר בא לפני כי מלאה הארץ חמס מפניהם (בראשית ו). ודרשו ז\"ל (סנהדרין ק\"ח ע\"א) לא נחתם גזר דינם אלא על הגזל. והקשו המפרשים שהרי לעיל מיניה כתיב כי השחית כל בשר את דרכו על הארץ. ואמרו ז\"ל שם אפילו בהמה חיה ועוף נזקקין לשאינם מינם, הרי שנגזרה עליהם כלייה עבור חטאם בגילוי עריות.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 131,
      "char_length": 345,
      "timestamp": "2025-02-06T19:20:16.212165"
    },
    {
      "id": "mishpatim_p132",
      "text": "ופירשנו עפ\"י מה דאיתא בגמרא (ברכות ל\"ה ע\"א) א\"ר חנינא בר פפא כל הנהנה מן העוה\"ז בלא ברכה כאילו גוזל להקב\"ה וכנסת ישראל, ופירש\"י ז\"ל גוזל להקב\"ה את ברכתו וכנסת ישראל שבחטאו הפירות לוקין. וכתב המהרש\"א ז\"ל לבאר הטעם אשר ע\"י חטא זה הפירות לוקין, כי הברכות מורידים שפע ברכה על הפירות, ובאינו מברך על דבר הנהנה הוא מפריד ומשחית שפע הקדושה והברכה לכנסת ישראל מאביהם שבשמים עכ\"ל המהרש\"א. המורם מדבריו כי הממעט שפע הברכה מן העולם ע\"י חטאיו נקרא גזלן. והנה ידוע כי ע\"י הפגם באות ברית קודש נופלת השפעת הקדושה ליד החיצונים ר\"ל ומתמעט שפע הברכה מן העולם, וזה ראשית לכל דבר הממעט את המחיה מן האדם. (עי' יש\"מ פ' מקץ צ\"ז ע\"ג) ועפי\"ז נראה לפרש מאמרם ז\"ל (ב\"ב קס\"ה ע\"א) רובם בגזל ומיעועם בעריות, דלכאורה אינו מובן וכי רוב העולם גזלנים, אמנם לדברינו מובן כי הכוונה הוא שרוב העולם נכשלים בחטא הידוע וע\"י כך גוזלים השפע מן העולם, וז\"פ רובם בגזל ומיעוטם בעריות: כי בעריות ממש נכשלים רק מיעוט העולם אמנם בגזל דהיינו החטא הידוע שהוא ענף ג\"ע נופלים רוב העולם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 132,
      "char_length": 934,
      "timestamp": "2025-02-06T19:20:16.411573"
    },
    {
      "id": "mishpatim_p133",
      "text": "ועפ\"י האמור יתיישב היטב, כי באמת עיקר חטאם של אנשי דור המבול היה בגילוי עריות, כמאה\"כ כי השחית וגו', וע\"י חטא זה הפסיקו את השפע מן העולם, וז\"פ לא נחתם גז\"ד אלא על הגזל, היינו גזל השפעת הברכה מן העולם שנגרם ע\"י חטאם בגילוי עריות. והנה באמת זה לא הוי גזל בידים, כי אם גרמא בנזיקין, שע\"י מעשיהם המקולקלים גרמו להפסקת השפע מן העולם, וקיי\"ל (ב\"ק נ\"ה ע\"ב) גרמא בנזיקין פטור בדיני אדם וחייב בדיני שמים, וא\"כ למה נתחייבו דור המבול כלייה בעבור גזל ההשפעה מן העולם שהוא רק גרמא בנזיקין, אמנם יבואר דהנה איתא במד\"ר (שמות פ\"ל) ביקש הקב\"ה ליתן לדור המבול תורה וכו' ולא רצו אמר להם הקב\"ה מי גרם לכם שתאבדו וכו' מפני שלא קבלתם את התורה שיש בה דין וכו' ע\"כ. והנה אמרו ז\"ל (דברים רבה פ\"ה ד') ר\"א אומר במקום שיש דין אין דין ובמקום שאין דין יש דין וכו' אם נעשה הדין למטה אין הדין נעשה למעלה ואם לא נעשה הדין למטה נעשה למעלה. ע\"כ. ומעתה אם היו מקבלים עליהם לשמור את הדין לא היו מתחייבים כליה על שגרמו להפסקת השפע מן העולם, כי כשיש דין למטה אין דין למעלה, ולא היו נענשים על גרמא בנזקין. רק ע\"י שלא רצו לקבל את הדינים ובזמן שאין דין למטה יש דין למעלה נענשו גם על גרמא בנזקין החייב בדיני שמים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 133,
      "char_length": 1070,
      "timestamp": "2025-02-06T19:20:16.867274"
    },
    {
      "id": "mishpatim_p134",
      "text": "ועפי\"ז נבא לבאר הדקדוקים הנ\"ל, בהקדם מ\"ש בסה\"ק ש\"ך על התורה (פ' זו) כי במשפטים נכללים שני דברים הא' דינים שבין אדם לחבירו ואחד הדינים שהם לצורך הנהגתו במאכלו ובשתיתו והנהגתו עם אשתו בימי נדתה ולבונה ושאר דברים שבצנעה וכו' יע\"ש וכן נכלל בכלל המשפטים הפגם באות ברית קודש, ובפרט כי ע\"י פגם זה נקרא גזלן שגוזל שפע הברכה מן העולם נמצא כי הוא בכלל דיני גזלה, וזה אפשר לרמוז במאה\"כ ואלה המשפטים אשר תשים לפניהם כי הכוונה הוא על פגם הברית שנקרא גזלן על ידו, אמנם הוא רק גרמא בנזיקין ובדיני אדם אינו חייב, והתקנה לכך שלא יענש בידי שמים אשר תשים לפניהם שיקיימו ישראל את הדינים וכשיש דין למטה אין דין למעלה וכנ\"ל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 134,
      "char_length": 602,
      "timestamp": "2025-02-06T19:20:17.431321"
    },
    {
      "id": "mishpatim_p135",
      "text": "ויש לומר עוד כי ידוע מ\"ש בזה\"ק (ח\"א רי\"ט ע\"ב) כי אין מועיל תשובה לחטא הידוע ובמקום אחר כתב כי אמנם מועילה תשובה גם לחטא זה אבל רק תיובתא סגיא (ח\"ב רי\"ד ע\"ב) וכתבנו לעיל (פ' ויחי ע' תקע\"א) שאין דברי הזה\"ק סותרים, כי מ\"ש שאין מועיל תשובה היינו תשובה מיראה, והתשובה המועילה היינו תשובה מאהבה, והנה כתב ק\"ז הישמח משה זלל\"ה (פ' האזינו קמ\"ו ע\"ג) כי תשובת רבים אף שהיא מיראה נחשבת כתשובה מאהבה, כי גדול כח הרבים ומועילה תשובתם להפוך זדונות לזכיות, וז\"ש הכתוב ואלה המשפטים הרומז על פגם הברית, כמ\"ש הש\"ך עה\"ת הנ\"ל, אשר תשים פירוש שצוה הקב\"ה למשה רבינו ע\"ה שיעורר בלבם הרהורי תשובה בכח קדושתו, וישימו אל לבם את אשר עוותו ויתחרטו בחרטה גמורה על מעשיהם, עד שיגיעו למדרגת בעלי תשובה שהם נחשבים כאחרים ואינם אותם שעשו את העברות וכמ\"ש הרמב\"ם ז\"ל (פ\"ב מהלכות תשובה ה\"ד) מדרכי התשובה שיהא השב וכו' ומשנה שמו כלומר אני אחר ואיני אותו האיש שעשה אותן המעשים עכ\"ל. ואין לך שימה גדולה מזו, שעשאם בעלי תשובה ונהפכו לאנשים אחרים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 135,
      "char_length": 905,
      "timestamp": "2025-02-06T19:20:17.726190"
    },
    {
      "id": "mishpatim_p136",
      "text": "ורמז לנו הכתוב באמרו לפניהם לשון רבים כי שימה זו תועיל ביותר בעת שישובו ברבים. וכמ\"ש הישמח משה ז\"ל הנ\"ל כי תשובת הרבים אין לשער ולהעריך, שכל מה שיוכל היחיד לתקן בעידן עידנים וזמן זמנים טובא יוכלו הרבים לתקן ברגע אחד, כי אל כביר לא ימאס (איוב ל\"ו) ולמדו רז\"ל מפסוק זה ברכות דף ח' ע\"א) שאין הקב\"ה מואס בתפלתן של רבים, וכ\"כ גדול כחה כתשובה מאהבה המהפכת זדונות לזכיות, ועל כן כיון שמרומז בקרא פגם הברית שהכריע בזה\"ק שמועלת לו רק תשובה מאהבה, רמזה לנו תורה במאמר תשים לפניהם שגם תשובת הרבים תועיל לפגם נורא זה, ומקובלת ומרוצה התשובה לפני אדון כל כתשובה מאהבה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 136,
      "char_length": 554,
      "timestamp": "2025-02-06T19:20:18.167303"
    },
    {
      "id": "mishpatim_p137",
      "text": "באופן אחר י\"ל פירש\"י ז\"ל ואלה מוסיף על הראשונים וכו', וגם יתיישבו שאר הדקדוקים הנ\"ל בפסוק. בהקדם להעיר עוד מה דאיתא במד\"ר הה\"ד מגיד דבריו ליעקב, אלו הדברות, חוקיו ומשפטיו לישראל, אלו המשפטים וגו', וצ\"ב למה חלקם הפסוק לשנים והרי גם המשפטים דברי הקב\"ה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 137,
      "char_length": 250,
      "timestamp": "2025-02-06T19:20:18.524664"
    },
    {
      "id": "mishpatim_p138",
      "text": "ב) עוד במדרש (ילקוט תהלים רמז תרע\"ד) משפטי ה' אמת צדקו יחדיו (תהלים י\"ט) זה סדר נזקין שיש בו כל הדינים וצ\"ב.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 138,
      "char_length": 108,
      "timestamp": "2025-02-06T19:20:18.670669"
    },
    {
      "id": "mishpatim_p139",
      "text": "ונראה בהקדם מ\"ש בסה\"ק בני יששכר (דרוש לר\"ה מאמר ג' דרוש ב') בשם הרמ\"ע מפאנו על דאיתא בגמרא (ר\"ה י\"ז ע\"א) בינונים וכו' (דהיינו מחצה עונות ומחצה זכיות) ב\"ה אומרים ורב חסד מטה כלפי חסד וכו' היכי עביד ר' אליעזר אומר כובשו וכו' ר' יוסי בר' חנינא אמר נושא וכו' תנא דבי ר' ישמעאל מעביר ראשון ראשון ע\"כ. וצ\"ב שהרי איתא בגמ' (ב\"ק דף נ' ע\"א) כל האומר הקב\"ה ותרן יותרו מעיו ואיך מותר הקב\"ה על העוונות, ופירש כי הקב\"ה מתנהג עם ישראל על פי משפטי התורה, כי כך יאתה לבני ישראל שהם בניה של תורה: שהקב\"ה ידונם עפ\"י משפט התורה, ובדיני התורה קיי\"ל אחרי רבים להטות, ואפילו מחצה עונות ומחצה זכיות הלא מדה טובה מרובה ממדת פורעניות, ע\"כ הקב\"ה נושא כובש ומעביר העוונות ואין זה ויתור.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 139,
      "char_length": 659,
      "timestamp": "2025-02-06T19:20:18.768321"
    },
    {
      "id": "mishpatim_p140",
      "text": "עוד הביא שם בשם הרה\"ק הר\"ר זושא זלל\"ה שפירש הפסוק (תהלים פ') תקעו בחדש שופר וגו' כי חק לישראל הוא משפט לאלקי יעקב, כי כאשר השי\"ת רואה כי גדול הקיטרוג על ישראל, ואין בידם מצות ומע\"ט לזכותם בדין. אמנם בגודל רחמיו וחסדיו רצונו לזכות את ישראל, אזי אומר השי\"ת כי בדין הוא להושיעם בלי טעם כי גם הם מקיימים מצוות שהם חוקים ואין בהם טעם, וז\"פ כי חק לישראל הוא. ר\"ל ע\"י שישראל מקיימים חוקי התורה, מדה כנגד מדה היא שהקב\"ה יעשה מזה משפט ויזכה אותם בדין בלא טעם ע\"ש שהאריך.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 140,
      "char_length": 461,
      "timestamp": "2025-02-06T19:20:19.093829"
    },
    {
      "id": "mishpatim_p141",
      "text": "ולכאורה צ\"ב היאך דנים בב\"ד של מעלה על פי התורה, והרי תורה לא בשמים היא, וע\"כ לומר כי בעת שישראל מתנהגים בדרך התורה, ושומרים משפטי התורה, משפיע הקב\"ה בב\"ד שלמעלה כח התורה, למען ידונו את ישראל עפ\"י התורה, וז\"פ הפסוק משפטי ה' אמת, ר\"ל משפטי ה' הם הדינים הנפסקים בב\"ד שלמעלה, מתנהגים עפ\"י התורה שהיא תורת אמת, והטעם צדקו יחדיו, ר\"ל שאז מתנהגים בב\"ד שלמעלה עפ\"י התורה ''יחדיו'' כשגם ישראל משמרים את משפטי התורה, אז משפיע הקב\"ה כח התורה בב\"ד שלמעלה לטובת ישראל, כדי שיצדקו בדין. וזה כונת המדרש משפטי ה' וגו' זה סדר נזקין ר\"ל שע\"י שמשמרין סדר נזקין שהם המשפטים, מתנהגים משפטי ה' בדרך התורה, כדי להצדיק ישראל בדין. וכן יתבאר המדרש הה\"ד מגיד דבריו ליעקב אלו הדברות דהיינו שהקב\"ה הגיד להם דברות קדשו היא התוה\"ק, חקיו ומשפטיו לישראל, ר\"ל שע\"י שישראל משמרים חקיו דהיינו המצות שהם חק בלי טעם, מזה נעשה להם משפט בב\"ד של מעלה שיפסקו על פי התורה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 141,
      "char_length": 830,
      "timestamp": "2025-02-06T19:20:19.335915"
    },
    {
      "id": "mishpatim_p142",
      "text": "ועל פי זה פירוש ומשפטיו לישראל, היינו בשביל ישראל, כי לטובת ישראל משפיע הקב\"ה בב\"ד שלמעלה כח התורה, כדי שידונו את ישראל על פי התורה, והשתא מיושב למה חלקם הכתוב לשנים, כי לא קאי חקיו ומשפטיו לישראל על ההגדה, אלא כוונה אחרת להם כנ\"ל, וזאת גם כונת המדרש ומשפטיו לישראל אלו המשפטים, ר\"ל ע\"י שמקיימים ישראל משפטי התורה, משפיע הקב\"ה במשפטיו היינו בהוראת ב\"ד שלמעלה כח התורה כדי לזכות את ישראל, וזה שמסיים הכתוב לא עשה כן לכל גוי, נקט לשון עשייה, כי ע\"י שישראל משמרים את המשפטים הם עושים מעשה בב\"ד שלמעלה שדנים את ישראל על פי התורה, ואין לאוה\"ע כח עשייה זו, שע\"י קיום המשפטים ידונו אותם בב\"ד שלמעלה על פי התורה, כמו שביארנו לעיל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 142,
      "char_length": 622,
      "timestamp": "2025-02-06T19:20:19.735995"
    },
    {
      "id": "mishpatim_p143",
      "text": "וזאת גם כונת המדרש אם אין אתם שומרים את הדינים נוטל תורתו מכם, ר\"ל כח זה שניתן ביד ישראל, שידונו אותם בב\"ד שלמעלה כמשפט התורה יטול הקב\"ה מהם, אם אינם משמרים את הדינים. ובזה מיושב למה כתיב תשים לפניהם ולא כתיב תלמדם, כי ע\"י שמירת המשפטים הם גורמים שימה, כי ישפיעו כח התורה בב\"ד שלמעלה לטובת ישראל ולזכותם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 143,
      "char_length": 304,
      "timestamp": "2025-02-06T19:20:20.042796"
    },
    {
      "id": "mishpatim_p144",
      "text": "והנה כל השפעות התורה נשפעות ע\"י משרע\"ה. כמו שמצינו בדברי חז\"ל כמה פעמים שמכונים תלמידי חכמים בשם משה (עי' חולין צ\"ג ע\"א) ופירש האריז\"ל הטעם משום שכל ת\"ח הוא ניצוץ מנשמת משה, ואיתא במדרש (שמו\"ר פכ\"ט) כל מה שתלמיד ותיק עתיד לחדש נאמר למשה בסיני, ע\"כ. וגם חלק התורה שהקב\"ה משפיע בב\"ד שלמעלה לדון בו את ישראל, הוא גם כן על ידי משה רבינו ע\"ה. וזה אפ\"ל בכוונת רש\"י ז\"ל ואלה מוסיף על הראשונים, מה הראשונים מסיני, פירוש שכל השפעות התורה נמסרו למשה מסיני, אף אלו מסיני, ר\"ל אף מה שהקב\"ה משפיע בב\"ד שלמעלה כח התורה לטובת ישראל, הרמוז במאה\"כ אשר תשים לפניהם ג\"כ נמסר למשה בסיני.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 144,
      "char_length": 567,
      "timestamp": "2025-02-06T19:20:20.219176"
    },
    {
      "id": "mishpatim_p145",
      "text": "ואלה המשפטים אשר תשים לפניהם. במד\"ר זש\"ה (תהלים קמ\"ז) מגיד דבריו ליעקב וגו' לא עשה כן לכל גוי. כבר הבאנו לעיל קושית המפרשים שאין הפסוק מסיים במה שהתחיל, דפתח בלשון הגדה וסיים בלשון עשייה, והול\"ל לא הגיד כן לכל גוי.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 145,
      "char_length": 214,
      "timestamp": "2025-02-06T19:20:20.518087"
    },
    {
      "id": "mishpatim_p146",
      "text": "ונראה לפרש עפ\"י מה דאי' בספה\"ק לדחות טענת אוה\"ע (ע\"ז דף ב' ע\"ב) רבש\"ע כלום כפית עלינו הר כגיגית, דהנה איתא בעירובין (י\"ג ע\"ב) שני שנים ומחצה נחלקו ב\"ש וב\"ה הללו אומרים נוח לו לאדם שלא נברא יותר משנברא והללו אומרים נוח לו לאדם שנברא יותר משלא נברא נמנו וגמרו נוח לו לאדם שלא נברא יותר משנברא עכשיו שנברא יפשפש במעשיו וכו'. וכתב המהרש\"א בח\"א (מכות כ\"ג ע\"ב) לפרש הלשון נמנו וגמרו, היינו שמנו שיש רמ\"ח מ\"ע ושס\"ה מצות ל\"ת, וא\"כ כיון שהל\"ת מרובין מהעשין קרוב האדם לחטוא ח\"ו, ע\"כ גמרו נוח לו לאדם שלא נברא משנברא עכ\"ד. ואומרם ועכשיו שנברא יפשפש במעשיו, יתבאר ע\"ד דאיתא בגמרא (יומא פ\"ו ע\"ב) דבתשובה מאהבה זדונות נעשין לו כזכיות, נמצא כי ע\"י תשובה מאהבה יהיו העשין מרובין מן הלאוין, כי יתהפכו לו העבירות למצות, וז\"פ עכשיו שנברא מה תקנתו, יפשפש במעשיו, וע\"י התשובה יתהפכו לו זדונות לזכיות וא\"כ נוח לו שנברא.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 146,
      "char_length": 797,
      "timestamp": "2025-02-06T19:20:20.654276"
    },
    {
      "id": "mishpatim_p147",
      "text": "אמנם תשובה מועילה רק בישראל, אבל לא באוה\"ע, כדאיתא במדרש תנחומא (פ' האזינו) כתיב ישא ה' פניו אליך וכתיב אשר לא ישא פנים עשה תשובה ישא ה' פניו אליך יכול לכל ת\"ל אליך ולא לאוה\"ע עכ\"ד. (ועי' בבני יששכר מאמר ימי הגבלה שהאריך בטעם הדבר) נמצא כי כיון שאין מועלת תשובה לאוה\"ע, הוי התורה גבייהו רחוק משכר וקרוב להפסד, שהרי הלאוין מרובין מן העשין, ושוב אין טענתם טענה כלום כפית עלינו הר כגיגית, כי הקב\"ה חפץ חסד הוא ולא רצה לכופם על דבר שהוא לרע להם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 147,
      "char_length": 441,
      "timestamp": "2025-02-06T19:20:21.043249"
    },
    {
      "id": "mishpatim_p148",
      "text": "והנה איתא בספרים הקדושים טעם שאין מועלת תשובה לאוה\"ע, כי באמת מדת הדין נותנת כי הנפש החוטאת הוא תמות. אלא שהתשובה מועלת מצד מדת הרחמים, והנה בני ישראל יש בידם כח זה לשבור תוקף מדת הדין ולעורר מדת הרחמים בעולם, ע\"י קיום המשפטים כי כשיש דין למטה אין דין למעלה, וע\"כ מועילה להם תשובה אבל אומות העולם אין בכחם להגביר מדת הרחמים על מדת הדין כמו שנתבאר לעיל בדברנו באורך כי לא ניתן כח זה אלא לישראל לפי שהם משמרים את המשפטים לצד גזרת הבורא ולא לטעם קיום העולם כאוה\"ע, ולכן אין מועילה לאוה\"ע תשובה, לפי שמדת הדין מתוחה עליהם ע\"י חטאיהם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 148,
      "char_length": 529,
      "timestamp": "2025-02-06T19:20:21.285701"
    },
    {
      "id": "mishpatim_p149",
      "text": "וזה אפ\"ל בכוונת המדרש ואלה המשפטים הה\"ד מגיד דבריו ליעקב וגו' לא עשה כן לכל גוי ומשפטים בל ידעום, כי לפי שדרשו ז\"ל לפניהם ולא לפני עכו\"ם, בא המדרש לתת טעם מדוע לא כפה אותם הקב\"ה לקבל התורה ע\"כ קאמר הה\"ד מגיד דבריו ליעקב, פירוש שנתן לישראל את התורה, וקבלת התורה היתה ע\"י כפיית ההר, ולכאורה מדוע כפה אותם הקב\"ה על כך, והלא התורה היא קרובה להפסד ורחוקה משכר כי הלאוין מרובין, וע\"כ לומר כנ\"ל שע\"י תשובה מאהבה מתהפכין זדונות לזכיות וא\"כ העשין מרובין, וטעם שמועילה תשובה בישראל לפי שבידם להגביר מדת הרחמים בעולם ע\"י קיום המשפטים, כי כאשר יש דין למטה אין דין למעלה ומתנהגים בב\"ד שלמעלה כהוראת ב\"ד שלמטה. וז\"פ הפסוק חוקיו ומשפטיו לישראל, היינו שמסר הקב\"ה לישראל כח המשפט בב\"ד שלמעלה הקרוי חקיו ומשפטיו, כאשר בארנו לעיל, לא עשה כן לכל גוי, פירוש לא כפה אותם לקבל את התורה כי עשייה הוא לשון כפייה מלשון גט מעושה, ומפרש הכתוב הטעם ומשפטים בל ידעום, ר\"ל שאין בידם כח המשפטים לבטל על ידי כך דיני מעלה, וא\"כ אין מועלת להם תשובה שהיא מצד מדת הרחמים, כי מתוחה עליהם מדת הדין, וא\"כ התורה לגבייהו קרובה להפסד ורחוקה משכר, על כן לא עשה הקב\"ה כן לכל גוי לכפותם על קבלת התורה כי חפץ חסד הוא.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 149,
      "char_length": 1070,
      "timestamp": "2025-02-06T19:20:21.557491"
    },
    {
      "id": "mishpatim_p150",
      "text": "ואלה המשפטים אשר תשים לפניהם. במדרש רבה איתא (סי' י\"ט) הה\"ד ועוז מלך משפט אהב (תהלים צ\"ט) א\"ל משה לישראל הרי נתן לכם הקב\"ה את תורתו אם אין אתם עושים את הדינים נוטל תורתו מכם למה שלא נתן לכם הקב\"ה את התורה אלא ע\"מ שתעשו את הדינים וכו'. והקשר המפרשים וכי עבור שאין ישראל עושים את הדינים נעשו בני חורין ופטורים מכל מצות התורה, והרי אפילו מין וכופר מלבד אשר יקבל ענשו על עצם הכפירה לא בעבור זאת יפטר מקיום המצות, וענוש יענש בעד כל איסור קל אשר עשה, ואפי' איסור דרבנן, וכמ\"ש הרמב\"ם ז\"ל (אגרות הרמב\"ם מאמר קדוש השם) וא\"כ מה כוונת המדרש אם אין אתם עושים את הדינים נוטל תורתו מכם. ובספר חן טוב כתב לפרש המדרש עפ\"י מה דאיתא במד\"ר (סי' י\"ב) כי הגאולה העתידה תלויה בשמירת הדינים, ואם אין ישראל משמרים את הדינים מעכבים את הגאולה, ובהיותנו בגלות חסרנו הרבה מצות שאינן נוהגות אלא בזמן שביהמ\"ק קיים, וזה כוונת דברי המדרש אם אין אתם עושים את הדינים, ועי\"ז מעכבין את הגאולה, נוטל תורתו מכם. היינו אותם המצות שאי אפשר לקיימם אלא בזמן שבית המקדש קיים עכ\"ד. אבל עדיין אין מיושב לשון המדרש דקאמר נוטל תורתו משמע דקאי על התורה כולה ולא על חלק מהמצוות בלבד.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 150,
      "char_length": 1034,
      "timestamp": "2025-02-06T19:20:22.097974"
    },
    {
      "id": "mishpatim_p151",
      "text": "ב) להלן בפרשה (כ\"ג ח) ושחד לא תקח כי השחד יעור פקחים ויסלף דברי צדיקים, ועוד הזהיר הכתוב בפרשת שופטים, ולא תקח שחד כי השחד יעור עיני חכמים ויסלף דברי צדיקים. דקדק ק\"ז זלה\"ה בישמח משה פרשה זו למה שינה הכתוב לשונו, דהכא כתיב ושחד לא תקח, הקדים תיבת ''שחד'' לאזהרת לא תקח, ובפ' שופטים כתיב לא תקח שוחד, וגם למה נאמר כאן יעור פקחים והתם כתיב יעור עיני חכמים ועי' מ\"ש לפי דרכו באורך.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 151,
      "char_length": 378,
      "timestamp": "2025-02-06T19:20:22.612993"
    },
    {
      "id": "mishpatim_p152",
      "text": "ג) בילקוט הכא (רמז שנ\"ג) איתא כי השחד יעור עיני חכמים (דברים ט\"ז) בתורה או עיני חכמים כמשמעו (פירוש שאינם חכמים בחכמת התורה אלא במילי דעלמא), ת\"ל כי השחד יעור פקחים אלו פקחי הדעת שהן מטהרין ומטמאין מדעת עצמם. ופירש בזית רענן מטהרין ומטמאין מדעת עצמן שאין צריכין לשאול לשום אדם. ע\"כ. ולכאורה אין הדבר מובן וכי זו בלבד היא מעלת הפקחים שהם יודעים לטהר ולטמא ואינם צריכים לשאול, והלא מעלה זו נמצאת גם במי שהוא רק במדרגת חכם בתורה, ופקח הוא במדרגה גדולה יותר מחכם, שהרי חכם יכונה גם מי שהוא חכם במילי דעלמא, וכמ\"ש ז\"ל (איכה רבתי פ\"ב י\"ז) אם יאמר לך אדם יש חכמה בגוים תאמין שנאמר (עובדיה א) והאבדתי חכמים מאדום וגו'. משא\"כ פקחות מורה על פקחות בתורה, וא\"כ מה רבותא משמיענו המדרש שמעלת הפקחים היא שהם יודעים לטהר ולטמא ואינם צריכים לשאול לשום אדם, והרי לא שלל בזה אלא ע\"ה גמור שאין לו ידיעה בתורה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 152,
      "char_length": 789,
      "timestamp": "2025-02-06T19:20:22.849229"
    },
    {
      "id": "mishpatim_p153",
      "text": "ונראה לפרש הענין בהקדם דברי כ\"ק אבא מארי זללה\"ה בספרו קדושת יו\"ט פ' שלח לפרש דברי התרגום יונתן שם כד חמא משה לענותנותיה קרא להושע בן נון יהושע, וגם לפרש המדרש עה\"פ ויקרא משה להושע בן נון יהושע זש\"ה (איוב יד) מי יתן טהור מטמא לא אחד, עפ\"י מ\"ש ק\"ז בישמח משה פ' חקת לפרש הפסוק מי יתן טהור מטמא וגו' דהנה הכלי יקר מבאר הטעם שהפרה מטהרת טמאים ומטמאה טהורים כי כל דבר אינו מתפעל כי אם מהפכו, ולא ממה שהוא מינו, כדרך שהיצה\"ר מתגרה בישראל יותר מבאומות וגו', לפיכך מי נדה שיש בהם מים חיים שכולם טהרה, ויש בהם אפר פרה שכולו טומאה, והם מעורבים יחד, אם נזרקים על אדם טמא הוא מתפעל מן המים שכולם טהרה והם הפכיים לו, ואינו מתפעל מן האפר שהוא ממינו, משא\"כ אם יגע בהם איש טהור, יתפעל מן האפר שהוא הפכו לו, ולא מן המים הטהורים שהם מינו עכ\"ד הכל''י. וז\"פ מי יתן טהור מטמא, ר\"ל דאיך יכול להתהפך מטמא לטהור ''לא אחד\" ר\"ל ע\"י שהוא אינו אחד עם המים, נתפעל מהפכיותו, עכ\"ד הישמח משה ז\"ל. והנה יהושע וכלב היו המיעוט נגד עשרה נשיאי ישראל מובחרים שבעם, ויהושע בהיותו עניו והתבעל עצמו בפני כל לא היה יכול להתוכח עמהם, וחשש משה כי מחמת ענותנותו יגרר אחריהם לתעות מני הדרך, ע\"כ הוצרך להתפלל בעדו, שיוסיף אומץ ויעמוד איתן כנגדם כחלמיש צור ולא יתבעל כנגדם אלא יתפעל מהפכיותו וז\"פ המדרש ויקרא משה להושע בן נון יהושע דהיינו כדברי התרגום יונתן שהתפלל עליו שלא יתבטל כנגדם מחמת גודל ענותנותו, זש\"ה מי יתן טהור מטמא לא אחד כנ\"ל, כי נתפעל מחמת שהיתה דעתו היפך דעתם, ועי\"ז יכול לעמוד כנגדם. עכת\"ד אאמו\"ר זללה\"ה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 153,
      "char_length": 1372,
      "timestamp": "2025-02-06T19:20:23.239179"
    },
    {
      "id": "mishpatim_p154",
      "text": "ונראה להוסיף נופך על דבריו בביאור המדרש הנ\"ל זש\"ה מי יתן טהור מטמא וגו', עפ\"י מה שהביא ק\"ז הישמח משה זללה\"ה בשם האר\"י ז\"ל דבר נפלא עה\"פ הנ\"ל, דהנה איתא במדרש ילקוט כאן כל הנועל ממון ומטה את הדין או דעתו מטורפת בתורה ומטמא את הטהור ומטהר את הטמא וכו' והנה אמרו ז\"ל (כתובות ק\"ה) מאי שחד שהוא חד ופי' הוא ז\"ל כי לא תקח שחד הוא ס\"ת ''אחד\" והלוקח שחד מבטל תיבת ''לא\" ונותר ''תקח שחד\" שהוא ס\"ת ''חד\" ובזה יתבאר הכתוב מי יתן טהור מטמא. ר\"ל איך הגיע לידי כך שיאמר על טהור טמא ''לא אחד\" דהיינו מי שמבטל תיבת ''לא\" תקח שחד ובטל ''אחד'' ונעשה ''חד''. עכ\"ד האר\"י הקדוש. (עי' בניצוצי אורות על הזה\"ק פ' משפטים דף ק\"יז ע\"ב).",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 154,
      "char_length": 609,
      "timestamp": "2025-02-06T19:20:23.958799"
    },
    {
      "id": "mishpatim_p155",
      "text": "והנה איתא במשנה (סוף מס' פאה) וכל דיין שלוקח שחד ומטה את הדין אינו מת מן הזקנה עד שעיניו כהות שנאמר ושחד לא תקח וגו' כי השוחד יעור. ע\"כ. וכתב בזרע יצחק שם, מקשים המפרשים דהרי מצינו כמה וכמה מקבלי שוחד שאין עיניהם כהות לעת זקנתם, ותירצו כי עיניו כהות פירושו מאור הנשמה, ופירש הזרע יצחק דבריהם כי הכוונה הוא אשר לעוה\"ב יכהה מאור נשמתו, וביאר בזה את הפסוק (תהלים פ\"ב) לא ידעו ולא יבינו בחשכה יתהלכו, כי מקבלי השוחד חושבים בלבם שלום יהיה לי, בראותם כי הגיעו לעת זקנה ולא חשכו הרואות בארובות, אמנם לא ידעו ולא יבינו כי בחשכה יתהלכו נשמותיהם לעוה\"ב ואין נוגה למו. ברם אותם מקבלי שחד שכהתה עינם בעוה\"ז הוא להם לכפרה תמורת עונשם לעוה\"ב יעש\"ד באריכות. אבל קשה לכוון פירושו בלשון המשנה, שאם נאמר כדבריו מדוע כתיב אינו מת מן הזקנה עד שעיניו כהות, והרי לא יכהו עיניו אלא לאחר המיתה לעוה\"ב.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 155,
      "char_length": 777,
      "timestamp": "2025-02-06T19:20:24.324516"
    },
    {
      "id": "mishpatim_p156",
      "text": "ונראה לומר כי מ\"ש המפרשים דעיניו כהות קאי על מאור עיני הנשמה הכוונה הוא כי בעוד בו נשמתו ועודנו חי בעוה\"ז יכהה אור נשמתו, דהנה במשנה שם איתא הלשון אינו מת מן הזקנה עד שעיניו כהות, ולכאורה משמע כי רק לאחר זמן רב לעת זקנתו יכהו עיניו, וצ\"ב שהרי פשטות הפסוק פירושו כי ע\"י לקיחת השוחד מיד נעשים עיניו סמויות ולא יראה האמת, וכמ\"ש רש\"י ז\"ל (פ' שופטים) משקבל שחד ממנו אי אפשר שלא יטה את לבבו להפך בזכותו, ונראה כי זה אשר נתעורו עיני שכלו ולא יוכל לכוון אל האמת באותו משפט אין זה מצד העונש, כי דבר טבעי הוא שלב האדם פונה אל בצעו, וכאמרם ז\"ל שנעשה לבם חד ודעתו נטרפת עליו וכאשר ביארנו (עי' בדברנו בספרי ויואל משה סימן קמ\"ו קמ\"ז) ענין טעותו של שאול המלך, ששלחו שמואל הנביא ללחום בעמלק ולהכרית להם שם ושאר ולקעקע שורש וענף, ולא יוותר להם מאיש עד אשה מעולל ועד יונק משור ועד שה. וכתיב ויחמול שאול והעם על אגג ועל מיטב הצאן וגו' ולא אבו החרימם (שמואל א' ט\"ו), וכאשר הוכיחו שמואל על פניו למה לא שמעת בקול ה' וגו', ענהו שאול חטאתי כי עברתי את פי ה' ואת דבריך כי יראתי את העם ואשמע בקולם. ולכאורה הענין פלא חדא הקשה האלשיך הקדוש דמעיקרא כתיב ויחמול שאול והעם וגו', הרי שלא מחמת יראת העם השאיר את אגג ואת מיטב הצאן. אלא מחמלתו עליהם, ומדוע השיב לשמואל כי יראתי את העם ואשמע בקולם, ותו קשה הלא מלך היה ובידו השלטון על העם ולמה ירא מהם כל כך, ובפרט כי שאול המלך היה נקי מכל חטא כבן שנה נער כמו שדרשו ז\"ל (יומא כ\"ב ע\"ב) מדכתיב בן שנה שאול במלכו (שמואל א' י\"ג). ואמרו ז\"ל (ברכות י\"ב ע\"ב) עה\"פ (שמואל ב' כ\"א) והוקענום לה' בגבעת שאול בחיר ה' שיצתה בת קול ואמרה בחיר ה'. והוא גם עם נביאים ניבא (שמואל א' י), ובעולם העליון שפר חלקו במחיצה אחת עם שמואל הנביא, כאמרם ז\"ל (שם) עה\"פ (שמואל א' כח) ויאמר שמואל אל שאול מחר אתה ובניך עמי עמי במחיצתי. ואיך יתכן שהמרה פי ה' מחמת יראת העם, ומה גם שדורו היו מאמינים בה' ובנבואת שמואל, ולא היו כופים אותו לעבור פי ה' לעשות קטנה או גדולה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 156,
      "char_length": 1751,
      "timestamp": "2025-02-06T19:20:24.709469"
    },
    {
      "id": "mishpatim_p157",
      "text": "אמנם האמת הוא, כי אילו ידע שאול כי מעשהו נגד רצון ה' ודאי לא היה עובר על דברי ה' מחמת יראת העם, אלא שחשב שעושה בזה מצות ה' כאשר אמר למען זבוח לה', וכאשר הוכיחו שמואל הנביא על אשר המרה פי ה' שלא מחה שמו של עמלק, וראה כי דבריו כנים ואמיתיים, חזר לתמוה על עצמו היאך בא לידו טעות כזה, שלא להכיר האמת בדבר ברור כ\"כ, והתבונן כי אך מחמת יראת העם שחפץ לשמוע בקולם, נעשה משוחד, ובא לידי סמיות עינים לחשוב על עבירה שהיא מצוה, וז\"ש חטאתי כי עברתי את פי ה' וגו' כי יראתי את העם ואשמע בקולם, ר\"ל שיראת העם ורצונו לשמוע בקולם היתה הסבה שהביאתו לטעות שמצוה היא עושה בכך, והשתא א\"ש כי תרוייהו אמת, מעיקרא כתיב ויחמול שאול וגו', כי בשעת מעשה חשב בלבו כי מצוה הוא עושה למען זבוח לה', ולבסוף כאשר התבונן כי עבירה היתה בידו, הרגיש כי טעות זה בא לידו מחמת יראת העם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 157,
      "char_length": 744,
      "timestamp": "2025-02-06T19:20:25.614101"
    },
    {
      "id": "mishpatim_p158",
      "text": "היוצא מזה הוא כי מה שהשוחד מסמא עיני האדם לבל יוכל לשפוט דין אמת אינו מצד העונש כלל, כי דרך הטבע הוא שלבו נוטה אחרי מי ששחדו, אמנם כוונת חז\"ל במה שאמרו אינו מת מן הזקנה עד שעיניו כהות, היא כי אף בהבטל הסבה שהביאתו לידי טירוף הדעת וסמיות העינים, כגון בבא לפניו משפט אחר, או הוראת איסור והיתר שאין לו נגיעה בה כלל, ואינו משוחד, אעפי\"כ תטרף עליו דעתו, ולא יוכל לכוון אל האמת, כי כך ענשם של מקבלי שוחד. אשר ברבות הימים תטרף דעתם, שלא יוכלו לכוון אל האמת בשום ענין בתוה\"ק, וזאת כוונת אומרם ז\"ל אינו מת וכו' עד שעיניו כהות, ועונשו הוא מדה כנגד מדה, שאף בעת שאין לו כבר נטייה ואינו משוחד: מ\"מ הוא אדם משוחד והשפעת השוחד נשארת עליו שלא יראה האמת.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 158,
      "char_length": 638,
      "timestamp": "2025-02-06T19:20:26.009841"
    },
    {
      "id": "mishpatim_p159",
      "text": "ועפי\"ז נראה לפרש דברי הילקוט (אות ג') יעור פקחים אלו פקחי הדעת שהן מטהרין ומטמאין מדעת עצמן, פירוש כי בעת שלקח שוחד מבע\"ד, הרי ישנו מי שתובע ממנו לשלם לו כגמולו, ולהטות הדין לזכותו, או דבת רבים שהוא ירא מהם מביאתו להטות משפט וכמ\"ש הרמ\"א ז\"ל בשו\"ע ח\"מ (סי' י\"ד ס\"ס א') בעשיר מוחזק ואלם בעירו מוציאים אותו לדון בעיר אחרת מחשש פן מיראת האלם ישתחד ולא יראה את האמת, נמצא שאינו מטה את הדין מעצמו אלא השפעת ולחץ משחדיו הוא המביאו להטות משפט, אמנם כאשר שואלים ממנו לומר על דבר טהור או טמא ואין בענין זה שום דבר המשחדו שלא יראה האמת, שהרי גם השואל חפץ לדעת ההלכה לאמתה, אעפ\"כ טחו עיניו מראות האמת ולא יוכל לכוון ההלכה, כי אם יאמר על טהור טמא ועל טמא טהור, וסמיות עינים זו היא העונש על אשר לקח שחד על נקי והטה דינו, על כן אף בעת שאין לו סבה להטות דין אין ביכלתו לדון דין אמת ואומר על טהור טמא ועל טמא טהור. וז\"ש הילקוט כי השחד יעור פקחים אלו פקחי הדעת שמטהרין ומטמאין מדעת עצמם פירוש אף כשהוא כבר חפשי לעצמו, ואין עליו השפעת המשחד או האלם, וביכלתו לדון דין אמת באין מוחה ומפריע, ענשו הוא שנסמו עיניו ויטהר את הטמא ויטמא את הטהור, יען אשר הלך אחר הבצע ולקח שוחד להטות משפט, פעל השחד בנפשו פעולה רעה, עד שברבות הימים נטרפת דעתו עליו, ומבלי כל סיבה משחדת לא יוכל להורות דין אמת",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 159,
      "char_length": 1165,
      "timestamp": "2025-02-06T19:20:26.357559"
    },
    {
      "id": "mishpatim_p160",
      "text": "ועפ\"י זה אפ\"ל מה שדקדק ק\"ז זלה\"ה ששנה הכתוב לשונו הכא להקדים תיבת שחד לאזהרת לא תקח, כי לפי מה שפרשנו בדברי הילקוט כוונת הכתוב כי השחד יעור פקחים הוא על העונש אשר עתיד לבא ברבות הימים על מקבלי שחד שיכהה מאור שכלם, ולא יוכלו ראות האמת בתורה הקדושה, ואף באין עליהם השפעת השחד לעוות משפט לא יוכלו להורות כהלכה, כי פעל השוחד בנפשם פעולה רעה, לכן הקדים הכתוב ואמר ''ושחד\" לא תקח להורות על הקנין הרע שהוא קונה בנפשו ע\"י לקיחת שחד, שאף כאשר אין עליו השפעה לסלף משפט אעפי\"כ השחד יעור פקחים, וכדאיתא בילקוט אלו פקחי הדעת שמטהרין ומטמאים מדעת עצמם, וכמ\"ש דאף בבא לפניו דיני טומאה וטהרה שאין הוא משוחד בו, ונפש השואל איוותה לדעת אמיתות ההלכה, אין בידו להורות דין אמת, כי נטרפה דעתו, ואור עיני שכלו גם הם אין אתו, לברר הלכה לאמתה של תורה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 160,
      "char_length": 726,
      "timestamp": "2025-02-06T19:20:26.944710"
    },
    {
      "id": "mishpatim_p161",
      "text": "ועפי\"ז נבא לביאור המדרש עה\"כ ויקרא משה להושע בן נון יהושע זש\"ה מי יתן טהור מטמא לא אחד, דהנה איתא במד\"ר (במדבר ט\"ז ו') שלח לך אנשים זש\"ה (ישעי' מ\"ד) לא ידעו ולא יבינו כי טח מראות עיניהם, מה ראה לומר אחר מעשה מרים שלח לך אנשים אלא שהיה צפוי לפני הקב\"ה שיאמרו לה\"ר על הארץ וכו', שאם בקשו לומר לה\"ר יהיו מסתכלין מה נעשה למרים, ואעפי\"כ לא רצו ללמד לכך נאמר לא ידעו ולא יבינו כי טח מראות עיניהם ע\"כ. והנה כל הענין פלא שהרי המרגלים היו נשיאי העדה מובחרים שבעם והיו קדושי עליון, ואיתא במדרש שם שנמלך משה בהקב\"ה על כאו\"א פלוני משבט פלוני וא\"ל ראוים הם ע\"כ, ואיך נהפכו כמו רגע להוציא דבה על הארץ ועשו כל הצרה וגרמו לאותו דור שילקה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 161,
      "char_length": 622,
      "timestamp": "2025-02-06T19:20:27.324660"
    },
    {
      "id": "mishpatim_p162",
      "text": "אמנם לדרכנו מובן כי באמת מבואר שהיה להם טעם בדבר כי לא רצו שיכנסו ישראל לארץ בחשבם שעדיין אין זכותם מספיק לכך, ואין להם די מצות ומע\"ט ברם כיון ששלחם משה אסור היה להם להרהר בדבר ולהסתפק בזה כלל, אמנם הם היו משוחדים ע\"י הטעמים שלהם ולא ראו את האמת, ואף לדברי האוה\"ח הקדוש כי לצד שתכונת המשלחים היתה רעה נכנסה בהם, כי שלוחו של אדם כמותו, עכ\"פ מאיזה סיבה היתה להם סמיות עינים, ולכך טחו עיניהם מראות האמת, וזה כונת המדרש שלח לך אנשים זש\"ה לא ידעו ולא יבינו וגו', בא לפרש איך יתכן אשר אנשים צדיקים נהפכו כקשת רמיה, וע\"ז בא כמשיב לא ידעו ולא יבינו כי טח מראות עיניהם. כי מחמת שהיו משוחדים היתה להם סמיות עינים ולא יכלו לכוון לאמת.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 162,
      "char_length": 623,
      "timestamp": "2025-02-06T19:20:27.642535"
    },
    {
      "id": "mishpatim_p163",
      "text": "וזהו כוונת המדרש ויקרא משה להושע בן נון יהושע זש\"ה מי יתן טהור מטמא וגו', וכמ\"ש א\"א הקדוי\"ט ז\"ל כי חשש מרע\"ה פן יתבטל יהושע כנגד המרגלים כי הם הרוב ובגודל ענותנותו יקשה בעיניו להתוכח עם רוב גדול כ\"כ, וגם במה שרואה אשר הרוב נגדו עלול הוא להשתחד על כן התפלל עליו י\"ה יושיעך מעצת מרגלים, שיעמוד איתן כנגדם, ולא ישתחד מדעתם, וזש\"ה מי יתן טהור מטמא לא אחד, בא לבאר כמה גדול כח השחד שיבא לידי כך שיאמר על טהור טמא, וכפירוש האריז\"ל, ולכן הוצרך להתפלל עליו שינצל משוחד.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 163,
      "char_length": 461,
      "timestamp": "2025-02-06T19:20:27.977810"
    },
    {
      "id": "mishpatim_p164",
      "text": "ועתה נבא לביאור המדרש המוצג בפתח דברינו א\"ל משה לישראל וכו', אם אין אתם עושים את הדינים נוטל תורתו מכם וכו'. בהקדם מה שכ' אבא מארי זללה\"ה בקדושת יו\"ט לבאר המדרש ואלה המשפטים וכו' זש\"ה מגיד דבריו ליעקב וגו' לא עשה כן לכל גוי (עיין להלן הבאנו דבריו באריכות) עפ\"י מ\"ש הר\"ן בדרשותיו לפרש מטבע הברכה בבה\"ת אשר בחר בנו מכל העמים ונתן לנו את תורתו, כי השי\"ת מסר לבנ\"י כח ההכרעה לפסוק הלכה, וכן לחדש ולהוסיף גדרים וסייגים, וכל מה שהם מוסיפים נקרא תורה, וכ\"פ התולדות מאמר הכתוב (דברים ד') ומי גוי גדול אשר לו חקים ומשפטים צדיקים ככל התורה הזאת וגו', שכל מה שהצדיקים מוסיפים גדרים וסייגים וחקים ומשפטים דינו ממש ככל התורה הזאת. וכן אמרו (שמו\"ר פכ\"ט) כל מה שתלמיד ותיק עתיד לחדש נאמרה למשה מסיני, וז\"פ המדרש ואלה מוסיף על הראשונים, מה ראשונים מסיני, אף אלו דהיינו הגדרים והסייגים שמוסיפים חכמי דור ודור מסיני. וזה כוונת המדרש זש\"ה מגיד דבריו ליעקב וגו' כי כח זה להוסיף ולחדש גדרים וסייגים בתורה הוא רק בישראל, אבל לא עשה כן לכל גוי שאין בידם להוסיף ולחדש במצות שנצטוו עליהם, זת\"ד הקדושים ז\"ל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 164,
      "char_length": 981,
      "timestamp": "2025-02-06T19:20:28.234491"
    },
    {
      "id": "mishpatim_p165",
      "text": "ולדרכנו יש להוסיף נופך בפירוש נוסח הברכה אשר בחר בנו וכו' ונתן לנו את תורתו, דאי' בגמ' (ע\"ז י\"ט ע\"א) ואמר רבא בתחלה נקראת (התורה) על שמו של הקב\"ה ולבסוף נקראת על שמו (פירש\"י של אותו תלמיד שטרח בה דכתיב ובתורתו דמשמע של כל אדם) שנא' כי אם בתורת ה' חפצו ובתורתו יהגה יומם ולילה (תהלים א') עכ\"ד הגמ'. וזה פירוש אשר בחר בנו מכל העמים ונתן לנו את תורתו דהיינו שנתן לנו את התורה במתנה, שמתורת ה' יעשה ובתורתו, דהיינו תורתינו שתקרא על שמנו ויהי' לנו כח להוסיף בה גדרים וסייגים, אמנם כח זה נמסר רק למי דעתו דעת אמת, ולא כהו עיניו בקבלת שחד, אבל אם הוא משוחד, נוטל הקב\"ה כח זה ממנו, ואין התורה נקראת מסורה בידיו לחדש בה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 165,
      "char_length": 611,
      "timestamp": "2025-02-06T19:20:28.782768"
    },
    {
      "id": "mishpatim_p166",
      "text": "ופירשנו בזה מאמר הגמרא (שבת קל\"ח ע\"ב) עתידה תורה שתשתכח מישראל שנא' (עמוס ח') ישוטטו לבקש את דבר ה' ולא ימצאו דבר ה' זו הלכה וכו' רשב\"י אומר ח\"ו שתשתכח תורה מישראל שנא' (דברים ל\"א) כי לא תשכח מפי זרעו אלא מה אני מקיים ישוטטו לבקש את דבר ה' ולא ימצאו הלכה ברורה במקום אחד ע\"כ. ולכאורה הרי זו היא ג\"כ שכחת התורה שלא ידעו הלכה ברורה, וגם צ\"ב והלא גם בדורות הקודמים היו מחלוקות בין החכמים ההלכה נפסקה לפי הכללים המסורים בידינו להכריע הלכה כדברי מי, כגון אחרי רבים להטות וכדומה, אולם נראה כי כח זה לדעת איך להכריע הלכה ינטל, שהרי אין מצטרף לרוב אלא מי שאין לו נגיעות ודעתו לשמים, וע\"כ לא יוכלו לפסוק הלכה כי לא ידעו מי ראוי לצרפו לרוב וזה פירוש שלא ימצאו הלכה ברורה במקום אחד, עפ\"י מה שכ' הרמב\"ן סברא נפלאה (חידושי הרמב\"ן עירובין י\"ז) לבאר טעם עירובי תחומין שמועיל אף למ\"ד תחומין דאורייתא שאמרו חז\"ל כי טבע האדם להמשך אחרי סעודתו וכיון שהניח עירוב בסוף אלפיים אמה ושם היא סעודתו גם מחשבתו שם ובמקום שמחשבת האדם נמצאת הוי כאלו גם גופו שם, ע\"כ מועיל הערוב.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 166,
      "char_length": 949,
      "timestamp": "2025-02-06T19:20:29.105754"
    },
    {
      "id": "mishpatim_p167",
      "text": "ואפ\"ל שזאת טמנו חז\"ל הקדושים ברמז במתק לשונם באמרם שלא ימצאו הלכה ברורה במקום אחד\" כלומר שלא יוכלו לקבוע הלכה ברורה, לפי שיש לחוש פן יש בין החולקים אנשים שאינם ראויים לצירוף. מטעם שאינם ''במקום אחד\" אלא מחשבתם משוחדת מנגיעה צדדית ומושכים מזה אחד ומזה, ובמקום שמחשבתם משוטטת גם גופם כאלו גריר אבתריה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 167,
      "char_length": 299,
      "timestamp": "2025-02-06T19:20:29.552054"
    },
    {
      "id": "mishpatim_p168",
      "text": "או יאמר לפרש המדרש ואלה המשפטים וגו' הה\"ד (תהלים צ\"ט) ועוז מלך משפט אהב וגו' א\"ל משה לישראל וכו' אם אין אתם עושים את הדינים נועל תורתו מכם למה שלא נתן לכם הקב\"ה את התורה אלא על מנת שתעשו את הדינים, ע\"כ. והוא פלא איך יתכן לומר שיטול הקב\"ה את התורה מישראל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 168,
      "char_length": 254,
      "timestamp": "2025-02-06T19:20:29.724286"
    },
    {
      "id": "mishpatim_p169",
      "text": "ונ\"ל בהקדם דברי המדרש ילקוט פ' במדבר (רמז תרפ\"ד) בשעה שקבלו ישראל את התורה נתקנאו בהם אומות העולם מה ראו להתקרב יותר מן האומות סתם פיהם הקדוש ברוך הוא אמר להם הביאו לי ספר יוחסין שלכם וכו' כשם שבני מביאין וכו' ע\"כ. ופרשנו על פי דברי אאמו\"ר הקדושת יום טוב זלה\"ה לפרש ואלה המשפטים הה\"ד מגיד דבריו ליעקב וגו' לא עשה כן לכל גוי ומשפטים בל ידעום, וגם לבאר דברי רש\"י ז\"ל ואלה מוסיף על הראשונים מה הראשונים מסיני אף אלו מסיני, ופירש דהנה מודעת זאת כי התורה נתנה רשות לעיני העדה הצדיקים שבכל דור ודור לעשות ולהוסיף גדרים וסייגים הן עפ\"י השכל והן נגד השכל, כמאמרם ז''ל (ספרי פ' שופטים) עה\"פ לא תסור מן הדבר אשר יגידו לך ימין ושמאל אפי' יאמרו לך על ימין שמאל אתה מצוה לשמוע לו, והטעם כי הקב\"ה הראה למשה בסיני כל מה שתלמיד ותיק עתיד לחדש (שמו\"ר פכ\"ט) נמצא כי כל דבריהם נתנו בסיני בקולות וברקים כמו תורה שבכתב, ואין חילוק ביניהם. והנה זה הענין שניתן רשות לדרוש ולהוסיף בתורה כפי שכלם ולהוסיף גדרים וסייגים כפי העת והזמן לא מצינו אלא בישראל, אבל בעכו\"ם אף בשבע מצות שלהם, לא מצינו שיהיה להם רשות להוסיף ולדרוש ולחדש בהם, ובזה נבין היטב דברי רש\"י ז\"ל ואלה מוסיף על הראשונים. ר\"ל מה שהחכמים שבכל דור ודור מוסיפים גדרים וסייגים על הראשונים, תשים לפניהם פירש\"י ולא לפני עכו\"ם, כי העכו\"ם אין להם כח להוסיף דבר קטן וגדול על מצות שניתנו להם ומה הראשונים, ר\"ל תורה שבכתב מסיני, וניתנה בקולות וברקים, אף אלו מסיני בקולות וברקים, ועפי\"ז יובנו דברי המדרש ואלה המשפטים אשר תשים לפניהם כלומר שנתנו להם המשפטים להוסיף עליהם כנ\"ל, הה\"ד מגיד דבריו ליעקב וגו' שנתנה התורה לישראל בידם וברשותם לדרוש ולחדש כפי השגתם, אבל לא עשה כן לכל גוי ומשפטים בל ידעום שאין בידם כח זה, עכ\"ד הקדושת יו\"ט זי\"ע.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 169,
      "char_length": 1563,
      "timestamp": "2025-02-06T19:20:29.881961"
    },
    {
      "id": "mishpatim_p170",
      "text": "ועפי\"ז י\"ל כי זאת היתה טענת האומות מה ראה להתקרב יותר מן האומות, שנתן הקב\"ה כח זה בידם לדרוש ולהוסיף גדרים וסייגים. מה שלא עשה כן לכל גוי, ואף שהחזיר הקב\"ה את התורה על כל אומה ולשון, מ\"מ כח זה שיהיה להם רשות להוסיף בתוה\"ק, לא היה ניתן להם אף אילו היו מקבלים את התורה, מיד סתם הקב\"ה את פיהם וכו' הביאו לי ספר יוחסין שלכם וכו' כי אי אפשר לחדש ולהוסיף גדרים וסייגים ולכוון בהם אל האמת כי אם מי שיש עליו השראת השכינה, וכמו שדרשו ז\"ל (סנהדרין צ\"ג ע\"ב) עה\"פ (שמואל א' ט\"ז) וה' עמו, שהלכה כמותו בכל מקום, ופירושו כיון שה' עמו שהשכינה שורה עליו מכוון הוא לאמתה של תורה והלכה כמותו בכל מקום, והנה אי אפשר לבא להשראת השכינה אלא ע\"י יחוס, כאמרם ז\"ל (קידושין ע' ע\"ב) אין השכינה שורה אלא על משפחות המיוחסות שבישראל, ובזאת סכר הקב\"ה פי האומות, באמור להם הביאו לי ספר יוחסין שלכם כדרך שמביאין בני וכיון שאין לכם חייס אי אפשר שתהי' עליכם השראת השכינה, ועל כן לא נתנה לכם מדה זו לחדש ולהוסיף גדרים וסייגים בתורה, כי אין ביכולתכם לכוון לאמיתה של תורה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 170,
      "char_length": 933,
      "timestamp": "2025-02-06T19:20:30.593450"
    },
    {
      "id": "mishpatim_p171",
      "text": "ולדרך זה יובנו דברי המדרש הנ\"ל בהקדם מה דאיתא בגמ' (סנהדרין ז' ע\"א) אמר ר' שמואל בר נחמני אמר ר' יונתן כל דיין שדן דין אמת לאמתו משרה שכינה בישראל שנאמר (תהלים פ\"ב) אלקים נצב בעדת אל וגו' וכל דיין שאינו דן דין אמת לאמתו גורם לשכינה שתסתלק מישראל שנא' (תהלים י\"ב) משוד עניים מאנקת אביונים עתה אקום יאמר ה' עכ\"ל הגמרא. וזאת אפ\"ל בכוונת המדרש כי במאמר ואלה המשפטים רמוזים הגדרים והסייגים שנתנה תורה רשות לחכמי העדה להוסיף בכל דור, כמ\"ש הקדוי\"ט זי\"ע, לפרש ואלה מוסיף על הראשונים, וע\"כ כתב המדרש אמר הקב\"ה אם אין אתם עושים את הדינים: ר\"ל שאין דנים דין אמת לאמתו, ודין גרמא שמסתלקת השכינה מישראל, ובהעדר השראת השכינה מקרב ישראל א\"א לכוון אל האמת, וז\"כ אומרו נוטל תורתו מכם כלומר שנוטל ממכם כח זה שתוכלו לחדש ולהוסיף גדרים וסייגים בתוה\"ק, שע\"י כך נקראת התורה שלנו, כמ\"ש הר\"ן בדרשותיו על שאומרים בנוסח ברכת התורה ונתן ''לנו\" את תורתו, דהיינו שנתן לנו את התורה בידנו וברשותינו לדרוש ולהוסיף בה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 171,
      "char_length": 885,
      "timestamp": "2025-02-06T19:20:31.044987"
    },
    {
      "id": "mishpatim_p172",
      "text": "ואלה המשפטים אשר תשים לפניהם. פירש\"י ז\"ל כל מקום שנאמר אלה פוסל את הראשונים ואלה מוסיף על הראשונים מה הראשונים מסיני אף אלו מסיני. הקשו המפרשים ז\"ל דלימוד זה לא איצטריך אלא לר' ישמעאל דסבר בפרק בתרא דזבחים (קט\"ו ע\"ב) כללות נאמרו בסיני ופרטות באוהל מועד, ע\"כ איצטריך ואלה שנשתנו המשפטים משאר מצוות, שאף פרעיה נאמרו בסיני, אבל לדעת ר\"ע שם כי כל המצות נאמרו פרטיהן וכללותיהן בסיני, לא איצטריך ואלה לרבות שהמשפטים נאמרו בסיני כללותיהן ופרטותיהן, וא\"כ דברי רש\"י נראים כסתרי אהדדי כי בפ' בהר כ' כר\"ע, מה שמעה נאמרו כללותיה ודקדוקיה בהר סיני אף כולן נאמרו כללותיהן ודקדוקיהן מסיני וכאן כ' כר' ישמעאל ואלה מוסיף על הראשונים מה ראשונים מסיני אף אלו מסיני, ועיין באור החיים הקדוש כאן.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 172,
      "char_length": 674,
      "timestamp": "2025-02-06T19:20:31.466904"
    },
    {
      "id": "mishpatim_p173",
      "text": "ב) בזה\"ק (ח\"ב צ\"ד ע\"א) איתא פתח ר' שמעון ואמר ואלה המשפטים אשר תשים לפניהם וכו' אלין אינון סידורין דגלגולא וכו' ע\"ש והוא פלא.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 173,
      "char_length": 125,
      "timestamp": "2025-02-06T19:20:31.791629"
    },
    {
      "id": "mishpatim_p174",
      "text": "ונל\"\"פ הענין עפימ\"ש בספר הק' דגל מחנה אפרים לבאר דברי הזה\"ק הנ\"ל כי יזדמן בעת אשר יתיצבו האנשים אשר להם הריב לפני השופט ונפסק בבית דין לחייב אחד מהם והוא יודע בנפשו אשר הוא זכאי בדינו, אל יתחמץ לבבו ולא ירע בעיניו לאמר הן תורתנו הקדושה היא תורת אמת דרכיה דרכי נועם וכל נתיבותיה שלום, ואיך נהייתה כזאת שתצא המכשלה מתחת ידי הב\"ד לחייב את הזכאי ולזכות את החייב עפ\"י דין תורה, כי בודאי היה הוא חייב ממון לבעל דינו בגלגול הקודם ולא פרעו, ומאת ה' היתה זאת שיעמדו שניהם לדין בגלגול זה ויצא הוא חייב בדינו. וזה פירוש הזה\"ק ואלה המשפטים וכו' אלין אינון סידורא דגלגולא כי דיני ממונות שבתורה הקרווים משפטים נחתכים עפ\"י הגלגולים הקודמים כי כך מנהיג הקב\"ה את עולמו שאף אם בדין זה היה מן הראוי שיצא בדימוס, מ\"מ אם נתחייב לחבירו בגלגול הקודם יצא דינו לחובה, אלו תוכן דבריו הקדושים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 174,
      "char_length": 766,
      "timestamp": "2025-02-06T19:20:31.888388"
    },
    {
      "id": "mishpatim_p175",
      "text": "ועפי\"ז פירשנו את הפסוק (תהלים יט) משפטי ה' אמת צדקו יחדיו, כי אם יראה האדם רק את אשר לפניו באותו הדור, יחשוב לפעמים כי משפט דיני ממונות שבתורה הם היפך האמת, אמנם אימת יוכל להבין אשר משפטי ה' אמת ואין בהם נפתל ועיקש צדקו יחדיו, אם רואה כל מעשי הדורות הקודמים יחדיו מעשה איש ופעולתו בגלגולים הקודמים, אז יבין דבר לאשורו כי דיני הממונות שבתורה הם אמת וצדק.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 175,
      "char_length": 353,
      "timestamp": "2025-02-06T19:20:32.275448"
    },
    {
      "id": "mishpatim_p176",
      "text": "אמנם עוד יש לאלוה מלין לפרש דברי הזה\"ק בהקדם דברי כ\"ק אבא מארי זללה\"ה בסה\"ק קדושת יו\"ט לישב מה שדקדקו דכתיב אשר תשים לפניהם ולא כתיב אשר תלמדם, וביאר עפ\"י דברי הגאון הר\"ר העשיל זצלל\"ה לפרש המדרש מנין שאמירה לעכו\"ם שבות שנאמר (ויקרא י\"ט) את שבתותי תשמורו, דהנה הקב\"ה ברא את העולם בדבור ולא במעשה כמאה\"כ (תהלים ל\"ג) בדבר ה' שמים נעשו וגו', נמצא כי כששבת ונח בשביעי היתה אצלו יתברך שביתה מדיבור, וזאת כונת המדרש מנין לאמירה לעכו\"ם שבות כי צריך לשבות גם מדיבור שנא' את שבתותי תשמורו, דהיינו שתשמרו את השבת כמו ששבתתי אני, מה שביתת הקב\"ה היתה מדיבור, אף ישראל מצווים לשבות מדיבור חול, וכן דרשו בגמ' (שבת קי\"ג ע\"ב) ודבר דבר (ישעיה נ\"ח) שלא יהא דבורך של שבת כדבורך של חול, עכ\"ד הגאון הר\"ר העשיל זצלה\"ה. וכעין זה מבואר גם בדברי האר\"י הקדוש. היוצא לנו מזה הוא עד כמה גדול כח הדבור של איש ישראל שנחשב כמעשה, ומתנה זאת נתן לנו הקב\"ה מגודל אהבתו והחבה היתירה הנודעת לנו ממנו יתברך, שבכח הדבור נוכל לפעול פעולות רמות ולהשפיע ישועות וטובות מרובות, וזה פירוש הפ' ואלה המשפטים אשר תשים לפניהם אף שצוהו הקב\"ה רק ללמדם כנהו הכתוב בלשון שימה כי לימוד המשפטים נחשב לנו כמעשה, וכל דיבור עושה רושם למעלה, ועפי\"ז יתבאר המדרש ואלה המשפטים וכו' הה\"ד מגיד דבריו ליעקב וגו' כיון שממקרא זה מוכח שדיבור נחשב כמעשה מדכתיב אשר תשים לפניהם, בא המדרש ללמדנו כי כח זה אינו אלא בישראל אבל לאומות לא ניתן כח זה שיחשב דבורם כמעשה, וז\"פ הפסוק מגיד דבריו ליעקב וכו' שהשי\"ת מסר לישראל כח זה שיהיה דבורם כמעשה בחי' דבריו של הקב\"ה שברא בו את העולם, לא עשה כן לכל גוי כי אצל האומות אין נחשב הדבור כמעשה ופטפוטי מילי בעלמא הוא זה תוכן דברי הקדוי\"ט זצללה\"ה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 176,
      "char_length": 1512,
      "timestamp": "2025-02-06T19:20:32.465357"
    },
    {
      "id": "mishpatim_p177",
      "text": "ונראה להוסיף נופך לדבריו ז\"ל דלכאורה למה רמזה לנו התוה\"ק שדיבור נחשב לישראל כמעשה דייקא במשפטים ולא בשאר מצות, ונראה בהקדם דברי הבית שמואל אחרון (הובא בישמח משה פ' שמות דף קכ\"א ע\"ג) לפרש הגמ' (שבת ל\"א ע\"א) באחד שבא לפני שמאי ואמר גיירינו ע\"מ שתלמדני כל התורה כולה כשאני עומד על רגל אחד וכו' בא לפני הלל גייריה וא\"ל כל מה דעלך סני לחברך לא תעביד זו הוא כל התורה כולה ואידך פירושא היא זיל גמור. והדקדוקים ידועים גם מה ראה הגר לשטות זה לומר שילמדנו כל התורה כולה כשהוא עומד על רגל אחד, ופי' דאיתא בספרים כי כל אחד מישראל צריך לקיים כל התרי\"ג מצות, וצריך להתגלגל עד שיקיים כולן, והנה הגר הזה רצה להתגייר רק באופן שלא יצטרך להתגלגל שוב, ורגל הוא לשון פעם כמו שלש רגלים (במדבר כ\"ב) וזהו אמרו גיירני ע\"מ שתלמדני כל התורה כשאני עומד על רגל אחד, שאוכל לקיים בפעם אחת כל המצות ולא אבוא בגלגול עוד, והשיב לו הלל דעלך סני לחברך לא תעביד, כי איתא בספרים דמי שמקשר עצמו עם כל א' מישראל בנפשו הרי נחשב כגוף אחד עם כל ישראל וכל מה שמקיים א' מישראל כאלו קיים הוא, נמצא כי אף מצות שלא יכול לקיימם בפועל כגון יבום וחליצה ומצוות כהנים, כיון שיש בקרב ישראל המקיימים מצות אלו נחשב כאלו קיימם. ומה שא\"ל ואידך פירושא היא זיל גמור הביא ביש\"מ שם מס' סמא דחייא בשם החסיד מו\"ה אברהם הכהן ז\"ל לפרש דהנה יש תקנה אחרת לקיים כל התרי\"ג מצות בגלגול אחד ע\"י לימוד התורה, וכמו שאמרו ז\"ל (מד\"ר פ' צו) כל העוסק בתורת עולה כאלו הקריב עולה וכן כל המצות שאין בידו לקיימם בפועל יעסוק בתורה בהלכה של אותה המצוה ונחשב לו כאלו קיימה בפועל וזה פירוש הגמ' ואידך פירושא היא עוד דרך יש לך לקיים כל המצות בגלגול אחד זיל גמור שתעסוק בהלכות המצוה ונחשב לך כאלו קיימת המצוה בפועל עכת\"ד ז\"ל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 177,
      "char_length": 1537,
      "timestamp": "2025-02-06T19:20:33.172089"
    },
    {
      "id": "mishpatim_p178",
      "text": "והנה פירשנו מאמר הכתוב (הושע יד) שובה ישראל עד ד' אלקיך וגו' אמרו אליו כל תשא עון וקח טוב ונשלמה פרים שפתינו. ולכאורה צ\"ב כיון שיעשו ישראל תשובה שלמה והקב\"ה ימחול כל עוונתיהם כאמרו כל תשא עון ויעשו אך הטוב והישר בעיני ה' הרי מיד תהיה הגאולה השלמה וכמ\"ש הרמב\"ם (הלכות תשובה פ\"ז הלכה ה') אין ישראל נגאלין אלא בתשובה, וכבר הבטיחה תורה שסוף ישראל לעשות תשובה בסוף גלותן ומיד הן נגאלין (ועי' מה שכתבנו בספר ויוא\"מ מאמר שלש שבועות סי' מ') ויבנה בית המקדש ויקריבו קרבנות בפועל, ולמה יצטרכו לשלם פרים שפתותם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 178,
      "char_length": 500,
      "timestamp": "2025-02-06T19:20:33.979590"
    },
    {
      "id": "mishpatim_p179",
      "text": "ופירשנו עפ\"י מה שכ' היפה תואר על מה דאיתא במדרש (ויקרא רבה פ\"ט ז' ותנחומא פ' אמור י\"ט) כל הקרבנות בטלין לעתיד לבא חוץ מן התודה, שאין הכוונה שתהיה ח\"ו השתנות במצות התורה, אלא כיון שהקרבנות באים לכפר על אשר יחטא האדם ולעתיד תמלא הארץ דעה את ה' ויטו כולם שכם אחד לעבדו ולא יחטאו עוד ממילא יבטלו הקרבנות הבאים על חטא, חוץ מקרבן תודה שאינו בא לכפר על חטא עכ\"ד. ולכאורה הרי הקרבנות הם בכלל התרי\"ג מצוות ההכרחיים לשלמות האדם, ואיך יקיימו מצות אלו לעתיד, ועל כרחך לומר שיעסקו בתורת חטאת ויחשב להם כאלו הקריבו חטאת, וכן כולם כאשר אנחנו עושים בזמן שחרב בית המקדש ואין לנו מזבח להקריב ולא כהן שיכפר בעדינו שנחשב לנו העסק בהלכות הקרבנות כהקרבה בפועל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 179,
      "char_length": 638,
      "timestamp": "2025-02-06T19:20:34.240039"
    },
    {
      "id": "mishpatim_p180",
      "text": "וזה פירוש הפסוק אמרו אליו כל תשא עון שהקב\"ה ישא לכל חטאות בני ישראל, וקח טוב שיעשו הטוב והישר לפניו, ומיד תהיה הגאולה השלמה, ולא יוכלו לקיים מצות הקרבנות בפועל, כי רוח הטומאה יעביר מן הארץ ולא יחטאו עוד, וע\"כ ונשלמה פרים שפתינו שילמדו דיני הקרבנות ויחשב להם כאלו הקריבו אותם בפועל, ושפיר יוכלו לקיים כל התרי\"ג מצות. ובזה פירשנו הפסוק (תהלים צ\"ד) אשרי הגבר אשר תיסרנו יה ומתורתך תלמדנו, פי' אימתי טובים הם היסורין ואשרי הגבר הזוכה להם, בזמן שמתורתך תלמדנו שלומד בתוה\"ק את פרשיות היסורין ונחשב לו כאלו באו עליו בפועל, כי דבור הוא כמעשה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 180,
      "char_length": 534,
      "timestamp": "2025-02-06T19:20:34.546661"
    },
    {
      "id": "mishpatim_p181",
      "text": "והנה תחלת פרשת משפטים היא דיני עבד עברי, שלא יכלו לקיימה בפועל בשעה שעמדו על הר סיני כי עבד עברי יכול להיות רק ע\"י חטא, וכמו שאמרו ז\"ל (קידושין כ\"ב ע\"ב) אוזן ששמעה על הר סיני כי לי בני ישראל עבדים וכו' ולא עבדים לעבדים והלך זה וקנה אדון לעצמו ירצע, ובשעה שעמדו על הר סיני פסקה זוהמתן ולא היה בהם יצה\"ר כלל, וכן כמה מצות האמורות בפ' זו לא היו שייכות אז בפועל, וע\"כ לומר שנאמרו להם אז כדי שיקיימו אותם בבחינת ונשלמה פרים שפתינו שיעסקו בדיני המצוה ויחשב להם כאלו קיימוה בפועל, והשתא מובן שפיר למה מודיענו הכתוב באמרו אשר תשים לפניהם שדיבור כמעשה דוקא במצוה זו כי כאן מקומו להודיענו שאף שלא היה בידם לקיים מצות עבד עברי בפועל, יעסקו בדיניה ויחשב להם הדבור כמעשה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 181,
      "char_length": 658,
      "timestamp": "2025-02-06T19:20:34.808136"
    },
    {
      "id": "mishpatim_p182",
      "text": "והשתא יובנו היטב דברי הזה\"ק ואלה המשפטים וגו' ואלין סדורא דגלגולא, כי באמרו אשר תשים לפניהם גלה לנו הכתוב שדבור נחשב אצל ישראל כמעשה, ואף המצות שלא יוכלו לקיים בפועל ממש יחשב ניב שפתותיהם כמעשה ממש, וא\"כ יש תקנה להנצל מעונש הגלגול, כי כל המצוות שלא יוכלו לקיימם יעסקו במשפטי המצוה ויחשב להם כעשיה, ונמצא כי יכול האדם לקיים כל התרי\"ג מצות בגלגול אחד. ויובנו גם דברי רש\"י ז\"ל ואלה מוסיף על הראשונים וכו', כי להודיענו בא שדבר זה שיחשב לישראל דבור כמעשה ג\"כ ניתן בסיני, וה\"פ מה הראשונים מסיני אף אלו מסיני, היינו זאת שהלימוד יחשב כעשיה ממש, נתן לנו הקב\"ה בסיני מחמת גודל אהבתו וחבתו אלינו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 182,
      "char_length": 585,
      "timestamp": "2025-02-06T19:20:35.125106"
    },
    {
      "id": "mishpatim_p183",
      "text": "ואלה המשפטים אשר תשים לפניהם. בזוה\"ק ר\"פ משפטים (דף צ\"ד ע\"א) איתא פתח ר' שמעון ואמר ואלה המשפטים אשר תשים לפניהם תרגום ואילין דיניא דתסדר קדמיהון אלין אינון סידורין דגלגולא דינין דנשמתין דאתדנו כל חד וחד לקבל עונשיה, עכ\"ל הק'. וצ\"ב מה שייכי עניני הגלגולים לפרשה זו דמיירי בעניני המשפטים שבין אדם לחבירו, ואם להודיענו כי עונש מי שאינו משמר את הדין הוא לחזור אל העולם בגלגול, הרי זה שייך גם בעובר על שאר מצות התוה\"ק ולא רק במשפטים, ולמה השמיענו הזה\"ק עונש הגלגול במשפטים דייקא.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 183,
      "char_length": 475,
      "timestamp": "2025-02-06T19:20:35.415955"
    },
    {
      "id": "mishpatim_p184",
      "text": "ב) וכי ימכור איש את בתו לאמה לא תצא כצאת העבדים במסורה ג' כצאת, לא תצא כצאת העבדים והיה כצאת משה את האהל, כצאת השמש בגבורתו וצ\"ב.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 184,
      "char_length": 129,
      "timestamp": "2025-02-06T19:20:35.652781"
    },
    {
      "id": "mishpatim_p185",
      "text": "ונ\"ל עפ\"י מה דאיתא בזה\"ק ובמדרשי חז\"ל כי פרשת עבד עברי רומזת על ענין הגלות והגאולה וז\"ל הזה\"ק (ח\"ב דף צ\"ו ע\"ב) וכי ימכור איש דא קב\"ה, את בתו אילין ישראל, ואיתימא דיפקון כגוונא דאילין וכו' דנפקו במנוסה ממצרים, לא תצא כצאת העבדים הה\"ד (ישעיה מ\"ב) כי לא בחפזון תצאו ובמנוסה לא תלכון וגו' עכ\"ל הק'. וכן במד\"ר פרשה זו דורש פ' עבד עברי על זמן הגאולה העתידה עיי\"ש (פ\"ל כ\"ב) וכ\"ה בילקוט (צפני' רמז תקס\"ז) עה\"פ בעת ההיא אחפש את ירושלים בנרות (צפניה א) א\"ר אחא וכו' אחפש אמר הקב\"ה מוציא אני אותה לחרות כשם שהכתבתי בתורה וכי יכה איש את עין עבדו וגו' ושחתה לחפשי ישלחנו תחת עינו ואני הכיתי את שני עיניהם של בני שנא' כי נסך ה' עליהם רוח תרדמה ויעצם את עיניהם אינו בדין שיצאו לחפשי עכ\"ל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 185,
      "char_length": 673,
      "timestamp": "2025-02-06T19:20:35.759674"
    },
    {
      "id": "mishpatim_p186",
      "text": "והנה אופן הגאולה תלוי במעמד ומצב בני ישראל באותו הדור, וכאמרם ז\"ל (סנהדרין צ\"ח ע\"א) וא\"ר יוחנן אין בן דוד בא אלא בדור שכולו זכאי או כולו חייב, וכתבו הספרים הקדושים כי הכוונה שאפילו אם יהיה הדור כולו חייב ולא יהיו ראוים לגאולה מ\"מ בהגיע עת קץ הגאולה שגזר הבורא בהכרח הוא שתבא אלא שאם יהיה הדור זכאי ימהר ויחיש הקב\"ה את הקץ כאומרם ז\"ל (שם) זכו אחישנה לא זכו בעתה. והנה אם היו ישראל זוכים שתהיה הגאולה בדור שכולו זכאי אזי בשובה ונחת יושעון, וקלים יהיו חבלי משיח, אבל אם אינם זוכים והגאולה תהי' בבחינת כולו חייב, אזי היציאה מן הגלות הוא ע\"י חבלי משיח הקשים, כעבדים כנענים היוצאים בשן ועין כדאי' במדרש ילקוט הנ\"ל, ואף שגם אם תהיה הגאולה בדור שכולו חייב יעשו ישראל תשובה קודם ביאת המשיח וכמ\"ש הרמב\"ם ז\"ל בהלכות תשובה (פ\"ז הלכה ה') אין ישראל נגאלין אלא בתשובה, וכבר הבטיחה תורה שסוף ישראל לעשות תשובה בסוף גלותן ומיד הן נגאלין וכו' עכ\"ל. (ועי' בספרי ויואל משה סי' מ' מ\"א מה שכתבנו בזה) מ\"מ תשובה זו תהיה רק בבחינת תשובה תתאה, ולא די בתשובה כזו לרחוץ וללבן כתמי הנפש, כי לא בניקל כ\"כ למחוק רושם החטאים הנחקקים בנפש האדם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 186,
      "char_length": 1012,
      "timestamp": "2025-02-06T19:20:36.115692"
    },
    {
      "id": "mishpatim_p187",
      "text": "ועפ\"י זה י\"ל בדברי הכתוב לא תצא כצאת העבדים בהקדם עוד מה שכתב הזה\"ק להלן בפ' זו (דף צ\"ו ע\"ב) וכי ימכור איש דא קב\"ה, את בתו דא נשמתא קדישא, לאמה למיהוי אמה משתעבדא בינייכו בהאי עלמא, במטו מינייכו בשעתא דמטו זמנא לנפקא מהאי עלמא, לא תצא כצאת העבדים, לא תפוק מטנפא בחובין, עכ\"ל. וכמו כן אנו נאמר לדרך הראשון שכתב הזה\"ק לפרש האי פרשתא על היציאה מן הגלות, בא הכתוב להזהיר את כנסת ישראל, לא תצא כצאת העבדים, שלא יצאו מן הגלות מלוכלכים בעוונות, ומרומז בזה גם החטא הידוע, אשר הוא הזוהמה הגדולה ביותר הנדבקת לנשמת האדם, והוא הוא המעכב גאולתינו ופדות נפשנו, וז\"פ הכתוב לא תצא כצאת העבדים הפרוצים בזנות וידוע שחטא זה הוא ענף מג\"ע.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 187,
      "char_length": 619,
      "timestamp": "2025-02-06T19:20:36.601884"
    },
    {
      "id": "mishpatim_p188",
      "text": "והנה איתא בכתבי האריז\"ל כי טרם ביאת המשיח, יחזרו להתגלגל בעולם כל הנשמות שהיו כבר בעולם בדורות הקודמים, ולא מצאו תיקונם עדיין כי קודם הגאולה הוא זמן הבירור האחרון: ובהכרח הוא שיתוקנו כל הנשמות, ויתבררו ויתלבנו למרק עוונותיהם מכל הגלגולים, והם הם חבלי משיח הקשים כי חייב כל אחד לסבול תמורת מה שחטא גם בגלגולים הקודמים, עד שתתלבן נשמתו, אמנם אילו לא היו חוטאים בגלגול זה, היו יכולים להעשות כל אלו התיקונים ע\"י תשובה ומעשים טובים, כי יש דרך ישר לפני איש לתקן פגמיו ע\"י מע\"ט, ללא יסורים, וכיון שלא זכו. והוסיפו עון על עונם, עליהם לסבול חבלי משיח, וכמ\"ש האריז\"ל על הא דאיתא בגמרא (סנהדרין כ\"ז ע\"ב) דרמינן קראי אהדדי דכתיב לא יומתו אבות על בנים איש בחטאו יומתו והכתיב פוקד עון אבות על בנים ומשני התם בשאוחזין מעשה אבותיהם בידיהם. ופירש הוא ז\"ל כי כאשר בא האדם כמה פעמים בגלגול קרויים הגלגולים הראשונים אב, וז\"פ כשאוחזין מעשה אבותיהם בידיהם, שעדיין הוא מתנהג בדרכים העקלקלות שהלך בהם בגלגוליו הקודמים, אזי פוקדים עליו גם עוונות אבותיו היינו חטאיו שבגלגולים הקודמים. וזה אפ\"ל בדברי הזה\"ק ואלין אינון סדורין דגלגולא, כי לפי שפרשה זו רומזת על זמן היציאה מן הגלות, בא לרמז לנו אלין אינון סדורין דגלגולא, כי טרם בוא הגאולה, בהכרח הוא שיתגלגלו ויבאו על תיקונן כל הנשמות הנדחות.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 188,
      "char_length": 1164,
      "timestamp": "2025-02-06T19:20:36.929211"
    },
    {
      "id": "mishpatim_p189",
      "text": "והנה בזה\"ק פתח דבריו בדברי התרגום ואלין דיניא די תסדר קדמיהון. ובזה אפ\"ל מה שאמר כ\"ק אבא מארי זלה\"ה בשנתו האחרונה (היא שנת תרס\"ד) בשבת האחרונה לפני הסתלקותו שהיה שב\"ק פ' משפטים, ואמר בליל שב\"ק דברי התרגום ואלין דיניא די תסדר קדמיהון, ודקדק בדברי התרגום ואמר ואילין דיניא די ''תסדר\" שהדינים של תרס\"ד יהיו קדמיהון, ע\"כ דבריו הקדושים. ולא יכולנו לשאלו מה פירוש דבריו. אבל עכ\"פ רימז על כך באמרו שהדינים של תרס\"ד יהיו קדמיהון אבל לא ביאר כ\"כ דבריו. אמנם המתבונן בזה\"ק שמפרש התרגום ואלין דיניא די תסדר על עניני הנשמות, יראה כי מסתמא הרגיש שאותה שנה היא זמן הסתלקותו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 189,
      "char_length": 560,
      "timestamp": "2025-02-06T19:20:37.485882"
    },
    {
      "id": "mishpatim_p190",
      "text": "והנה בכל שנה ושנה יש התעוררות הגאולה בזמנים אלו אחר שנת ת\"ר לאלף הששי, כמ\"ש הזה\"ק פ' וירא (דף קי\"ז ע\"א) בשית מאה לשתיתאה יתפתחון תרעי דחכמתא לעילא וכו' ויתתקן עלמא לאעלא בשביעאה כבר נש דמתתקן ביומא שתיתא מכי ערב שמשא לאעלא בשבתא אוף הכי נמי וסימניך בשנת שש מאות שנה לחיי נח וגו' נבקעו כל מעינות תהום רבה, עכלה\"ק. והתעוררות הגאולה תלויה ג\"כ בתיקון החטא הידוע אשר בזה תלוי קיבוץ נדחי ישראל, ובפרט שב\"ק פ' משפטים מסוגל לתשובה ולתיקון חטא זה, כי מרומזים בפרשה עניני הגאולה, והוא השבוע האחרון של ימי השובבי\"ם בשנה פשוטה, כי הוא גמר מתן תורה, שכתוב בה שקבלו ישראל עליהם נעשה ונשמע, וכל המשפטים כתובים בה, ובשנה מעוברת מוסיפין עוד שני שבועות תרומה תצוה, כי בה כתובים מעשה המשכן והמקדש, ובפרט שעתה הוא שבת שמברכין בו החדש, ואיתא בספה\"ק כי שבת מברכין מסוגל לתיקון החטא הידוע, וכמו שאומרים בתפלת יהי רצון ויקבץ נדחינו מארבע כנפות הארץ, שהכוונה בזה גם על הנשמות שנדחו ע\"י חטא זה, וכל ניצוצי הקדושה הפזורים הם בחינת נשמות, ושייכי לקיבוץ נדחים כידוע.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 190,
      "char_length": 937,
      "timestamp": "2025-02-06T19:20:37.779870"
    },
    {
      "id": "mishpatim_p191",
      "text": "ועל כן מתחלת הבקשה הראשונה בתפלת שמנה עשרה מענין הגאולה תקע בשופר גדול לחרותנו ושא נס לקבץ גליותנו וקבצנו יחד מארבע כנפות הארץ והכוונה בבקשה זו הוא על נוצה\"ק הפזורות בעמקי הקליפות ע\"י חטא זה, שיקבצם הקב\"ה ויחזירם שנית אל הקדושה. ומה גם שעתה הוא שבת מברכים אדר, שהוא החדש שמתחלת בו התעוררות הגאולה, ואף באדר ראשון מתחילים להתעורר ימי השמחה והגאולה, וטרם הגאולה יהיה קיבוץ הנדחים, על כן עתה הוא הזמן המסוגל מאד לתיקון חטא הידוע, כי בקיבוץ נדחים תלויה הגאולה, כמו שאמרו ז''ל (נדה י\"ג ע\"ב) המשחקים בתינוקות מעכבים ביאת המשיח, עיי\"ש. ובעוה\"ר אין שמים על לב גודל הענין, ובפרט בשנים אחרונות אלו שממתינים על הגאולה, אשר היא תלויה בזה, שיזכו לשמור עצמם מכאן ולהבא שלא יפגמו, ויתקנו מה שפגמו כבר, והעיקר הוא עזיבת החטא מכאן ולהבא, ושמירת עינים ושמירת המחשבות ונזכה לקיים מ\"ש בזוה\"ק לא תצא כצאת העבדים, שלא נצא מן הגלות מלוכלכים בעברות, וכל יהודי בפני עצמו זקוק לרחמי שמים מרובים שיזכה לחיות בגאולתן של ישראל, ולראות בישועת כל ישראל ושמחתן ובהתגלות כבוד שמים על ישראל וזולת זה זקוקים אנו לרחמי שמים שמי שיזכה לראות את הגאולה, יזכה לראותה בשמחה ובנחת, לא בבושה גדולה כצאת העבדים מלוכלכים בעברות, ופוק חזו מה שכתב במדרש רבה כאן (פ\"ל כ\"ב) וז\"ל אמר הקב\"ה אני מביא את הישועה וכו' ומי שהוא עושה משפט כותב אני עליו שהוא מקרב את הישועה וכו' עיי\"ש, וי\"ל כי כונת המד\"ר במ\"ש מי שהוא עושה משפט וכו', היינו מי שמתקן פגמי נפשו מאשר חטא על הנפש בכל הגלגולים כנ\"ל בדברי הזה\"ק, ואלין סידורין דגלגולא, אזי הקב\"ה כותב עליו שהוא מקרב את הישועה, וא\"כ מי שלא יהיה בבחינה זו שתיקן פגמי נפשו, ולא יאמר עליו שהוא היה מאותם שקירבו את הישועה, אוי לה לאותה בושה אוי לה לאותה כלימה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 191,
      "char_length": 1542,
      "timestamp": "2025-02-06T19:20:38.234969"
    },
    {
      "id": "mishpatim_p192",
      "text": "ולפרש דברי המסורה הנ\"ל (אות ב) יש לומר על פי מה שנתבאר לעיל, שדברי הכתוב לא תצא כצאת העבדים, הם אזהרה לכנסת ישראל בהיותה בגלות, שלא תהיה מלוכלכת בחובין, ובהגיע עת קץ בשמחה יצאון מן הגלות בנשמות זכות וטהורות, ועפי\"ז י\"ל כי כונת המסורה להורות דרך ישכון אור, וכמה זהירות מרובה נחוץ, כדי לשמור על שלמות הנשמה, שלא תתלכלך ח\"ו בעונות, ובפרט בהיותנו בגלות, מעורבים בין העכו\"ם ובין הע\"ר, שזה הוא הגורם לשפלות הדור, וכמה סייעתא דשמיא וזהירות רבה צריכים לבלתי התערב עם שונים, ולהתרחק מהם ומהמונם. וראיה לדבר כמה נחוצה ההתבדלות מהם כדי לשמור על טהרת הנשמה, היא מדברי הכתוב כצאת משה אל האהל וכתב רש\"י ז\"ל עה\"פ ומשה יקח את האהל, מאותו עון והלאה הוא לוקח אהלו ונוטהו מחוץ למחנה אמר מנודה לרב מנודה לתלמיד, הרי לך כי גם משרע\"ה בגודל קדושתו היה ירא לשכון בין חטאים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 192,
      "char_length": 749,
      "timestamp": "2025-02-06T19:20:39.080454"
    },
    {
      "id": "mishpatim_p193",
      "text": "וגדולה מזו איתא בזה\"ק שהיה ירא משה שלא יפגם בהיותו ביניהם, וזה לשון הזוהר הקדוש (שמות קצ\"ד ע\"א ובבראשית דף נ\"ב ע\"ב) ומשה יקח את האהל וגו' וקרא לו אהל מועד וכי לא הוה בקדמיתא אהל מועד, אלא בקדמיתא אהל סתם, והשתא אהל מועד, מאי מועד ר' אלעזר אמר לטב, רבי אבא אמר לביש, ר' אלעזר אמר לטב, מה מועד דאיהו יום חדוה וכו', אוף הכא קרי לה בשמא דא, לאחזאה דהא אתרחיק מבינייהו ולא אתפגים, וע\"ד וקרא לו אהל מועד כתיב, ור' אבא אמר לביש, דהא בקדמייתא הוה אהל סתם, כד\"א (ישעיה ל\"ג) אהל בל יצען בל יסע יתידותיו לנצח, והשתא אהל מועד, מעיקרא למיהב חיין ארוכין לעלמין, דלא ישלוט בהן מותא, מכאן ולהלאה אהל מועד, כד\"א (איוב ל) ובית מועד לכל חי. השתא אתייהיב ביה זמנא וחיין קצובין לעלמא וכו' עי\"ש. הרי לך ראיה גדולה מדברי הזה\"ק כמה יש ליזהר להתרחק מבעלי עבירה, כי לדברי ר' אלעזר הוצרך משה להתרחק מקרב בני ישראל אחר שחטאו בעגל, לבל יפגם, ולדברי ר' אבא יש לנו ללמוד זאת ממה שנפגם אהל מועד ע\"י חטאם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 193,
      "char_length": 872,
      "timestamp": "2025-02-06T19:20:39.465320"
    },
    {
      "id": "mishpatim_p194",
      "text": "וזאת תורת המסורה, וכי ימכור איש את בתו לאמה, כמו שנתבאר דקאי על כנסת ישראל, אשר צורם מכרם להיות עבדים בגלות, לא תצא כצאת העבדים, מזהירם הכתוב שישמרו עצמם לבלתי יתערבו בין הגוים ובין הערב רב כי עלולים הם ללכלך נשמתם, על כן עליהם להיות מופרשים ומובדלים מהם, כדי שלא יצאו מן הגלות מטונפין בחובין כעבדים. וראיה לדבר, עד כמה פוגמת ההתערבות עם חטאים, מפסוק כצאת משה אל האהל שיצא ממחנה ישראל ויצא אל אהלו הרחק מחוץ למחנה, כדי שלא יפגם בינותם, ואם משה רבינו ע\"ה ירא שלא יפגם בין עוברי עבירה, עאכו\"כ שעלינו ליזהר בכך, ומכש\"כ בדורות אחרונים אלו כמה סייעתא דשמיא צריך לכך.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 194,
      "char_length": 561,
      "timestamp": "2025-02-06T19:20:39.920609"
    },
    {
      "id": "mishpatim_p195",
      "text": "ולבל יפול רוח האדם בקרבו, לאמר איך אוכל עמוד בנסיונות הקשים על כל צעד ושעל, ע\"ז קאמר ואוהביו כצאת השמש בגבורתו ויובן עפ\"י מ\"ש הישמח משה זללה\"ה (פ' וירא דף ל\"ז ע\"ג) לפרש הכתוב הנ\"ל, בהקדם דברי ספר אגודת אזוב, כי השמש יש לה ב' תנועות. תנועה ישרה שלה ממערב למזרח, אלא שגלגל היומי מקיפה בכל יום סביבות הכדור ממזרח למערב כי הוא גדול והשמש נגררת אחריו בהכרח, אבל מ\"מ מעט מעט הולכת תנועתה הישרה ממערב למזרח, עד שתשלים בשס\"ה ימים להקיף הכדור בפעם אחת וכו'. והנמשל הוא כי הצדיק יאחז דרכו ללכת להשלים רצון קונו לגשת אל הקדש, אף אם תנועות הפכיות המרחיקות מקיפין אותו, הוא היצה\"ר, עכ\"ז ברבות הזמן ישלים חוקו האמיתי, ועל מקומו יבא בשלום, וז\"ש ואוהביו כצאת השמש בגבורתו, ירצה שהם עושים מעשה השמש כאמור עכ\"ד. וממנו נקח לעבוד את אלקינו, אף בהיותנו כבושים בגולה ומעורבים בין האומות, נעשה תנועות הפכיות לבלתי עשות כתועבותם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 195,
      "char_length": 805,
      "timestamp": "2025-02-06T19:20:40.210820"
    },
    {
      "id": "mishpatim_p196",
      "text": "ונל\"פ בדברי הכתוב והיה כצאת משה את האהל וגו' והביעו אחרי משה, דהנה אמרו ז\"ל במד\"ר (שמות פנ\"א ד) ומה היו אומרים ר' יוחנן אמר אשרי יולדתו של זה וכו' כל ימיו הקב\"ה מדבר עמו כל ימיו מושלם הוא להקב\"ה זהו והביטו אחרי משה ר' חמא אמר היו אומרים חמי קדל דבריה דעמרם (פי' במת\"כ אחד אמר לחבירו בא וראה צוארו של בן עמרם כמה הוא שמן כל זה הוא ממה שלקח משלנו וכו'), וכ\"ה בתרגום יונתן עה\"פ והביטו אחרי משה שרשעי ישראל הסתכלו בעינא בישא אחרי משה, ולכאורה למה אמרו דברי גנאי רק כשיצא משה מן המחנה ללכת אל האהל, ולא כל זמן היות משה בתוך המחנה, ואף כי בודאי לא העיז רשע לדבר דברי נרגן בפני משה, מ\"מ היו יכולים לדבר שלא בפניו בתוך המחנה, אמנם נ\"ל כי לצד שכל זמן היות משה במחנה שרתה הקדושה על המחנה, על כן לא היה לרשעי ישראל פה לדבר ולא מצח להרים ראש, כי בפני קדושת משה נכנעת הקליפה לחלוטין, וכמ\"ש התוס' (סוטה י\"ד ע\"ב) בשם מדרש כי בכל שנה ושנה בעת שחטאו ישראל בבנות מואב באותה פרק בית פעור עולה למעלה כדי לקטרג ולהזכיר עון וכשהוא רואה קברו של משה הוא חוזר ושוקע שמשה רבנו שקעו בקרקע עד חוטמו וכו' ע\"כ. הרי לנו גודל קדושת משרע\"ה, שאין לטומאה קימה בפניו, ורק בצאת משה מן המחנה ללכת אל האהל ונסתלק כח הקדושה מן המחנה, העיזו רשעי הדור להרים ראש ולפצות פה בדברי בלע לשון מרמה, על משה עבד ה'.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 196,
      "char_length": 1165,
      "timestamp": "2025-02-06T19:20:40.609420"
    },
    {
      "id": "mishpatim_p197",
      "text": "וכמה יש לנו להתאונן על כך בדורות אלו, כי אף שבכל הדורות היו רשעי ישראל, כגון בתקופת התנאים והאמוראים היו הצדוקים והביותוסים וכהנה וכהנה, ובדורות האחרונים התפשטה כת הש\"ץ ימ\"ש בעולם, אבל לעומת זאת היו נגדם הצדיקים הגדולים מוסדי דור דור, אשר בתוקף קדושתם הכניעו את כוחות הטומאה, ולא העיזו להרים ראש, אבל בעוה\"ר המה נסעו למנוחות, ואותנו עזבו לאנחות, ורשעי הדור הרימו למרום קרנם, ושננו כחרב לשונם, להפיל עני ואביון לטבוח ישרי דרך, וכמ\"ש החת\"ס ז\"ל לפרש מאמר הכתוב (שה\"ש ב) אחזו לנו שועלים שועלים קטנים מחבלים כרמים וכרמינו סמדר, כי כרם ה' צבאות המה בני ישראל, ואף כי בכל הדורות קמו שועלים אשר ניסו לחבל בכרם ה'. אבל עמדו נגדם הצדיקים הקדושים שבכל דור ודור, אבל עתה השועלים מחבלים כרמים, וח\"ו עולה בידם לחבל ולהשחית בכרם ה', לפי שכרמינו סמדר, פירוש ענבים שלא נגמר בישולם, כי אין לנו כח הצדיקים להגן על שלמות כרם ישראל, עכ\"ד.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 197,
      "char_length": 817,
      "timestamp": "2025-02-06T19:20:41.212015"
    },
    {
      "id": "mishpatim_p198",
      "text": "ובפרט יש לנו להתאונן על כך בדורות האחרונים שטרם ביאת המשיח. שחבלי משיח מתגברים והצדיקים נעדרו מאתנו, ואיתא בגמרא (ב\"ק דף ס' ע\"א) אר\"ש בר נחמני א\"ר יונתן אין פורענות באה לעולם אלא בזמן שהרשעים בעולם ואינה מתחלת אלא מן הצדיקים תחלה שנאמר (שמות כ\"ב) כי תצא אש ומצאה קוצים אימתי אש יוצאה בזמן שקוצים מצויים לה ואינה מתחלת אלא מן הצדיקים תחלה שנאמר ונאכל גדיש ויאכל גדיש לא נאמר אלא ונאכל גדיש שנאכל גדיש כבר ע\"כ. ונתקיים בנו מאמר הכתוב ונאכל גדיש, שכל צדיקי האמת וגדולי הדור האמיתיים שהיו בדור הקודם המה בעולם העליון, ונשארנו ערומים ויחפים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 198,
      "char_length": 536,
      "timestamp": "2025-02-06T19:20:41.617957"
    },
    {
      "id": "mishpatim_p199",
      "text": "והנה לכאורה יל\"ד בלשון הכתוב ומצאה קוצים, למה כתיב לשון מציאה, שהרי אין מציאה אלא בהיסח הדעת, והול\"ל ואכלה קוצים, כדכתיב בסיפא דקרא ונאכל גדיש, ונראה כי בא לרמוז על מצב הדור והוא עפ\"י מה שדרשו ז\"ל קוצים אלו הרשעים, דהנה מלפנים זאת בישראל היה היכר והבדל בין צדיק לרשע, בין עובד האלקים ללא עבדו, כי הצדיקים פרשו עצמם לגמרי מהתחברות עם הרשעים, וממילא נודע לכל מי הוא זה ואיזה הוא ההולך בדרך הרשעים, וידעו להשמר על נפשם, אבל היום נתפשט דרכם כ\"כ עד שאפילו מקום שלא עלתה על הדעת שהוא רע, וחושבים שהוא אך טוב, לפתע נודע כי גם הוא חבר לעושי רשעה, וכן יהודי החושב על עצמו כי הוא הולך עדיין קצת בדרך התורה ופתאום רואה את עצמו מרוחק, וכן הוא גם בכללות העולם שאפילו מקום שאין מציירין עליו כלל שהוא רע נתקיים בו מאמר הכתוב (ירמיה ח ט\"ו) קוה לשלום ואין טוב לעת מרפא והנה בעתה שמקוים עליו שהוא עת מרפא ולפתע פתאום והנה בעתה, מבלי חשוב על זאת כלל, נודע לו שהוא מקום בעתה, וזה מרומז בכתוב ומצאה קוצים שדרך הרשעים בעוה\"ר מתגבר ע\"ד מציאה לפתע פתאום. מבלי שחשבו עליו כלל, וכל יהודי צריך לחשוד את עצמו אולי ח\"ו סר מדרך האמת, כי בעצמו אינו מרגיש אם הולך הוא בדרך נכוחה, ופעמים הוא חושב שהולך הוא בדרך האמת, ופתאום יווכח שטעה ונתעה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 199,
      "char_length": 1109,
      "timestamp": "2025-02-06T19:20:41.899727"
    },
    {
      "id": "mishpatim_p200",
      "text": "ופוק חזי מ\"ש הגה\"ק מחוסט זלל\"ה בספר הצואה הכנה דרבה, כי בדור הזה בכל מקום שפונים עצמם אין רואים כי אם מינות ואפיקורסות, ובכל אשר יפנה האדם צריך הוא כח גדול להתחזק באמונה, ואם כתב כן הוא ז\"ל בדורו שעדיין לא היה המצב כך לגמרי, ואך בשביל שהיה שכיח מאד כתב כן מה נאמר אנו בדורנו, שמצב הדור הוא כך במלוא מובן המלה, אשר בכל צד ופנה שהאדם פונה עצמו הוא שומע בו דברי מינות ואפיקורסות בעוה\"ר, ואין האדם יודע בעצמו היכן ובאיזה מצב הוא עומד וצריכין אנו לנסים מן השמים שלא נפול בדרך המינות אף בלא יודעים, וז\"ש הכתוב ומצאה קוצים, כי דרך הרשעים הוא נודע בהסח הדעת בלי ידיעה קודמת, ופעמים יש אשר אפילו מי שחשבו עליו שהוא טוב באמת, ורצו להשתייך אליו, בידעם כי הוא זה משרש הצדיקים, ולפתע פתאום מוצאים עצמם משתייכים עם בחינת הרשעים, כי זה האיש אשר חשב עליו שהוא אך טוב עתה רואה הוא שגם הוא פונה לדרך הרשעים, ואין יודעים עד היכן הדברים מגיעין, וגודל השמירה שזקוקים לה. ואמרו ז\"ל (סנהדרין צ\"ו ע\"א) שלשה באין בהיסח הדעת משיח מציאה ועקרב, ופירש המהרש\"א ז\"ל כי הא בהא תליא, אם זכו תהיה ביאת המשיח כהיסח הדעת דמציאה, וח\"ו אם לא זכו יבאו חבלי משיח קשים בהיסח הדעת שלא חשבו עליהם, בבחינת עקרב הבא על האדם בהסח הדעת עיי\"ש.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 200,
      "char_length": 1095,
      "timestamp": "2025-02-06T19:20:42.466834"
    },
    {
      "id": "mishpatim_p201",
      "text": "וכאשר מתבוננים על מה שעבר על כלל ישראל בשנים האחרונות. רואים כי החבלים הקשים והצרות הקשות שסבל כלל ישראל בעוה\"ר, באו עליו בהסח הדעת, מבלי מחשבה קודמת, הכי היה מי שהעלה על דעתו קודם לכן שיתכן להיות כזאת, הלא לא עלתה על דעת אדם לצייר במחשבתו שיהיה מה שהיה שימצאונו בדור זה צרות רבות ורעות שיעדרו מאתנו החלק המובחר בכלל ישראל סלתה ושמנה וכל מקום שגדל והצליח וגם עשה פרי בדרך הטוב והישר האמיתי בתורה וביהדות ובקדושה נספה בחרבן הנורא, ונשארנו מעט מזעיר ממש מיעוטא דמיעוטא, ואין להבין דרכי השם יתברך, ומי יודע אותן שנעדרו על מה נעדרו, ואותן שנשארו הכי יודעים על מה ולמה נשארו, לאיזה דרך ולאיזה תכלית, אבל זאת צריכים לדעת כי נותרנו בחמלת הבורא עלינו, ומוטל עלינו לעשות רצונו, ולמלאות השליחות המוטל עלינו, והבוכ\"ע יעזור שנזכה להתגבר על כל הנסיונות, וחייבים לדעת כי מה שרואים כי דרך רשעים צלחה, הם הם הנסיונות הגדולות הקמים על האדם, וכשנזכה שהשי\"ת יעזרנו לעמוד בכל הנסיונות, ונעבור את כל חבלי משיח ונזכה לגאולה, אזי מי שיהיה בין אלו שעמדו בנסיון ולא נתפסו ברשת הרשעים, אשרי לו ומה טוב חלקו וחבלו. והבוכ\"ע יעזור שנזכה לתקן מה שפגמנו ונתלכלכנו בגלות המר הזה, בחטאים ובמחשבות רעות מחשבת מינות ומחשבת עריות, והמחשבות הרעות הם הגורם להכשל בחטא הידוע אוי מה מר כלענה הוא כובד המשא הרובץ על אדם מישראל בעבור חטא זה, וכמה קשה לתקן חטא זה, ועכשיו הזמן לכך, כי אנו עומדים כבר בסוף ימי השובבי\"ם, והבוכ\"ע יעזור שנזכה לקבל פני משיח צדקינו באנפין נהירין. וכאשר נזכה לעבור הנסיונות אזי יתקיים מ\"ש ז\"ל במס' ב\"ק (דף ס' ע\"ב) עה\"פ כי תצא אש וגו' שלם ישלם המבעיר את הבערה, ומה נוראים דברי הגמרא שם וז\"ל, שלם ישלם המבעיר את הבערה אמר הקב\"ה עלי לשלם את הבערה שהבערתי אני הצתו אש בציון שנאמר (איכה ד) ויצת אש בציון ותאכל יסודותיה ואני עתיד לבנותה באש שנאמר (זכריה ב) ואני אהיה לה חומת אש סביב ולכבוד אהיה בתוכה, עכ\"ל. ולכאורה יל\"ד שהרי דרשו שם בגמרא את דברי הכתוב כי תצא אש ומצאה קוצים ונאכל גדיש וגו' על פורענות הצדיקים והרשעים: ואיך שייך לדרוש סיפא דקרא שלם ישלם המבעיר את הבערה על שהצית הקב\"ה אש בציון. דקאי לכאורה על חורבן ביהמ\"ק, ולפי\"ז לא שייך סיפא דקרא שלם ישלם וגו' לרישא והם שני ענינים נפרדים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 201,
      "char_length": 1970,
      "timestamp": "2025-02-06T19:20:43.007464"
    },
    {
      "id": "mishpatim_p202",
      "text": "אמנם י\"ל כי לפי שכ\"כ מתגברים הנסיונות על האדם ועל כל פסיעה ופסיעה אורבים הנסיונות, ומי שיזכה לעבור כל הנסיונות ולא יכשל בהם, אזי הקב\"ה מקבל על עצמו שהוא הוריד לעולם נסיונות אלו, וכאמרם ז\"ל (סוכה נ\"ב ע\"ב) אמר ר' חנא בר אחא אמרי בי רב ארבעה מתחרט הקב\"ה עליהם וחד מנהון שברא יצה\"ר שנאמר (מיכה ד) ואשר הרעותי, ע\"כ, וכמו כן יאמר הקב\"ה אני הצתי אש בציון שהבוכ\"ע יקבל על עצמו מה שהניח את הנסיונות הגדולות בעולם, וז\"ש הצתי אש בציון דהיינו שהניחו מן השמים את הסט\"א לבצע זממו ולנסות את העולם בבחינה זו של ציון, כמו שהניח הקב\"ה את כל העבודות זרות בעולם, כמאמר הכתוב ובא אליך האות והמופת כי מנסה ה' אלקיכם אתכם (דברים י\"ג).",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 202,
      "char_length": 611,
      "timestamp": "2025-02-06T19:20:43.950607"
    },
    {
      "id": "mishpatim_p203",
      "text": "וזה אפשר לרמוז במאה\"כ כי תצא אש, כי אש יצאה מציון, הם הנסיונות המרים ואש הסט\"א, ומצאה קוצים. כי האש מצאה את רשעי הדור והמה הוסיפו ללבות את האש עד שהבערה ללהב יצאה, ועל ידי זה ונאכל גדיש, שנלקחו מאתנו כל הצדיקים, כאשר ידוע לכל מי שהוא קצת בר דעת, כי הלהבה אשר יצאה מציון. היא היתה הגורם בפועל ובכח למה שנעדרו מאתנו מיליונען יהודים לדאבון נפשנו בשנים האחרונות האלו, וז\"ש הכתוב ומצאה קוצים ונאכל גדיש, שע\"י הקוצים רשעי הדור התפשטה האש ללהבה ונשרפו הצדיקים וע\"ז יאמר הקב\"ה אני הצתי אש בציון במה שהנחתי לנסיונות להתגבר בעולם, ואני עתיד לבנותה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 203,
      "char_length": 538,
      "timestamp": "2025-02-06T19:20:44.269847"
    },
    {
      "id": "mishpatim_p204",
      "text": "עוד אפ\"ל בדברי הזה\"ק הנ\"ל ואלה המשפטים ואלין אינון סידורין דגלגולא עפ\"י מה דאיתא בגמרא (ע\"ז ט' ע\"א) תנא דבי אליהו ששת אלפים שנה הוי העולם שני אלפים תוהו שני אלפים תורה שני אלפים ימות המשיח בעוונותינו שרבו יצאו מהם מה שיצאו. וכתב האר\"י הקדוש לבאר עפ\"י מה שאמרו ז\"ל (נדה י\"ג ע\"ב) אין בן דוד בא עד שיכלו כל הנשמות שבגוף וכו' (ופירש\"י ז\"ל גוף חדר כי גוף שם מקום המיוחד לנשמות העתידים להיות נולדים). והנה כל עוד שלא נתקנו הנשמות אשר ירדו כבר לעולם, אין יורדים נשמות חדשות לעולם, כי אם חוזרים ומתגלגלים אותם הנשמות עד שימצאו תיקונן. וזאת כוונת הגמרא בעוונותינו שרבו יצאו מהן מה שיצאו, ר\"ל שחוזרים ויוצאים לעולם נשמות שיצאו כבר, ועל כן עדיין בן דוד לא בא. כי אין יוצאים נשמות חדשות מן החדר ששמו גוף.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 204,
      "char_length": 692,
      "timestamp": "2025-02-06T19:20:44.591025"
    },
    {
      "id": "mishpatim_p205",
      "text": "וזה אפ\"ל בדברי הזה\"ק, כי פרשת ואלה המשפטים רומזת על הגאולה כמו שדרשו ז\"ל, ובא לרמז לנו הזה\"ק כי הגאולה תלויה במה שיכלו הנשמות מן הגוף, וזה לא יתכן כי אם ע\"י שיתוקנו כל הנשמות הישנות ע\"י הגלגולים, וז\"ש אילין אינון סדורא דגלגולא דאתדנו כל חד וחד לקבל עונשיה, כי ע\"י שיתוקנו כל הנשמות הצריכות תיקון ויצאו לעולם כל הנשמות החדשות שבגוף תבא הגאולה, ובעוה\"ר לא רק שהגופים שלנו הם בגלות. אלא שגם הנשמות הם בגלות, ואף הנשמות אשר הם בעולם העליון כולם הם בגלות, וצריכין אנו לחשב עם נפשנו ולהתאמץ בכל כוחנו לתקן מה שפגמנו, כדי שלא נצא מן הגלות מלוכלכין בחובין בעת חדוה דמלכא כי לא דבר קטן הוא שצריכין אנו לתקן כל הנשמות שנדחו על ידינו, וחייבים לתקן זאת בעוד מועד, ובפרט בדור האחרון הזה טרם ביאת המשיח שחוזרים ומתגלגלים לעולם כל הנשמות שלא נתעלו עדיין לשרשם ולא נתקנו עדיין.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 205,
      "char_length": 761,
      "timestamp": "2025-02-06T19:20:44.944182"
    },
    {
      "id": "mishpatim_p206",
      "text": "והנה נשארו לנו בשנה זו מן הימים המסוגלים לתיקון חטא זה עוד שני שבועות (ת\"ת) ועלינו לתקן פגמנו בתשובה ומעשים טובים המועילים על הכל, ועלינו לשוב בתשובה שלמה לפני הבורא כל העולמים, ולבקש רחמי שמים על כלל ישראל הנתונים בצרה ובשביה בכל מקומות מושבותיהם והחי יתן אל לבו. ועוד בו נשמתו יכול הוא לתקן ע\"י תשובה, ונזכה שיתגדל ויתקדש שמיה רבא בחייכון וביומיכון ובחיי דכל בית ישראל שנזכה לקדש שם שמים עוד בחיים חיותינו. ולעשות נחת רוח להבוכ\"ע, ונזכה לישועה שלימה בכלל ובפרט, ונזכה במהרה לישועה האמיתית בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו במהרה בימינו אמן.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 206,
      "char_length": 560,
      "timestamp": "2025-02-06T19:20:45.316329"
    },
    {
      "id": "mishpatim_p207",
      "text": "באופן אחר יש לפרש דברי הזה\"ק הנ\"ל ואלה המשפטים אלין אינון סדורא דגלגולא וכו'. עפ\"י מה שיש לדקדק למה נאמרה פרשת עבד עברי לאנשי דור המדבר, והרי לא נהגה בהם מצוה זו כלל, כי אין עבד עברי נוהג אלא בזמן שהיובל נוהג וגם אין לומר כי נאמרה להם פ' זו על לעת\"ל, כשיעמדו בתחיית המתים, שהרי עבד עברי תחלתו ע\"י עבירה שנמכר בגנבתו, ואף מוכר עצמו מחמת דוחקו תחלתו בעבירה, שסחר בפירות שביעית וע\"י כך התרושש, כדאיתא בגמרא (קידושין כ' ע\"א) וגם המכירה היא בעבירה שעובר על כי לי בני ישראל עבדים וכו' ולא עבדים לעבדים. וא\"כ לא שייכא פרשה זו לעתיד, כי השי\"ת יערה עלינו רוח ממרום ואת רוח הטומאה יעביר מן הארץ, וכולם ידעו את ה' מקטנם ועד גדולם, ולא יחטאו עוד וא\"כ על מה ולמה נאמרה להם פ' זו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 207,
      "char_length": 666,
      "timestamp": "2025-02-06T19:20:45.591387"
    },
    {
      "id": "mishpatim_p208",
      "text": "ונראה בהקדם דברי הש\"ך עה\"ת ריש פ' דברים כי לכאורה כל התוכחות שהוכיח משה את ישראל בסוף שנת הארבעים, הם לא עשו שום אחת מהם, שהרי תם כל הדור ההוא שחטאו במדבר, וא\"כ למה שתקו ולא דברו דבר לאמר נקיים אנחנו מעון, ותירץ כי נשמות אנשי דור המדבר חזרו ונתגלגלו בבניהם באי הארץ, ונתקנו על ידם, וע\"כ הוכיחם משה כי הם אשר עשו את החטאים האלו בגלגול הקודם. עכ\"ד ז\"ל. ועל פי דבריו נראה לומר כי זאת כוונת המדרש רבה (דברים א י\"ג) א\"ר אחא יכולין היו ישראל לומר לו רבינו משה אנו יש בנו אחד מכל הדברים שאתה מוכיחנו וקבלנו תוכחותיך אלא שתקו וכו' ע\"כ. כונת המדרש כי לכן שתקו כי השיגו וידעו שנשמתם היא גלגול אנשי דור המדבר, והם אשר עשו את החטאים בגלגול הראשון, ועל כן קבלו תוכחתו. ועפי\"ז י\"ל כי לכן צוה משרע\"ה דין ע\"ע לאנשי דור המדבר. אף שלא נהג דין זה אצלם, מכיון שהיו עתידים לבא בגלגול בדור באי הארץ. ושפיר שייכא בהם מצוה זו בגלגול שני, וזאת כוונת הזה\"ק ואלה המשפטים וגו', ולכאורה למה נצטוו על דיני עבד עברי שלא נהגו בהם כלל, וע\"ז בא הזה\"ק לפרש ואלין אינון סדורי דגלגולא, כי עתידים הם לחזור בגלגול בדור באי הארץ, ותנהוג בהם מצוה זו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 208,
      "char_length": 1009,
      "timestamp": "2025-02-06T19:20:45.937510"
    },
    {
      "id": "mishpatim_p209",
      "text": "ובבחינה זו אפ\"ל הפסוק (מלאכי ג) הנה אנכי שולח לכם את אליהו הנביא וגו' והשיב לב אבות על בנים ולב בנים על אבותם, דהנה ידוע מה דאיתא בכתבי האר\"י ז\"ל דכל הנשמות בדורות אלו הם גלגולים מדורות הקודמים, שירדו לתקן את אשר פגמו. ובזה פירש הגמ' (סנהדרין צ\"ז) ובעוה\"ר יצאו מהם מה שיצאו ועדיין בן דוד לא בא, כי אין בן דוד בא עד שיכלו נשמות שבגוף ועבור שיצאו עוד הפעמים נשמות שיצאו כבר בגלגולם קודמים ולא יצאו עדיין הנשמות החדשות מתעכבת הגאולה. והנה אפ\"ל כי עכשיו בדורנו דור עיקבא דמשיחא, בנינו הם גלגול אבותינו הקדושים שנהרגו רח\"ל בחרבן הנורא שהיה בזמנינו ולא זכו בעיניהם לראות את הגאולה, ועל כן חזרו בגלגול, כדי שעיניהם יראו בביאת המשיח, וזה אפ\"ל בכונת הכתוב הנה אנכי שולח לכם את אליהו הנביא וגו' והשיב לב אבות על בנים: ר\"ל שהאבות יחזרו בגלגול שנית בבניהם, כדי שיזכו לחזות את הגאולה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 209,
      "char_length": 771,
      "timestamp": "2025-02-06T19:20:46.445321"
    },
    {
      "id": "mishpatim_p210",
      "text": "ואלה המשפטים אשר תשים לפניהם. במד\"ר מה כתיב למעלה מן הפרשה ושפטו את העם בכל עת ואמר כאן ואלה המשפטים והדברות באמצע משל למטרונה שהיתה מהלכת הזין מכאן והזין מכאן והיא באמצע כך התורה דינין מלפניה ודינין מאחריה והיא באמצע וכו' וצ\"ב.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 210,
      "char_length": 228,
      "timestamp": "2025-02-06T19:20:46.827935"
    },
    {
      "id": "mishpatim_p211",
      "text": "ב) במדרש רבה הה\"ד ועוז מלך משפט אהב א\"ל משה לישראל הרי נתן לכם הקב\"ה את תורתו אם אין אתם עושין את הדינים נוטל תורתו מכם למה שלא נתן לכם הקב\"ה את התורה אלא ע\"מ שתעשו את הדינים וכו'. והוא פלא איך יתכן שיטול הקב\"ה את התורה מישראל, הלא אפי' רשע גמור חייב בכל מצות התורה, וכבר הארכנו לעיל בכמה אנפי בביאורו, ועוד לאלקי מילין.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 211,
      "char_length": 320,
      "timestamp": "2025-02-06T19:20:46.966530"
    },
    {
      "id": "mishpatim_p212",
      "text": "ג) עוד במד\"ר הה\"ד מגיד דבריו ליעקב וגו' לא עשה כן לכל גוי, וגו' ויש לדקדק בפסוק דפתח דבריו בהגדה מגיד דבריו וגו', וסיים בעשיה לא עשה כן וגו' והול\"ל לא הגיד כן לכל גוי.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 212,
      "char_length": 167,
      "timestamp": "2025-02-06T19:20:47.153540"
    },
    {
      "id": "mishpatim_p213",
      "text": "ונראה ביאור הענין. בהקדם לבאר בכמה אופנים מאמר נעים זמירות ישראל (תהלים פ\"ו) לדוד שמרה נפשי כי חסיד אני, ולכאורה צ\"ב מה נתן טעם באמרו כי חסיד אני. לבקשתו שמרה נפשי, וכי בעבור שהוא חסיד צריך הוא שמירה מעולה יותר. וי\"ל עפ\"י מ\"ש הרב חיד\"א זלל\"ה בשם קדמונים לפרש הכתוב בתהילים (קי\"ט) עשיתי משפט וצדק בל תניחני לעושקי. דהנה אמרו ז\"ל (סנהדרין ו' ע\"ב) ויהי דוד עושה משפט וצדקה (שמואל ב' ח') דן את הדין זיכה את הזכאי וחייב את החייב וראה שנתחייב עני ממון שילם לו מתוך ביתו וזהו משפט וצדקה משפט לזה שהחזיר לו ממון וצדקה לזה ששלם לו מתוך ביתו. עכ\"ד הגמרא. והנה חשש דוד מפני הרמאים אשר יעמידו פנים כאילו באים לדין, וכשיתחייב אחד מהם ויטעון אין לי לשלם, יפרע לו דוד מביתו, ואח\"כ יחלקו שלל ביניהם, ע\"כ התפלל דוד הע\"ה עשיתי משפט וצדק, דהיינו משפט לזה וצדקה לזה ששלם לו מביתו, לזאת תיכון תפלתי לפניך בל תניחני לעושקי, שתצילני מאינשי דלא מעלי, בל יעשקוני זדים. והנה אמרו ז\"ל (ב\"ק ל' ע\"א) האי מאן דבעי למהוי חסידא לקיים מילי דנזקין, וז\"פ הפסוק לדוד שמרה נפשי, והטעם שאני צריך שמירה רבה כי חסיד אני שאני מקיים מילי דנזקין. בעשית משפט וצדקה כנ\"ל, ע\"כ גדול החשש מפני הרמאים, פן ילכדונו בערמתם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 213,
      "char_length": 1072,
      "timestamp": "2025-02-06T19:20:47.274513"
    },
    {
      "id": "mishpatim_p214",
      "text": "באופן ב' י\"ל לדוד שמרה נפשי וגו', עפ\"י מה דאיתא בפסחים (קי\"ב ע\"א) אל תדור בעיר שראשיה ת\"ח, פרש\"י דטריד בגירסא ולא טריד במילי דציבורא. והנה דוד המלך עליו השלום היה מוטל עליו לנהל צרכי העם ולשמרם ממלחמות האומות, אולם היה טרוד בגירסא, כדאי' בגמרא (ברכות ד' ע\"ב) לדוד שמרה נפשי כי חסיד אני אמר דוד לפני הקב\"ה לא חסיד אני שכל מלכי מזרח ומערב יושבים אגודות אגודות בכבודם ואני ידי מלוכלכות בדם ובשפיר ובשליא כדי לטהר אשה לבעלה וכו'. ע\"כ. וא\"כ חשש דוד שע\"י טרדתו בגירסא לא יוכל להתפנות לעסוק במילי דציבורא כראוי, ע\"כ התפלל לפני הקב\"ה שמרה נפשי היינו שאתה תשמור אותי ואת כלל ישראל בכל דבר הצריך שמירה, כי חסיד אני וטרוד בגירסא, וע\"כ צריכים אנחנו שמירה, כי כל מלכי מזרח ומערב יושבים אגודות אגודות בכבודם ויש להם פנאי לעסוק במילי דצבורא, ואני ידי מלוכלכות וכו' לטהר אשה לבעלה, ואין לי עת ופנאי לטכס עצות במילי דצבורא.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 214,
      "char_length": 806,
      "timestamp": "2025-02-06T19:20:47.834295"
    },
    {
      "id": "mishpatim_p215",
      "text": "באופן ג' יתבאר הפסוק הנ\"ל בהקדם המשנה בברכות (דף ל' ע\"ב) חסידים הראשונים היו שוהין שעה אחת ומתפללין וכו'. ובגמרא שם ת\"ר חסידים הראשונים היו שוהין שעה אחת ומתפללין שעה אחת וחוזרין ושוהין שעה אחת וכי מאחר ששוהין תשע שעות ביום בתפלה תורתן האיך משתמרת ומלאכתן האיך נעשית אלא מתוך שחסידים היו תורתן משתמרת ומלאכתן נעשית וכו' ע\"כ. והנה עיקר חיות נפשו של דהע\"ה היתה התוה\"ק כדכתיב (תהלים קי\"ט) לעולם לא אשכח פקודיך כי בם חייתני, וזו היתה תפלתו שמרה נפשי ר\"ל שישמור הקב\"ה תורתו. שלא תשתכח ממנו, וטעם שצריכה תורתו שמירה יתירה, כי חסיד אני, ופירוש חסיד הוא כדאיתא בגמ' חסידים הראשונים היו שוהים תשע שעות ביום בתפלה, וע\"כ צריכה תורתו שמירה מעולה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 215,
      "char_length": 634,
      "timestamp": "2025-02-06T19:20:48.239200"
    },
    {
      "id": "mishpatim_p216",
      "text": "באופן ד' יל\"פ כוונת הפסוק הנ\"ל, עפ\"י מ\"ש החתם סופר זללה\"ה בנוסח ההודאה בחנוכה מסרת גבורים ביד חלשים ורבים ביד מעטים וטמאים ביד טהורים וכו', והקושיא ידועה כי בשלמא גבורים ביד חלשים הוא נס כי דרך הטבע הוא להיפך שאימת גבור על החלש, וכן רבים ביד מעטים הוא היפך דרך הטבע, אבל טמאים ביד טהורים מה נס יש בו, וכי דרך הטבע ח\"ו שדוקא טמאים ינצחו את הטהורים, ופירש כי אמנם כן הוא שבדרך הטבע יתגברו הטמאים על הטהורים כי הטמאים משתמשים בתחבולות כאלו בשעת מלחמה, אשר הטהורים נמנעים מלעשותם, עבור שאסור לעשותם עפ\"י הדין, כגון כריתת עץ מאכל כדי לבנות מצור וכדו', ע\"כ גם זה הוא מספור הנס שגברו הטהורים על הטמאים, אף שלא השתמשו בתחבולות האסורות עפ\"י הדין, ע\"כ. והנה דוד המלך ע\"ה לחם מלחמות רבות נגד אומות העולם, ע\"כ התפלל שמרה נפשי שאנצח במלחמה, וטעם כי צריך אני לשמירה גדולה כי חסיד אני, ונמנע מלעשות תחבולה במלחמה שהוא אסורה עפ\"י התורה א\"כ קרוב הדבר שינצחוני האומות ע\"כ שמרה נפשי שאוכל לנצחם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 216,
      "char_length": 876,
      "timestamp": "2025-02-06T19:20:48.542844"
    },
    {
      "id": "mishpatim_p217",
      "text": "באופן ה' י\"ל הכתוב הנ\"ל בהקדם מאמה\"כ (תהלים צ\"ז) אוהבי ה' שנאו רע שומר נפשות חסידיו מיד רשעים יצילם. ופירש במצודות דוד אתם אוהבי ה' שנאו עושי הרע ולא תפחדו מהם, כי הנה ה' שומר נפשות חסידיו ויצילם מיד הרשעים ההם, ולזאת התפלל אדונינו המלך דוד ע\"ה, שמרה נפשי לבל יזיקו אותי עושי רשעה: והטעם שהם חפצים להזיקני, כי חסיד אני ואני שונא את הרשעים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 217,
      "char_length": 339,
      "timestamp": "2025-02-06T19:20:48.967326"
    },
    {
      "id": "mishpatim_p218",
      "text": "ועתה נבא לביאור המדרשים הנ\"ל בהקדם דאיתא במס' ע\"ז (דף י\"ט ע\"א) אמר רבא בתחלה נקראת (התורה) על שמו של הקב\"ה ולבסוף נקראת על שמו (ופירש\"י על שמו של אותו תלמיד שטרח בה) שנא' (תהלים א') בתורת ה' חפצו ובתורתו יהגה ופירש המהרש\"א ז\"ל עפ\"י דאיתא בנדרים (ל\"ח ע\"א) בתחלה היה משה לומד תורה ומשכחה עד שנתנה לו במתנה שנאמר ויתן אל משה ככלתו וגו' ה\"נ פירושו בתחלה נקראת על שמו של הקב\"ה דבתחלת למודו שהוא לומד ומשפחה עדיין אין התורה שלו עד שלמדה מרבו כ\"כ עד שנעשית קנין בנפשו אזי תקרא התורה על שמו והיינו במתנה דקאמר דמקריא תורתו של תלמיד חכם וכו' עכ\"ל. והנה יכול כל אדם להיות כמשה, להשיג מעלה זו שתנתן לו התורה במתנה שלא ישכח מה שלמד, והגם שאי אפשר להיות תורתו באותה הבחינה של משה רבינו ע\"ה, אף עפי\"כ יכול להשיגה בבחינת מתנה שתקרא תורתו, וכמו דאיתא בגמ' ברכות הנ\"ל מתוך שחסידים הם תורתן משתמרת וכו', כי נעשית התורה קנין בנפשם ואין שוכחין מה שלומדים. אמנם כדי להגיע למעלת חסיד שתעשה התורה קנין בנפשו צריך לקיים דיני ממונות ומשפטי התורה, כדאמר רבא האי מאן דבעי למהוי חסידא לקיים מילי דנזיקין.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 218,
      "char_length": 976,
      "timestamp": "2025-02-06T19:20:49.190239"
    },
    {
      "id": "mishpatim_p219",
      "text": "ובזה מבואר המדרש (קושיא ב') היטב א\"ל משה לישראל הרי נתן לכם הקב\"ה תורתו, ר\"ל שנתן לכם בחינה זו שע\"י שתתיגעו בתורה תעשה קנין בנפשכם ותקרא תורתכם, אם אין אתם עושים את הדינים, א\"כ אבד מכם שם חסיד, כי אינכם מקיימים מילי דנזיקין. וא\"כ לא תשתמר בקרבכם התורה, כי א\"א שתעשה התורה קנין בנפש אלא אם הם בבחינת חסידים כנ\"ל, ע\"כ הקב\"ה נוטל תורתו מכם, שאין התורה נקראת תורתו של הלומדה. ועל פי זה יובן המדרש היטב משל למטרונה שהיתה מהלכת הזין מכאן והזין מכאן והיא באמצע כך התורה דינין מלפניה ודינין מאחריה והיא באמצע. והכונה כי כשם שהמטרונה צריכה שמירה מלפניה ומאחריה, כן התורה צריכה שמירה שלא תשתכח ותעשה קנין בנפש, ומה היא השמירה דינין מלפניה ודינין מלאחריה, כי ע\"י קיום הדינים זוכים להגיע למעלת חסיד, ומתוך שחסידים הם תורתם משתמרת.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 219,
      "char_length": 718,
      "timestamp": "2025-02-06T19:20:49.719643"
    },
    {
      "id": "mishpatim_p220",
      "text": "ועפי\"ז יתיישב מה שדקדקו המפורשים בדברי הכתוב מגיד דבריו ליעקב וגו' דפתח בהגדה וסיים בעשיה, דהנה איש הישראלי הלומד תורה וקונה אותה בנפשו קנין גמור עושה בזה מעשה רב. שזוכה להשראת השכינה עליו וכדאיתא במד\"ר ריש פרשת תרומה אמר הקב\"ה לישראל מכרתי לכם תורתי כביכול נמכרתי עמה וכו' משל למלך שהיתה לו בת יחידה בא אחד מן המלכים ונטלה ביקש לילך לו לארצו וליטול לאשתו א\"ל בתי שנתתי לך יחידית היא לפרוש ממנה איני יכול לומר לך אל תטלה איני יכול לפי שהיא אשתך אלא זו טובה עשה לי שכל מקום שאתה הולך קיטון אחד עשה לי שאדור אצליכם כך אמר הקב\"ה לישראל נתתי לכם את התורה לפרוש הימנה איני יכול לומר לכם אל תטלוה איני יכול אלא בכ\"מ שאתם הולכים בית אחד עשו לי שאדור אצליכם וכו'. הרי לנו כי ע\"י שהאדם קונה את התורה בנפשו קנין גמור, זוכה להשראת השכינה, כי לא יצוייר כביכול פירוד בין הקב\"ה ותורתו הקדושה, ונמצא כי נעשה מעשה רבה ע\"י לימודו, כעין מה דאיתא בתמורה (דף ג' ע\"ב) לא תתני ומימר משום דבדיבוריה מתעביד מעשה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 220,
      "char_length": 888,
      "timestamp": "2025-02-06T19:20:50.095816"
    },
    {
      "id": "mishpatim_p221",
      "text": "וזהו פירוש מאמר הכתוב מגיד דבריו ליעקב דהיינו שהקב\"ה מסר את התורה הקדושה ליעקב חקיו ומשפטיו לישראל כי ע\"י קיום המשפטים יגיעו ישראל למדרגת חסידים, ותעשה התורה קנין בגופם ועל ידי כך יזכו להשראת השכינה, ואין לך מעשה גדול מזה, ושפיר סיים קרא לא עשה כן לכל גוי וגו', במה דפתח מגיד דבריו וגו' חקיו ומשפטיו לישראל, שנתן להם מעלה זו שע\"י שמירת החוקים והמשפטים תעשה התורה קנין בגופם, אבל לא ''עשה\" כן לכל גוי, ר\"ל שאף בשעה שהחזיר הקב\"ה את התורה על כל אומה ולשון שיקבלוה, מ\"מ מעלה זו שיוכלו להגיע למדרגת חסידים ותעשה התורה קנין בגופם לא רצה לתת להם מעולם, וז\"פ לא ''עשה'' כן לכל גוי, שלא רצה לתת להם התורה בבחינת עשיה, שיוכלו להגיע למעשה רב של השראת השכינה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 221,
      "char_length": 647,
      "timestamp": "2025-02-06T19:20:50.518203"
    },
    {
      "id": "mishpatim_p222",
      "text": "ועפי\"ז יתבארו דברי המדרש ילקוט (ר\"פ במדבר רמז תרפ\"ד) בשעה שקיבלו ישראל את התורה נתקנאו אוה\"ע בהם מה ראו להתקרב יותר מן האומות סתם פיהן הקב\"ה א\"ל הביאו לי ספר יוחסין שלכם וכו' כשם שבני מביאין וכו' ע\"כ. והקושיא ידועה הלא הקב\"ה החזיר את התורה על כל אומה ולשון ולא רצו לקבלה, ומה יש להם פתחון פה עוד. אמנם לדברינו יובן היטב, כי קנאתם של אוה\"ע הוא על שהקב\"ה נתן את התורה לישראל בבחינה שתעשה התורה קנין גמור בנפשם, כי מדרגה זו לא רצה הקב\"ה ליתן לאוה\"ע אף כשרצה לתת להם את התורה, וע\"כ דייק המדרש בלשונו בשעה שקבלו ישראל את התורה, דהיינו שקבלוה בתורת מתנה גמורה שיוכלו להגיע לבחינה שהתורה תקרא על שמם, כמאה\"כ ובתורתו יהגה, נתקנאו בהם אוה\"ע מה ראו להתקרב יותר מן האומות, שלא רצה הקב\"ה לתת להם את התורה בבחינה זו, סתם פיהן הקב\"ה ואמר להם הביאו לי ספר יוחסין שלכם וכו', כי לא יתכן להשיג מדרגה זו שתעשה התורה קנין בנפש ולא תשכח זולת ע\"י השראת השכינה, כיון שאין הקב\"ה יכול לפרוש מן התורה כביכול, ואיתא בגמ' (קידושין ע' ע\"ב) אין השכינה שורה אלא על משפחות המיוחסות שבישראל, ובתשובה זו סכר הקב\"ה פיהם של אוה\"ע, ונסתתמו טענותיהן כיון שאין להם יחוס, ורק ישראל קדושים אשר זרע קודש מצבתם יכולים להשיג מעלה זו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 222,
      "char_length": 1089,
      "timestamp": "2025-02-06T19:20:50.846634"
    },
    {
      "id": "mishpatim_p223",
      "text": "אם בגפו יבא בגפו יצא אם בעל אשה הוא ויצאה אשתו עמו. ק\"ז בישמח משה מביא מדרש פליאה וזה תוארו, בשעה שאמר הקב\"ה אם בגפו יבא בגפו יצא, אמרו מלאכי השרת לפני הקב\"ה א\"כ למה צוית למחות את זכר עמלק, וא\"ת בדין הוא, א\"כ למה בא אדה\"ר על כל בהמה וחיה, וא\"ת בדין א\"כ למה צוית להביא בכורים ע\"כ. והוא פלאי. וזקיני הקדוש מאריך לפרש קושית מה\"ש בדרך דרוש כדרכו בקודש ומסיים ע\"כ ביארתי קושית מלאכי השרת, אבל צדיק ה' בכל דרכיו ודאי יש לו תירוץ על קושיתם וכו', וא\"כ ממילא דא\"ל אמונה ואין עול עכ\"ל. ולא ביאר היאך מתורצת קושית מלאכי השרת, וצ\"ב.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 223,
      "char_length": 520,
      "timestamp": "2025-02-06T19:20:51.350617"
    },
    {
      "id": "mishpatim_p224",
      "text": "ונראה לפרש דברי המדרש פליאה דהנה איתא בגמרא (קידושין כ' ע\"א) ת\"ר אם בגפו יבא בגפו יצא בגופו נכנס בגופו יצא ר' אליעזר בן יעקב אומר יחידי נכנס יחידי יצא מאי בגופו נכנס בגופו יצא אמר רבא לומר שאינו יוצא בראשי אברים כעבד וכו' מאי יחידי יצא אמר ר' נחמן בר יצחק הכי קאמר יש לו אשה ובנים רבו מוסר לו שפחה כנענית אין לו אשה ובנים אין רבו מוסר לו שפחה כנענית, ע\"כ. ופסק הרמב\"ם ז\"ל (פ\"ג מה' עבדים ה\"ד) כר' אליעזר בן יעקב וכן רש\"י בנימוקי התורה פירש כראב\"י. והקשה הר\"ר אליה מזרחי ז\"ל דלפי\"ז מנ\"ל לרש\"י לפרש לקמן, עה\"פ אם אדוניו יתן לו אשה, מכאן שהרשות ביד רבו למסור לו שפחה כנענית וכו', ע\"כ, דילמא חובה היא למסור לו שפחה כנענית, שהרי תיבת אם מתפרשת גם לחובה, כמו (שמות כ\"ב) אם כסף תלוה את עמו, והגם שמקורו הוא מהמכילתא, וז\"ל אם אדוניו יתן לו אשה רשות, או אינו אלא חובה, ת\"ל אם בגפו יבא רשות ולא חובה דברי ר' ישמעאל, מ\"מ יקשה לדעת רש\"י ז\"ל שדורש אם בגפו כראב\"י, לומר שאם אין לו אשה ובנים אין רבו מוסר לו שפחה כנענית, א\"כ לא אייתר אם בגפו למידרש מיניה שהוא רשות ולא חובה, ואיכא למימר דבאין לו אשה ובנים אסור למסור לו שפחה כנענית, וביש לו אשה ובנים חובה הוא עכת\"ד הרא\"ם ז\"ל. ויש מתרצים דעת רש\"י ז\"ל, דמסברא קאמר דרשות הוא ולא חובה, כיון דאין לנו הכרח לדרוש דחובה הוא למסור לו שפחה כנענית, ולדבריהם קשה אמאי איצטריך ר' ישמעאל במכילתא ללמוד מקרא דאם בגפו דרשות הוא ולא חובה, כיון דמסברא ידעינן כן.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 224,
      "char_length": 1281,
      "timestamp": "2025-02-06T19:20:51.626447"
    },
    {
      "id": "mishpatim_p225",
      "text": "ולי נראה לתרץ דעת רש\"י בפשיטות, דס\"ל דאי אפשר שיהיה הפרש גדול כ\"כ בין אין לו אשה ובנים ליש לו אשה ובנים וכיון דסבר רש\"י כראב\"י דבאין לו אשה ובנים אסור למסור לו שפחה כנענית, די לנו אם נאמר דביש לו אשה ובנים הוא רשות, שאם נאמר דחובה הוא למסור לו, יהיה המרחק ביניהם מן הקצה אל הקצה, אמנם ר' ישמעאל לא ס\"ל לאסור למי שאין לו אשה ובנים למסור לו שפחה כנענית, אלא רשות הוא למסור לו, וא\"כ הוה אמינא דביש לו אשה ובנים חובה הוא למסור לו, דאין הפרש גדול בין רשות לחובה, ע\"כ איצטריך קרא דאם בגפו, לומר דאף ביש לו אשה ובנים רשות הוא ולא חובה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 225,
      "char_length": 528,
      "timestamp": "2025-02-06T19:20:52.242107"
    },
    {
      "id": "mishpatim_p226",
      "text": "והנה חתרו המפרשים למצוא טעם לדברי ראב\"י דס\"ל אם אין לו אשה ובנים אין רבו מוסר לו שפחה כנענית, דאדרבה איפכא מסתברא כי ביש לו אשה ישראלית ובנים יאסר לתת לו כנענית, כיון דיש לו כבר ישראלית, ובאין לו אשה ובנים סברא היא שמותר לתת לו כנענית. ובעל הלבושים בספרו לבוש האורה נתן טעם לדבר, וז\"ל דמשום שכשיש לו אשה שאפשר לו לקיים פריה ורביה באשתו הישראלית, לא הקפידה התורה אם אדוניו יתן לו אשה להוליד גם עבדים. אבל אם אין לו אשה שאינו מקיים פריה ורביה. לא התירה התורה לאדון לתת לו שפחה להוליד עבדים, כי העבדים לא יהיו מיוחסים אחריו. שעבד אין לו יחוס, והרי לא יקיים זה מצות פריה ורביה, ולא לתוהו בראה, עכ\"ל. ולכאורה עדיין לא מצאנו בזה טעם מספיק לאסרו בשפחה כנענית, כי לחששת שלא יקיים פ\"ו די שנזהיר לעבד שאינו מקיים פ\"ו בבניו אשר יולדו לו מן הכנענית וחובה עליו לישא גם ישראלית ולקיים פ\"ו, ולמה אסרה התורה ליתן לו שפחה כנענית.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 226,
      "char_length": 812,
      "timestamp": "2025-02-06T19:20:52.536511"
    },
    {
      "id": "mishpatim_p227",
      "text": "ונראה לפרש כונת הלבוש, כי הקפידה תורה שלא תהיה ביאתו הראשונה בשפחה כנענית שלא לשם מצות פ\"ו, לכן אם יש לו אשה ישראלית ובנים, הרי כבר קיים המצוה ומותר למסור לו שפחה כנענית, אמנם לטעם זה יש לחקור באם היו לו אשה ובנים, וקיים מצות פ\"ו, ואח\"כ נתאלמן אם מותר למסור לו שפחה כנענית, כיון דעיקר הקפידא הוא שיקיים תחלה מצות פ\"ו, והרי כבר קיים. וצ\"ע. ועיין במשנה למלך (פ\"ג מה' עבדים ה\"ד) שנסתפק בזה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 227,
      "char_length": 387,
      "timestamp": "2025-02-06T19:20:52.941662"
    },
    {
      "id": "mishpatim_p228",
      "text": "והגור אריה נתן טעם כי אם יש לו אשה ישראלית ובנים, לא חששה התורה שיאמר העבד ככלות שש השנים אהבתי וגו' את אשתי השפחה, כי יחפוץ לצאת לחירות באהבתו את אשתו הישראלית ובניו, אבל אם אין לו אשה ובנים אסרה התורה למסור לו שפחה כנענית, פן אמר יאמר העבד אהבתי וגו' את אשתי השפחה עכ\"ד. וגם על דבריו יש להקשות קצת, דהרי רש\"י פירש על הפסוק ויצאה אשתו עמו, וכי מי הכניסה שתצא, אלא מגיד הכתוב שהקונה עבד עברי חייב במזונות אשתו ובניו א\"כ גם ביש לו אשה ובנים איכא למיחש שיאמר אהבתי את אשתי השפחה, שהרי גם אשתו הישראלית ובניו הם אתו עמו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 228,
      "char_length": 517,
      "timestamp": "2025-02-06T19:20:53.160733"
    },
    {
      "id": "mishpatim_p229",
      "text": "אמנם מדברי בעלי התוספות פ' זו, נמצינו למדים טעם נוסף לדבר וז\"ל והטעם הוא שכשהוא נשוי ישראלית אינו נמשך אחר השפחה אבל כשאינו נשוי יהיה נמשך אחריה, ע\"כ. ונראה לי להוסיף נופך ולהסביר כונתו, דהנה כלל גדול הוא שבכל מקום המיעוט בטל ברוב, ועל כן ביש לו אשה ישראלית התירה התורה למסור לו שפחה כנענית, כי אין לחוש פן יעלה ביד השפחה להטות לבו מדרכי ה', לעבוד אלהי נכר, כי יעמדו כנגדה הוא ואשתו הישראלית, ותבטל דעת השפחה ברוב, אבל אם אין לו אשה ישראלית, חיישינן פן תסיר את לבו מאחרי ה' על כן אסרה עליו תורה לשאת שפחה כנענית ולפי\"ז יש לפשוט האיסתפקתא הנ\"ל באם היתה לו אשה ישראלית ומתה אם מותר הוא בכנענית, כי לפי סברא זו אין למסור לו שפחה כנענית אלא א\"כ אשתו הישראלית אתו עמו, כי אז תתבטל דעת השפחה ברוב.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 229,
      "char_length": 691,
      "timestamp": "2025-02-06T19:20:53.427644"
    },
    {
      "id": "mishpatim_p230",
      "text": "אמנם בעיקר הדבר עדיין צ\"ב, מדוע התירה תורה כאן איסור לא יהיה קדש בבני ישראל, כדכתיב אם אדוניו יתן לו אשה שאם יש לו אשה ובנים מותר למסור לו שפחה כנענית. ונראה שהענין הוא כעין מה שמצינו ביפת תואר שהותרה בשעת מלחמה, והקשה האה\"ח הקדוש (פ' תצא) למה יצו ה' כדברים האלה לטמא האדם עצמו בבת אל נכר וכו' ותירץ על פי מה שאמרו ז\"ל שבחטא אדה\"ר נשבו כמה נשמות יקרות ביד הסט\"א וכו' תמצא נשמה טהורה דבוקה בנשמה טמאה ואין כח בטהורה להעלות הטמאה להיטיב והיא מונחת שם עד עת דרור וכו' ובאמצעות היותו עוסק במצוה יגלה ה' את עיניו להכיר באשת גוי שיש בה יפ\"ת, והיא הנשמה הקדושה הנקראת יפ\"ת וכו', ותיכף יקנה מקומו חלק הטוב בישראל ויזכה בו וכו' עכ\"ל האה\"ח הקדוש. וכעין זה יש לומר כאן, כי פן ואולי שפחה זו דבוקה בה נשמה קדושה, וע\"י שיקח אותה העבד לאשה, יוציא בלעה מפיה, והתירה לו התורה לנשאה כדי שלא לדחות בידים את הנשמות הקדושות שאולי הם טמונות בה, ברם באין לו אשה ובנים לא התירה לו התורה לנשאה, מן הטעמים שכתבנו לעיל",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 230,
      "char_length": 891,
      "timestamp": "2025-02-06T19:20:53.771067"
    },
    {
      "id": "mishpatim_p231",
      "text": "ועתה נבא לביאור המדרש פליאה, בהקדם מה דאיתא בגמ' (סנהדרין צ\"ט ע\"ב) ואחות לוטן תמנע מאי היא, תמנע בת מלכים הואי דכתיב אלוף לוטן אלוף תמנע וכו' בעיא לאיגיורי באתה אצל אברהם יצחק ויעקב ולא קבלוה הלכה והיתה פלגש לאליפז בן עשיו אמרה מוטב תהא שפחה לאומה זו ולא תהא גבירה לאומה אחרת נפק מינה עמלק דצערינהו לישראל מ\"ט דלא איבעי להו לרחקה (ופירש\"י מוטב שאהיה שפחה לאומה זו, לבני אברהם יצחק ויעקב שהן יראי שמים ולא אהיה גברת לאומה אחרת. דלא איבעי לרחקה. מתחת כנפי השכינה שהיה להם לגיירה). והנה לפי זה לכאורה בדין בא עמלק לצער את ישראל, וטענה נכוחה בפיו, שבא לתבוע עלבון אמו שלא רצו האבות להכניסה תחת כנפי השכינה, וא\"כ למה מגיע לו עונש חמור כ\"כ למחות את שמו מתחת השמים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 231,
      "char_length": 658,
      "timestamp": "2025-02-06T19:20:54.200680"
    },
    {
      "id": "mishpatim_p232",
      "text": "וזו היתה טענת מלאכי השרת בשעה שאמר הקב\"ה אם בגפו יבא וגו' שמשם למדנו דאם אין לו אשה ובנים אין רבו רשאי למסור לו שפחה כנענית, הרי שיש טעם לאסור את הדבר, ואעפי\"כ ביש לו אשה ובנים התירה לו התורה שפחה כנענית, וע\"כ לומר שהטעם הוא שלא רצתה התורה לרחק את חלקי הקדושה הנטמעים בקרב האומות, ואעפ\"י שהעבד הזה הוא בעל עבירה שהרי במכרוהו ב\"ד בגנבתו הכתוב מדבר, ורחוק הוא שיוכל להוציא בלעה מפיה, התירתה התורה אף לצד רחוק כזה, כדי שלא לדחות בידים את הניצוצות הקדושים, וא\"כ ק\"ו שלא היה להם לאבות הקדושים לרחק את תמנע. שרצתה להתגייר לש\"ש, כפירש\"י שאמרה מוטב אהיה שפחה לאומה זו שהם יראי שמים וא\"כ למה צוית למחות את זכר עמלק, שהרי בא בדין לצער את ישראל, כי תבע עלבון אמו שלא קרבוה האבות.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 232,
      "char_length": 668,
      "timestamp": "2025-02-06T19:20:54.560048"
    },
    {
      "id": "mishpatim_p233",
      "text": "אמנם לפי האמת קושיא זו ליתא, כי טעם האבות הקדושים שריחקוה. כי הם חזו ברוח קדשם שעתיד לצאת ממנה עמלק, כמו שמצינו שהיה זה דבר ידוע שעתיד עמלק להוולד כדכתיב (בראשית י\"ב) ויכו את כל שדה העמלקי וגו' פירש\"י עדיין לא נולד עמלק ונקרא ע\"ש העתיד, ועיין ברמב\"ן שם שהביא לשון המד\"ר עדיין לא נולד עמלק ואת אמרת את כל שדה העמלקי אלא מגיד מראשית אחרית וכו' עכ\"ל. שדבר זה היה ידוע לאבות הקדושים שעתיד עמלק להולד, ולכן לא רצו אברהם יצחק ויעקב לקבלה אף שאם היו מקבלים אותה לא היה עמלק מצער את ישראל, כי חששו שאם יהיה עמלק נולד בקרב ישראל יהיה כח הטומאה מתגבר בישראל יותר ויותר, כי עמלק הוא שורש הרע והס\"מ הוא שרו של עמלק וכן מבואר בתיקוני זוהר כי ג' גליות יש והגלות בין הע\"ר הוא הקשה ביותר, ואיתא בזה\"ק (בראשית כ\"ה ע\"א) חמש מינין אנון בע\"ר ואינון נפילים גבורים ענקים רפאים עמלקים, והגם שנולדו בקרב ישראל ביאר באור החמה דהכונה שנשמותיהם מזרע עמלק. ולצד זה מאנו האבות הקדושים לקבלה, אף על פי שהתאמצו בכל כחם לגייר גרים, דכתיב (בראשית י\"ב) ואת הנפש אשר עשו בחרן, וגם לא חששו פן תטה אותם מדרך ה' כי אצל האבות הקדושים לא היה שייך חשש זה, מ\"מ חששו על הדורות הבאים שיזיק להם מאד אם יולד עמלק בין ישראל, ובזה בטלה טענתם של מלאכי השרת, כי אין להביא ראיה ממה שהתירה התורה למסור לו שפחה כנענית, שאין לרחק את הניצה\"ק בידים, כי שאני התם דאיכא טעמא רבה למילתא, כי עיניהם לנוכח הביטו על העתיד שיצא ממנה עמלק, וא\"כ בדין הוא שלא קבלוה, כי לא רצו שיתערב שרש נתעב זרע עמלק בקרב ישראל, נמצא אשר לא בדין ציער עמלק את ישראל, וע\"כ צותה התורה למחות את שמו מתחת השמים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 233,
      "char_length": 1425,
      "timestamp": "2025-02-06T19:20:54.906656"
    },
    {
      "id": "mishpatim_p234",
      "text": "היוצא מזה כי אף אם אמנם בשעת מעשה כשריחקוה האבות הקדושים היה קצת פגם בדבר ונגרם לה עול: כדמוכח לישנא דגמרא לא איבעי להו לרחקה, וע\"י כך סבלו ישראל את כל הצער מעמלק, אבל לאמתו של דבר כדין עשו האבות הקדושים שלא קרבוה, כי עיניהם שפיר חזו אשר עמלק עתיד לצאת ממנה, ותרוייהו אמת, כי היה קצת פגם במה שלא קבלוה, ומצוה נמי עשו כי כונתם היתה לשמים, שלא יולד עמלק בקרב בני ישראל, והכריעו האבות הקדושים כי מוטב שלא לקבלה אף שיש פגם בדבר, כי המצוה שעשו במה שלא קבלוה גדולה יותר מן העברה שבה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 234,
      "char_length": 477,
      "timestamp": "2025-02-06T19:20:55.630241"
    },
    {
      "id": "mishpatim_p235",
      "text": "אך אעפי\"כ סבלו ישראל צער בשל הפגם שהיה בדבר ומצינו דוגמא כעין זה דאיתא בגמ' (בבא קמא צ\"א ע\"ב) תניא אמר ר\"א הקפר ברבי מה ת\"ל וכפר עליו מאשר חטא על הנפש (במדבר ו) וכו', אלא שצער עצמו מן היין ע\"כ. וכתבו התוס' (ד\"ה אלא) לכאורה משמע דבנזיר טהור נמי קאמר דנקרא חוטא וכו' ותימה דבפ\"ק דנזיר פריך נזירות מילתא דעבירה ואמרינן ליה נאה ומשני וכו' אבל נזיר טהור לאו חוטא הוא ואור\"ת דהא דקאמר דלא הוי חוטא היינו שמצוה גדולה מן העבירה דמצוה לידור כדאמר הרואה סוטה בקלקולה יזיר עצמו מן היין ומ\"מ יש קצת חטא מידי דהוי אמתענה תענית חלום בשבת שקורעין לו גזר דינו ונפרעין ממנו תענית של שבת מאי תקנתיה ליתב תענית לתעניתו שהמצוה גדולה מן העבירה, עכ\"ל התוס'. וכמו כן עשו האבות הקדושים שריחקו את תמנע ואעפ\"י שהיה קצת פגם בדבר מ\"מ המצוה היתה גדולה יותר.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 235,
      "char_length": 728,
      "timestamp": "2025-02-06T19:20:55.910956"
    },
    {
      "id": "mishpatim_p236",
      "text": "אמנם מצד ההלכה יש להסתפק בדבר כזה שלשעתו הוא טוב, ולאחר זמן עתיד לצמוח ממנו קלקול והפסד, מה דינו, אי נימא כי עלינו להביט באשר הוא שם, וכיון שלשעתו הוא דבר טוב למצוה יחשב, א\"ד כיון שבסוף עתיד לצאת ממנו דבר רע, צריך להמנע ממנו, כי צריך לראות את הנולד וכמו שעשו האבות הקדושים, כי אף שלשעתו היה דבר טוב לקבלה ולהכניסה תחת כנפי השכינה, מ\"מ ריחקוה על שעתיד לצאת ממנה עמלק, וספק כעין זה מצינו בשו\"ת חכ\"צ סי' ק\"ו שהביא מתשובות הרדב\"ז (ח\"ד סי' אלף פ\"ז) באחד שהיה חבוש בבית האסורים ונתנו לו רשות לצאת פעם אחת בשנה איזה יום עליו לבחור כדי שיוכל לשמוע קריאת התורה אם הקרוב קרוב יותר או המקודש יותר עיי\"ש.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 236,
      "char_length": 592,
      "timestamp": "2025-02-06T19:20:56.259341"
    },
    {
      "id": "mishpatim_p237",
      "text": "ולכאורה יש לפשוט ספק זה, ממה דאיתא בגמ' (ברכות י' ע\"א) הביא הקב\"ה יסורין על חזקיה ואמר לו לישעיה לך ובקר את החולה וכו' כי מת אתה ולא תחיה וכו' א\"ל מאי כוליה האי א\"ל משום דלא עסקת בפריה ורביה אמר ליה משום דחזאי לי ברוח הקודש דנפקי מנאי בנין דלא מעלי א\"ל בהדיה כבשי דרחמנא (פירש\"י סתרים דהקב\"ה) למה לך מאי דמפקדת איבעי לך למיעבד ומאי דניחא קמיה קב\"ה ליעביד וכו', עכ\"ל הגמרא. הרי שנענש חזקיה על שלא נשא אשה, אף שראה שיצאו ממנו בנים דלא מעלי, וא\"כ ראיה לכך שאין להביט על מה שעתיד להיות, ואין לו לאדם אלא מה שלפניו, וא\"כ לכאורה חזרה הקושיא אמאי רחקו האבות את תמנע, שהרי לא היה להם להביט על העתיד, רק כיון שבשעתו היה מצוה בדבר, היה להם לגיירה, אולם ראיה זו יש לדחות מב' טעמים, א' כי חזקיה היה מחויב לקיים מ\"ע דפריה ורביה מצד הדין, ולכן אף שראה ברוה\"ק שיצאו ממנו בני דלא מעלי, א\"א לדחות מצות עשה ע\"י רוה\"ק ונבואה, משא\"כ האבות שהיו קודם מ\"ת, ולא היו מחויבים לגיירה, שפיר רחקוה, כי ראו ברוח קדשם שעתיד עמלק לצאת ממנה, הב' כי הרי מנשה עשה תשובה אח\"כ, ולכן נענש חזקיהו כי היה מחויב לעסוק בפ\"ו, כיון שסוף כל סוף יעשה בנו תשובה, אבל האבות הקדושים שפיר רחקו את תמנע עבור שעמלק עומד לצאת ממנה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 237,
      "char_length": 1078,
      "timestamp": "2025-02-06T19:20:56.574630"
    },
    {
      "id": "mishpatim_p238",
      "text": "אולם לכאורה יש להביא ראיה ממצות ביכורים כי אין על האדם להביט על העתיד, אלא באשר הוא שם, בהקדם מה שביארנו הפסוק בריש פ' כי תבא והיה י תבא אל הארץ וגו', ודקדקו המפרשים מדוע במצוה זו כתיב ''והיה\" כי תבא דהול\"ל כי תבא אל הארץ ובספרי איתא עשה מצוה זו שבשבילה תכנס לארץ, והוא פלא. דבשלמא במצות שהם חובת הגוף ונוהגות גם בחו\"ל, שייך לומר עשה מצוה זו שבזכותה תכנס לארץ. אבל ביכורים שאין נוהגים אלא לאחר כיבוש וחילוק, ואז הרי ישראל כבר בארץ וא\"כ איך שייך לומר שבזכות מצוה זו יכנסו לארץ. ופירשנו על פי דברי הרמב\"ם ז\"ל (פ\"ד מה' ביכורים ה\"ג) וז\"ל, הגר מביא וקורא שנאמר לאברהם אב המון גוים נתתיך הרי הוא אב כל העולם כולו שנכנסין תחת כנפי שכינה ולאברהם היתה שבועה תחלה שירשו בניו את הארץ (פירוש וא\"כ יכול לומר אשר נשבעת לאבותינו לתת לנו) ע\"כ והקשה המשנה למלך שם תמיה לי אף שיכולים לומר אשר נשבעת לאבותינו, מ\"מ כיון שלא נטלו חלק בארץ אינם יכולים לומר אשר נתת לנו וכו', והרמב\"ם עצמו פסק בסוף הלכות מעשר שני דגרים אינם מתוודים מפני שאין להם חלק בארץ עכ\"ד. ומהר\"ם בן חביב בכפו\"ת תירץ דהחילוק הוא משום דגבי ביכורים נקט קרא לישנא דלעתיד, דכתיב אשר נשבעת לאבותינו לתת לנו, וכיון שכן יכול הגר לומר כן דאע\"ג דלא נטלו חלק בארץ מ\"מ לעתיד לבא יטלו הגרים נחלה בתוך בני ישראל, כדכתיב ביחזקאל פ' מ\"ז וכו', אבל גבי וידוי מעשר דכתיב אשר נתת לנו ה' וכו' אין הגר יכול לומר וידוי זה, כיון שלא נטל חלק בארץ עכ\"ד. נמצא כי פרשת ביכורים קאי על לעתיד לבא, ועפי\"ז אתי שפיר דכתיב והיה כי תבא, שיהיה לעתיד זמן שתבא אל הארץ וזו כוונת הספרי עשה מצוה זו שבשבילה תכנס לארץ, הכוונה שע\"י שתקיימו בארץ מצות ביכורים תזכו להכנס לארץ לעתיד לבא.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 238,
      "char_length": 1491,
      "timestamp": "2025-02-06T19:20:57.135555"
    },
    {
      "id": "mishpatim_p239",
      "text": "אמנם עדיין יש להבין מה נשתנתה פ' ביכורים מכל פרשיות התורה המדברות בביאת הארץ בהוה, ומדוע בפרשת ביכורים הכתוב מדבר על לעתיד. ונראה לפרש בהקדם מה שדקדקו המפרשים שם על מאמר הכתוב ובאת אל הכהן וגו' ואמרת אליו הגדתי היום לה' אלקיך כי באתי אל הארץ אשר נשבע ה' וגו'. ולכאורה מה צורך בסיפור דברים אלו, חדא הרי זה דבר הנראה לעינים כי בא אל הארץ, ועוד שהרי אח\"כ הוא כופל זאת באריכות יתר באמרו ויביאנו אל המקום הזה ויתן לנו את הארץ הזאת, ופירשו כי זו הוא הודאה על ביאת הארץ שמיד בביאתו אל הכהן מתחיל בהודאה להשי\"ת שהביאנו אל הארץ אשר נשבע לאבותינו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 239,
      "char_length": 537,
      "timestamp": "2025-02-06T19:20:57.871283"
    },
    {
      "id": "mishpatim_p240",
      "text": "והנה בפ' וארא כתיב לכן אמור לבני ישראל אני ה' והוצאתי אתכם מתחת סבלות מצרים והצלתי וגו' וגאלתי וגו' ולקחתי וגו'. ואמרו חז\"ל (ירושלמי פסחים פ\"י ה\"א וב\"ר פ' פ\"ח) כי נתקנו ארבע כוסות בליל פסח כנגד ארבע לשונות של גאולה הכתובות כאן ולכאורה קשה שהרי כתיב שם והבאתי אתכם אל הארץ וגו' שהוא לשון חמישי של גאולה, וא\"כ הוה להו לתקן חמשה כוסות. ונ\"ל עפ\"י מ\"ש האה\"ח הקדוש בפ' ראה עה\"פ ראה אנכי וגו' וז\"ל עוד יתבאר כל הכתוב עז\"ה לפי שאמר בסמוך כל מקום אשר תדרוך כף רגלכם לכם יהיה, לזה אמר להם ראה אנכי נותן לפניכם היום ברכה וקללה, פי' יש בנתינה זו ברכה, ויש בה קללה וחזר ופי' את הברכה אשר תשמעון פי' אם תשמעון תהיה נתינה זו לכם לברכה, ואם לא תשמעון אין זו לכם כי אם קללה שבאמצעותה יתקנאו בכם האומות ויאבדו אתכם ממנה בנקמה גדולה וכו' עכלה\"ק. הרי כי ביאת הארץ יכולה להיות ח\"ו קללה ולא ברכה, והיפה תואר פ' מקץ האריך להקשות מה צורך היה בבנין שני המקדשות כיון שאח\"כ נחרבו ונגרמו צרות גדולות לישראל, ומוטב היה שימתינו על בנין המקוה, ואא\"ז בישמח משה פ' תצוה תירץ קושיתו באריכות ע\"ד משל עיי\"ש, ותוכן דבריו כי לא יכלה הארץ הגשמית לסבול קדושת הבית השלישי, ע\"כ הוצרך הדבר כי בבנין ב' המקדשות נשרש כח הקדושה בארץ ויוכל בנין המקוה להתקיים לעולם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 240,
      "char_length": 1118,
      "timestamp": "2025-02-06T19:20:58.145114"
    },
    {
      "id": "mishpatim_p241",
      "text": "היוצא מדבריהם הוא כי תכלית ביאת הארץ הוא לעת\"ל, והביאות הראשונות היו רק הכנה אל הביאה העתידה, וע\"כ שפיר מובן למה לא תקנו כוס חמישי כנגד והבאתי אתכם אל הארץ, כי איך אפשר להודות ולשבח על דבר שאינו טוב בתכלית, אדרבה יגרום רעות וצרות לישראל ע\"י החרבנות. ולפי\"ז קשה איך אפשר להודות בהבאת ביכורים על ביאת הארץ דבר שאינו טוב לגמרי, ויצאו ממנו רעות וצרות לישראל, ובפרט כי הבאת ביכורים אינה אלא מן העצרת ועד החג שהוא זמן שמחה, ואם הביא אח\"כ אינו קורא, ואז עדיין לא היתה השמחה בשלמות, כיון שידעו שעתיד המקדש להחרב, וכמו שדרשו חז\"ל (נזיר ל\"ב ע\"ב) דידעי אימת יחרב מקדש ראשון ומקדש שני, דכתיב (דניאל ט) שבועים שבעים נחתך על עמך ועל עיר קדשך (ופירש\"י כשהגלו נבוכדנצר בחורבן בית ראשון וכו' שבעים שמיטין עתידין לבא מכאן ועד חרבן בית שני והם שבעים שנה שהיו בבבל וד' מאות ועשרים שהיו בבית שני הרי ע' שמיטין אלמא ידעי לאימת חרב) וכן כתיב (בעזרא ג') ורבים מהכהנים והלוים וראשי האבות הזקנים אשר ראו את הבית הראשון וגו' בוכים בקול גדול (פירש\"י כשהיו רואים בנין בית זה היו בוכים מתוך שהיו זוכרים אותו בנין גדול של בית ראשון) א\"כ לא היתה השמחה בשלמות וא\"כ למה נצטוו בהבאת ביכורים, שעיקרה הודאה על ביאת הארץ, כיון שהשמחה בביאת הארץ אינה בשלימות. אמנם עפי\"מ שהקדמנו מובן שפיר, כי הבאת ביכורים הוא הודאה על ביאת הארץ לעתיד, כמו שפירשנו דלכן כתיב והיה כי תבא לשון עתיד, וכן אמרו ז\"ל (ויקרא רבה פי\"א) והיה לשון שמחה בכל מקום, כי אז ימלא שחוק פינו, ותהיה שמחה שלמה, כי ידעו כולם אשר הבית השלישי יעמוד לנצח ולא ישוב לשממה עוד.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 241,
      "char_length": 1395,
      "timestamp": "2025-02-06T19:20:58.688126"
    },
    {
      "id": "mishpatim_p242",
      "text": "ועתה נבא לבאר המשך המדרש פליאה, בהקדם עוד מה דאיתא במד\"ר (דברים פ\"ח) וכו' וא\"ת לרעתכם נתתי לכם את התורה, לא נתתי אותה לכם אלא לטובתכם, שמלאכי השרת נתאוו לה ונעלמה מהן שנא' (איוב כח) ונעלמה מעין כל חי וכו' ומעוף השמים נסתרה אלו המלאכים שנאמר (ישעי' ו) ויעף אלי אחד מן השרפים וכו' ע\"כ. הרי שאין מלה\"ש משיגים את התורה וכ\"ש מה שהחכמים מחדשים בכל דור ומכריעים להלכה, שזו היא תורה שבע\"פ שניתנה למשה מסיני, ודאי שאין המלאכים משיגים, אבל זאת שעתידין ישראל להיות בגלות ידעו גם המלאכים, ואפי' עשיו ידע זאת שעתידין ישראל לגלות, כמבואר במד\"ר פ' וישלח שהדין ודברים בינו לבין יעקב היה על זמן הגלות, וכן פירש העקידת יצחק על הפסוק (בראשית לג) נסעה ונלכה ואלכה לנגדך, בשוה לך, שרצה ליתן ליעקב מלכות בזמן הגלות, והשיב לו יעקב אע\"ה ודפקום יום אחד למהר את הגאולה קודם הזמן ומתו כל הצאן, עי\"ש. הרי שידע עשיו שישראל ילכו בגולה וא\"כ כ\"ש שהמלאכים ידעו זאת.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 242,
      "char_length": 832,
      "timestamp": "2025-02-06T19:20:59.366397"
    },
    {
      "id": "mishpatim_p243",
      "text": "ובהקדמות אלו יבוארו דברי המדרש פליאה כמין חומר בשעה שאמר הקב\"ה אם בגפו יבא בגפו יצא וגו', וכמו שדרשו ז\"ל מהכא. שאם אין לו אשה ובנים אין רבו מוסר לו שפחה כנענית. וממה שאסרה תורה למסור לו שפחה כנענית, נראה כי איכא טעמא רבה לאסור את הדבר, ואעפי\"כ התירה התורה היכא שיש לו אשה ובנים למסור לו שפחה כנענית וצריך לומר כמו שנתבאר כי הטעם שהתירה התוה\"ק איסור לא יהיה קדש הכא, שלא לדחות בידים את הניצוצות הקדושות שאולי הם טמונות בשפחה זו, וא\"כ לכאורה שלא בדין עשו האבות הקדושים שלא אבו לגייר את תמנע שבאת להתגייר לש\"ש ורחקו בידים את חלקי הקדושה שאפשר יהיו טמונים בה, וענשם היה שיצא ממנה עמלק שציער את ישראל, וא\"כ בא עמלק בטענה נכונה שציער את ישראל, כי בא לתבוע עלבון אמו שרחקוה האבות הקדושים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 243,
      "char_length": 681,
      "timestamp": "2025-02-06T19:20:59.889711"
    },
    {
      "id": "mishpatim_p244",
      "text": "וזו היתה טענת מלה\"ש א\"כ למה צוית למחות את זכר עמלק, וא\"ת בדין הוא פירוש שעשו האבות הקדושים כדין במה שהרחיקו את תמנע מכלל ישראל, כי אף שבשעת מעשה היתה כוונתה לשמים והיה ראוי לקרבה, מ\"מ כיון שהם ראו ברוח קדשם שעתיד עמלק לצאת ממנה ולא רצו שיולד רשע זה בקרב ישראל, ובחרו יותר לרחק את חלקי הקדושה הטמונים בקרב תמנע, וא\"כ כיון שהאבות הקדושים כדין עשו במה שלא קבלו את תמנע, שוב לא קשה, למה צוית למחות את זכר עמלק, כי אין טענת עמלק טענה שלא קבלו את אמו להכניסה תחת כנפי השכינה, וא\"כ שלא בדין רדה את ישראל וציערם, וגמולו ישולם לו למחות את שמו מתחת השמים, ושוב אין קושיא מפסוק אם בגפו יבא וגו' על ציווי מחיית עמלק, א\"כ למה בא אדה\"ר על כל בהמה וחיה, פירוש כי קשה להו קושיא אחרת על הכתוב אם בגפו יבא בגפו יצא, והוא שהרי מפסוק זה נמצינו למדים כי לא התירה התורה שפחה כנענית למי שאין לו אשה ובנים, ואעפ\"כ התירה התורה למי שיש לו אשה ובנים לשאת שפחה כנענית, וצ\"ל שהטעם הוא כמ\"ש הלבוש, כי כיון שאין לו אשה ובנים הקפידה תורה שלא תהיה ביאתו הראשונה בשפחה, לפי שאין הוא מקיים בבנים אשר יוולדו ממנה מצות פריה ורביה, ואך במי שיש לו אשה ובנים שכבר קיים פ\"ו, התירה תורה לישא שפחה כנענית, וא\"כ קשה למה בא אדה\"ר על כל בהמה וחיה, כי ודאי שלא היתה ביאתו לשם קיום מצות פ\"ו שהרי אינם יכולים להתעבר מבני אדם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 244,
      "char_length": 1176,
      "timestamp": "2025-02-06T19:21:00.231712"
    },
    {
      "id": "mishpatim_p245",
      "text": "והנה הגם שיש פלוגתא בין המפרשים בפירוש המאמר הלז עי' במהרש\"א שם (יבמות ס\"ג ע\"א) שהביא דבריהם דיש סוברים שלא בא ממש רק התבונן בהם למצוא לו זוג, עכ\"פ אף לדעה זו קשה, אם הקפידה התורה הקדושה שביאה ראשונה תהיה לשם מצות פ\"ו, איך התבונן בהם כלל אלא ע\"כ לומר כי אין הטעם במה שהקפידה תורה שלא למסור שפחה כנענית למי שאין לו אשה ובנים, משום שהקפידה תורה בביאה ראשונה שתהיה לשם מצות פריה ורביה כתירוץ הלבוש, אלא חדא מתרי טעמי אחריני אית ביה, משום שחששה תורה שמא לא ירצה לצאת בסוף שש ויאמר אהבתי וגו', כמ\"ש הגוו\"א ז\"ל, או משום שיש לחוש שאשתו השפחה תטה את לבו מאחרי ה' ולא יוכל להתגבר כנגדה, משא\"כ כשיש לו אשה ישראלית אין חשש זה כמו שנתבאר.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 245,
      "char_length": 626,
      "timestamp": "2025-02-06T19:21:00.853159"
    },
    {
      "id": "mishpatim_p246",
      "text": "ותוכן קושיתם של מה\"ש היא להוכיח כי דבר אשר הוא טוב אך לשעתו, ולאחר זמן יכול לצאת ממנו קלקול ועיוות, אין להביט אל הטוב ההוא, ומוטב להמנע ממנו מחשש הקלקול העתיד לצאת ממנו, ויש להם שני עדים המסייעים לכך, חדא ממה שאסרה תורה למסור לעבד עברי שפחה כנענית באין לו אשה ובנים. כי חששה תורה פן לא ירצה לצאת חפשי ושמא תטה לבו מאחרי ה', ועל כרחך חדא מהני תרי טעמא אית ביה דליכא למימר כטעם הלבוש שהקפידה תורה שביאה ראשונה תהיה לקיום מצות פ\"ו שא\"כ יקשה למה בא אדם הראשון על כל בהמה וחיה ולא הקפיד שביאתו ראשונה תהי' לקיום מצות פ\"ו. ועד השני לכך כי על האדם להביט על סוף הדבר ותכליתו, ממה שצותה תורה למחות זכר עמלק, אף שלכאורה היה עמלק בא בטענה שרחקו האבות הקדושים את אמו כאשר באה להתגייר, ועל כרחך לומר כי אין טענתו טענה והאבות הקדושים כתורה עשו, כי חששו לקלקול שיכול לצמוח מלידת עמלק בקרב ישראל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 246,
      "char_length": 780,
      "timestamp": "2025-02-06T19:21:01.184394"
    },
    {
      "id": "mishpatim_p247",
      "text": "ומכח ב' הוכחות חותכות אלו הקשו מלאכי השרת וא\"ת בדין הוא א\"כ למה צוית להביא ביכורים ופירושו שאם בדין עשה אדה\"ר שבא על כל בהמה וחיה וטעם שאסרה תורה למסור שפחה כנענית למי שאין לו אשה ובנים משום שהביטה תורה על תכלית הדבר וסופו, ומכח זה ראיה שהאבות הקדושים כדין עשו שלא קרבו את תמנע ע\"ש שעתיד עמלק הרשע לצאת ממנה, א\"כ למה צוית להביא ביכורים, שהרי הבאת ביכורים הוא להודות על ביאת הארץ, וכיון שלא ארכו ימי שבת ישראל על אדמתם ולבסוף גלו ממנה, ולא היתה השמחה בשלמות, א\"כ למה נצטוו להודות עליה, והרי על האדם להביט על סוף הדבר, ואף שראשיתה היה לטוב, מ\"מ כיון שאחריתה גלות וחורבן אין להודות על כך.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 247,
      "char_length": 585,
      "timestamp": "2025-02-06T19:21:01.568112"
    },
    {
      "id": "mishpatim_p248",
      "text": "אמנם קושיא זו היא רק לשיטת החולקים על הרמב\"ם וסוברים כי הגר מביא ואינו קורא שאינו יכול לומר לתת לנו. כי הם סוברים שהבאת ביכורים היא הודאה על ביאת הארץ בהווה, ועל כן נשארו מלה\"ש בקושיא לאלקינו ית\"ש, אבל על פי פסק הרמב\"ם ז\"ל שהגר מביא וקורא שיכול הוא לומר אשר נשבעת לאבותינו לתת לנו, כי הוא מודה ומשבח על ביאת הארץ לעתיד, א\"כ לא קשה שוב קושיית מלה\"ש שהרי ביאת הארץ לעתיד תהיה טוב נצחי שאין לו הפסק, אמנם פסק הלכה זו נעלם הוא ממה\"ש כמו שהקדמנו דברי המדרש ומעוף השמים נסתרה אלו המלאכים, שאין התורה מושגת למלאכים וכ\"ש פסקי ההלכות שמכריעים חכמי הדורות, אמנם זאת ידעו אף מלאכי השרת שהבית עתיד להחרב, כמ\"ש לעיל, ועל כן נשארו בקושיא לאלקינו על הבאת ביכורים, אמנם לפי האמת שהודאה זו היא על ביאת הארץ לעתיד סרה קושיתם, וצדיק ה' בכל דרכיו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 248,
      "char_length": 727,
      "timestamp": "2025-02-06T19:21:01.865075"
    },
    {
      "id": "mishpatim_p249",
      "text": "באופן אחר יש לבאר דברי המדרש פליאה הנ\"ל לפי חומר הנושא: וכאשר כתב ק\"ז הייטב לב זלה\"ה בהג\"ה (בסה\"ק ישמח משה בפירושו על המדרש הנ\"ל) כי שמע מפי קדשו של ק\"ז הישמח משה זלה\"ה, וכן נמצא בכי\"ק, שנתגלה לו בחלום, שמצוה גדולה לקרב הרחוקים בביאורים על הפליאות ומאן דמקרב אותם, אף בנגלה, רק שיהיה לבו לשמים, נעשה היחוד למעלה וכו', עכ\"ד הקדושים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 249,
      "char_length": 331,
      "timestamp": "2025-02-06T19:21:02.222256"
    },
    {
      "id": "mishpatim_p250",
      "text": "ונראה לבאר בהקדם מה שעלה ונסתפק הריב\"ש בתשובותיו בעבד כנעני שמרד ברבו והתחיל להתקוטט עמו, עד עלות חמת רבו, והפיל את שנו או סימא את עינו, מה נידייניה דיינא להאי דינא, אי נימא דכיון שהתחיל העבד בקטטה אין לשות אשם על רבו, על אשר הפיל שנו או סימא עינו. שהרי העבד הוא הגורם לכך, כי לולא מרד ברבו לא היה מכהו, או נימא לא שנא. וגם באופן כזה יוצא הוא לחרות. וכתב החתם סופר ז\"ל (בחידושיו עה\"ת פ' זו), כי יש לפשוט ספיקו של הריב\"ש מדברי הגמרא (ברכות דף ה' ע\"א) דיליף ר\"י יסורין ממרקין עוונותיו של אדם בק\"ו משן ועין ומה שן ועין שהם אחד מאבריו של אדם עבד יוצא בהן לחרות יסורין שממרקין כל גופו של אדם על אחת כמה וכמה ע\"כ. ודבר ידוע הוא כי מה שהקב\"ה מביא יסורין על האדם הוא בסבת החטאים, כי עוונותינו הטו כל אלה, ולא עביד קב\"ה דינא בלא דינא, ואעפי\"כ יליף בגמרא שהיסורין ממרקין עוונותיו של אדם בק\"ו משן ועין. הרי ראיה כי גם בעבד כנעני דינא הכי שאף אם העבד התחיל בקטטה וגרם בכך שרבו סימא את עינו וכו', לחפשי ישלחנו, עכת\"ד החת\"ס זלה\"ה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 250,
      "char_length": 916,
      "timestamp": "2025-02-06T19:21:02.415775"
    },
    {
      "id": "mishpatim_p251",
      "text": "ברם אכתי לא הונח לנו בדברי החת\"ס ז\"ל, ועדיין י\"ל כי ספק הריב\"ש במקומו עומד, דמה שהביא החת\"ס ראיה מדברי הגמרא איכא למידחי, דהנה לכאורה צ\"ב מה דיליף בגמרא שאדם יוצא לחרות ע\"י יסורין, בק\"ו משן ועין וכי מה יציאה לחרות שייכא גבי האדם, הכי יוצא הוא לחרות מלהיות עבדו של הקב\"ה, אתמהה. והרי\"ף בעין יעקב הוסיף להקשות, דאיך איכא למילף שאדם יוצא לחרות ע\"י יסורין, משן ועין, והלא דין שן ועין אינו נוהג אלא בעבד כנעני, ואיך ילפינן מינה שיצא איש הישראלי לחרות, ותירץ הרי\"ף ז\"ל כי ידוע הוא אשר עבדים אנחנו לה' אלקינו לעבדו ולשמור מצוותיו. וכל עת אשר האדם חי עלי אדמות הוא עומד בעבודתו וכיון שמת נעשה חפשי מן המצוות, שנאמר (תהלים פ\"ח) במתים חפשי וכו' והולך אל המנוחה ואל הנחלה, ומי שאינו עושה רצונו יתברך, נמשכת עבודתו גם לאחר מותו, כי הוא נמסר לדומה שרו של גיהנם, ונמצא עבד עולם דומה לעבודתו של הכנעני, דכתיב ביה לעולם בהם תעבודו. אף גם הוא אינו נעשה חפשי, והיה לעבד עולם, וכשבאים למרק עוונותיו של אדם ע\"י היסורין הללו, הרי באמת אותו אדם שיש לי עוונות וחטאים אינו נקרא עבד עברי, לצאת חפשי אחר מותו, אלא דומה לעבד כנעני כי היה ראוי להיות עבד עולם בחטאותיו, ולא יצא חפשי במיתתו, ומתוך היסורין שבאו עליו נתמרקו עוונותיו, ק\"ו מעבד כנעני, הראוי להיות עבד עולם, שיוצא לחרות בשן ועין, וכש\"כ בן אדם שחטא, והיה ראוי להיות עבד עולם עבור חטאותיו, שהיסורין שבאו על כל גופו, ממרקין עוונותיו, ופודין אותו מלהיות עבד עולם, ובמותו יצא חפשי אל המנוחה ואל הנחלה וכו' עכת\"ד, יע\"ש. אמנם דברי הרי\"ף ז\"ל דחוקים, שפירש כי עבדות האדם קאי על אחר פטירתו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 251,
      "char_length": 1413,
      "timestamp": "2025-02-06T19:21:02.908366"
    },
    {
      "id": "mishpatim_p252",
      "text": "ונראה ליישב האי דיליף בגמרא יסורין ממרקין עוונותיו של אדם בק\"ו מעבד כנעני בדרך פשוט, כי ידוע אשר מכל חטא אשר יחטא האדם נברא מזיק, כדאיתא במשנה (אבות פ\"ד מי\"א) העובר עברה אחת קונה לו קטיגור אחד, ופירש הר\"ע מברטנורא קונה פירושו בורא מלשון קונה שמים וארץ. כי הקטיגור הוא בריאה אשר יברא האדם בחטאו, והמזיק ההוא הוא מושל על האדם ומצערו, כדכתיב תיסרך רעתך (ירמיה ב' יט), וכמו שפירשו מאה\"כ (תהלים י\"ט) גם מזדים חשוך עבדך אל ימשלו בו, שיצילו השי\"ת מעוונות ופשעים, אז איתם וניקיתי מפשע רב שלא יהיה המזיק הנברא מהפשע בבחינת רב ושליט עלי. והשתא שפיר מובן כי כל זמן שהמזיק הנברא מהחטא קיים, האדם הוא עבד כנעני, כי הוא משועבד ונכנע תחת יד המזיק, ואין הוא יוצא חפשי ממנו, עד שיעשה תשובה, ובתשובה מאהבה מתהפכים עוונותיו לזכיות, ונעשה ממנו מלאך קדוש, ואין שעבודו דומה לעבד עברי העובד רק זמן מוגבל, ויוצא בשש או ביובל, א\"כ שפיר איכא למילף שהאדם יוצא לחרות מן המזיקין ע\"י יסורין, בק\"ו מעבד כנעני היוצא בשן ועין.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 252,
      "char_length": 893,
      "timestamp": "2025-02-06T19:21:03.589983"
    },
    {
      "id": "mishpatim_p253",
      "text": "והשתא הדרא ספיקת הריב\"ש לדוכתא, כי ליכא למיפשטא ממה דילפינן שאדם יוצא לחרות ביסורין, בק\"ו משן ועין, כמ\"ש החת\"ס ז\"ל, דלעולם נימא שאם העבד התחיל בקטטה עם רבונו, וגרם בכך שהפיל רבו את שינו אינו יוצא לחרות, והא דיליף מיניה שיסורין ממרקין העוונות, אף שהאדם התחיל בעבירה, איכא למימר, כי בעת שהאדם התחיל בעבירה, עדיין לא היה בבחינת עבד, כי רק ע\"י חטאו נוצר המזיק שאליו הוא נעשה משועבד, נמצא כי בעת שחטא עדיין היה בן חורין מן המזיק אלא שחטאו גרם בריאת המזיק והשתעבדותו אליו, ומעת שנעשה משועבד אל המזיק הרשות בידו למשול בו ולצערו. אף שאינו מוסיף על חטאתו פשע, כי כל זמן שלא שב על חטאו הקודם שגרם לבריאת המזיק, ועדיין המזיק בעולם: הרי הוא עבד כנעני אליו, והרשות בידו למשול בו וליסרו: וא\"כ אף אם נאמר שאין עבד כנעני יוצא בשן ועין, היכא שהוא היה המתחיל בקטטה עם אדונו, אכתי איכא למילף מדין עבד כנעני היוצא בשן ועין, שיסורין ממרקין עוונותיו של אדם, שהרי הכא אף שהאדם התחיל בחטא, אך עדיין לא היה אז המזיק בעולם, ואכתי בן חורין הוא, ואין זה כעבד המתגרה באדונו והעלה קצפו, עד שהכה שנו או סימא עינו, שהרי התם כבר היה משועבד לרבו בעת שהתגרה בו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 253,
      "char_length": 1026,
      "timestamp": "2025-02-06T19:21:04.033872"
    },
    {
      "id": "mishpatim_p254",
      "text": "ועתה נבא לביאור המדרש פליאה, בהקדם מה דאיתא בגמרא (קידושין כ' ע\"א) ת\"ר אם בגפו יבא בגפו יצא בגופו נכנס בגופו יצא אמר רבא לומר שאינו יוצא בראשי איברים כעבד ופריך אביי ההיא מלא תצא כצאת העבדים נפקא ומשני אי מהתם הוה אמינא ניתיב ליה דמיה עיניה וניפוק קמ\"ל, ע\"כ. הרי לנו כי הא דאין עבד עברי יוצא בשן ועין, ילפינן מקרא אם בגפו יבא בגפו יצא, וא\"כ ממקרא זה ידעינן דע\"כ לומר שהאדם החוטא דין עבד כנעני יש לו, לפי שהוא עבד כנעני אל המזיקים שנבראו מחטאיו ואז שפיר ילפינן שיסורין ממרקין עוונותיו בק\"ו משן ועין, וע\"י היסורין עבד חפשי מאדוניו המזיקים, דליכא למימר כי דין עבד עברי לו, שהרי ילפינן דאין עבד עברי יוצא בשן ועין מדכתיב אם בגפו יבא וגו'. ואם נתפוס כן, כי מה דילפינן יסורין ממרקין בק\"ו משן ועין, הוא לפי שהאדם הוא עבד כנעני אל המשחיתים הנוצרים בחטאיו, איכא למימר כי אין עבד כנעני יוצא לחרות, כאשר התחיל בקטטה עם רבו, כאשר ביארנו דלא דמיא למה שהאדם התחיל בעבירה, ואעפי\"כ הוא יוצא לחרות ע''י יסורין, שהרי האדם היה חפשי בעת התחיל בעברה, שהרי המזיק עדיין לא היה בעולם, וע\"כ מועילים לו יסורין לצאת לחרות מן המזיקים, משא\"כ העבד הרב את ריבו עם רבו, הרי הוא כבר משועבד אליו, ואיכא למימר שאינו יוצא בשן ועין, כי לא היה לו להעלות חמת רבו עד אין מרפא.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 254,
      "char_length": 1136,
      "timestamp": "2025-02-06T19:21:04.552258"
    },
    {
      "id": "mishpatim_p255",
      "text": "ועפי\"ז תתפרש שאלת מלאכי השרת, בשעה שאמר הקב\"ה אם בגפו יבא בגפו יצא, דמיניה ילפינן שאין עבד עברי יוצא בשן ועין, וע\"כ לומר דיסורין ממרקין עוונותיו של אדם משום דדין עבד כנעני לו, ויוצא הוא לחרות ע\"י היסורין, אף שהתחיל בעברה, מ\"מ אכתי לא הוי עבדא בעת החטא שעדיין לא היה המזיק בעולם. אבל במקום שהעבד הוא המתחיל בקטטה עם רבו, י\"ל כי אינו יוצא חפשי בשן ועין. וא\"כ למה צוית למחות את זכר עמלק, דהנה סבת ביאת עמלק להרע לישראל היתה, על אשר ישראל התחילו בעברה, כאמרם ז\"ל (שבת קי\"ח ע\"ב) אלמלי שמרו ישראל שבת ראשונה לא שלטה בהן אומה ולשון שנאמר (שמות ט\"ז) ויהי ביום השביעי יצאו מן העם ללקוט ולא מצאו וכתיב בתריה ויבא עמלק ע\"כ, וכן איתא בילקוט פ' בשלח היגאה גמא בלא בצה (איוב ח) וכי אפשר לגומא זה להתגדל בלא בצה ובלא מים וכו' כך אי אפשר לישראל להיות אלא אם כן עוסקים בתורה ולפי שפרשו מדברי תורה לכך בא השונא עליהם, שאין השונא בא אלא על חטא ועל עברה לכך נאמר ויבא עמלק. עוד איתא שם על הכתוב וילחם עם ישראל ברפידים אין רפידים אלא רפיון ידים לפי שרפו ידיהם מדברי תורה לכך בא השונא עליהם לפי שאין השונא בא אלא על רפיון ידים מן התורה. וכן איתא במד\"ר (שמות פכ\"ו ג) כך אמר הקב\"ה וכו' ואתם אומרים היש ה' בקרבנו לפיכך יבא השונא וישלוט בכם הוי ויבא עמלק, ע\"כ.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 255,
      "char_length": 1134,
      "timestamp": "2025-02-06T19:21:05.140668"
    },
    {
      "id": "mishpatim_p256",
      "text": "מכל הלין ראי' כי תחלת ביאת עמלק היתה לפי שישראל התחילו בעברה, ואם כן יש לומר כי כמו דבעבד כנעני איכא למימר, דאינו יוצא לחירות כאשר הוא המתחיל בקטטה עם אדונו, כמו כן נימא כי אין מועילים היסורים שעשה עמלק לישראל למרק עוונותיהם, ולהוציאם לחרות ממנו, כי אין זה דומה למה דאמרינן יסורין ממרקין עוונותיו של אדם, ויוצא הוא לחירות מן המזיקים, שהרי התם לא גירה האדם חמתו של המזיק ע\"י חטאו שהרי המזיק עדיין לא היה אז בעולם, ועל כן מועילים היסורים לכבסו מעוונותיו, ולהוציאו לחרות. משא\"כ עמלק שהוא בן תמותה, והיה בעולם גם קודם החטא. ומה שציער את ישראל היה לפי שהתחילו בעברה ואיכא למימר כי אינו בדין שיצאו ישראל לחרות מחטאיהם ע\"י היסורין, ובדין הוא כל הצער שגרם להם, לפי שהם שהתחילו בעברה, וגרמו בכך לביאתו עליהם, דוגמת עבד כנעני שהקניט את רבו והעלה חמתו עד שהכה את שינו, שאינו יוצא לחרות לפי שהוא המתחיל בקטטה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 256,
      "char_length": 797,
      "timestamp": "2025-02-06T19:21:05.711250"
    },
    {
      "id": "mishpatim_p257",
      "text": "אמנם האמת הוא כי אף שלא בא עמלק להצר לישראל בפועל אלא אחר חטאם, אבל צורר היה להם בנכליו זמן זמנים טובא קודם שחטאו, רק שלא עלתה בידו להפיק זממו, ולהוציא מחשבתו הרעה אל הפועל, עד אחר החטא, וכדאיתא במכילתא סוף פ' בשלח ויבא עמלק שבא בגילוי פנים לפי שכל הביאות שבא לא בא אלא במטמוניות שנאמר אשר קרך בדרך אבל ביאה זו לא בא אלא בגילוי פנים. ע\"כ. והכוונה באמרו בא במטמוניות, היינו שיעץ תמיד מזימות להרע לישראל בסתר מחשבתו, ואומות העולם נענשים על מחשבה כמעשה, כדאיתא בירושלמי פ\"ק דפאה (סוף הלכה א') מחשבה רעה אין הקב\"ה מצרפה למעשה מחשבה טובה הקב\"ה מצרפה למעשה וכו', הדא דתימא בישראל אבל בגוים חילופא מחשבה טובה אין הקב\"ה מצרפה למעשה מחשבה רעה הקב\"ה מצרפה למעשה וכו' דכתיב (עובדיה א') מקטל מחמס יעקב אחיך תכסך בושה ונכרת לעולם וכי הורגו אלא מלמד שחשב עליו להורגו והעלה עליו הכתוב כאילו הרגו (ועי' תוספות קידושין ל\"ט ע\"ב ד\"ה מחשבה). וכן מצינו שדן הקב\"ה את המצריים על מחשבתם הרעה, דכתיב (שמות י\"ח) כי בדבר אשר זדו עליהם ותרגם אונקלוס ארי בפתגמיא די חשיבו מצראי למידן ית ישראל ביה דנינון, הרי שנידונו על המחשבה, שהרי לידי מעשה לא באו, כדאיתא במדרש ילקוט פ' שמות (רמז קס\"ה) ר' שילא אמר כל הילדים שהשליכו היה היאור פולט אותם במדבר והיה הקב\"ה מביא סלע בפי כל אחד ואחד וכו' והיה מניק אותם שנאמר (דברים ל\"ב) ויניקהו דבש מסלע וגו', ע\"כ.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 257,
      "char_length": 1217,
      "timestamp": "2025-02-06T19:21:06.099754"
    },
    {
      "id": "mishpatim_p258",
      "text": "וכיוצא בזה מצינו מ\"ש האה\"ח הקדוש לתרץ קושית הראשונים (עי' רמב\"ן פ' לך לך עה\"פ וגם את הגוי אשר יעבודו דן אנכי שהאריך בזה) על מה מגיע עונש לאומות המשעבדים את ישראל, והרי גזרה היא מן השמים והם שלוחים לקיים גזרתו יתברך ותירץ כי חייבים הם להענש על כל העינוי והצער אשר ירעו לנו, כי אין טעם האומות המענים אותנו לצד שהיא גזרה מן השמים, אלא לפי שישראל מקיימים תורה ומצוות, ע\"כ גדולה שנאתם אלינו כי אין שנאה כשנאת הדת, ולו היו ישראל עובדים לטלה והיו לעם אחד במצרים, לא היו המצרים משתעבדים בהם וכו' עיי\"ש, הרי כי כל עונשם הוא על כי כוונתם לרע וכן פירשנו מאמה\"כ (דברים כ\"ג) לא יבא עמוני ומואבי בקהל ה' וגו' ועל אשר שכר עליך את בלעם וגו' ולא אבה ה' אלקיך לשמוע אל בלעם וגו'. וקשה וכי זו היא נתינת טעם למה שלא יבאו בקהל ה', על אשר לא רצה ה' לשמוע אל בלעם, והפך את הקללה לברכה, אדרבה לו היה אמנם קושיא זו יש ליישב בהקדם השי\"ת שומע לקללת בלעם ח\"ו, היה עונשם גדול יותר, כי לפי שלא עשתה קללתו פירות, אין להענישם כ\"כ, ומה מקום לומר שלא שמע ה' אל בלעם, כנתינת טעם על אשר נאסרו לבא בקהל. אמנם נראה לי כי אילו חס ושלום היתה קללתו חלה, היה אפשר לומר כי היתה זאת גזרה מן השמים ואולי לא היה ענשם גדול כ\"כ, אבל לפי שלא אבה ה' א' לשמוע אל בלעם. והוא חשב לעשות היפך רצון ה', ולקלל את ישראל, ע\"כ שמחשבתו הרעה אשר חשב באה לו לצד רשעתו, וע\"כ עונשו גדול, ושפיר הוי זה שלא אבה ה' לשמוע אל בלעם, נתינת טעם למה שנאסרו לבא בקהל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 258,
      "char_length": 1292,
      "timestamp": "2025-02-06T19:21:06.760651"
    },
    {
      "id": "mishpatim_p259",
      "text": "נחזור לעניננו כי לפיכך נענש עמלק בעונש גדול כ\"כ, ואחריתו עדי אובד, כי הביא עליו רעה פרי מחשבתו, אשר חשב להרע לישראל, עוד טרם התחילו בעבירה, ועפי\"ז נבא לפרש המשך דברי המדרש פליאה, וא\"ת בדין הוא, מה שצוה ה' למחות זכר עמלק, כי נענש על מזימתו הרעה, א\"כ למה בא אדה\"ר על כל בהמה וחיה, ויתפרש עפ\"י דאמרו בגמרא יבמות (דף ס\"ג ע\"א) בא אדה\"ר על כל בהמה וחיה ולא נתקררה דעתו עד שבא על חוה וכו' ע\"כ. והקשו הראשונים ז\"ל והרי בני נח נצטוו על הזכור ועל הבהמה ותירץ המהרש\"א ז\"ל בשם המפרשים שאין זה כמשמעו ביאה ממש אלא לפי שלא היה לו בן זוג היה חפץ לחפש ולבדוק בכל המינים, אולי ימצא מין אחר בלא עזר, וכיון שלא מצא לא נתקררה דעתו וכו' ע\"כ. ולפי\"ז מה שאמרו בגמרא שבא אדה\"ר על כל בהמה וחיה הכוונה כי היתה לו מחשבת עריות, וזהו שהקשו מלאכי השרת וא\"ת בדין שנענש עמלק על מחשבתו הרעה, כי אוה\"ע נידונין על מחשבה, א\"כ למה בא אדה\"ר על כל בהמה וחיה, ואף שלא בא עליהם בפועל ממש, מ\"מ בבני נח גם מחשבה כמעשה דיינינן ליה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 259,
      "char_length": 887,
      "timestamp": "2025-02-06T19:21:07.434998"
    },
    {
      "id": "mishpatim_p260",
      "text": "אמנם קושיא זו יש בהקדם מה שכתב המהר\"ל מפראג זלה\"ה, להסביר מה שלכאורה מה שכתב נראה זאת כעוול בחקו יתברך ח\"ו, ומלך במשפט יעמיד ארץ כתיב, וכאן כפי הנראה לעיני בשר הוא משפט מעוקל, אשר בישראל אין הקב\"ה עונש על מחשבה כמעשה, משא\"כ מחשבה טובה הקב\"ה מצרפה הם למעשה כדאיתא (קידושין ל\"ט ע\"ב) ובאוה\"ע הוא להיפך מחשבה רעה הם נענשין עליה כמעשה, משא\"כ מחשבה טובה אין הקב\"ה מצרפה להם למעשה וכי משוא פנים יש בדבר. וביאר דהנה אוה\"ע מקורם רע, ומשורש פורה ראש ולענה יצאו, ואף כשחושבים פעמים לעשות מעשה טוב, מאחר שלא גמרו להוציא את הדבר אל הפועל, זהו לאות כי המחשבה הטובה לא היתה רק מקרית אצלם כיון שאין זה מטבעם, ולפיכך שורת הדין נותנת שלא תצורף מחשבתם למעשה, אבל מחשבה רעה שלהם היא עצמית להם, ואף שלא גמרו להרע בפועל, הנה המניעה אינה מצד עצמם, כי לא יבצר מטבעם עשות כל רע, ובודאי היתה להם איזה מניעה שלא יכלו להשלימה בפועל, ומשום כך שורת הדין נותנת לצרף מחשבתם הרעה למעשה. וכל זה הוא באוה\"ע, מה שא\"כ בישראל הוא להיפך ממש, כי עם בני ישראל מקור מחצבתם הוא שורש הטוב. והטוב דבק בהם בעצם, והרע הוא רק מקרי אצלם, ולפיכך מחשבה טובה שלהם דין הוא שתצורף למעשה, כי מה שלא הוציאו מחשבתם הטובה אל הפועל, בודאי היתה להם מניעה בזה, אבל מצדם לא יבצר עשות טוב, כי המה מוכנים אל הטוב בטבעם, משא\"כ מחשבה רעה ח\"ו שלא הוציאוה אל הפועל, הרי יש כאן הוכחה שאין המחשבה הרעה עצמית, כי אם מקרה הוא על כן אין הקב\"ה מצרפה למעשה, ומשפטי ה' אמת צדקו יחדיו, ע\"כ דבריו ז\"ל. ועפי\"ז י\"ל קושית מלה\"ש א\"כ למה בא אדה\"ר על כל בהמה וחיה, שהרי לא בא עליהם אלא במחשבה, ולא נחשבה לו מחשבתו אשר חשב לבא עליהם כמעשה, כי נשתנה דינו מדין ב\"נ לפי שמקורו היה טוב כי הוא יציר כפיו של הקב\"ה, ובודאי נידון הוא כדין ישראל, שלא נחשבה מחשבתו הרעה כמעשה, כי רק מקרית היתה אצלו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 260,
      "char_length": 1604,
      "timestamp": "2025-02-06T19:21:07.897127"
    },
    {
      "id": "mishpatim_p261",
      "text": "ועל דרך זה יתבאר גם המשך דברי המדרש, וא\"ת בדין הוא מה שבא אדה\"ר על כל בהמה וחיה, כי לפי שלא בא עליהם אלא במחשבה אין זה נחשב לו לעוון, לפי שהמחשבה היתה מקרית אצלו, וחזקת כשרות לו, א\"כ למה ציוית להביא ביכורים, ויתבאר בהקדם דאיתא במד\"ר (בראשית פ\"א ו) ר' הונא בשם ר' מתנה אמר בזכות ג' דברים נברא העולם בזכות חלה ובזכות מעשרות ובזכות ביכורים ומה טעם בראשית ברא אלקים ואין ראשית אלא חלה שנאמר (במדבר ט\"ו) ראשית עריסותיכם ואין ראשית אלא מעשרות המד\"א (שמות כ\"ג) ראשית דגנך ואין ראשית אלא ביכורים שנאמר (שמות כ\"ג) ראשית ביכורי אדמתך, ע\"כ. וביאר היפה תואר הטעם שגדולה כ\"כ חשיבות ג' מצוות אלו. שבזכותם נברא העולם, כי במה שמביא האדם ראשית דגנו ועיסתו וביכורי אדמתו אל הכהן הוא מורה על כניעתו לאלקים, ועל הודאתו כי לא בכוחו ובעוצם ידו עשה את החיל הזה, אלא ממך ומידך הכל ניתנו. וכ\"כ בכלי יקר ז\"ל (ריש פ' תבא) בשם הרמב\"ם ז\"ל, כי טעם מצות ביכורים הוא ההכנעה וההשתעבדות אל השי\"ת, ובל יעלה על לבו כי הארץ קנויה היא לו, אלא הרי הוא בה כאריס ע\"כ. אמנם כתב היפ\"ת עדיין צריך לתת טעם מדוע נצטוו לתת ביכורים. ולא סגי במה שמפרישים חלה מן העיסה, ותרומות ומעשרות מפירות האילן, שהרי בזה הוא מורה באצבע שאין הוא בעל השדה, ומאת ה' היתה לו זאת, ומה צורך גם בהבאת ביכורים לכונה זו, וכתב כי לפי שתרומות ומעשרות מתחייבים רק משעת מירוח. וחלה משעת גלגול, לא סגי בכך להראות הכנעתו והשתעבדותו לאלקים, כי חובה עליו מראש מקדם, בעוד הפרי על האילן, להראות הכנעתו והשתעבדותו אל הקב\"ה. ועל כן חשובה היא ביותר מצות ביכורים. אשר בה הוא מורה שמיד בהתבשל הפרי על האילן, והאדם מתאווה לאכלו, כבכורה בטרם קוץ בעודה בכפה יבלענה, הוא מפרישה לביכורים, כי לה' הארץ וכל אשר בה, ואין הוא בעל השדה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 261,
      "char_length": 1540,
      "timestamp": "2025-02-06T19:21:08.702347"
    },
    {
      "id": "mishpatim_p262",
      "text": "וגדולה מזו כתב ק\"ז זלה\"ה בייטב פנים מאמר שירת דודי (סי' ט\"ו) לפרש מאה\"כ בפ' תבא והיה כי תבא אל הארץ וגו' וירשתה וישבת בה וגו', דלכאו' קשה כיון שלא נתחייבו בביכורים אלא לאחר ירושה וישיבה, כמפורש במקרא וירשתה וישבת בה, וכדאיתא בפ\"ק דקידושין (דף ל\"ז ע\"ב), א\"כ כי תבא למה לי, דהול\"ל כי תירש ותשב בארץ, ונ\"ל כי התורה הזהירה כי גם בטרם בואם לארץ יגמרו בדעתם ויקבלו עליהם עול מצוות התלויות בארץ לעשותם ומחשבתם הטובה מצטרפת למעשה, והרי זה כאילו כבר קיימו, ובזכות זה יבאו וירשו את הארץ וכו' עכ\"ד הקדושים. היוצא מזה כי במחשבה חייב האדם לקבל על עצמו לקיים מצות התלויות בארץ עוד טרם ביאתו לארץ. וכדאיתא בספרי פ' תבא עשה מצוה זו שבשבילה תכנס לארץ, אף שלא יכלו לקיים מצות ביכורים בפועל בחו\"ל, אלא הכוונה שיקיימו מצות ביכורים במחשבה, ובזכות זה יכנסו לארץ.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 262,
      "char_length": 740,
      "timestamp": "2025-02-06T19:21:09.495312"
    },
    {
      "id": "mishpatim_p263",
      "text": "וזו היתה קושית מלאכי השרת, וא\"ת בדין הוא שלא חשב ה' לו עון לאדה\"ר מה שהרהר במחשבת עריות, כי חזקת כשרות יש לו ולכן לא צירף לו הקב\"ה מחשבה רעה למעשה, א\"כ למה צוית להביא בכורים, שהרי על כרחך לומר כי לאידך גיסא מחשבה טובה הקב\"ה מצרף למעשה למי שיש לו חזקת כשרות, וא\"כ כיון שאי אפשר לבא לארץ, אלא אם קדמה לה מחשבה טובה לקיים מצות התלויות בה, וזולת זאת אין הביאה לארץ מסטרא דקדושה, א\"כ די בכך שגילו ישראל דעתם במחשבה בטרם בואם לא\"י שרצונם להפריש תרומות ומעשרות, ולקיים שאר מצות התלויות בארץ, שהרי בזה גילו הכנעתם והשתעבדותם לאלקים, ומה צורך עוד בהבאת ביכורים, להראות כוונה זו עצמה, וכמ\"ש היפ\"ת הנ\"ל, כי זה כל טעם הבאת ביכורים, לגלות בתחלה כי הוא משעבד עצמו להשי\"ת, והרי כבר גילו זאת עוד טרם ביאתם לארץ.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 263,
      "char_length": 695,
      "timestamp": "2025-02-06T19:21:09.843986"
    },
    {
      "id": "mishpatim_p264",
      "text": "אמנם האמת הוא כי אף שהדבר תלוי בחזקת כשרות אם לצרף מחשבה טובה למעשה או לא. אבל אעפי\"כ לא סגי במחשבה טובה לחודה, כי דא עקא שהצר הצורר הוא עמלק הוא הס\"מ מפתה את האדם ובא עליו במטמוניות לקלקל מחשבותיו, כמו שאמרו ז\"ל (סנהדרין כ\"ו ע\"ב) אמר עולא מחשבה מועלת אפילו לד\"ת ופירש\"י ז\"ל בלישנא אחרינא מחשבה שאדם מחשב כך וכך אעשה כך וכך תעלה בידי מועלת להשבית הדבר שאין מחשבתו מתקיימת אפילו לד\"ת כגון האומר עד יום פלוני אסיים כך וכך מסכתות בגירסא, ע\"כ. ועל כן לא סגי במחשבה טובה שהיתה לישראל לקיים מצות התלויות בארץ כי חשש גדול יש פן יתגבר הבע\"ד ויפר עצתם ויקלקל מחשבתם, ולכן נצטוו לעשות גם מעשה בהבאת ביכורים",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 264,
      "char_length": 596,
      "timestamp": "2025-02-06T19:21:10.279099"
    },
    {
      "id": "mishpatim_p265",
      "text": "אמנם תשובה זו לא רצה הקב\"ה להשיב למלאכי השרת על שאלתם למה ציוית להביא ביכורים, דהנה התוספות כתבו במס' שבת (דף י\"ב ע\"ב) על הא דאמרו בגמרא שאין מלאכי השרת מכירין בלשון ארמי וז\"ל ותימא שאפי' מחשבה שבלב כל אדם יודעים ולשון ארמי אין יודעים ע\"כ. אמנם המפרשים כתבו שבכמה מקומות בדברי חז\"ל מוכח שאין מלאכי השרת יודעים מחשבות לב האדם (עי' בישמח משה פ' וירא דף ל\"ח ע\"ד) וכתב בשל\"ה הקדוש לישב קושית התוספות כי יש כתי מלאכים שאינם יודעים מחשבות והם המלאכים הממונים להעלות תפלות ישראל אל כסא הכבוד לפי ששליחותם היא בבחינת דבור ואין מלאך אחד עושה ב' שליחיות, אמנם ישנם מלאכים ששליחותם היא להשיג מחשבות האדם, עכ\"ד. ואם כן מובן היטב למה לא רצה הקדוש ברוך הוא להשיב תשובה זו, שהחשש הוא פן יתקלקלו מחשבות האדם, ועל כן נצטוו להביא ביכורים בפועל, לפי שאותם מלאכים שאינם יודעים מחשבות האדם, אינם יכולים להשיג מהות המחשבה, וגודל הנסיונות העומדים על האדם לקלקל מחשבתו, וכמה קשה על האדם להתגבר על הס\"מ, ולשמור על טהרת מחשבתו, והוא דוגמת מ\"ש הרמב\"ם ז\"ל בפירוש המשניות פרק חלק בענין עולם הבא כי כמו שלא ישיג הסומא עין הצבעים ואין החרש משיג שמע הקולות כך אין נודע בזה העולם הגופני תענוג העולם הרוחני וכו' עיי\"ש. וכמו כן אין המלאכים משיגים כמה קשה על האדם לשמור על בהירות המחשבה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 265,
      "char_length": 1151,
      "timestamp": "2025-02-06T19:21:10.565234"
    },
    {
      "id": "mishpatim_p266",
      "text": "ומצינו כיוצא בזה במדרש ילקוט פרשת בראשית (רמז מ\"ד) בשם מדרש אבכיר בב' מלאכי מעלה שמחזאי ועזאל שקוטרגו לפני הקב\"ה בעת שעבדו אנשי דור המבול ע\"ז ואמרו רבש\"ע הלא אמרנו לפניך מה אנוש כי תזכרנו א\"ל גלוי וידוע לפני שאם הייתם שרויים בארץ היה יצה\"ר שולט בכם והייתם קשים מבני אדם אמרו לו תן לנו רשות ונדור בין הבריות ותראה איך אנו מקדשים שמך ומיד שירדו קלקלו וכו' עיי\"ש. הרי כי אין בהם להשיג גודל כח היצר הרע והתגברותו על האדם ורק האדם בעצמו יודע זאת, ומבשרו יחזה כי רבות מחשבות בלב איש, ויש אשר נופלת בלבו מחשבה טובה, וכמו רגע מתגבר עליו הבעל דבר ומסיח דעתו ממנה, וכשיש בלבו מחשבה רעה קשה עליו לטרדה ממנו. כי מתגבר עליו עמלק הוא הס\"מ ועל כן לא סגי במחשבה טובה לקיים מצוות התלויות בארץ, כי יש חשש גדול להתגברות היצר, ובפרט בארץ ישראל הוא מתחזק ביותר על האדם, ולכן נצטוו לקיים המצוה בפועל, ולגלות הכנעתם והשתעבדותם לאלקים ע\"י הבאת ביכורים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 266,
      "char_length": 828,
      "timestamp": "2025-02-06T19:21:11.089943"
    },
    {
      "id": "mishpatim_p267",
      "text": "עוד אפשר לומר כי לא רצה הקב\"ה לגלות למלאכי השרת מעמדו ומצבו: השפל של האדם, ועד כמה הוא נתפס במחשבות רעות, בהרהורי עריות, ובמחשבות מינות, וכהנה וכהנה, מחשבות אדם ותחבולותיו ויצרי מעללי איש, אבל האמת הוא כי יש תשובה לשאלתם, וצדיק ה' בכל דרכיו, א\"ל אמונה ואין עול צדיק וישר הוא.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 267,
      "char_length": 275,
      "timestamp": "2025-02-06T19:21:11.491657"
    },
    {
      "id": "mishpatim_p268",
      "text": "הנה אנכי שולח מלאך לפניך לשמרך בדרך וגו'. הקשה הרמב\"ן ז\"ל (בפ' תשא פל\"ג יב) מדוע כשאמר לו הקב\"ה הנה אנכי שולח מלאך וגו' שתק משה כמסכים על הדבר, ובפ' תשא שהיה כבר אחר חטא העגל מיאן משה בכך, ואמר אם אין פניך הולכים אל תעלנו מזה, וכי יבקש עתה להרויח בעבור מעשה העגל.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 268,
      "char_length": 263,
      "timestamp": "2025-02-06T19:21:11.667700"
    },
    {
      "id": "mishpatim_p269",
      "text": "ב) השמר מפניו ושמע בקולו אל תמר בו כי לא ישא לפשעכם וגו'. פירש\"י ז\"ל אינו מלומד בכך שהוא מן הכת שאין חוטאין, ועוד שהוא שליח ואינו עושה אלא שליחותו, ע\"כ. הר\"ן ז\"ל בדרשותיו הקשה כי כאן מבואר כי גרוע ביותר אם ילך עמהם מלאך, לפי שאין בידו למחול, ובפ' תשא כתיב רגע אחד אעלה בקרבך וכליתיך וגו', ופירש\"י אם אעלה בקרבך ואתם ממרים בי אזעום עליכם רגע אחד וכו' ואכלה אתכם לפיכך טוב לכם שאשלח מלאך, ע\"כ. הרי משם להיפך כי כאשר הקב\"ה הולך עמהם יש חשש כליה ח\"ו, ומוטב שילך עמהם מלאך, עיי\"ש שנדחק לישב סתירת הכתובים אהדדי.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 269,
      "char_length": 506,
      "timestamp": "2025-02-06T19:21:11.844687"
    },
    {
      "id": "mishpatim_p270",
      "text": "ג) עוד צריך להבין מאמר הכתוב כי לא ישא לפשעכם, וכי מחילת החטאים היא ביד המלאך והלא אף אם הולך לפניהם מלאך יכול הקב\"ה למחול להם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 270,
      "char_length": 127,
      "timestamp": "2025-02-06T19:21:12.129806"
    },
    {
      "id": "mishpatim_p271",
      "text": "ד) עוד צ\"ב הכתובים בפ' תשא כי אחר שאמר הקב\"ה למשה רגע אחד אעלה בקרבך וכלתיך, השיב משה אם אין פניך הולכים אל תעלנו מזה, וקשה כי מאחר שיש חשש כליה ח\"ו בהליכת הקב\"ה עמהם למה בקש משה על כך.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 271,
      "char_length": 185,
      "timestamp": "2025-02-06T19:21:12.239686"
    },
    {
      "id": "mishpatim_p272",
      "text": "ואפשר לפרש הענין עפ\"י מה שכתב בעטרת חכמים על מאמר ההגדה צא ולמד מה ביקש לבן הארמי לעשות ליעקב אבינו שפרעה לא גזר אלא על הזכרים ולבן בקש לעקור את הכל. ולכאורה הרי כוונת בעל ההגדה לספר גודל הנס שהיה ביציאת מצרים, ומה מקום להזכיר כאן שהיה ליעקב אבינו ע\"ה נס גדול יותר שלבן בקש לעקור את הכל, והרי בכך הוא מקטין מעלת נסי יציאת מצרים. ופירש כי אדרבה מכאן נראה גודל נסי יציאת מצרים יותר מן הנס שנעשה ליעקב אבינו, שהרי כבר נשבע הקב\"ה לאבותינו שלא יכלה זרעם, וכיון שלבן ביקש לעקור את הכל אין רבותא שנתבטלה הגזרה, כי אי אפשר לה להתקיים מחמת הבטחת הקב\"ה, אבל פרעה לא גזר אלא על הזכרים, א\"כ אין זו גזרת כלייה על כלל ישראל, והיה מקום לגזרה להתקיים ח\"ו, ואעפ\"י כן הצילנו הקב\"ה ברוב חסדיו, א\"כ בזאת מספר הוא גודל הנס ביציאת מצרים, עכ\"ד. ועפי\"ז י\"ל מה שאמר משה אם אין פניך הולכים אל תעלנו מזה אחר שאמר לו הקב\"ה רגע אחד אעלה בקרבך וכליתיך, כי היא הנותנת, לפי שכ\"כ גדול הפגם נגד הבורא כל העולמים, שחייבים עליו כלייה ח\"ו, אזי בהכרח שתבא איזה הצלה מצד מדת הרחמים, כי כבר הבטיח הקב\"ה שלא תאבד שארית יעקב, אבל אם היה הולך לפניהם מלאך, אין הפגם גדול כ\"כ שיתחייבו עליו כלייה, אלא שאר עונשים קשים ומרים שאפשר להם להתקיים ח\"ו, ולכן מיאן משה בהליכת המלאך ואמר אם אין פניך הולכים אל תעלנו מזה, כי כאשר הולך לפניהם ה' ומאספם קדוש ישראל בעצמו, לא ע\"י מלאך ולא ע\"י שליח. בהכרח תתעורר מדת הרחמים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 272,
      "char_length": 1264,
      "timestamp": "2025-02-06T19:21:12.373838"
    },
    {
      "id": "mishpatim_p273",
      "text": "ועפי\"ז י\"ל כי מה שלא בקש משה רבינו ע\"ה קודם חטא העגל שילך עמהם הקב\"ה, הוא, כי באשר היו ישראל במדרגה גדולה ונעקר היצר הרע מלבם, לא היה ירא שיחטאו, ועל כן אין חשש אף אם ילך עמהם מלאך, אבל לאחר חטא העגל שחזרה זוהמתן והיו בשפל המצב, חשש משה כי אם ילך עמהם מלאך, ויחטאו בני ישראל, יענשו בעונשים קשים ח\"ו, ומיושב גם מ\"ש כי לא ישא לפשעכם (קושיא ג') שהכונה עבור שאין העונש גדול כ\"כ על החטאים שיעשו אם ילך לפניהם מלאך אזי יש חשש שתתקיים הגזרה ח\"ו, ולא תתעורר מדת הרחמים.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 273,
      "char_length": 461,
      "timestamp": "2025-02-06T19:21:12.998855"
    },
    {
      "id": "mishpatim_p274",
      "text": "ובאמת בזמנינו הפחד גדול כ\"כ, ואין אנו יכולים להנצל אלא ע\"י הקב\"ה ובעוה\"ר אין מי שיסייע כי מלפנים היה כח הצדיקים, אבל בעוה\"ר מפגיע אין בעדינו, ורק הקב\"ה יושיענו מתוקף הגלות החל הזה כדאיתא במדרש (ילקוט זכריה רמז תקע\"ז) אשריך ישראל מי כמוך עם נושע בה' (דברים ל\"ג) וכו' אמר הקב\"ה בעוה\"ז הייתם נושעים ע\"י בני אדם במצרים ע\"י משה ואהרן וכו', אבל לעתיד אני בעצמי גואל אתכם ועוד יותר אין אתם משתעבדים שנאמר ישראל נושע בה' תשועת עולמים (ישעי' מ\"ה). וכדאיתא בזה\"ק (פ' ויקרא דף ו' ע\"א) מתל למלכא דרגז על מטרוניתא ואשדי לה מהיכליה וכו' כד מטא ההוא זמנא מיד מטרוניתא הוה עאלת ותבת קמי מלכא וכן זמנא חד ותרין ותלת זמנין לזמנא בתרייתא אתרחקת מהיכליה לזמנא רחיקא אמר מלכא האי זימנא וכו' אנא איזיל עם כל בני היכלי ואתבע עלה כד מטא לגבה חמא לה דהוה שכיבת לעפרא וכו' עד דאחיד לה מלכא בידוי ואוקים ואייתי לה להיכליה ואומי לה (ונשבע לה) דלא יתפרש מינה לעלמין ולא יתרחק מינה כך קב\"ה וכו' השתא בגלותא וכו' קודשא בריך הוא יוחיד בידהא ויוקים לה ויתפייס בהדה ויתיב לה להיכליה, עכ\"ד הקדושים. ולזאת אפ\"ל רמז משה רבינו ע\"ה באמרו אם אין פניך הולכים אל תעלינו מזה, כי ראה ברוח קדשו שכך יהיה בעקבתא דמשיחא שלא יוכלו ישראל להגאל אלא ע\"י הקב\"ה בעצמו, וכנודע כי משה יהי' הגואל לעתיד, כדאיתא בזוהר הקדוש (ח\"ג ר\"פ ע\"א) על כן התפלל על אותו הזמן שיושיעם הקב\"ה בכבודו ובעצמו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 274,
      "char_length": 1234,
      "timestamp": "2025-02-06T19:21:13.261400"
    },
    {
      "id": "mishpatim_p275",
      "text": "באופן אחר יש לישב קושית הרמב\"ן ז\"ל (בפ' תשא) שהקשה מדוע כאשר אמר לו הקב\"ה הנה אנכי שולח מלאך לפניך שתק כמסכים על הדבר, ובפ' תשא כאשר אמר לו הקב\"ה הנה מלאכי ילך לפניך מיאן בדבר ואמר אם אין פניך הולכים אל תעלנו מזה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 275,
      "char_length": 213,
      "timestamp": "2025-02-06T19:21:13.859646"
    },
    {
      "id": "mishpatim_p276",
      "text": "ונ\"ל עפ\"י מה דאיתא בליקוטי תורה מהאריז\"ל עה\"פ (שמות ג) לכה ואשלחך אל פרעה דלכאורה תיבת לכה מורה שילך מעצמו בלא שליחות והוא סותר למה שנאמר ואשלחך, ותירץ כי לצד שהקב\"ה היה משלח את משה בב' שליחויות, אחד לטובת ישראל להוציאם ממצרים, והב' לרעה שע\"י השליחות אמר פרעה תכבד העבודה על האנשים, ולפי שאין הקב\"ה מיחד שמו על הרעה, לכן אמר לכה כלפי מה שנגרמה להם רעה שהכבידו עליהם את העבודה, הרי הוא כהולך מעצמו בלא שליחות מהשי\"ת, וכלפי מה שהולך לטובת ישראל אמר ואשלחך, לכנות שמו יתברך על הטובה, שהולך בשליחותו של מקום. ועפי\"ז י\"ל כי לפי שבפרשת משפטים נאמר הנה אנכי שולח מלאך לפניך נתרצה משה בדבר, כי כיון שהקב\"ה מיחד שמו עליו, והוא שלוחו של מקום, תהיה שליחות המלאך רק לטוב להם. אבל בפ' תשא נאמר לו הנה מלאכי ילך לפניך, שהוא מורה שיהיה המלאך לרעה, שעל כן נאמר לשון הליכה ולא לשון שליחות, שאין הקב\"ה מיחד שמו עליו, מיאן משה ואמר אם אין פניך הולכים אל תעלנו מזה, והבן.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 276,
      "char_length": 851,
      "timestamp": "2025-02-06T19:21:14.000826"
    },
    {
      "id": "mishpatim_p277",
      "text": "או יאמר ליישב קושיית הרמב\"ן ז\"ל הנ\"ל בהקדם מה שפרשנו דברי הגמרא (שבת פ\"ח ע\"ב) בשעה שעלה משה למרום אמרו מלה\"ש לפני הקב\"ה רבש\"ע מה לילוד אשה בינינו וכו' אמר להם למצרים ירדתם וכו'. וי\"ל הכוונה עפ\"י דאיתא בזה\"ק (ח\"א קי\"ז ע\"א) שגאולת מצרים הוכרחה להיות על ידי הקדוש ברוך הוא בכבודו ובעצמו ולא על ידי מלאך או שליח. כדכתיב ועבר ה' לנגוף את מצרים, לפי שכ\"כ גדולה היתה טומאת מצרים ערות הארץ שגם מלאך היה יכול להתגשם שם.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 277,
      "char_length": 410,
      "timestamp": "2025-02-06T19:21:14.413602"
    },
    {
      "id": "mishpatim_p278",
      "text": "וזה אשר השיב משה למלאכים בעת קבלת התורה, למצרים ירדתם, ר\"ל כי גדולה מעלתם של ישראל ממעלתכם, שהרי לא רצה הקב\"ה לשלוח מלאך למצרים, אלא הקב\"ה בכבודו ובעצמו ירד לשם. כי עלולים היו המלאכים להתגשם בטומאת מצרים. ואילו בני ישראל היו משועבדים במצרים רד\"ו שנה, ואמרו ז\"ל (ויקרא רבה פל\"ב ה' שה\"ש רבה פ\"ד כ\"ד) ר' הונא אמר משום ב\"ק בשביל ד' דברים נגאלו ישראל ממצרים שלא שינו את שמם ואת לשונם ולא אמרו לה\"ר ולא נמצא ביניהן אחד מהם פרוץ בערוה וכו' עכ\"ל. ובזה תתיישב קושית הרמב\"ן ז\"ל, כי לפי שע\"י חטא העגל חזרה זוהמתן, והתגבר כח הטומאה והקליפות בין ישראל, חשש משרע\"ה פן יתגשמו המלאכים מפני גודל הטומאה, ע\"כ התפלל משה שילך עמהם הקב\"ה בכבודו ובעצמו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 278,
      "char_length": 631,
      "timestamp": "2025-02-06T19:21:14.624130"
    },
    {
      "id": "mishpatim_p279",
      "text": "באופן אחר י\"ל קושיית הרמב\"ן ז\"ל, מדוע קודם חטא העגל לא סירב משה בשליחת מלאך, עפ\"י מה שכתבו רבותינו בעהתוז\"ס, כי במאמרו יתברך הנה אנכי שולח מלאך מרומזת שליחות אליהו הנביא בעת הגאולה, דכתיב הכא הנה אנכי שולח מלאך, וכתיב התם הנה אנכי שולח לכם את אליהו הנביא, ולפי\"ז א\"ש כי קודם חטא העגל שהיו ישראל במדרגה עליונה אמר לו השי\"ת הנה אנכי שולח לפניך מלאך זה אליהו שיהיה התיקון השלם, ועל כן כתיב אנכי שולח לפניך וגו' דאיתא במד\"ר ס\"פ עקב שא\"ל הקב\"ה למשה כשאביא את אליהו הנביא שניכם באים כאחת, וזה מרומז באמרו אנכי שולח לפניך מלאך שיבאו משה ואליהו בבת אחת ועל כן הסכים משה לשליחות המלאך כי ביאת אליהו הוא סימן הגאולה, וכמ\"ש המהר\"ל מפראג שע\"כ פותחין את הדלת בליל פסח לכבודו של אליהו הנביא, ומוזגין כוס של אליהו, להראות כי לא תתכן גאולה רק ע''י ביאת אליהו מקודם וזולת זאת היא גאולת שקר, וז\"ש הכתוב הנה אנכי שולח מלאך לשמרך בדרך לבל יטו מני הדרך לטעות בגאולה של שקר, ולהביאך אל המקום אשר הכינותי, מרומז בזה בנין העתיד אשר כוננוהו ידי יוצר כדכתיב מקדש ה' כוננו ידיך, אמנם אחר חטא העגל שנפלו ממדרגתם ולא זכו אל התיקון השלם, והוצרכו להצטרף ולהזדכך בכובד עול הגליות, עדי נזכה אל הגאולה השלמה, אזי כשאמר לו הקב\"ה הנה מלאכי ילך לפניך אין הכוונה על אליהו. אלא על המלאך שילך עמהם לשמרם בדרך, על זאת לא הסכים משה כי רצה שילך לפניהם ה' ומאספם קדוש ישראל, והסכים ה' עמו על הדבר, כדאיתא במדרש (שמות רבה פל\"ב ג') שלא נמסרו ישראל לשר כל ימי משה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 279,
      "char_length": 1317,
      "timestamp": "2025-02-06T19:21:14.929418"
    },
    {
      "id": "mishpatim_p280",
      "text": "לא תהיה משכלה ועקרה בארצך את מספר ימיך אמלא. ג' במסורה, את מספר ימיך אמלא, פי אמלא תוכחות, ואוצרותיהם אמלא.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 280,
      "char_length": 107,
      "timestamp": "2025-02-06T19:21:15.602240"
    },
    {
      "id": "mishpatim_p281",
      "text": "ונראה לפרש עפ\"י מ\"ש החת\"ס זללה\"ה, לפרש הפסוק (דברים כ\"ח) והותירך ה' לטובה בפרי בטנך, על דרך מ\"ש הרמב\"ם ז\"ל באגרת לבנו, אשרי אדם שחתם ימיו במהרה. שלכל אדם יש קיצבה מה הוא צריך לתקן בתורה ובמצות, ומי שגמר הקיצבה ההיא השלים ימיו, וכל זמן שהאדם חי עלי אדמות עלול הוא לחטוא, כי ארבו טמון בחובו ע\"כ מוטב שישלים עצמו מהרה ויצא בשלום מן העולם. אמנם היינו אם הוא לעצמו, ואינו פועל על אחרים להטיבם, אבל אם יש לו בנים או אחרים אשר הוא מדריכם בדרכי ה', אזי אף שכבר השלים עצמו אין קיצבה לזה, וז\"פ הפסוק והותירך ה' לטובה, שיתן לך מותרות חיים לטובה והטעם בפרי בענך, כדי שתוכל לנהלם על מבועי התורה, עכת\"ד ז\"ל. ועפי\"ז נל\"פ הפ' לא תהי' משכלה ועקרה בארצך, שתתברך בבנים, וע\"י כך את מספר ימיך אמלא. ר\"ל אף שכבר השלמת עצמך., ירבו ימיך ויוסיפו לך שנות חיים, עבור שתדריך בניך בדרכי ה'.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 281,
      "char_length": 761,
      "timestamp": "2025-02-06T19:21:15.697717"
    },
    {
      "id": "mishpatim_p282",
      "text": "וזאת תהיה תורת המסורה לא תהי' משכלה וגו' את מספר ימיך אמלא, שתאריך ימים עבור בניך כנ\"ל, ועוד יש תקנה לכך. אם הוא מוכיח לעם ה' דרכי ה', ופיו ימלא תוכחות למען ישמעון ולמדו ליראה את ה' אזי אף שכבר השלים עצמו, יאריך ימים כדי להורות את העם דרכי ה' וכמ\"ש החת\"ס ז\"ל, אמנם כדי שיהיו דברי תוכחתו מתקבלים על לבות השומעים, יש לו צורך בעשירות, וכדאיתא בגמ' (חולין קל\"ד ע\"ב) עה\"כ (ויקרא כ\"א) והכהן הגדול מאחיו שהוא גדול מאחיו בנוי בחכמה ובעושר וכו' מנין שאם אין לו שאחיו הכהנים מגדלים אותו משלהם ת\"ל הגדול מאחיו גדלהו משל אחיו, ועי' בפירש\"י שם. וזאת תורת המסורה פי אמלא תוכחות שגם ע\"י שמוכיח את אחרים יזכה לאריכות ימים, אמנם כדי שיהיו דבריו נשמעים, צריך הוא לברכת ואוצרותיהם אמלא.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 282,
      "char_length": 667,
      "timestamp": "2025-02-06T19:21:16.099584"
    },
    {
      "id": "mishpatim_p283",
      "text": "לא תהיה משכלה ועקרה בארצך את מספר ימיך אמלא. אבא מארי זצללה\"ה בספרו קדושת יו\"ט הביא מספר ליקוטי תורה מהאריז\"ל שדקדק מה קשר יש בין תחלת הפסוק לסופו, והוסיף כ\"ק אבא מארי זללה\"ה דיל\"ד דתיבת מספר יתירא היא והול\"ל את ימיך אמלא, ופירש עפי\"מ ששמע מפי קדשו של אדמו\"ר הגאון הקדוש האבדק\"ק צאנז זצוקלה\"ה לפרש הגמרא במס' יומא (כ\"ב ע\"ב) אמר ר' שמואל בר נחמני ר' יונתן רמי כתיב (הושע ב) והיה מספר בני ישראל כחול הים (ופרש\"י אלמא דאית להו מנין) וכתיב (שם) אשר לא ימד ולא יספר לא קשיא כאן בזמן שישראל עושין רצונו של מקום כאן בזמן שאין עושין רצונו של מקום, ע\"כ. ולכאורה פירושו כי בזמן שעושין רצונו של מקום לא ימד ולא יספר, וכשאין עושין רצונו של מקום הם כחול הים, והקשו המפרשים דא\"כ איפכא הול\"ל כאן בזמן שאין עושין רש\"מ דקאי ארישא דקרא והיה מספר בני ישראל, והדר הול\"ל כאן בזמן שישראל עושין דקאי אסיפא אשר לא ימד ולא יספר. ע\"כ פירש מרן הדברי חיים זצוקלה\"ה דכן הוא האמת, דהאי כאן בזמן שישראל עושין רצונו של מקום דנקט ברישא, קאי ארישא דקרא דכתיב והיה מספר, והענין יובן עפ\"י הידוע שדבר חשיבות דרכו למנות, ודבר שבמנין יש לו מספר בפני עצמו, משא\"כ דבר שאינו חשיבות כ\"כ למנות כ\"א דרכו במדה ובמשקל אין לו מספר, כי אם ע\"י הצטרפות וריבוי וכו', וכן איש הישראלי העושה רצונו של מקום אז יש לו חשיבות גדול ויש לו מספר בפני עצמו וכו', משא\"כ זה שאינו עושה רצונו של מקום שאין לו חשיבות אין לו מספר בפ\"ע, כי אם בריבוי עם, שיש לכל אחד מדה טובה ואז ביחד יש להם מספר, וזה דאמרינן בגמ' כאן בזמן שעושין רצונו של מקום אז והיה מספר בני ישראל דהיינו שיהיה להם מספר לכל אחד ואחד בפני עצמו, כאן בזמן שאין עושין רצונו של מקום אשר לא ימד ולא יספר מרוב, שאין להם מספר לכל אחד בפ\"ע, כי אם כשירבו ויפרצו יש להם מספר בריבוי עם. עכ\"ד קדשו של מרן הד\"ח זי\"ע. ועפי\"ז פי' אמ\"ו זצללה\"ה הפסוק הנ\"ל לא תהיה משכלה ועקרה בארצך ופירש\"י משכלה מפלת נפלים וקוברת את בניה קרויה משכלה, ע\"כ. וא\"כ כיון שלא יפילו נפלים ולא יהיו עקרות, כן ירבו וכן יפרוצו, ויש לטעות ולומר שלא יהיה מספרם אלא מחמת ריבוי העם, ולא יספר כאו\"א בפני עצמו, ע\"כ מבטיח לנו הכתוב את מספר ימיך אמלא. היינו שלכל יחיד ויחיד בפני עצמו יהיה מספר. ולא רק מחמת הריבוי, עכת\"ד הקדושים של אמ\"ו זצללה\"ה.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 283,
      "char_length": 1992,
      "timestamp": "2025-02-06T19:21:16.428230"
    },
    {
      "id": "mishpatim_p284",
      "text": "וי\"ל קשר הפסוק באופן אחר דהנה אמרו חז\"ל (ע\"ז ט' ע\"א) תנא דבי אליהו ששת אלפים שנה הוי העולם שני אלפים תוהו שני אלפים תורה שני אלפים ימות המשיח ובעוונותינו שרבו יצאו מהם מה שיצאו, ע\"כ. ופירש האריז\"ל (עי' ישמח משה פ' עקב) ע\"ד דאיתא בגמ' (נדה י\"ג ע\"ב) אין בן דוד בא עד שיכלו כל הנשמות שבגוף שנא' (ישעי' נ\"ז) כי רוח מלפני יעטוף ונשמות אני עשיתי (ופירש\"י שבגוף. חדר כי גוף שם מקום המיוחד לנשמות העתידים להיות נולדים) וז\"פ יצאו מה שיצאו היינו שעדיין באין בגלגול פעם שנית אותם הנשמות שכבר יצאו בגלגול ראשון ולא באים נשמות חדשות, דין גרמא לאריכות הגלות. והנה כתיב (תהלים צ') שמחנו כימות עיניתנו, ולמדו חז\"ל ממקרא זה (סנהדרין צ\"ט ע\"ב) כי בימות המשיח יהיו ימי טובה ושמחה לישראל כמספר הימים אשר התענו בגולה עיי\"ש. ולכאורה איך אפשר שיתקיים בנו מקרא זה, והרי לא נותרו לנו עד כלות האלף הששי אלא פחות משלש מאות שנה, ואחר כלות האלף הששי הוא יום שכולו שבת העוה\"ב, ואיך יתקיים בנו שמחנו כימות עינותנו. הרי ארכו ימי גלותנו וימות המשיח יהיו זמן קצר בלבד, וע\"כ לומר שתתקיים לנו הבטחה זו ע\"ד שאמרו ז\"ל (סנהדרין צ\"ז ע\"א) יומו של הקב\"ה אלף שנה. כמו כן יאריך לנו הקב\"ה את הימים שאחר ביאת המשיח, עד שבזמן הקצר שעד כלות האלף הששי יהיו לישראל ימי שמחה כנגד כל שנות הגלות, כי כל יום יהיה ארוך מאד. אמנם אילו זכו ישראל ולא היה מתארך הגלות כ\"כ, היה יכול להתקיים בנו מקרא זה כפשוטו, שיהיו ימי השמחה שוים במספרם לימי הצער והעינוי אבל עתה בע\"כ לא יהיה מספר הימים שוה אלא אורך הזמן.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 284,
      "char_length": 1346,
      "timestamp": "2025-02-06T19:21:17.428716"
    },
    {
      "id": "mishpatim_p285",
      "text": "ועפי\"ז יל\"פ כוונת הכתוב לא תהי' משכלה וגו' את מספר ימיך אמלא, דהנה פרשה זו מדברת בזמן שישראל עושים רצונו של מקום, כדכתיב לעיל מיניה ועבדתם את ה' אלקיכם וגו', וא\"כ לא היו הנשמות חוזרות להתגלגל שנית בעוה\"ז, כי הגלגול הוא בסבת החטא, ועוד מבטיחנו הכתוב שאם יעשו ישראל רצונו של מקום לא יהיו בישראל מפילות נפלים ועקרות, וא\"כ ירבו מאד בני קיימא, ויכלו מהרה הנשמות מן האוצר הקרוי גוף ומיד בן דוד בא, וז\"ש הכתוב לא תהי' משכלה ועקרה בארצך, וא\"כ יכלו מהר הנשמות מן הגוף ותבא הגאולה, ע\"י כן את מספר ימיך אמלא פירוש שיהיו ימות המשיח שוים במספרם לימות העינוי והצער. ויתקיים המקרא שמחנו כימות עניתנו כפשוטו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 285,
      "char_length": 592,
      "timestamp": "2025-02-06T19:21:18.107855"
    },
    {
      "id": "mishpatim_p286",
      "text": "יאמרו כל אשר דבר ה' נעשה ונשמע. ג' במסורה נעשה ונשמע, ונשמע קולו בבואו אל הקדש לפני ה' ובצאתו ולא ימות. ונשמע פתגם המלך בכל מדינות מלכותו. ב) בתנא דבי אליהו בשעה שאמרו ישראל נעשה ונשמע מיד אמר הקב\"ה ויקחו לי תרומה וצ\"ב.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 286,
      "char_length": 219,
      "timestamp": "2025-02-06T19:21:18.399353"
    },
    {
      "id": "mishpatim_p287",
      "text": "ונראה לפרש בהקדם דברי הילקוט פ' יתרו עה\"פ וישאלו איש לרעהו לשלום ויבאו האהלה זה בית המדרש. וצ\"ב למה משמיענו הילקוט זאת שבאו לביהמ\"ד, ומה הרבותא בכך. ואפ\"ל עפ\"י מה דאיתא בגמ' (מועד קטן ט\"ז ע\"א) פעם אחת גזר רבי שלא ישנו לתלמידים בשוק מאי דרש (שה\"ש ז) חמוקי ירכיך כמו חלאים מה ירך בסתר אף דברי תורה בסתר יצא ר' חייא ושנה לשני בני אחיו בשוק וכו' שמע רבי איקפד וכו' מ\"ט עבד מר הכי א\"ל דכתיב (משלי ח) חכמות בחוץ תרונה א\"ל אם קרית לא שנית וכו' כדרבא דאמר רבא כל העוסק בתורה מבפנים תורתו מכרזת עליו מבחוץ ע\"כ. ולכאורה צ\"ב שהרי לימוד התורה צריך להיות בסתר וא\"כ למה תורתו מכרזת עליו בחוץ והרי לאו מעליותא היא לעשות פרהסיא מתורתו.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 287,
      "char_length": 619,
      "timestamp": "2025-02-06T19:21:18.540201"
    },
    {
      "id": "mishpatim_p288",
      "text": "ויתבאר בהקדם דאיתא בגמ' (ברכות דף ח' ע\"א) א\"ל רבא לרפרם בר פפא לימא לן מר מהני מילי מעליותא דאמרת משמיה דר' חסדא במילי דבי כנישתא א\"ל הכי אמר רב חסדא מאי דכתיב אוהב ה' שערי ציון מכל משכנות יעקב (תהלים פ\"ז) אוהב ה' שערים המצויינים בהלכה יותר מבתי כנסיות ובתי מדרשות ע\"כ ויל\"ד דרבא שאל ממנו שיאמר לו מילי מעליא דבי כנישתא והוא ענהו כי שערים המצויינים בהלכה חשובים יותר מבתי כנסיות ובתי מדרשות, א\"כ לא אמר לו מעלת בתי הכנסיות ובתי המדרשות.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 288,
      "char_length": 436,
      "timestamp": "2025-02-06T19:21:18.847909"
    },
    {
      "id": "mishpatim_p289",
      "text": "ואפ\"ל דהנה בשעה שישראל מתאספין יחד בבתי כנסיות שורה השכינה בביהכנ\"ס, כאמרם ז\"ל (סנהדרין ל\"ט ע\"א) כל בי עשרה שכינתא שריא, וכן כשלומדים בביהמ\"ד שורה שם השכינה כמאמר חז\"ל (ברכות דף ו' ע\"א). וא\"כ כשיוצאים מביהכ\"נ מסתלקת השכינה משם, נמצא לכאורה כי אין מעלת ביהכנ\"ס וביהמ\"ד שוה תמיד, כי יש בכל יום עליה וירידה בקדושתם, וקיי\"ל מעלין בקודש ואין מורידין (ברכות כ\"ח ע\"א) וזה אשר שאל ממנו רבא לימא לן מר מהני מילי מעליותא וכו' במילי דבי כנישתא, ר\"ל איך יתכן להיות עליה תדירה לביה\"כ בלא ירידה, וזה כונתו באמרו מילי ''מעליותא\" אמנם האמת הוא כי כל תכלית הישיבה בבתי כנסיות ובבתי מדרשות הוא, אשר גם בעת יצאו משם ויפנו לעסקיהם יהא ניכר עליהם שלמדו תורה, כי יתנהגו בכל ארחות חייהם עפ\"י התורה, וא\"כ נמצא כי גם צאתם מביהכ\"נ אין הורדה לקדושת ביהכ\"נ, אדרבה בכל אשר יפנו יהא ניכר עליהם שכל התנהגותם הוא עפ\"י התורה שלמדו בביהכ\"נ. וזה אשר השיב לו אוהב ה' שערים המצויינים בהלכה, היינו שכל התנהגותם הוא עפ\"י הלכה, יותר מבתי כנסיות ובתי מדרשות, כי זה תכלית הלימוד לשמור ולעשות, נמצא כי שפיר אמר לו ממילי מעליותא דבי כנישתא. שהרי עיקר מעלת ביהכנ\"ס ניכרת בעת היותו חוץ לכתלי ביהכנ\"ס, והבן.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 289,
      "char_length": 1060,
      "timestamp": "2025-02-06T19:21:19.064113"
    },
    {
      "id": "mishpatim_p290",
      "text": "וזאת אפ\"ל בכונת הגמ' הנ\"ל כל העוסק בתורה מבפנים תורתו מכרזת עליו מבחוץ, כי ע''י שעסק בתורה בביהמ\"ד, גם בלכתו בחוץ בשוקים וברחובות, יהיה ניכר בהתנהגותו לעין כל שלמד תורה, כי יהיו מעשיו מצויינים עפ\"י התורה. והנה לכאורה הסברא נותנת כי מה שאסרו חכמים ללמוד תורה בשוק הכונה דוקא לשוק של נכרים ומטעם שיש שם ערבוביא אסור ללמוד שם, משא\"כ במדבר שהיא ארץ לא עבר בה איש, א\"כ י\"ל שמותר ללמוד גם בשוק, שלא היו שם כי אם ישראל קדושים אבל האמת הוא כי גם במדבר אסור היה ללמוד בשוק, והטעם כי צריך ללמוד תוה\"ק בצניעות, וזה אשר משמיענו הילקוט ויבואו האהלה זה ביהמ\"ד, להודיענו בא כי לא רק כשהיה יתרו בארץ מדין שהוא מקום נכרים הוצרך ללמוד בביהמ\"ד. אלא גם בבואו אל המדבר נכנס לביהמ\"ד ללמוד ולא בשוק.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 290,
      "char_length": 676,
      "timestamp": "2025-02-06T19:21:19.565530"
    },
    {
      "id": "mishpatim_p291",
      "text": "ואפ\"ל בדרך רמז, ע\"ד מה שפירשנו (עי' בדברנו להלן בפ' תרומה) טעם שהקדימו ישראל נעשה לנשמע, עפ\"י דאיתא באדר\"נ פי\"א ר\"ט אומר אף הקב\"ה לא השרה שכינתו על ישראל עד שעשו מלאכה שנאמר ועשו לי מקדש ושכנתי בתוכם ע\"כ. ולזה נתכוונו באמרם נעשה היינו שנבנה את המשכן ועל ידי כך ונשמע נזכה להשראת השכינה ולשמיעת קול ה' מן המשכן.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 291,
      "char_length": 310,
      "timestamp": "2025-02-06T19:21:19.890903"
    },
    {
      "id": "mishpatim_p292",
      "text": "ולדרכנו י\"ל כי נרמז באמרם נעשה שיבנו בהמ\"ד ללמוד תורה, וכאשר פרשנו (בפ' ויקהל) דברי המדרש ילקוט (ר\"פ פקודי) ששאל משה מן הקב\"ה מה נעשה בנותר מכסף הנדבה אמר לו לך ועשה מהם משכן לדברות. ופירש היפה תואר פירוש ביהמ\"ד ללמוד תורה. וכתבנו כי טעם שהוצרכו לבנות מיד עם הקמת המשכן בהמ\"ד ללמוד תורה, כי המשכן הוא מקום מוכן להשראת השכינה, וכדי שיהיו ישראל ראוים להשראת השכינה צריכים הם להכנה גדולה, והראש וראשון לכך הוא לימוד התורה, כי בלא לימוד התורה לא נדע מה לעבוד את ה' וז\"פ נעשה, שנבנה בהמ\"ד מקום ללמוד תורה, כדי שנשמע, פי' שנוכל ללמוד תורה, כי בשוק אסור ללמוד, וגם ע\"י כך נזכה להשראת השכינה במשכן ונשמע קול ה' מבין שני הבדים. וזה אפשר לומר בדרך רמז בכוונת התנא דבי אליהו בשעה שאמרו ישראל נעשה ונשמע, היינו שנבנה בית המדרש מקום ללמוד התורה, מיד אמר הקב\"ה ויקחו לי תרומה, שיתנו המתנדבים בעם נדבתם לבנין בית המדרש, שגם זה מרומז במאמר ויקחו לי תרומה כמבואר במדרש ילקוט הנ\"ל, שמן הנותר מכסף התרומה בנו בית המדרש.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 292,
      "char_length": 900,
      "timestamp": "2025-02-06T19:21:20.064889"
    },
    {
      "id": "mishpatim_p293",
      "text": "וזה אפ\"ל דברי המסורה נעשה ונשמע, היינו שנבנה בהמ\"ד ללמוד תורה, וכי תאמר בלבבך הלא אין קדושתו קביעא וקיימא. כי הקדושה פוחתת בצאת בני ישראל מן הקדש, לכן אמר כי לא כן הוא הדבר אלא ונשמע קולו בבואו אל הקדש ובצאתו וגו', שגם ביציאתם מבהמ\"ד ובלכתם בשווקים וברחובות תורתם שלמדו בבהמ\"ד מעידה עליהם ונכרת בהתנהגותם, וא\"כ אין זו הורדה לקדושת בהמ\"ד, כי ונשמע פתגם המלך מלכו של עולם הקב\"ה בכל מדינות מלכותו, כי בכל מקום בואם יכירו וידעו פתגם המלך היא התורה שלמדו בבית המדרש.",
      "source_file": "Mishpatim.txt",
      "chumash": "שמות",
      "parsha": "mishpatim",
      "paragraph_index": 293,
      "char_length": 461,
      "timestamp": "2025-02-06T19:21:20.569447"
    }
  ],
  "shape": [
    294,
    768
  ],
  "created_at": "2025-02-06T19:21:20.812092"
}