{
  "paragraphs": [
    {
      "id": "beshalach2_p0",
      "text": "ואפשר שהעלימו מן השמים ממשרע\"ה השגת ידיעה זו היכן יוסף קבור, כדי שתהי' פעולת מצותו יתירה, ובכל פסיעה ופסיעה שנתייגע למצוא ארונו של יוסף קיים מצוה וקבל שכר, וע\"ד שאמרז\"ל (בב\"ר פ' ל\"ט סימן ט') באברהם שא\"ל הקב\"ה אל הארץ אשר אראך ולמה לא גילה לו מיד, כדי לחבבה בעיניו וליתן שכר על כל פסיעה ופסיעה, ולזה דרשו רז\"ל חכם לב יקח מצות על משרע\"ה, שנתייגע למצוא ארונו של יוסף וקיים בזה מצות הרבה בכל פסיעה ופסיעה, וא\"ש הקישור ומנין הי' יודע משה רבינו היכן יוסף קבור, דכיון שהעלימו מן השמים ידיעה זו ממנו כדי להרבות שכרו, א\"כ מנין הי' יודע, ותירצו דאחר שנתייגע הרבה פגעה בו סרח בת אשר והראה לו מקום קבורתו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 0,
      "char_length": 593,
      "timestamp": "2025-02-06T19:31:49.794240"
    },
    {
      "id": "beshalach2_p1",
      "text": "ויגד למלך מצרים כי ברח העם, פרש\"י איקטורין שלח עמהם, וכיון שהגיעו לג' ימים שקבעו לילך ולשוב וראו שאינן חוזרין למצרים, באו והגידו לפרעה ביום ד', ובחמישי ובששי רדפו אחריהם וליל שביעי ירדו לים בשחרית אמרו שירה והוא יום ז' של פסח: לכן אנו קורין השירה ביום השביעי עכ\"ל רש\"י ז\"ל, והקשה הרא\"ם ז\"ל דמהכא משמע שלא שהו ישראל משיצאו ממצרים עד שאמרו שירה רק ז' ימים, ובסו\"פ שלח כתב רשיז\"ל מיסודו של ר' משה הדרשן שמנה ימים שהו ישראל משיצאו ממצרים עד שאמרו שירה, ושמא י\"ל שר' משה הדרשן חולק עם האגדה האומרה בז' אמרו שירה עכ\"ל הרא\"ם, ותירוצו קשה דלא יתכן לומר שיחלקו במציאות, ויותר קשה דמפורש בגמ' (סוטה י\"ב ע\"ב) דבכ\"א בניסן אמרו ישראל שירה, ומפורש בפסוק (במדבר ל\"ג ג') ויסעו מרעמסס וגו' בחמשה עשר יום לחודש הראשון וגו', נמצא שביום הז' אמרו שירה, ואיך יחלוק ר\"מ הדרשן על זה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 1,
      "char_length": 759,
      "timestamp": "2025-02-06T19:31:50.111279"
    },
    {
      "id": "beshalach2_p2",
      "text": "ונקדים עוד קושית המזרחי (בפ' יתרו) עה\"פ ואשא אתכם על כנפי נשרים, פרש\"י (מדברי המכילתא) זה יום שבאו ישראל לרעמסס, שהיו ישראל מפוזרין בכל ארץ גושן. ולשעה קלה כשבאו ליסע ולצאת נקבצו כולם לרעמסס, אבל בפ' בא בפסוק ויסעו בנ\"י מרעמסס סכותה, אמרו במכילתא והביאו רש\"י בפירושו, ק\"כ מיל הי' ובאו שם לפי שעה שנאמר ואשא אתכם על כנפי נשרים. (ולפי\"ז הנס של כנפי נשרים נעשה להם בנסיעתם מרעמסס לסוכות), ושמא י\"ל שקול הוא ויבואו שניהם, דתרווייהו משתמעי מהאי קרא עכ\"ל הרא\"ם ז\"ל, ר\"ל דתרווייהו הי' ע\"י כנפי נשרים ובשעה קלה שלא כדרך הטבע, אמנם לפי\"ז צ\"ב מ\"ש רשיז\"ל כאן (בפ' בשלח) עה\"פ ויסעו מסוכות וגו' ביום השני, שהרי בראשון באו מרעמסס לסוכות, ולפי\"ד המכילתא ורש\"י ז\"ל (בפ' בא) שנסיעתם מרעמסס לסוכות על כנפי נשרים ובשעה קלה הי', א\"כ אין מוכרח שנסיעתם מסוכות ביום השני הי', והי' אפשר שיהי' הכל ביום א', כיון שלא הי' דרך הטבע כלל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 2,
      "char_length": 808,
      "timestamp": "2025-02-06T19:31:50.495716"
    },
    {
      "id": "beshalach2_p3",
      "text": "ונקדים עוד דברי המכילתא (פ' בא) עה\"פ ויסעו בנ\"י מרעמסס סכתה וגו', ק\"כ מיל, כהרף עין נסעו בנ\"י מרעמסס לסוכות, לקיים מ\"ש ואשא אתכם על כנפי נשרים. סכותה סכות ממש וכו' דברי ר' אליעזר, ר\"ע אומר אין סוכות אלא ענני הכבוד וכו' עכ\"ד המכילתא, ובמרכבת המשנה הקשה איכא למידק למ\"ד סוכות ממש עשו להם, הלא נאסרו במלאכת יו\"ט במצרים, וזה הי' ביום ט\"ו איך עשו מלאכה ובנו סוכות, אם לא כשיטת הפסיקתא פ' מסעי דביאתם לסוכות הי' ביום ט\"ז והוא הנקרא מחרת הפסח, ואף דחוה\"מ הי' דאסור ג\"כ בעשיית מלאכה. אפשר שעדיין לא הוזהרו אשביתת חוה\"מ, כמו שלא נזהרו אחימוץ אלא יום א' עכ\"ל המרכבת.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 3,
      "char_length": 556,
      "timestamp": "2025-02-06T19:31:50.913219"
    },
    {
      "id": "beshalach2_p4",
      "text": "ותירוצו צ\"ב דהרי מפורש בתורה (פ' מסעי ל\"ג ג') ויסעו מרעמסס בחדש הראשון בחמשה עשר יום וגו' ממחרת הפסח וגו', והתוס' במס' קדושין (ל\"ז ע\"ב) הביאו ראי' מהאי קרא, דממחרת הפסח משמעותו ממחרת שחיטת הפסח דהיינו יום ט\"ו, שבו נסעו ישראל מרעמסס כמפורש בקרא עייש\"ד התוס', וכיון שנסיעתם מרעמסס לסוכות כהרף עין ועל כנפי נשרים הי', ויצאו מרעמסס ביום ט\"ו איך לא הגיעו לסוכות עד יום ט\"ז, אם לא שנדחוק דר\"א דס\"ל סוכות ממש, והפסיקתא דפ' מסעי דס\"ל ביום ט\"ז הגיעו לסוכות, חולקים על שיטה זו דנסיעתם מרעמסס לסוכות על כנפי נשרים וכהרף עין הי', אמנם בלא\"ה קשה דהרי ק\"כ מיל מרעמסס לסוכות, ומהלך אדם בינוני י' פרסה ליום דהיינו ארבעים מיל, נמצא ק\"כ מיל הוא מהלך ג' ימים בדרך הטבע, ואף לדברי הפסיקתא שביום ט\"ז הגיעו לסוכות עכ\"ח בדרך נס הי', וא\"כ מ\"ט מוכרח לומר שלא הגיעו לסוכות עד יום ט\"ז, ושמא ביום ט\"ו שנסעו מרעמסס, מיד כהרף עין הגיעו לסוכות.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 4,
      "char_length": 813,
      "timestamp": "2025-02-06T19:31:51.198946"
    },
    {
      "id": "beshalach2_p5",
      "text": "ואפ\"ל עפי\"ד הגמ' (שבת פ\"ז ע\"ב) ששי למאי רבא אמר ששי לחנייתן ר' אחא בר יעקב אמר ששי למסען, וקמפלגי בשבת דמרה, מר סבר אשבת איפקוד אתחומין לא איפקוד, (פרש\"י הלכך כשנסעו מרפידים נסעו בשבת, שלא הוזהרו שלא לילך יותר מאלפים אמה) ומר סבר אתחומין נמי איפקוד עיי\"ש, והנה על שביתת יו\"ט של פסח נצטוו ישראל במצרים טרם שנצטוו על השבת, שנאמר מקרא קודש יהי' לכם וכמ\"ש במרכבת לעיל, ורוב פוסקים ס\"ל דתחומין נאסרו ביו\"ט כמו בשבת, ולפי\"ז לא יכלו לנסוע מרעמסס לסוכות ק\"כ מיל ביו\"ט, די\"ב מיל מדאורייתא ואף דנסיעתם בדרך נס ועל כנפי נשרים הי', מ\"מ גם בדרך זה איכא איסור תחומין, וראי' מדברי הגמ' (ערובין מ\"ג ע\"ב) דמספקא לי' אי יש תחומין למעלה מי' או לא, ואי יש תחומין לא אתי אלי' בשבת משום תחומין עיי\"ש, וביאת אלי' לא בדרך הטבע יהי' ועכ\"ח גם בזה איכא תחומין.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 5,
      "char_length": 733,
      "timestamp": "2025-02-06T19:31:51.589524"
    },
    {
      "id": "beshalach2_p6",
      "text": "ובזה יתבאר לעניננו דלא יכלו לנסוע מרעמסס לסוכות ביום ט\"ו משום איסור תחומין די\"ב מיל, אמנם לא יכלו להתמהמה במצרים עוד, וכמ\"ש האריז\"ל דאלמלי נשתהו עוד רגע במצרים, היו משוקעים בשער הנו\"ן של טומאה והוכרחו לצאת מיד, לכן יצאו מרעמסס ביום ט\"ו א' דפסח, אך לא הרחיקו לילך חוץ לתחום משום יו\"ט, ועמדו מחוץ לעיר כדי שלא יתמהמהו במקום טומאה, וביום ט\"ז שהוא חוה\"מ נסעו משם לסוכות ק\"כ מיל בשעה קלה, ובזה יתיישב לשון הכתוב בפ' מסעי ויסעו מרעמסס בחדש הראשון בחמשה עשר יום וגו', ויסעו בני ישראל מרעמסס ויחנו בסוכות, וצ\"ב מדוע כפל הכתוב להזכיר נסיעתם מרעמסס ב\"פ וסגי בחדא, ולדרכנו נסעו ישראל מרעמסס ב\"פ, ביום ט\"ו יצאו מן העיר שלא לשהות במקום טומאה עוד רגע, אבל חנו בעיבורה של עיר בתוך התחום כנ\"ל, ולענין הרבה דברים נחשב סמוך ונראה כתוך העיר כמבואר בגמ' מגילה עיי\"ש, ע\"כ כפל הכתוב עוה\"פ ויסעו בנ\"י מרעמסס ויחנו בסוכות, וזה הי' ביום ט\"ז, ויתיישב בזה שיטת הפסיקתא פ' מסעי וגם תי' המרכבת דביאתם לסוכות ביום ט\"ז הי', ואף שביום ט\"ו נסעו מרעמסס כמפורש בקרא, ונסיעתם הי' על כנפי נשרים וכהרף עין, מ\"מ לא הגיעו לסוכות ביום שיצאו לטעם איסור תחומין כנ\"ל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 6,
      "char_length": 1023,
      "timestamp": "2025-02-06T19:31:51.966528"
    },
    {
      "id": "beshalach2_p7",
      "text": "ולכאורה אפשר לתרץ בזה סתירת דברי רשיז\"ל (עיין לעיל קושיא א'), דאם נחשוב מיציאה ראשונה שהי' ביום ט\"ו ניסן, שיצאו רק מתוך העיר שלא לשהות במקום טומאה כנ\"ל, אפשר ששהו ישראל ח' ימים עד שאמרו שירה, ואם נחשוב מיציאה השני' שנסעו מתחומה של עיר ביום ע\"ז, נמצא ששהו רק ז' ימים עד שאמרו שירה על הים, אמנם אין תירוץ זה מספיק שעדיין יקשה מדברי הגמ' (סוטה י\"ב ע\"ב הנ\"ל) דבכ\"א בניסן אמרו ישראל שירה, א\"כ אינו אלא ז' ימים אף אם נחשוב מהיציאה של יום ט\"ו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 7,
      "char_length": 436,
      "timestamp": "2025-02-06T19:31:52.439298"
    },
    {
      "id": "beshalach2_p8",
      "text": "ואפ\"ל ששהו ונתעכבו ישראל על הים גם יום ח', דלא יכלו ליסע משם בז' של פסח משום תחומין כנ\"ל, שהרי נצטוו ביום השביעי מקרא קודש, ועוד טעם בדבר דהרי כל כליהם של המצריים של ע\"ז הי', והי' צורך לבטל הע\"ז טרם שזכו בה ישראל, דאח\"כ אין לו ביטול עולמית, וביו\"ט א\"א לבטלו דהוי כתיקון מנא, דזהו הכשרן וא\"א להשתמש בהם זולת זה, ע\"כ לא הי' אפשר להם ליטול ביזת הים ביום ז', ונשארו שם ליום ח' ואמרו עוד הפעם שירה, נמצא שאמרו שירה ביום ז' וביום ח', ומ\"ש בגמ' בכ\"א בניסן אמרו שירה ומ\"ש רש\"י בשביעי אמרו שירה ובמקו\"א כתב שאמרו שירה לח' ימים כולהו איתנייהו וא\"ש.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 8,
      "char_length": 538,
      "timestamp": "2025-02-06T19:31:52.686247"
    },
    {
      "id": "beshalach2_p9",
      "text": "ויגד למלך מצרים כי ברח העם וגו', פרש\"י ז\"ל איקטורין שלח עמהם, וכיון שהגיעו לג' ימים וכו' באו והגידו לפרעה ביום ד', ובחמשה ובששי רדפו אחריהם וליל שביעי ירדו לים, בשחרית אמרו שירה והוא יום ז' של פסח וכו' והקשו המפורשים דבסו\"פ שלח כתב רש\"י ז\"ל שמונה חוטים שבציצית כנגד שמונה ימים ששהו ישראל משיצאו ממצרים עד שאמרו שירה על הים, והוא סתירה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 9,
      "char_length": 335,
      "timestamp": "2025-02-06T19:31:52.981725"
    },
    {
      "id": "beshalach2_p10",
      "text": "ב) אז ישיר משה ובנ\"י את השירה הזאת לה' ויאמרו לאמר וגו', יש להבין אומרו ישיר בלשון עתיד והול\"ל אז שר משה וגו', גם הכפל ויאמרו לאמר צ\"ב.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 10,
      "char_length": 135,
      "timestamp": "2025-02-06T19:31:53.168038"
    },
    {
      "id": "beshalach2_p11",
      "text": "ג) ובמדרש רבה (פ' כ\"ג סימן ד') הה\"ד (משלי ל\"א) פיה פתחה בחכמה ותורת חסד על לשונה וצ\"ב.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 11,
      "char_length": 86,
      "timestamp": "2025-02-06T19:31:53.273467"
    },
    {
      "id": "beshalach2_p12",
      "text": "ונל\"פ בהקדם דברי החת\"ס זלה\"ה לפרש בנוסח התפלה וזדים טבעת וידידים העברת ויכסו מים צריהם וכו', על זאת שבחו אהובים וכו' על שפת הים יחד כולם הודו וכו', דיל\"ד אחר שכבר אמר על זאת שבחו אהובים מה זה שחזר ואמר על שפת הים יחד כולם הודו וכו', ופי' שהיו בישראל שני כתות, האהובים והידידים שבישראל תיכף כשידידים העברת ויכסו מים צריהם, שבחו והודו להקב\"ה שהאמינו בו ית\"ש שהציל אותם מיד המצריים, אך שאר העם לא שבחו כי אמרו כשם שאנו עולים מצד זה כך מצרים עולים מצד אחר והמרו על ים בים סוף, עד שרמז הקב\"ה ופלטם הים לחוץ כדכתיב וירא ישראל את מצרים מת על שפת הים, וז\"פ על שפת הים יחד כולם הודו שירת הים אפילו אותם שאינם אהובים ידידים אלא כולם אמרו שירה עכ\"ל היוצא לנו מדבריו הקדושים שאמרו ישראל שירה ב\"פ משה רבינו ובני העלי' אמרו שירה מיד כשידידים העברת ויכסו מים צריהם, ושאר העם לא אמרו שירה עד שפלט הים את המצריים ואז חזרו ואמרו כל ישראל שירה: האמנם שממשמעות הלשון נראה שגם הידידים והאהובים לא אמרו שירה עד לאחר שיצאו מן הים ויכסו מים צריהם, ולפי\"ז אינו מדוייק כ\"כ מה שאמר על שפת הים יחד כולם הודו, שהרי גם כשאמרו הידידים כבר היו על שפת הים, אמנם נראה לומר שהידידים והאהובים אמרו שירה מיד כשנכנסו בתוך הים ביבשה, שהאמינו שהקב\"ה יעשה להם נס בשלימות להציל אותם מיד המצריים, וממ\"ש על זאת שבחו אהובים וכו' אחר וידידים העברת ויכסו מים צריהם אינו מוכרח שאח\"כ שבחו אהובים, אולם מאמר על זאת שבחו סובב על תחלת הענין שאמר וים סוף להם בקעת וכו' ומיד התחילו לומר שירה על שם העתיד שהאמינו בהשי\"ת שיגמור הנס בשלימות להציל אותם הצלה גמורה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 12,
      "char_length": 1406,
      "timestamp": "2025-02-06T19:31:53.365780"
    },
    {
      "id": "beshalach2_p13",
      "text": "והנה כתבו התוס' (ערכין ט\"ו ע\"א) שישראל לא עברו הים לרחבו מצד זה לזה, רק הלכו כחצי גורן עגולה ועיין בספר ערבי נחל פרשת בשלח שהאריך לבאר דבריהם ז\"ל וכתב שי\"ב שבילים היו לי\"ב שבטים ועיגול החיצונה הי' גדול מאוד להקיף כל העיגולים הפנימיים עיי\"ש, ומובן שמשעה שנכנסו לתוך הים עד שעברו כולם נשתהו זמן רב, ואינו מפורש להדיא כמה שהו בעברם את הים, ויתכן לומר מסברא ששהו יום אחד שלם, כי האנשים לבד היו ששים רבוא והנשים וילדיהם ונוסף עליהם הערב רב שהיו הרבה יותר מישראל וע\"כ מסתבר שנשתהו בעברם את הים יום אחד שלם, ואף אם נאמר שעברו כולם את הים בליל שביעי של פסח כנראה מפשטות לשון רש\"י והמדרשים, אבל מה שפלט הים את המצריים על שפתו זה וודאי אפ\"ל שנשתהה עד יום ח' כי אינו מבואר בדבריהם כלל אימת הי' א\"כ י\"ל שנתעכבו בתוך הים עד שחרית של יום שמיני ואז פלט אותם הים וחזרו כל ישראל לומר שירה יחד כולם, נמצא דביום אחרון של פסח חזרו ואמרו שירה על שפת הים, ומעתה אין עוד סתירה בדברי רש\"י ז\"ל דתרווייהו אתנהו, ביום שביעי של פסח אמרו שירה האהובים והידידים מיד, ואח\"כ ביום שמיני חזרו כולם יחד ואמרו עוה\"פ שירה על שפת הים אחר שפלט הים את המצריים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 13,
      "char_length": 1019,
      "timestamp": "2025-02-06T19:31:54.103518"
    },
    {
      "id": "beshalach2_p14",
      "text": "ובזה מדוייק לשון הפסוק אז ישיר משה וגו' דבשעה שאמרו שירה פעם ראשונה, ראו ברוה\"ק שעתידים לומר עוה\"פ שירה לכך אמר ישיר בלשון עתיד, וז\"פ ויאמרו לאמר שאמרו שירה בידיעה זו שיחזרו עוה\"פ לומר כולם יחד על שפת הים, וזה שהסמיכו במדרש לכאן הפסוק פיה פתחה בחכמה וגו' דאיזהו חכם הרואה את הנולד, וגם המה ראו בחכמתם וברוה\"ק שעתידים לומר שירה עוה\"פ, ומדוייק הלשון \"פתחה\" שהם עשו פתיחה והתחלה ויחד כולם גמרו ביום המחרת.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 14,
      "char_length": 402,
      "timestamp": "2025-02-06T19:31:54.597048"
    },
    {
      "id": "beshalach2_p15",
      "text": "או י\"ל עפי\"מ שפירשתי בדברי רש\"י ז\"ל (איכה ב') עה\"פ פצו עליך פיהם וגו' מפני מה הקדים פ\"א לעי\"ן מפני שהיו אומרים בפיהם מה שלא ראו בעיניהם. עפ\"י מה שפי' השלה\"ק אמרם ז\"ל (שמו\"ר פ' כ\"ג) עתידים ישראל לומר שירה לעתיד לבוא, היינו שיאמרו ישראל שירה וישבחו להקב\"ה על הנס העתיד לבוא ואף שלא הגיע עליהם מאמינים הם בהקב\"ה שבודאי יקיים הבטחתו ואומרים שירה על זה, וז\"פ שהיו אומרים בפיהם מה שלא ראו בעיניהם, ר\"ל שגם בשעת החורבן שלא ראו בעיניהם שום טובה ונחמה אעפי\"כ שבחו והודו להקב\"ה ע\"ש הישועה העתידה להיות, ועד\"ז לענינינו דהאהובים וידידים אמרו שירה תיכף אף שלא ראו עדיין בעיניהם הישועה וההצלה מידי המצריים, אעפי\"כ פתחו לומר שירה והקדימו פיהם לעיניהם, וזהו פי' הפסוק פיה פתחה בחכמה שעשו פתיחה והתחלה בפיהם ולא המתינו מלומר שירה עד שיראו הנס בעיניהם, וזהו תורת חסד על לשונה דהנה אחר שרואין הישועה צריכים לומר שירה מן הדין, אבל טרם שראו הישועה אמרו שירה מצד החסד ולפנים משוה\"ד וא\"ש קישור פסוק זה לשירת הים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 15,
      "char_length": 889,
      "timestamp": "2025-02-06T19:31:54.815453"
    },
    {
      "id": "beshalach2_p16",
      "text": "עוד אפ\"ל בהקדם דברי המדרש (ילקוט שה\"ש ד' רמז תתקפ\"ח) כמגדל דוד צוארך כמו שגדלו דוד בספרו לגוזר ים סוף לגזרים וגו' וצ\"ב, ונקדים דברי המד\"ר (פ' וישב פרשה פ\"ד סימן ח') ועשה לו כתונת פסים, כתיב לכו וראו מפעלות אלקים וכתיב בתרי' הפך ים ליבשה, למה וישנאו אותו בשביל שיקרע הים לפניהם וצ\"ב, ויתבאר עפי\"ד ק\"ז היש\"מ זלה\"ה (פ' בשלח) לפרש המדרש פליאה הים ראה וינוס מה ראה ברייתא דרבי ישמעאל ראה, וז\"ל דאיתא במדרש כשהעמיד יהושע את החמה אמרה לו אני קשיש ממך, אמר יהושע וכי אומר עבד זקן לאדון קטון אני קשיש ממך כבר נשתעבדת לזקני יוסף שנאמר והנה השמש וגו', ואיתא במדרש (פ' כ\"א סי' ו') כי הים טען ג\"כ אני קשיש ממך, וז\"ש מה ראה לסתור טענתו ראה ארונו של יוסף דנשתעבדו לו כל הנמצאים השמימה, וכ\"ת ים מנ\"ל, ראה ברייתא דרבי ישמעאל דדריש ק\"ו וכו', ומה גרמי השמימיים שהם נמצאים נכבדים נשתעבדו ליוסף, כש\"כ הנמצאים בעולם היסודות וע\"כ נס מפניו עכ\"ל, והנה כתב הרע\"ב מברטנורא במשנה (אבות פ\"ה מ\"ד) עשרה נסים נעשו לאבותינו במצרים ועשרה על הים, דא' מהנסים שנקרע הים לי\"ב גזרים כמספר השבטים, וכל שבע עבר בדרך מיוחד וזה שנאמר לגוזר ים סוף לגזרים. והוא מאמר חכז\"ל במדרש ולכאורה לפי דברי ק\"ז היש\"מ זלה\"ה שדן הים ק\"ו מהשתעבדות השמש ליוסף. אין זה רק לשבע יוסף משא\"כ בשאר שבטים לא הי' לו ק\"ו זה ולמה נקרע לכל שבע ושבט בפ\"ע.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 16,
      "char_length": 1183,
      "timestamp": "2025-02-06T19:31:55.248653"
    },
    {
      "id": "beshalach2_p17",
      "text": "וביארתי עפימ\"ד בזוה\"ק (פרשת וישב) שהכרח גדול הי' שישלטו השבטים על יוסף דעי\"ז שלטו אח\"כ על מצרים כי יוסף הי' השליט במצרים והם שלטו עליו ועי\"ז הי' להם הכח להתגבר על טומאת מצרים, ולולא זאת לא היו יכולין לצאת משם ח\"ו לעולם עיי\"ש, ולפי\"ז אם נקרע הים לפני יוסף ק\"ו שיש לו להקרע לפני כל השבטים שהם שלטו על יוסף במה שמכרו אותו לעבד, וזהו פי' המדרש למה וישנאו אותו כדי שיקרע הים לפניהם דייקא ולא ליוסף בלבד וזה נסתבב ע\"י השנאה שמכרוהו לעבד, מבואר דממה שנקרע הים לי\"ב גזרים נתוודע ונתברר שכל הנמצאים בעולם משועבדים לכולם, וזהו פי' המדרש כמגדל דוד צוארך כמו שגדלו דוד בספרו לגוזר ים סוף לגזרים דמפסוק זה נלמד שנקרע הים לי\"ב גזרים לכל שבט בפ\"ע כנ\"ל במדרש ובזה הגדיל דוד את השבטים הק' שהי' להם שליטה על יוסף ועי\"ז היו שולטין להתגבר על טומאת מצרים וכל הנמצאים המשועבדים להם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 17,
      "char_length": 760,
      "timestamp": "2025-02-06T19:31:55.833909"
    },
    {
      "id": "beshalach2_p18",
      "text": "אמנם יש להבין הלא קוב\"ה לא עביד ניסא למגנא ולאיזה צורך נקרע הים לי\"ב גזרים דוקא, וכמו\"כ היו יכולין לעבור דרך הים כולם בדרך אחד. ויל\"פ ע\"ד מ\"ש האריה\"ק בענין נוסח התפלה שאין לשנות מנוסח לנוסח כי כל שבט יש לו שער בפ\"ע להכניס התפלה ומי שמשנה לנוסח שבט אחר אין תפלתו מתקבלת, אולם האריז\"ל תיקן נוסח כולל ואף אם אין ידוע מאיזה שבט הוא יוכל להתפלל בנוסח זה, ועד\"ז אפ\"ל לענינינו דע\"כ עברו ישראל את הים בי\"ב שבילין, כי מיד שנכנסו ישראל בתוך הים ביבשה התחילו לומר שירה כנ\"ל וכל שבט ושבט יש לו שער בפ\"ע להעלות תפלתו, ובחינת התפלה שונה זה מזה, ולרמז זאת נעשה להם י\"ב שבילין לכל א' דרך בפ\"ע, ואחר שעלו מן הים עשו רמז ופועל דמיוני על נוסח הכולל כתקנת האריז\"ל וחזרו לומר שירה חדשה יחד כולם, ולז\"א על זאת שבחו אהובים וכו' ונתנו ידידים זמירות שירות ותשבחות, ר\"ל כ\"א לפי בחינתו ואח\"כ שירה חדשה שבחו גאולים על שפת הים כולם הודו והמליכו ואמרו, שנשתתפו בזה כולם יחד בנוסח הכולל לכל השבעים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 18,
      "char_length": 867,
      "timestamp": "2025-02-06T19:31:56.196522"
    },
    {
      "id": "beshalach2_p19",
      "text": "עוד י\"ל עפי\"ד הנ\"ל שתכלית שנאת השבטים ליוסף הי' בשביל שיקרע הים לפניהם. והנה כל זמן שלא נתגלה להם תכלית השנאה שהוא קי\"ס, הי' להם להשבטים הק' קצת טינא בלבם על שבע יוסף, וחשבו סיבת השנאה לטעם אחר כמבואר במדרשי חז\"ל שראו ברוה\"ק ירבעם יוצא ממנו וכדומה, וא\"כ לא הי' ביניהם אחדות ושלום כ\"כ, משא\"כ אחר קרי\"ס נתברר להם שהי' זאת סיבה מן השמים כדי שיקרע הים לפניהם אז נעשה שלום ואחדות גמור בין השבטים וחזרו לשבח את הקב\"ה כולם יחד, וזהו פי' על שפת הים אחר שעלו מן הים ונתברר להם סיבת שנאתם ליוסף, יחד כולם הודו בשירה חדשה להקב\"ה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 19,
      "char_length": 518,
      "timestamp": "2025-02-06T19:31:56.616506"
    },
    {
      "id": "beshalach2_p20",
      "text": "עוד י\"ל עפי\"מ דאיתא במד\"ר פ' זו (פ' כ\"ג סי' ז') אז ישיר משה הה\"ד קדמו שרים אחר נוגנים וכו' כיון שיצאו ישראל מן הים באו המלאכים להקדים שירה לפני הקב\"ה, א\"ל הקב\"ה יקדמו בני תחלה וכו', ואיתא בדרז\"ל שישראל מקדימין לומר שירה להקב\"ה ואח\"כ המלאכים, ושוב חוזרים ואומרים ישראל והמלאכים שירה ביחד וכמו שאומרים בקדושה כתר יתנו לך ה\"א מלאכים המוני מעלה עם עמך ישראל קבוצי מטה יחד כולם קדושה לך ישלשו וכו', וזהו פי' על שפת הים יחד כולם הודו, היינו המלאכים עם ישראל אחר שכבר אמרו בפ\"ע חזרו ואמרו עוה\"פ שירה חדשה כולם יחד. ועפ\"י דרכים הנ\"ל יתיישב ג\"כ סתירת דברי רש\"י ז\"ל שהובא לעיל (בדרוש הקדום קושיא א') דבפ' בשלח כתב דבשחרית ז' דפסח אמרו שירה, ובסו\"פ שלח כתב שאמרו שירה ביום ח' עיי\"ש, אמנם כיון שמוכרח בלא\"ה שאמרו שירה שני פעמים כנראה מנוסח לשון התפלה, יתכן לומר שפעם שנית אמרו ביום אחרון של פסח, ואין סתירה בדברי רש\"י ז\"ל ושניהם צדקו יחדיו, השי\"ת ירחם עלינו יחיינו ויקרבינו לגאולה האמיתית ונזכה כולנו לישועה שלימה ואמיתית, ישמחו השמים ותגל הארץ, ונזכה לכל מיני ישועות טובות בקדושה ובטהרה בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו במהרה בימינו אמן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 20,
      "char_length": 1045,
      "timestamp": "2025-02-06T19:31:56.890024"
    },
    {
      "id": "beshalach2_p21",
      "text": "ויגד למלך מצרים כי ברח העם וגו' פירש\"י איקטורין שלח עמהם וכיון שהגיעו לשלשת ימים שקבעו לילך ולשוב וראו שאינן חוזרין למצרים באו והגידו לפרעה ביום ד', ובחמישי ובששי רדפו אחריהם וליל שביעי ירדו לים בשחרית אמרו שירה והוא יום שביעי של פסח לכן אנו קורין השירה ביום השביעי ע\"כ, כבר הבאנו לעיל קושית המפורשים דזה סותר למש\"כ רש\"י ז\"ל (סו\"פ שלח) בשם ר' משה הדרשן דשמונה ימים שהו ישראל משיצאו ממצרים עד שאמרו שירה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 21,
      "char_length": 403,
      "timestamp": "2025-02-06T19:31:57.390370"
    },
    {
      "id": "beshalach2_p22",
      "text": "ב) במדרש ילקוט (רמז רנ\"ד) ויסע משה את ישראל מהו ויסע שהסיען בעל כרחן. דכתיב ויקח שש מאות רכב עמד פרעה וקשט אותן הסוסים באבנים טובות ומרגליות, וכשנטבעו בים היו צפין על שפת הים והיו ישראל יורדין בכל יום ונוטלין מהן. ולא היו מבקשין לזוז משם כיון שראה משה כך א\"ל מה אתם סבורים שבכל יום הים מעלה לכם אבנים טובות ומרגליות, עמד והסיען בעל כרחן ע\"כ, וצ\"ב מדוע הסיען בעל כרחן הלא הי' רצון השי\"ת שיטלו הרכוש דמהאי טעמא הי' הים מעלה להם אבנים טובות ומרגליות וכמ\"ש בילקוט (רמז רל\"ט) עה\"כ וירא ישראל את מצרים מת מפני ארבעה דברים ראו ישראל את מצרים מתים וכו' וכדי שיקחו ישראל את הביזה שהיו טעונין כסף וזהב ואבנים טובות ומרגליות וכו', וירא ישראל את מצרים מתים אינו אומר אלא מת, מתים ולא מתים כענין שנאמר ויהי בצאת נפשה כי מתה, וכי מתה היתה אלא מתה ולא מתה עכ\"ד המדרש, גם ראוי להבין מדוע עשה ה' ככה שיהיו המצריים חיים לאחר שפלטם הים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 22,
      "char_length": 817,
      "timestamp": "2025-02-06T19:31:57.605427"
    },
    {
      "id": "beshalach2_p23",
      "text": "ואפ\"ל עפי\"ד המדרש שהמצריים היו מקשטין סוסיהם באבנים טובות ומרגליות, והנה כל כליהם היו של ע\"ז וישראל אי אפשר לבטל ע\"ז של עכו\"ם וע\"כ הי' הכרח שיהיו חיים עדיין והם עצמם יבטלו הע\"ז, העולה מדברינו שכן הי' רצון השי\"ת שיעלו ישראל רכוש הים, וא\"כ קשה מדוע הסיען משרע\"ה בעל כרחן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 23,
      "char_length": 269,
      "timestamp": "2025-02-06T19:31:58.023929"
    },
    {
      "id": "beshalach2_p24",
      "text": "אמנם נראה דאף שהי' רצון הבוי\"ת שיטלו הרכוש אבל רק במדה ידועה ולא יותר מדאי דאז יותר משהוא מועיל הוא מזיק, וכמ\"ש הכתוב ודי זהב שבשביל רוב הזהב שהי' להם עשו את העגל, ועל כן הסיען משה בעל כרחן שלא יקחו יותר מדאי, ומבואר בדברי המדרש הנ\"ל שהיו ישראל יורדין בכל יום ונועלין מהם וכו' א\"ל משה מה אתם סבורים שבכל יום הים מעלה וכו' ע\"כ, ולא מצאתי מבואר בשום מקום כמה ימים נשתהו שם, ועכ\"פ משמע מלשון המדרש ששהו אצל עכ\"פ שני ימים דהרי מיעוט רבים שנים וע\"ז קאמר בכל יום, ואפשר דע\"כ נשתהו שני ימים מפני שביום שביעי של פסח הוא יו\"ט ולא היו יכולין ללקוט מהביזה דברים המוקצים ביו\"ט, ויצאו אל שפת הים גם ביום השני שהוא שמיני ליציאתם, ועל שראו במפלת שונאיהם אמרו שירה עוד פעם, ולפי\"ז יתכן שאמרו ישראל שירה בשביעי ובשמיני ליציאתם, ובזה יתורץ דברי רש\"י ז\"ל, שבפרשה זו כתב דבשביעי אמרו שירה, ובסו\"פ שלח כתב בש\"ר משה הדרשן בשמיני ליציאתם אמרו שירה, ולדרכינו תרווייהו אתנייהו וא\"ש.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 24,
      "char_length": 857,
      "timestamp": "2025-02-06T19:31:58.184865"
    },
    {
      "id": "beshalach2_p25",
      "text": "ויהפך לבב פרעה ועבדיו אל העם ויאמרו מה זאת עשינו כי שלחנו את ישראל מעבדנו, יל\"ד באומרו ויהפך וגו' דהרי מעיקרא בשלחם לא עשו זאת מדעתם ורצונם כ\"א אנוס על פי הדיבור שהוכו במכות נמרצות ואיך יצדק לומר ויהפך, גם יל\"ד בטעם שינוי הלשונות מתחלה אמר את העם ואח\"כ כי שלחנו את ישראל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 25,
      "char_length": 271,
      "timestamp": "2025-02-06T19:31:58.607006"
    },
    {
      "id": "beshalach2_p26",
      "text": "ב) במדרש (פרשה כ' סימן ה') ויהי בשלח פרעה וגו' הה\"ד (שה\"ש ד') שלחיך פרדס רמונים: א\"ר לוי משל לאחד שהי' לו שדה והי' בה גל של צרורות, עמד ומכרה לאחר, עמד אותו האיש שקנאה והעביר את הגל מתוכה ומצא תחתיו מים חיים, נטעה גפנים וכו' נטע בה כל מיני בשמים וכו', כל מי שהי' עובר עלי' היה משבחה, עבר עליה אותו האיש שמכרה ראה אותה מליאה כל טוב, אמר אוי לי שכך מכרתי אוי לי שכך הוצאתי מידי, כך היו ישראל במצרים גל של צרורות שנאמר (שם) גן נעול אחותי כלה גל נעול מעין חתום, כיון שיצאו נעשו פרדס רמונים וכו', כל הימים שהיו הבריות רואים את ישראל היו משבחין אותן וכו', פרעה ראה אותן שורות שורות כהנים לוים וישראלים דגלים דגלים התחיל צוח ואמר אוי לו לאותו האיש שכך הוציא מתחת ידו לכך נאמר ויהי בשלח פרעה עכ\"ד המדרש, וצ\"ב דמיון המשל, ומדוע נמשלו ישראל במצרים לגל של צרורות, גם הראי' שהביא המדרש מפסוק גל נעול מעין חתום אינו מובן דאדרבה ה\"ז מורה למעלתן וחשיבותן שלא נטמעו באומות כאמרז\"ל, גם סיום דברי המדרש צ\"ב פרעה ראה אותן שורות שורות וכו' דגלים דגלים התחיל צווח ואומר אוי לי וכו' לכך נאמר ויהי בשלח פרעה, לכאורה הלא לא נעשו ישראל לדגלים כ\"א במדבר ואחר קרי\"ס, ואיך התחרט עכשיו על מה שלא ראה, ואם ראה העתידות באצטגנינות כמ\"ש ראו כי רעה נגד פניכם, ובמדרש שאמר מי ומי ההולכים כולם ימותו במדבר ולא יכנסו לארץ כ\"א יהושע וכלב, א\"כ איך לא ראה כמו\"כ בראשונה כששלחם, ומה ניתוסף עכשיו בידיעתו מגדולת חשיבותן של ישראל, שעבור זה התחרט על שליחתם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 26,
      "char_length": 1313,
      "timestamp": "2025-02-06T19:31:58.822018"
    },
    {
      "id": "beshalach2_p27",
      "text": "והנל\"פ עפימ\"ד בזוה\"ק (פ' שמות ט\"ו ע\"א) כד חמא קוב\"ה חדוותא סגיאה דהאי עלמא תתאה וכו'. אמר דלמא ח\"ו יתערבון בשאר עממין וישתאר פגימותא בכלהו עלמין, מה עבד קב\"ה טלטל לכלהו וכו' עד דנחתו למצרים למידר דיוריהון בעם קשי קדל דמבזין נימוסיהון ומבזין להון לאתחתנא בהון וכו' גוברין געלן בהון נוקבתא געלן בהון. עד דאשתכלל כלא בזרעא קדישא וכו' עכ\"ד הזוה\"ק, מבואר שהי' סיבה מהבוי\"ת שיהיו ישראל נמאסים בעיני המצרים ועי\"ז ניצולו מהתחברותם ומלהתחתן עמהם ונשארו זרע קודש, ואילולא כן לא היו ראויים לקבלת התורה כמבואר בזוה\"ק פ' יתרו, ומעתה אין זה תימה שלא הכיר פרעה גדולתן של ישראל ולא השיג אף גדולתן העתיד עד לאחר שיצאו מארצו, אף שידע מקצת מן העתידות באצטגנינות, אבל ענין זה העלימו מידיעתו, ונסתבב בגזירת הבוי\"ת שיהיו ישראל נמאסין בעיניו כדי שישארו עם קדוש, ולאחר שיצאו מארצו לא הי' צורך לזה, אז השיג גדולתן העתיד בדגלים וכהנים לוים וישראל וצווח ווי וא\"ש דברי המדרש.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 27,
      "char_length": 847,
      "timestamp": "2025-02-06T19:31:59.639024"
    },
    {
      "id": "beshalach2_p28",
      "text": "ועד\"ז יתבאר במאמה\"כ ויהפך לבב פרעה וגו' (עיין קושיא א') בהקדם לבאר הכתוב (בפ' בא) ויקם פרעה לילה הוא וכל עבדיו וכל מצרים וגו' כי אין בית אשר אין שם מת, ויקרא למשה ולאהרן לילה ויאמר קומו צאו מתוך עמי וגו', ותחזק מצרים על העם למהר לשלחם מן הארץ כי אמרו כולנו מתים, ויל\"ד שהתחיל ויקם פרעה לילה הוא וכל עבדיו וכל מצרים וגו' וסיים ותחזק מצרים על העם והשמיט פרעה ועבדיו, ואפ\"ל כי פרעה ועבדיו ידעו שלא יבא עוד מכה עליהם, כי כך התרה משרע\"ה בהם שמכת בכורות הוא האחרונה שבכולם וזו כבר עברה, וע\"כ הם עצמם לא הסכימו לשלוח את ישראל מארצם, אך מלחץ העם שאמרו כלנו מתים, ובמכילתא שאמרו לא כגזירת משה הוא, שהרי אמר ומת כל בכור, וכאן אף הפשוטים מתים ה' או י' בבית אחד, והטעם מפני שהיו המצריות מזנות וילדות מרווקים פנויים והיו להם בכורות הרבה כפירש\"י עה\"פ כי אין בית אשר אין שם מת, ואולי פרעה ועבדיו השיגו דבר זה שכל אלו בכורים הם וע\"כ לא חששו שיביא עוד מכות עליהם ולא מיראת המות שלחו את ישראל, אלא מפני שכל מצרים החזיקו עליהם למהר לשלחם מן הארץ כי אמרו כולנו מתים, לכן הסכים גם פרעה ואמר קומו צאו מתוך עמי וגו', ועיקר הטעם שנתפתה לדבריהם מפני שלא ידע חשיבותם של ישראל והיו מבוזין בעיניו כי כן סיבב הבוי\"ת כנז\"ל בדברי הזוה\"ק, אמנם לאחר שיצאו ישראל מארצו השיג גדולת מעלתם, וגם זה היתה סיבה מאת ה' כדי שיחזק לבו לרדוף אחריהם, ע\"כ עכשיו ויהפך לבב פרעה ועבדיו אל העם, כלומר אל המצריים ויאמרו מה זאת עשינו כי שלחנו את ישראל מעבדנו, הזכיר ישראל שזה מורה על חשיבות בני ישראל, ומה\"ט נתחרטו על ששלח אותם שעכשיו כבר הכירו חשיבותן של ישראל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 28,
      "char_length": 1410,
      "timestamp": "2025-02-06T19:32:00.083583"
    },
    {
      "id": "beshalach2_p29",
      "text": "עוד י\"ל עפי\"ד הנועם אלימלך זלה\"ה (פ' בשלח) וזל\"ק דאיתא בגמרא (עירובין דף נ\"ד ע\"א) המהלך בדרך ואין עמו לוי' יעסוק בתורה ולכאורה הלא בלאו הכי הוא מחויב תמיד לעסוק בתורה, כמאמר התנא המהלך בדרך ומפנה לבו וכו', ונראה לי ליתן טעם למצות לוי', כשהצדיק מלוה את חבירו הם מתקשרים זה בזה בקדושתם ונעשים כאחד וקדושתו של זה הצדיק העוסק בתורה בביתו הוא משמר את חבירו בדרך, כאילו הוא עצמו עוסק בתורה וכו', זה הוא כשהצדיק הוא המלוה, אבל אם הוא איש נעצב וריקן אין תועלת לזה במה שזה מלווהו, ואדרבה הוא מכניס בו עצבותו וכו', וזהו ויהי בשלח פרעה ר\"ל מחמת שפרעה שלח את ישראל וכו' ולכן ולא נחם אלקים וגו' כי קרוב הוא, ר\"ל זה קאי אפרעה מחמת שעתה מקרוב הלך מאצלם, והי' עדיין רושם עצבותו בהם ולכן ויסב וגו' עכ\"ד, וראוי להבין מה שתיאר לפרעה איש נעצב וריקן ומהו עצבותו, ויותר יאות לו תואר רשע.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 29,
      "char_length": 765,
      "timestamp": "2025-02-06T19:32:00.769833"
    },
    {
      "id": "beshalach2_p30",
      "text": "ואפ\"ל עפימ\"ש הקדושת לוי זלה\"ה (פ' שמות) שע\"י הכאת מצרים נתגדל ונתקדש שמו הגדול והקדוש, ולהכי מכת בכורות הי' ע\"י הבורא ב\"ה בעצמו, כי הוא היתה עיקר הגורם יציאת בנ\"י ממצרים, ומחמת יצי\"מ נתגדל ונתקדש שמו הגדול וכו' וגם להאומות היתה טובה, שהמצרים נעשים כלים שעל ידם נודע מציאות הבורא וכו' עכ\"ד לענינינו, והנה לפי\"ז הי' להם זכות שנעשו כלים שנתקדש על ידם ש\"ש, אמנם אמרז\"ל (קידושין מ' ע\"ב) בתוהא על הראשונות ומתחרט על הטוב איבד כל זכותו ונתרוקן מהם עיי\"ש, וכמו\"כ בפרעה שאמר קומי צאי ושלח את ישראל, וע\"י יצי\"מ נתקדש שמו ית' בעולם, נמצא הי' כלי להתקדש ש\"ש על ידו, אולם אח\"כ התחרט ונהפך לבו וצווח ווי על ששלחם, ובזה אבד כל זכותו, ולזה יתואר איש נעצב וריקן, שע\"י עצבותו שהתחרט וצווח ווי, נתרוקן ונתערטל מכל זכיותיו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 30,
      "char_length": 703,
      "timestamp": "2025-02-06T19:32:01.178524"
    },
    {
      "id": "beshalach2_p31",
      "text": "ובזה יל\"פ ויהפך לבב פרעה וגו', מלת לבב מורה על ב' הלבבות, וע\"ד שדרשו רז\"ל באברהם שהפכו כולו לטוב מדכתיב ומצאת את לבבו נאמן לפניך ולהיפך בפרעה הפכו כולו לרע, ובחי' קדושה שנקנה אליו ע\"י שנתקדש ש\"ש על ידו, עכשיו נתרוקן ממנה ונהפך כולו לרע, ויאמרו מה \"זאת\" עשינו כי שלחנו את ישראל, ירמוז עפימ\"ש ז\"ל (ע\"ז ב' ע\"ב) אין זאת אלא תורה שנא' וזאת התורה וגו' ע\"י יצי\"מ זכו ישראל לקבלת התורה, והם התחרטו על שהיו כלים לגרום קדושה גדולה זו, וז\"ש מה \"זאת\" עשינו כי שלחנו את ישראל והבן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 31,
      "char_length": 468,
      "timestamp": "2025-02-06T19:32:01.531597"
    },
    {
      "id": "beshalach2_p32",
      "text": "ויהפך לבב פרעה ועבדיו אל העם ויאמרו מה זאת עשינו כי שלחנו את ישראל מעבדנו, צ\"ב דהלא מתחילה לא שלחו מדעתם ומרצונם רק אחר שהכה ה' אותם במכות, וא\"כ לא שייך הלשון ויהפך דלא הי' באמת שום הפיכה, ועוד צ\"ב דבאמת איך לא יראו אחר כל המכות למרות פי ה' ולרדוף אחריהם להחזירם, וברש\"י פי' בשביל ממונם שהשאילום, וגם זה צ\"ב וכי הי' ממונם חביב עליהם יותר מגופם, ואיך נכנסו בסכנת הגוף בשביל ממונם, גם דמפורש בפסוק טעם אחר על הרדיפה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 32,
      "char_length": 414,
      "timestamp": "2025-02-06T19:32:01.782680"
    },
    {
      "id": "beshalach2_p33",
      "text": "ב) במדרש (הובא בישמח משה) הים ראה וינוס מה ראה, ראה ישראל באים ורכוש מצרים בידם וצ\"ב.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 33,
      "char_length": 85,
      "timestamp": "2025-02-06T19:32:02.013030"
    },
    {
      "id": "beshalach2_p34",
      "text": "ויתבאר הענין בהקדם דברי הגמ' (ב\"ב דף י' ע\"ב) ואיפסק להלכה בשו\"ע יור\"ד (סי' רנ\"ד) דאסור לקבל צדקה מן הנכרים ולמדו זאת מפסוק (ישעי' כ\"ז) ביבש קצירה תשברנה נשים באות מאירות אותה, פירש\"י ז\"ל כשתכלה זכות שבידן וייבש לחלוחית מעשה צדקה שלהן אז ישברו עכ\"ל, ולפי\"ז אם מקבלים מהם צדקה נותנים להם חיות וזכות חדש, ועד\"ז יסבר טעותו של פרעה כי אף שהוכה במכות נוראים עד שהוכרח לשלחם, דימה בנפשו שנענש משום חוסר זכותו אבל לאחר שהשאילו לישראל כלי כסף ושמלות סבור הי' שמעכשיו ניתוספו זכיותיו ויגינו עליו מעונשים ויסורים, וז\"ש ויהפך לבב פרעה וגו' מה זאת עשינו כי שלחנו את ישראל מעבדנו, פי' רשיז\"ל בשביל ממונם שהשאילום, ר\"ל זהו טעם שהפך לבו לרדוף אחריהם כי סמך שבכח הצדקה זו ינצל מן העונשים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 34,
      "char_length": 671,
      "timestamp": "2025-02-06T19:32:02.104229"
    },
    {
      "id": "beshalach2_p35",
      "text": "אמנם צ\"ב למה באמת צוה הקב\"ה שיקחו ישראל מהם בדרך שאלה ואיכא חשש שיתרבה זכותם, גם באמת זכותם של המצריים ששאלו לישראל בטובם להיכן אזלא, ואפ\"ל דהנה הקשו המפורשים הלא יעקב ועשו חלקו בנחלת שני עולמים, יעקב נטל עוה\"ב ועשו עוה\"ז ואיך הותר ליעקב ליהנות מעוה\"ז והוא חלקו של עשו, ותירצו דאף חלקו של עשו מגיע ליעקב כמ\"ש יצחק אבינו הן גביר שמתיו וכו' ומה איפוא אעשה לך דמה שקנה עבד קנה רבו והנה כ\"ז ניחא בזמן שעושין רצונו של מקום. אבל אם ח\"ו אין עושין נתבטל העבדות כמ\"ש והי' כאשר תריד ופרקת עולו, וכמו\"כ יש לומר לענינינו דכל זמן שבנ\"י היו משועבדים תחת ידם של המצריים לא הי' באפשרות ליטול מהם דבר, דשלא ברשות ה\"ה גזל ואם יתנוהו בטובם הרי יתוסף זכותם, אבל אחר שהוציא הקב\"ה את בנ\"י מתחת ידי המצריים אזי נהפכו המצריים להיות כדין עבדים לישראל, כי יצאו ע\"ש זכות העתיד שיקבלו התורה ושוב אמרינן כל מה שקנה עבד קנה רבו והרכוש שלהם הוא ולא ניתוסף למצרים זכות עבור זה, כי החזיקו ישראל בשלהם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 35,
      "char_length": 868,
      "timestamp": "2025-02-06T19:32:02.428619"
    },
    {
      "id": "beshalach2_p36",
      "text": "ובזה יתבאר דברי המדרש הים ראה וינוס וכו' דהנה הים לא רצה להקרע והי' קטרוג גדול הללו והללו עוע\"ז והי' צריכים זכות גדול להנצל, אמנם כאשר ראה ישראל באים ורכוש מצרים בידם ר\"ל ברשותם, וע\"כ דכל מה שקנה עבד קנה רבו ואין זה רק בעושין רצונו של מקום, א\"כ מוכרח שיש להם זכות קבלת התורה ע\"ש העתיד וע\"כ וינוס מפניהם והבן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 36,
      "char_length": 308,
      "timestamp": "2025-02-06T19:32:02.835910"
    },
    {
      "id": "beshalach2_p37",
      "text": "באופן אחר יתבארו דקדוקים הנ\"ל בהקדם להעיר במאמה\"כ בפרשת בא, דבר נא באזני העם וישאלו איש מאת רעהו וגו' כלי כסף וכלי זהב פירש\"י אין נא אלא לשון בקשה, בבקשה ממך הזהירם על כך שלא יאמר אותו צדיק אברהם ועבדום וענו אותם קיים בהם ואח\"כ יצאו ברכוש גדול לא קיים בהם עכ\"ל, כבר דקדקו קמאי דמה צורך לטעם שלא יאמר אותו צדיק הלא חותמו של הקב\"ה אמת ונאמן הוא ית' לקיים הבטחתו אף אם לא יאמר אותו צדיק, והפרשת דרכים דייק בלשון קיים \"בהם\", לא קיים \"בהם\", שמלת בהם מיותר ומחוסר הבנה ע\"כ קושיתו, גם קשה מה צורך הי' להזהירן כ\"כ שיקחו כלי כסף וכלי זהב, והם דברים שנפשו של אדם מחמדתן, ומצינו בביזת הים ויסע משה את בנ\"י פרש\"י הסיעם בע\"כ שהי' רצונם להתעכב עוד למלאות ידם מביזת הים, ומדוע בביזת מצרים הי' צורך לאזהרה ולשון בקשה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 37,
      "char_length": 701,
      "timestamp": "2025-02-06T19:32:03.007933"
    },
    {
      "id": "beshalach2_p38",
      "text": "ב) גם הקשה האוהחה\"ק בפ' שמות דמה צורך הי' ליטול בשאלה שאינו מהמוסר לגנוב דעתם של המצרים, ובימי אלכסנדר מוקדן הי' להם טענה על ישראל שנטלן ממונם, הלא הקב\"ה כל יכול, וכמו שנתן את חן העם בעיני מצרים להשאיל להם, כמו\"כ ביכולתו ית' ליתן בדעתם שיתנו במתנה לצמיתות ולא יהי' להם עוד טענה עליהם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 38,
      "char_length": 284,
      "timestamp": "2025-02-06T19:32:03.364464"
    },
    {
      "id": "beshalach2_p39",
      "text": "ג) בגמרא ברכות (דף ט' ע\"ב) כשאמר משה לישראל וישאלו איש מאת רעהו וגו' אמרו לו ולואי שנצא בעצמנו, משל לאדם שהי' חבוש בבית האסורין והיו אומרים לו מוציאין אותך למחר וכו' ונותנין לך ממון הרבה, ואומר להם בבקשה מכם הוציאוני עכשיו ואיני מבקש ממון עכ\"ד הגמ', לכאורה אין המשל דומה לנמשל, דבהמשל אמרו לו שלמחר מוציאין אותך ונותנין לך ממון הרבה, ע\"כ וויתר על הרווחת הממון שלא יתארך מאסרו ויצא מיד, אבל במצרים הכי הי' ס\"ד שע\"י שישאלו ממצרים יתארך גלותם, ומה טעם שימאנו בדבר ומה צורך להזהירם ואינו דומה להמשל כלל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 39,
      "char_length": 499,
      "timestamp": "2025-02-06T19:32:03.531405"
    },
    {
      "id": "beshalach2_p40",
      "text": "ויתבאר בהקדם דברי הזוה\"ק פ' שמות (דף ג' ע\"א) ואלה שמות בנ\"י וגו' ר' חייא פתח (משלי כ\"ג) אל תלחם את לחם רע עין ואל תתאו למטעמותיו וכו', דאי כד נחתו ישראל למצרים לא יטעמון נהמא דמצראי, לא אשתבקו בגלותא ולא יעיקון לון מצראי א\"ל ר' יצחק והא גזירה אתגזר א\"ל הא לא אתגזר במצרים דוקא אלא בארץ לא להם ואפילו בארעא אחרא עכ\"ד הזוה\"ק, מבואר דבשביל שנהנו ישראל מן המצריים ע\"כ יכלו להם לשעבדם ולצערם, ובעה\"ת הביאו מדרש (בפ' שמות) שפרעה נתן להם שכר בתחלה, ודחקו עצמן מפני חימוד השכר, ואח\"כ גזר עליהם בכפי' להשלים חקם כאשר עשו בהיות השכר נתן להם, אבל שבט לוי לא קבלו עליהם לעבוד בשכר וע\"כ לא הי' לו פתחון פה לשעבד בהם גם בכפי' עכ\"ד המדרש, ולכאורה הרי השעבוד הי' בגזירת מלכות ובעכ\"ח ומי מעכב בידם ואף שלא עבדו בשכר הי' בידו להכריחם אח\"כ בכפי' ומדוע בשביל טעם זה מאנו מלשעבדם, אמנם יבואר הענין עפי\"ד הזוה\"ק הנ\"ל שישראל על ידי שנהנו מהם מתחלה הי' להם שליטה עליהם, אבל שבט לוי לא נהנו מהם לא הי' היכולת בידם להשתעבד בהם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 40,
      "char_length": 901,
      "timestamp": "2025-02-06T19:32:03.790493"
    },
    {
      "id": "beshalach2_p41",
      "text": "והנה בנ\"י יוצאי מצרים השיגו שע\"י שנהנו דור הראשון מממון של מצרים נגרם השעבוד להם, ואפשר שלטעם זה לא רצו ליקח כסף וזהב של המצריים בצאתם שהיו יראים לנפשם פן יגרום זה להם אריכת הגלות, ע\"כ הי' צורך לבקשם ולהזהירם על כך שישאלו, וא\"ש דמיון המשל להנמשל, דגם כאן הי' טעם סירובם מלקבל מחשש שלא יתארך גלותם בסיבת הממון, ולזה אמרו הלואי שנצא בעצמינו בלא ממון אבל יהי' היציאה מיד, משיתאחר יציאתינו ויתנו לנו ממון הרבה והוא המבואר בהמשל ג\"כ.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 41,
      "char_length": 428,
      "timestamp": "2025-02-06T19:32:04.302938"
    },
    {
      "id": "beshalach2_p42",
      "text": "אמנם הך חששא הי' להם רק כ\"ז שלא יצאו ממצרים עדיין אבל בקריעת ים סוף שראו המצריים פגרים מתים כמ\"ש וירא ישראל את מצרים מת על שפת הים לא היו מתייראים עוד ליהנות מממונם, כי אין בידם להרע להם עוד, ע\"כ עסקו ישראל בביזת הים ברצון נפשם אבל בביזת מצרים מיאנו לטעם יראה זו פן יתארך גלותם ויוסיפו לשעבדם, וע\"כ היו הצורך לבקשם ולהזהירם. אכן לפי האמת לא הי' מקום לחששא זו כלל מאחר שהקב\"ה צוה להם שישאלו, שומר מצוה לא ידע דבר רע, והקב\"ה ידע שכבר סר צלם ולא יוכלו עוד לשעבד בישראל, רק שחששו ישראל שעד שיגיע זמן איבודם יגרמו עוד צרות לישראל אם יהנו מממונם, ע\"כ להרגיע רוחם צוה הקב\"ה שיקחו מהם בדרך שאלה לזמן ולא נהנו ממנה כ\"א לאחר איבודם בים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 42,
      "char_length": 626,
      "timestamp": "2025-02-06T19:32:04.532600"
    },
    {
      "id": "beshalach2_p43",
      "text": "ובזה יתבאר מאמר רז\"ל שלא יאמר אותו צדיק וכו' דהנה הך חששא שאם יהנו מן המצריים יגרום להם אריכת הגלות אינו רק אם ישראל אינם ראויים להיגאל וקטרוג עונותיהם יוכל לגרום אריכת הגלות, משא\"כ אם ראויים א\"א לדחות ולאחרו ע\"י הקטרוג, ואפשר שזהו הכוונה שלא יאמר אותו צדיק וכו' ואח\"כ יצאו ברכוש גדול לא קיים בהם, דבאמת הי' מספיק לקיים הבטחתו ית' בביזת הים שהיתה גדולה מביזת מצרים הרבה, אלא משום שלא יצטער אותו צדיק אברהם, שלטעם שלא היו ישראל ראויים לא נתקיים בהם ואח\"כ יצאו ברכוש גדול לצד יראת הקטרוג, ע\"כ צוה הקב\"ה שיקחו גם מרכוש מצרים, ולזה דייק מלת בהם ר\"ל בהם הדבר תלוי וקטרוג עונותיהם גרמו, ובוודאי שלא יתרעם אאע\"ה על מדותיו ית', אבל יצטער על מדריגתן של ישראל, וז\"ש ועבדום וענו אותם קיים \"בהם\" שע\"י קטרוג עונותיהם הוכבד עליהם העבדות ועינוי, ואח\"כ יצאו ברכוש גדול לא נתקיים בהם לצד עצמותם שלא היו ראויים להיגאל, ואיכא חששא שע\"י הרכוש יתעורר הקטרוג ויתארכו ימי שעבודם, וע\"כ צוה הקב\"ה שיקחו גם רכוש מצרים נוסף על ביזת הים, ובזה אפ\"ל דברי המדרש הים ראה וינוס ראה ישראל באים ורכוש מצרים בידם, דהנה שר של מצרים קטרג עליהם מה בין אלו לאלו הללו עוע\"ז והללו וכו' אך כיון שראה רכוש מצרים בידם מזה ראי' כי ראויים הם דאל\"ה לא הי' מצוה ה' ליקח ממונם כלל אף בדרך שאלה וע\"כ נקרע לפניהם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 43,
      "char_length": 1161,
      "timestamp": "2025-02-06T19:32:04.865707"
    },
    {
      "id": "beshalach2_p44",
      "text": "ובזה א\"ש מה שפירש\"י בשביל ממונם שהשאילום, דהנה פרעה חשב ג\"כ שע\"י שנהנו מרכושם יהי' לו שליטה עליהם לשעבדם עוד ומה ששלח אותם הי' מוכרח מפני המכות, אמנם כל זה הי' טרם שנטלו ממונם, אבל אחר שנטלו את ממונם חשב שע\"י גרמת הקטרוג יוכל לשעבד בהם עוד ולא יענש, וזהו פירוש ויהפך לבב פרעה וגו' ויאמרו מה זאת עשינו כי שלחנו את ישראל מעבדנו, שהתחרט על ששלחם ושחררם משעבודו, אלא שרש\"י ז\"ל בא לתרץ איך יתכן לומר ויהפך הלא לא שלחם מרצונו כ\"א מהכרח המכות כקושית האוהחה\"ק, ולזה מתרץ בשביל ממונם שהשאילום כי על ידי זה השיאו לבו להתחרט ונהפך לבו גם על מה ששלחם מהכרח המכות, כי חשב כי מעתה הי' יכול להחזיק בהם ולא יענש עוד, וזה הי' סיבת טעותו, ועיקר חרטתו וטעם רדיפתו אחריהם הוא המפורש בפסוק כי שלחנו את ישראל מעבדנו, ומ\"ש רש\"י ז\"ל בשביל ממונם שהשאילום אין זה טעם חדש, רק לבאר סיבת ההשתנות ואיך פג יראתו מעונש המכות אשר עברו עליו, לז\"א מפני ממונם שהשאילום והבן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 44,
      "char_length": 838,
      "timestamp": "2025-02-06T19:32:05.462028"
    },
    {
      "id": "beshalach2_p45",
      "text": "באופן אחר אפ\"ל דברי המדרשים הנ\"ל: בהקדם להעיר עוד במאמה\"כ ויהפך לבב פרעה ועבדיו אל העם ויאמרו מה זאת עשינו כי שלחנו את ישראל מעבדנו, וצ\"ב דלא הי' התהפכות ברצון לבם כלל ומעיקרא לא שלחום ברצונם אלא הוכרחו לכך מכובד המכות, ורצונם עכשיו כרצונם אז, ואיך יאמר הכתוב ויהפך לבב פרעה, גם צ\"ב שינוי וכפל הלשונות מה זאת עשינו כי שלחנו וגו', ולא הי' כאן עשי' אחרת זולתי השליחות, והול\"ל מה זאת שלחנו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 45,
      "char_length": 387,
      "timestamp": "2025-02-06T19:32:05.882743"
    },
    {
      "id": "beshalach2_p46",
      "text": "ולבאר הענין נקדים דברי המכילתא וה' נתן את חן העם בעיני מצרים וישאילום, ר\"א רוח הקודש שרתה עליהן. והי' אומר לו השאילני כליך המונח במקום פלוני, והלה מוציא ונותן לו ואין חן אלא רוה\"ק וכו' עכ\"ד המכילתא, וראוי להבין מה צורך הי' להשתמש ברוה\"ק הלא מבואר במדרש ילקוט (רמז קפ\"ו) דבג' ימי אפילה היו ישראל נכנסין לבתיהן של המצריים ורואין כל מה שיש להם ובשעה שאמר להן הקב\"ה ושאלה אשה משכנתה היו ישראל נכנסין אצלם ואומרים להם השאילני אותו הכלי שיש לך, והוא אומר אין לי ואומר לו אני יודע שיש לך וכו' ראיתי אותו בידך והי' משאילו אותו הכלי, ומהיכן היו ישראל יודעים אלא באותן ימי החושך ע\"כ, וא\"כ מדוע הי' צורך להם להשתמש ברוה\"ק לענין זה, ואפ\"ל ביאור הענין עפ\"י מש\"כ האריז\"ל (בשער המצות פרשת ראה) במצות זכירת יצי\"מ החילוק שבין גאולת מצרים לשאר הגאולות בבל ומדי וכו' שבמצרים נתבררו בגאולתם כל הנשמות כמש\"ה וינצלו את מצרים לכן לא הי' צורך לחזור עוד שם, אבל בשאר הגאולות נשארו שם נשמות שלא נתבררו לגמרי וכו', גם כתב שהבטחת הקב\"ה ואחרי כן יצאו ברכוש גדול, הכוונה על ניצוצי הקדושה והנשמות שיוציאו ממצרים עמהם שהוא הרכוש הגדול של ישראל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 46,
      "char_length": 1012,
      "timestamp": "2025-02-06T19:32:06.101415"
    },
    {
      "id": "beshalach2_p47",
      "text": "ולכאורה הלא אין מקרא יוצא מידי פשוטו ונצטוו ישראל להשאיל ממצרים כלי כסף וכלי זהב ושמלות כדי לקיים הבטחת הרכוש ואיך יתפרש כוונת הפסוק על הניצה\"ק והנשמות, אמנם אליבא דאמת הא בהא תליא עפי\"מ שכתב ק\"ז הייטב לב זלה\"ה בפרשת בהר עה\"פ וכי תמכרו ממכר לעמיתך או קנה מיד עמיתך וגו' שכל חפץ וכלי שהאדם קונה הוא מקושר ושייך לשורש נשמתו לתקן הניצה\"ק שיש בחפץ ההוא עיי\"ש, והבעש\"ט הק' זי\"ע פי' עה\"פ רעבים גם צמאים נפשם בהם תתעטף וזל\"ק, פי' בכאן סוד גדול ונורא והוא למה ברא הקב\"ה עניני מאכל ומשתה שאדם תאב להם לאכול ולשתות, והטעם שהם ממש ניצוצי אדה\"ר שהם מתלבשים בדומם צומח חי מדבר ויש להם חשק לדבק בקדושה וכו', וז\"ש רעבים גם צמאים כשאדם רעב וצמא להם למה זה, וז\"ש נפשם בהם תתעטף עכל\"ק, וכמו כן באותן הכלים שהוציאו ישראל ממצרים הי' בהם ניצוצי הקדושה משורש נשמתם וע\"כ אסרה תורה לחזור למצרים לעולם כי כבר נתבררו ונגאלו משם כל נשמות ישראל, משא\"כ אלמלי נשארו שם ניצוה\"ק שהיו בחפצים ובכלים ההם לא היו נגאלין גאולה גמורה ועדיין היו צריכין לחזור להוציא ולברר הכל, וזה שאמר הקב\"ה למשה בבקשה ממך הזהירם על כך שלא יאמר אותו צדיק וכו' ואח\"כ יצאו ברכוש גדול לא קיים בהם ויצטרכו לחזור שוב למצרים ומזה יהי' לו צער גדול לאאע\"ה, ע\"כ תזהיר את ישראל שישאלו ויטלו כל החפצים השייכים לשורש נשמותיהם לברר כל ניצה\"ק ממצרים ולעשותה כמצולה שאין בה דגים ולא יצטרכו לחזור עוה\"פ למצרים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 47,
      "char_length": 1239,
      "timestamp": "2025-02-06T19:32:06.551674"
    },
    {
      "id": "beshalach2_p48",
      "text": "ובזה יובן מה שהוצרכו להשתמש ברוח הקודש בהשאלת הכלים דאף שראו כל הכלים והחפצים בשלשת ימי האפילה, מכל מקום הי' צורך להם לידע איזה חפץ יש בו ניצוץ הקדוש השייך לשורש נשמתו, דאין אדם נוגע במה שמוכן לחבירו, כי כל אחד צריך לתקן מה ששייך לשורש נשמתו, וע\"כ הוצרכו להשתמש ברוה\"ק שידעו ליטול רק מה ששייך לו ולהניח מה ששייך לחבירו ומה שאין בו ניצה\"ק כלל",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 48,
      "char_length": 341,
      "timestamp": "2025-02-06T19:32:07.145340"
    },
    {
      "id": "beshalach2_p49",
      "text": "והנה הים הי' לו טענה שעדיין לא הגיע זמנו להקרע לפני ישראל אעפ\"י שתנאי התנה הקב\"ה עמו בשעת הבריאה שיקרע לפני ישראל, אבל התנאי הי' רק אחרי כלות זמן שעבודם שנגזר עליהם ד' מאות שנה ועדיין לא שלמו ולכן לא רצה לקרוע לפניהם, אבל כשראה רכוש מצרים בידם שכבר הוציאו משם הניצה\"ק ונתבררו ונגאלו כל נשמות ישראל, מזה השיג שכבר הגיע זמנם להגאל ולא יחזרו למצרים עוד לעולם וע\"כ וינוס, וזהו פי' המדרש הים ראה וינוס מה ראה, ראה ישראל באים ורכוש מצרים בידם ומזה שפט שכבר הגיע עת הגאולה, ויובן בזה אידך דברי המדרש ברייתא דרבי ישמעאל ראה, כי סתם מכילתא הוא מכילתא דרבי ישמעאל, ומבואר בדברי המכילתא הנ\"ל בפסוק וה' נתן את חן העם בעיני מצרים שהי\"ל לישראל רוה\"ק ועי\"ז הוציאו בלעם מפיהם כל ניצוצי הקדושה ומזה השיג שהגיע זמן גאולתם ונקרע מפניהם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 49,
      "char_length": 717,
      "timestamp": "2025-02-06T19:32:07.344541"
    },
    {
      "id": "beshalach2_p50",
      "text": "והנה פרעה וחרטומי מצרים היו חכמים ובקיאים בכוחות הטומאה והשיגו ג\"כ שמה שזכו ישראל לצאת משם יציאה גמורה בלי לחזור שמה הוא ע\"י שלקחו עמהם כל הכלים וכסף וזהב שבזה נתבררו כל נשמות ישראל, וזולת זה היו מוכרחים לחזור עוה\"פ למצרים כדי לברר מה שנשאר שמה, ואיתא בגמרא (יבמות קי\"ג ע\"ב) נשתטית לא יוציא תנא דבי ר\"י ושלחה מביתו מי שמשלחה ואינה חוזרת יצתה זו שמשלחה וחוזרת, הרי דמשמעות שלוח היא שליחות גמורה בלי חזרה, ובזה יובן מאמה\"כ ויהפך לבב פרעה ועבדיו אל העם ויאמרו מה זאת עשינו כי שלחנו את ישראל מעבדנו: כלומר ששלחנו אותם שליחות גמורה שאינם חוזרים עוד, והנה מה שהשאילום כל הכלים והחפצים עשו מרצונם הטוב ולא היו מוכרחים ואנוסים לכך כפירש\"י דאף מה שלא היו שואלין מהם היו נותנין להם אתה אומר אחד טול שנים ולך, אמנם עכשיו התחרטו על כך שברצונם גרמו זאת שיהי' שילוחין גמורים בלי חזרה, וזה שאמרו מה זאת עשינו הכוונה על השאלת כליהם מרצונם הטוב ובזה גרמנו כי שלחנו את ישראל מעבדינו, ולא על עצם השילוחין נתחרטו כי לזה היו מוכרחין מחמת המכות, רק נתחרטו על השאלת הכלים שבזה גרמו שיהי' שליחות גמורה, דאל\"ה היו מוכרחין לחזור והיו יכולים לשעבד בהם עוה\"פ. וזה שכתב רש\"י ז\"ל נהפך לבם לרדוף אחריהם בשביל ממונם שהשאילום, שע\"י הממון שהשאילום גרמו שלא יחזרו אצלם עוד, ואינו סותר למה שאמר הפסוק כי שלחנו את ישראל מעבדנו כי הא בהא תליא דאם לא הממון שהשאילום היו מוכרחין לחזור אצלם עוה\"פ והיו משעבדין עמהם עוד.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 50,
      "char_length": 1278,
      "timestamp": "2025-02-06T19:32:07.679011"
    },
    {
      "id": "beshalach2_p51",
      "text": "ויהפך לבב פרעה ועבדיו אל העם ויאמרו מה זאת עשינו כי שלחנו את ישראל מעבדנו, ראוי להבין איך יצדק ענין התהפכות וחרטה בדבר שלא עשו ברצונם מעיקרא, כ\"א מחמת ההכרח ובכפי' כמשה\"כ ותחזק מצרים על העם למהר לשלחם וגו' כי אמרו כולנו מתים, גם צריך להבין השתנות דעתם וסברתם, כי מעיקרא יראו לנפשם פן ימותו כולם, ואיך עכשיו הפקירו חיותם מנגד לרדוף אחרי ישראל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 51,
      "char_length": 342,
      "timestamp": "2025-02-06T19:32:08.282869"
    },
    {
      "id": "beshalach2_p52",
      "text": "ואפ\"ל דלכאורה קשה מה שהגזימו המצריים פחדתם לומר כולנו מתים, ובמכילתא איתא שאמרו לא כגזירת משה, שהרי אמר ומת כל בכור, וכאן אף הפשוטים מתים ה' או י' בבית אחד, ולכאורה הלא ראו שנתקיימו כל דברי משה א' מהם לא נעדר ולא נשתנה אף כמלא נימא, ובודאי גם בזה יתקיים כדבריו ורק הבכורים ימותו, ורש\"י פי' שהמצריות מזנות תחת בעליהן וכו' והיו להם בכורות הרבה, פעמים הם חמשה לאשה אחת, כ\"א בכור לאביו, אמנם גם לטעם זה לא יצדק לומר כולנו מתים, גם כי בודאי לא הי' נעדר מהם ידיעת אפשרות זה ואפשר כי סיבת יראתם הי', דכיון שניתן רשות למשחית ליכנס לבתי המצרים ולהרוג כל הבכורים שוב לא יבחין, כי ידעו שכולם חייבים מיתה לצד הפלגת רשעתם, ובאמת הי' ראוי להם ככה, אלא שניצולו מן המשחית כדי שיתקדש ש\"ש על ידם בקרי\"ס, וכמ\"ש הכתוב בהתראת הברד ואולם בעבור זאת העמדתיך בעבור הראותך את כחי ולמען ספר שמי בכל הארץ, אמנם המצריים כאשר ראו שנעשה להם נס וניצולו ממיתה ודאית, לא שמו אל לבם שזהו אך לרעתם, אבל תלו סיבת הצלתם בע\"ז שלהם, והי' זה סיבה מהבוית\"ש לחזק את לבם לרדוף אחר ישראל, ולזה ויהפך לבב פרעה ועבדיו וגו' ויאמרו מה זאת עשינו כי שלחנו את ישראל כי עכשיו פג פחד המיתה מהם, שראו שאף שניתן רשות למשחית לא קרב אליהם, אין זה כ\"א יראתם קשה, והבוי\"ת סיכל את דעתם וחיזק את לבבם כדי שיאבדו ויתקדש ש\"ש בקרי\"ס.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 52,
      "char_length": 1168,
      "timestamp": "2025-02-06T19:32:08.472479"
    },
    {
      "id": "beshalach2_p53",
      "text": "ויאמר משה אל העם אל תיראו התיצבו וראו את ישועת ה' אשר יעשה לכם היום וגו', יש להבין מה צורך להקדמה זו התיצבו וראו וגו' הול\"ל בקיצור כי אשר ראיתם את מצרים לא תוסיפו לראותם עוד עד עולם, ודרשת חכז\"ל ידועים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 53,
      "char_length": 202,
      "timestamp": "2025-02-06T19:32:09.055068"
    },
    {
      "id": "beshalach2_p54",
      "text": "ב) במד\"ר סוף רות (פ\"ז סי' י') וזאת לפנים בישראל על הגאולה ועל התמורה לקיים כל דבר, ר\"ח פתר קרא בגו אפיא דישראל, לשעבר היו מקלסין על הגאולה שנאמר זה אלי ואנוהו, ועכשיו על התמורה שנאמר וימירו את כבודם בתבנית שור אוכל עשב וצ\"ב, גם ראוי להבין קישור דרשא זו אל פשוטו של מקרא דמיירי בעניני קנין וחליפין.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 54,
      "char_length": 297,
      "timestamp": "2025-02-06T19:32:09.237433"
    },
    {
      "id": "beshalach2_p55",
      "text": "ונל\"פ בהקדם דברי הגמ' (ברכות ל\"ח ע\"א) ת\"ר מה הוא אומר המוציא לחם מן הארץ ר\"נ אומר מוציא לחם מן הארץ, אמר רבא במוציא כ\"ע לא פליגי דאפיק משמע וכו', כי פליגי בהמוציא רבנן סברי המוציא דאפיק משמע וכו', ור\"נ סבר המוציא דמפיק משמע שנאמר המוציא אתכם מתחת סבלות מצרים, ורבנן ההוא הכי קאמר להו קב\"ה לישראל, כד מפיקנא לכו עבידנא לכו מילתא, כי היכי דידעיתו דאנא הוא דאפיקית יתכון ממצרים עכ\"ד הגמ' וצ\"ב דמשמע מכאן דבשעת יציאת מצרים עדיין לא ידעו אם הקב\"ה הוא המוציא אותם ואיך יתכן זאת הלא ראו בעיניהם הנסים והנפלאות שעשה הקב\"ה עמהם בשעת יציאתם ממצרים ואיך יסתפקו ח\"ו שלא הקב\"ה הוציא אותם, אמנם ענין זה מבואר בדברי הרמב\"ם ז\"ל (ה' יסוה\"ת פ\"ח ה\"א) וז\"ל משה רבינו לא האמינו בו ישראל מפני האותות שעשה, שהמאמין ע\"פ האותות יש בלבו דופי, שאפשר שיעשה האות בלט וכשוף, אלא כל האותות שעשה משה במדבר לפי הצורך עשאם וכו', ובמה האמינו בו במעמד הר סיני, שעינינו ראו ולא זר ואזנינו שמעו ולא אחר וכו' עכ\"ל הרי דבשעת יציאת מצרים עדיין לא נתברר בידם שכל האותות והמופתים הם מצד הקדושה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 55,
      "char_length": 951,
      "timestamp": "2025-02-06T19:32:09.462157"
    },
    {
      "id": "beshalach2_p56",
      "text": "ונראה מדברי הרמב\"ם ז\"ל שמפרש מ\"ש בגמרא כד אפיקנא יתכון עבידנא לכו מילתא דתדעו דאנא הוא דאפיקית יתכון הכוונה על מ\"ת שנתברר להם בראי' ושמיעה שכל הנסים והאותות נעשה להם מהקב\"ה, ואפ\"ל עוד לעניננו שהכוונה גם על קרי\"ס שגם אז נתברר לישראל שהכל מהקב\"ה עפימ\"ד במדרש רבה (פרשה כ\"ג סימן ח') ר' יהודה אומר מי אמר קילוס להקב\"ה התינוקות, אותן שהי' פרעה מבקש להשליך ליאור שהם מכירים להקב\"ה, כיצד כשהיו ישראל במצרים, והיתה אשה מבנות ישראל מבקשת לילד, היתה יוצאת לשדה ויולדת שם, וכיון שהיתה יולדת עוזבת הנער ומוסרת אותו להקב\"ה ואומרת, רבש\"ע אני עשיתי את שלי ואתה עשה את שלך, א\"ר יוחנן מיד הי' יורד הקב\"ה בכבודו כביכול וחותך עיבורן ומרחיצן וסכן וכו', והיה נותן ב' טנרין בידו אחד מניקו שמן ואחד מניקו דבש וכו' וכיון שבאו ישראל לים, היו אותן התינוקות שם, והם ראו להקב\"ה בים, התחילו אומרים לאבותיהם, זה אותו שהי' עושה לנו כל אותן הדברים כשהיינו במצרים שנאמר זה קלי ואנוהו עכ\"ד המדרש. ולכאורה אינו מובן דהלא כל תואר גופני רחוק הוא מאתו ית', ומהו ענין ההכרה שהכירוהו אותן התינוקות ואמרו זה אלי וגו', ומ\"ע הכירו יותר מאבותיהם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 56,
      "char_length": 1002,
      "timestamp": "2025-02-06T19:32:09.910706"
    },
    {
      "id": "beshalach2_p57",
      "text": "אמנם ידוע מספה\"ק דזה לעומת זה עשה אלקים וכל מה שמתרחקין מצד הסט\"א מתקרבין יותר אל צד הקדושה לזכות להשפעה אלקית ולהשיג את האמת, וישראל בגלות מצרים אע\"פ שהיו מובדלים ומופרשים מתועבת מצרים מ\"מ נכנס בהם קצת השפעה מטומאת מצרים מאכילת פירותי' כמ\"ש הב\"ח (או\"ח סי' ר\"ח) וגם מהשפעת שרו של מצרים וכדומה, שכ\"ז השפיע במקצת עליהם ועי\"ז לא הי' מאיר להם כ\"כ השפעה אלקית, אמנם אותן התינוקות שניזונו ממזון שמים רוחני, נשפע עליהם הארה קדושה נפלאה ע\"י קדושת המאכל וע\"ד שכתב בספה\"ק אגרא דכלה בשם הרה\"ק הר\"ר מענדלי מרימנוב זי\"ע לפרש הפסוק ויראו בנ\"י ויאמרו איש אל אחיו מן הוא כי לא ידעו מה הוא. שהי' המן דק ובהיר כ\"כ ברוחניות, עד שע\"י אכילתו נזדכך הגוף והי' ניכר לכ\"א פנימיות חבירו ומחשבתו, והנה איש אשר הי' מכיר את חבירו ביום אתמול בלא הודע פנימיותיו, וחשבו לצדיק או בהיפוך, וביום שאכלו את המן נתוודע לו פנימיותו ולא הכירו כי נדמה בעיניו כאיש אחר, וזה ויאמרו איש אל אחיו מן הוא ר\"ל מי הוא זה, כי נהפך לאיש אחר עכל\"ק, ועד\"ז אותן תינוקות שאכלו לחם מן השמים וניזונו מן הקדושה ונבנו על יסודי הקדושה בלא תערובת מאכל גשמי ובהבדלה גמורה מכוחות הטומאה, ע\"כ הכירו הם הבוי\"ת על הים והשיגו שכל הנסים שנעשו לישראל עד עכשיו ביצי\"מ וקריעת ים סוף הם מסטרא דקדושה ע\"י הקב\"ה ואין בו תערובות מכוחות הטומאה ולפיכך אמרו זה אלי ואנוהו: דהנה כלל גדול הוא בכ\"מ דתיבת זה בא למעט זה ולא אחר, ורמזו באמרם זה אלי ואנוהו למעט כל תערובת מצד הסט\"א והם העידו על הגאולה שהיא מאת הקב\"ה לבדו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 57,
      "char_length": 1338,
      "timestamp": "2025-02-06T19:32:10.404858"
    },
    {
      "id": "beshalach2_p58",
      "text": "וזהו כוונת המדרש וזאת לפנים בישראל וגו' לשעבר היו מקלסין על הגאולה פי' שהיו יודעין ומבחינים בגאולה שהוא מהקב\"ה שנאמר זה אלי ואנוהו, שאותן התינוקות העידו עלי' באומרם זה אלי, אבל עכשיו על התמורה מחליפין כבוד השי\"ת בכבוד הסט\"א שחולקין כבוד למינות ולע\"ז ולהירוס הדת ולזה נותנים שם של גאולה, ואין לך תמורה גדולה מזו, ורמז הפסוק כאן מה שיהי' בדורות האחרונים, דהנה איתא בזוה\"ק פ' חקת (דף ק\"פ ע\"א) בענין קנין נעל שזה הי' רק לפנים בישראל כד הוו צנועין קדישין וכו' וכיון דאסגיאו חייבין כסיאו מלה בגוונא אחרא וכו', א\"כ הפסוק הזה של וזאת לפנים בישראל מדבר מהירידה שיהי' בדורות האחרונים: וע\"כ מצאו חז\"ל מקום לרמז כאן חילוק זה שבין דורות הראשונים לדורות אלו בעיקבא דמשיחא שאז הללו ושבחו על הגאולה, ועכשיו בעוה\"ר הילולא וחינגא על התמורה, גם שאז התחיל השתלשלות מלכות בית דוד שנתגלה ההלכה עמוני ולא עמונית מואבי ולא מואבית שהי' עד אותו זמן בהסתר מחמת הקטרוג, ואז נתגלה שורש מלכות בית דוד ע\"י רות, לכן מצאו לנכון לרמוז כאן ענין השתלשלות הגאולה והתמורה שיהי' בדורות האחרונים קודם ביאת המשיח.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 58,
      "char_length": 972,
      "timestamp": "2025-02-06T19:32:11.052472"
    },
    {
      "id": "beshalach2_p59",
      "text": "ובזה יובן מאמה\"כ התיצבו וראו את ישועת ה' אשר יעשה לכם היום, דהנה חוץ ממה שהובטחו בנ\"י מהבוכ\"ע שיוושעו, צריכין עוד לישועה גדולה להיותם מבחינים ויודעים איזהו ישועת ה' דישועת ה' הוא רק מה שבא מהקב\"ה שיכולין לומר עליו זה קלי ואנוהו ומביא קדושה וטהרה לסייע לעבודת השי\"ת, וכל מי שיזכה לראות הגאולה שלימה יראה גודל השפעת אלקי שיורד על בנ\"י מישועה אמיתית ואיך שנתקרבין להקב\"ה, ואם יזכה יבחין ויראה עד כמה שנתרחקו ישראל ע\"י הגאולה המרה, ולא רק אלו שנשקעו לגמרי בהטומאה, ואין יכולין לצאת רק ברחמי שמים כשהבוכ\"ע יעזור ויהי' קיבוץ נידחים, רק גם כל יהודי אף מי שאינו עמהם נתרחק מיהדות ע\"י גודל כח השפעתם, וצריכין לרחמי שמים והתחזקות שנוכל לעבוד השי\"ת בזה השפלות.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 59,
      "char_length": 649,
      "timestamp": "2025-02-06T19:32:11.495640"
    },
    {
      "id": "beshalach2_p60",
      "text": "ולז\"א מרע\"ה לבנ\"י הבטחה, דחוץ מהישועה יהי' להם עוד ישועה גדולה שיראו ויבינו מהו ישועת השי\"ת, וז\"ש התיצבו וראו את ישועת ה' מלשון (כתובות דף ק\"ח ע\"ב) רואה אנו את דברי אדמון, שיחשב בעיניכם רק ישועה הבאה מהשי\"ת, דאותן שהן רחוקין מן האמת ר\"ל רואין ישועה בדרכי המינות והסט\"א, אבל הדבוק בבוכ\"ע ועובד ה' באמת אינו רואה רק ישועת ה' ורק זה נראה בעיניו ולא זולת, ואמר \"התיצבו\" \"וראו\" את ישועת ה' אשר יעשה לכם היום, ע\"ד הכתוב אשר יאמר היום בהר ה' יראה, פירש\"י ז\"ל היום הימים העתידין כמו עד היום הזה שבכל המקרא, שכל הדורות הבאים הקוראים את המקרא הזה אומרים עד היום הזה על היום שעומדים בו יעיי\"ש, ועד\"ז כוונת הפסוק אשר יעשה לכם היום, שיהי' להבטחה זו קיום נצחי להשיג הבחנה אמיתית איזהו ישועת ה' וכנ\"ל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 60,
      "char_length": 686,
      "timestamp": "2025-02-06T19:32:11.826115"
    },
    {
      "id": "beshalach2_p61",
      "text": "ואפ\"ל עוד בכוונת המאמר התיצבו וראו את ישועת ה' וגו', דהניצול בזכות עצמו זוכה לראות במפלתן של רשעים, משא\"כ הניצול בזכות אחרים, ומה\"ט נאמר ללוט אל תבט אחריך, מפני שלא ניצול אלא בזכות אברהם, וז\"ש להם משרע\"ה התיצבו ולא תעשו שום פעולה רק לבטוח בישועת ה', ועי\"ז וראו את ישועת ה' אשר יעשה לכם היום, שתוושעו בזכות עצמכם ותוכלו לראות הישועה במו עיניכם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 61,
      "char_length": 343,
      "timestamp": "2025-02-06T19:32:12.171867"
    },
    {
      "id": "beshalach2_p62",
      "text": "ויאמר משה אל העם התיצבו וראו את ישועת ה' וגו', איתא במכילתא ובתרגום יוב\"ע וירושלמי ד' כתין נעשו ישראל על הים, אחת אומרת ליפול אל הים, ואחת אומרת לשוב למצרים, ואחת אומרת לעשות מלחמה כנגדן, ואחת אומרת נצווח כנגדן, זו שאומרת נפול לים, נאמר להם התיצבו וראו את ישועת ה', זו שאמרה נשוב למצרים נאמר להם כי כאשר ראיתם את מצרים וגו', זו שאמרה נעשה מלחמה כנגדן נאמר להם ה' ילחם לכם, זו שאמרה נצווח כנגדן נאמר להם ואתם תחרישון עכ\"ד המכילתא, ראוי להבין סברת הכת שאמרה נפול לים ומה ירויחו בזה, וכמו\"כ אינו מובן דעת הכת שאמרה נשוב למצרים, ואותן שאמרו נצווח כנגדן. מה יועיל הצעקה והם מחושקים בכלי קרב.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 62,
      "char_length": 586,
      "timestamp": "2025-02-06T19:32:12.365188"
    },
    {
      "id": "beshalach2_p63",
      "text": "ב) במד\"ר (פ' כ\"ד ס\"ב) ויסע משה את ישראל, ר\"י אומר אמרו ישראל באותה שעה, כלום הוציאנו הקב\"ה ממצרים אלא בשביל ה' דברים. א' לתת לנו ביזת מצרים, ב' להרכיבנו על ענני כבוד, ג' לקרוע לנו את הים, ד' להפרע לנו מן המצרים, ה' לומר לפניו שירה, עכשיו כבר נתן לנו ביזת מצרים והרכיבנו על ענני כבוד, וקרע לנו את הים ופרע מן המצרים ואמרנו שירה לפניו נחזור למצרים, א\"ל משה כך אמר לי המקום כי כאשר ראיתם את מצרים היום וגו', אמרו לו כבר מתו כולן נחזור למצרים, א\"ל באו ופרעו את השטר, שכך אמר לי הקב\"ה בהוציאך את העם ממצרים תעבדון את האלקים על ההר הזה עכ\"ד המדרש, וצ\"ב מה היתה סברתם שלא הוציאם הקב\"ה אלא בשביל ה' דברים אלו בלבד, והלא היתה מוכרח היציאה משם דאלמלי התמהמהו היו משוקעים במ\"ע שערי טומאה ומהו הנתינת טעם הזה דאחרי כל הנסים שעשה הקב\"ה עמהם בטלה הכרח היציאה ושוב יוכלו לחזור למצרים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 63,
      "char_length": 769,
      "timestamp": "2025-02-06T19:32:12.667498"
    },
    {
      "id": "beshalach2_p64",
      "text": "ואפ\"ל דכוונתם הי' לש\"ש, וסברת הכתה שאמרה נפול לים וסבר עפי\"ד הזוה\"ק (פ' וישב קפ\"ה ע\"א) אמאי כתיב בראובן למען הציל אותו מידם להשיבו אל אביו, וכי לא חייש ראובן דאינון נחשין ועקרבין ינזקון לי' וכו', אמר ראובן טב למנפל לי' לגוי גובא דנחשין ועקרבין, ולא יתמסר בידא דשנאוי וכו', דזעירין אינון דיכלי לאשתזבא מידי בעלי בחירה וכו', דהכא אתר דנחשים ועקרבים אי איהו צדיקא קוב\"ה ירחיש לי' ניסא, ולזמנין דזכו אבהן מסייעין לי' לבר נש וישתזיב מנייהו, אבל כיון דיתמסר בידא דשנאוי, זעירין אינון דיכלין לאשתזבא, ובג\"כ אמר למען הציל אותו מידם, מידם דייקא וכו' עכ\"ד הזוה\"ק.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 64,
      "char_length": 553,
      "timestamp": "2025-02-06T19:32:13.057324"
    },
    {
      "id": "beshalach2_p65",
      "text": "ועד\"ז אפ\"ל לענינינו כי בטחו ישראל בישועתו ית' שינצלו מיד המצריים, כי ידעו שמוכנים לקבלת התורה וע\"ד כן הוציאם הקב\"ה ממצרים, אמנם כוונתם הי' למעט בחי' הנס עד כמה שאפשר כי אם יתמסרו בידי שונאיהם יצטרכו לזכות גדול להנצל מידי בעלי בחירה כמבואר בזוה\"ק, ע\"כ להנצל מסכנה זו בחרו יותר ליפול לים, והקב\"ה ירחיש להם ניסא להעלותם ממצולות ים. כאשר כבר אירע להם ככה כאמרז\"ל (ב\"ר פרשה צ\"ז סימן ג') ס' רבוא ילדים הושלכו ליאור ביום א' ועלו כולם, גם אמרו חכז\"ל (יבמות דף קכ\"א ע\"א) מים שאין להם סוף אשתו אסורה, א\"ר גמליאל פעם א' הייתי מהלך בספינה וראיתי ספינה א' שנשברה והייתי מצטער על ת\"ח שבה ומנו ר' עקיבא, וכשעליתי ביבשה בא וישב ודן לפני בהלכה וכו', אמרתי באותה שעה כמה גדולים דברי חכמים שאמרו וכו' מים שאין להם סוף אשתו אסורה עכ\"ד הגמ' ופי' דיש כח לחז\"ל לשנות הטבע, כמו שדרשו ז\"ל לק\"ל גומר עלי, וע\"י כח תורתן שקבעו הלכה דמים שאין להם סוף אשתו אסורה, ניתנה כח הצלה גם בדרך הטבע ממים שאין להם סוף, וז\"ש באותה שעה (שעלה ר\"ע) אמרתי כמה גדולים דברי חכמים שאמרו מים שאין להם סוף אסורה, ואפשר דמה\"ט אמרו נפול לים למעט בניסא, ושלא יצטרכו להנצל מידי בעלי בחירה שצריך זכות גדול לזה, והשיב משרע\"ה להם אל תיראו התיצבו וראו את ישועת ה' אשר יעשה לכם היום וגו', כי כך הי' רצון הבוי\"ת להגדיל בחינת הנס ועי\"ז נתפרסם קדושת שמו ית' בעולם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 65,
      "char_length": 1203,
      "timestamp": "2025-02-06T19:32:13.369638"
    },
    {
      "id": "beshalach2_p66",
      "text": "וכמו\"כ הכת שאמרה נחזור למצרים אפשר שהי' ג\"כ כוונתם לש\"ש רק שטעו, ויתבאר עפי\"מ שפירשתי מה שסרב מרע\"ה כ\"כ לילך בשליחות הקב\"ה לגאול את ישראל יען שראה כי אין זה גאולה שלימה ויצטרכו בנ\"י לסבול עוד גלות, וע\"כ חשב שמוטב שיתעכבו עוד זמן מה עד שתהי' הגאולה שלימה ולא יסבלו גלות עוד ומה\"ט סירב ולא רצה לילך, ועד\"ז אמרו ישראל לאחר שיצאו מן הים, הרי הכרח היציאה הי' בשביל שלא נשקע ח\"ו בנו\"ן שערי טומאה, אבל אחרי יצאנו משם והרכיבנו על ענני כבוד ונתן לנו ביזת מצרים וקרע לנו את הים ופרע מן המצרים ואמרנו שירה לפניו נחזור למצרים דמעתה יהי' לנו כח התגברות נגד כוחות הטומאה ומוטב יותר להמתין שם עד הגאולה הנצחית שאין אחרי' גלות ושעבוד, ועד\"ז טענה גם אותה הכת שאמרו לשוב למצרים, אבל האמת שכבר עברה השעה וא\"א לשנות, ואם יהי' להם זכותים גדולים יזכו שלא יהי' חורבן אלא שלא זכו לזה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 66,
      "char_length": 760,
      "timestamp": "2025-02-06T19:32:13.950867"
    },
    {
      "id": "beshalach2_p67",
      "text": "ואפ\"ל עוד דהכת שאמרה נפול לים, השיגו שע\"י כח המסנ\"פ הזה שיפילו עצמם לים יזכו לנס קרי\"ס, וכמ\"ש רז\"ל (סוטה דף ל\"ז ע\"א) שקפץ נחשון בן עמינדב לגלי הים באותה שעה אמר הקב\"ה למשה ידידי משוקעים במים וכו' ואתה עומד ומרבה בתפלה וכו', ועד\"ז הי' סברת הכת שאמרה נפול לים לעורר עי\"ז כח הנס מיד, והשיב להם משרע\"ה התיצבו וראו את ישועת ה' וגו', שימתינו עד שיצוה ה' כמ\"ש דבר אל בנ\"י ויסעו, ועד שתראו שהישועה מאת ה' אין לעשות דבר ע\"ד עצמו, והכת שאמרה נלחום כנגדן השיב להם משה ה' ילחם לכם שאסור ללחום באומות על דעת עצמינו, ובענין הגאולה אסור לעשות שום פעולה אנושי, רק הבוי\"ת ילחום מלחמתינו, ואפשר דהכת שאמרה נצווח כנגדן, יודעים היו להשתמש בשמות הקדושים, ועד\"ז רצו לצווח כנגדן ולעשות בהם כלה בכח השמות הק', ואמר להם משה רבינו ואתם תחרישון, שכל פעולה אף בתפלה יותר מדאי אסורה בענין הגאולה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 67,
      "char_length": 767,
      "timestamp": "2025-02-06T19:32:14.365361"
    },
    {
      "id": "beshalach2_p68",
      "text": "ואיתא במדרש (הובא בילקו\"ש תהלים פ\"ז) אלקים אל דמי לך אל תחרש ואל תשקוט קל, החרשתנו שנאמר ה' ילחם לכם ואתם תחרישון, לכך אל תחרש ואל תשקוט קל, ויובן עפי\"ד הילקוט (פ' בא רמז קצ\"א) מי פורע לכם ממלכות רביעית נטרונא, פי' בזכות שימתינו ישראל על ישועת ה' ולא יעשו פעולה לדחוק הקץ יזכו לגאולה, ועד\"ז בקשתינו החרשתנו שנאמר ה' ילחם לכם ואתם תחרישון, וע\"ד שביארנו לעיל שנצטווינו שלא לעשות פעולה אף בתפלה יותר מדאי, לכך בזכות זאת אל תחרש ואל תשקוט קל למהר ישועתינו בב\"א.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 68,
      "char_length": 457,
      "timestamp": "2025-02-06T19:32:14.769476"
    },
    {
      "id": "beshalach2_p69",
      "text": "ויאמר ה' אל משה מה תצעק אלי וגו' פירש\"י למדנו שהי' משה עומד ומתפלל, אמר לו הקב\"ה לא עת עתה להאריך בתפלה שישראל נתונים בצרה. וצ\"ב דאדרבה היא הנותנת להתפלל להקב\"ה, ובמד\"ר (פרשה כ' סימן ב') מה תצעק אלי הה\"ד (איוב כ\"ב) ותגזר אומר ויקם לך, א\"ר לוי כשם שהקב\"ה מצוה למשה ומדבר עמו כך הי' משה מצוה כביכול לפני הקב\"ה וכו' משל לאוהבו של מלך שהי' לו עסק הלך לצעוק לפני המלך א\"ל המלך מה אתה צועק גזור ואני אעשה, כך אמר הקב\"ה למשה מה תצעק אלי דבר ואני עושה וצ\"ב.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 69,
      "char_length": 449,
      "timestamp": "2025-02-06T19:32:15.017291"
    },
    {
      "id": "beshalach2_p70",
      "text": "ב) במדרש (הובא בישמח משה) אמר הקב\"ה למשה הים סוער והשונא רודף ואתה עומד ומרבה בתפלה לפני, אמר לו משה מה לי לעשות, א\"ל ואתה הרם את מטך, באותה שעה אמרו ישראל ה' ימלוך לעולם ועד, ותמה ק\"ז הישמח משה זללה\"ה ד' תמיהות, חדא מה זה שאמר הקב\"ה שני טעמים הים סוער והשונא רודף, ב' מ\"ש ואתה עומד ומרבה בתפלה קשה, למה לא יתפלל בצרת ישראל, ג' להבין מה שהשיב לו ואתה הרם את מטך, ד' למה באותה שעה אמרו ה' ימלוך לעולם ועד.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 70,
      "char_length": 404,
      "timestamp": "2025-02-06T19:32:15.258661"
    },
    {
      "id": "beshalach2_p71",
      "text": "ג) ואתה הרם את מטך וגו' במד\"ר (פ' כ\"א סימן ט') אמר ר' סימון משל לבעל הזמורה וכו' אמרו אילולי שהזמורה בידו לא הי' מתכבד שמע המלך וא\"ל העבר הזמורה ממך וצא לחוץ, וכל מי שאינו שואל בשלומך אני נוטל את ראשו, כך אמרו המצריים לא הי' יכול משה לעשות כלום אלא במטה. בו הכה היאור בו הביא כל המכות, כיון שבאו ישראל לתוך הים והמצרים עומדים מאחריהם, אמר הקב\"ה למשה השלך את מטך שלא יאמרו אילולא המעה לא הי' יכול לקרוע את הים שנאמר הרם את מטך עכ\"ד המדרש, לכאורה אין המשל דומה לנמשל, דאין זה דרך הטבע לקרוע את הים במטה ובעכ\"ח שהוא כח אלקי ובדרך נס, ומנפק\"מ אם יהי' באמצעות המטה או לא ובין כך ובין כך נס גדול הוא. גם יש להבין מדוע דוקא בנס קרי\"ס צוהו הקב\"ה להשליך המטה ולא בשאר הנסים עד עכשיו שנעשו ג\"כ ע\"י המטה הזה, ועוד הלא מטה זה יהי' ביד מלך המשיח כמבואר במדרשי חז\"ל, ולמה חששו יותר בקריעת ים סוף שלא יאמרו אילולי המטה לא הי' יכול לקרוע הים, ובאמת מצינו גם בחטא מי מריבה שזה הי' הפגם מה שהכה את הסלע במטה כדכתיב יען לא האמנתם בי וגו', אולם לפי זה טעמא בעי למה נצטוה בפעם הראשון להכות במטה על הסלע שא\"ל הקב\"ה ומטך אשר הכית בו את היאור קח בידך והלכת וגו' והכית בצור ויצאו ממנו מים וגו'.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 71,
      "char_length": 1069,
      "timestamp": "2025-02-06T19:32:15.510983"
    },
    {
      "id": "beshalach2_p72",
      "text": "ולבאר הענין נקדים לפרש במאמה\"כ (פרשת ויחי) פחז כמים אל תותר ובמד\"ר (פ' צ\"ח סי' ד') אתה חטאת במים יבוא משוי ממים (פי' משה דכתיב בי' כי מן המים משיתיהו) ויקרבוך יחי ראובן ואל ימות וצ\"ב, עוד במדרש כמים, מה מים ניתרין ממקום למקום כך הותרה לך, רבי אליעזר המודעי אומר אין עושין מקוה של יין של שמן אלא של מים, כך עשית לך מקוה של מים וטיהרת עצמך בו, וצ\"ב מדוע המשיל בחי' חטאו למים וגם את התשובה למים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 72,
      "char_length": 392,
      "timestamp": "2025-02-06T19:32:16.109323"
    },
    {
      "id": "beshalach2_p73",
      "text": "ואפשר לומר עפ\"י מש\"כ הרח\"ו זלה\"ה (בספרו שער הקדושה פ\"א ופ\"ב) בענין הד' יסודות אש רוח מים עפר שמהם גוף האדם נוצר, וקנין המדות הם כמו\"כ מד' יסודות אלו וזל\"ק, יסוד האש ממנו נמשכה הגאוה הנקרא גסות הרוח. להיותו היסוד הקל וגבוה מכולן, ובכללה הכעס וכו', יסוד הרוח ממנו נמשך דיבור הנקרא שיחה בטלה וכו' יסוד המים ממנו תאות התענוגים: כי כן המים מצמיחין כל מיני תענוג וכו', יסוד העפר ממנו מדת העצבות וכו' וארבעתן נמשכות מד' קליפות היצה\"ר שבנפש היסודית, והפכן הן ד' מדות טובות, נמשכות מד' יסודות הטוב שבנפש היסודית והן הענוה וכו' והשתיקה כאלם לא יפתח פיו לבד בעסק תורה ומצות וכו', והמיאוס בכל תענוגי הגוף וכו' והשמחה התדירית בחלקו וכו' עכלה\"ק.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 73,
      "char_length": 631,
      "timestamp": "2025-02-06T19:32:16.353563"
    },
    {
      "id": "beshalach2_p74",
      "text": "ועפי\"ז יובן קצת מה שהמשיל הכתוב בחי' חטאו של ראובן למים דהנה אמרו חכז\"ל (שבת דף נ\"ה ע\"ב) כל האומר ראובן חטא אינו אלא טועה מ\"מ אם התורה הקדושה כתבה עליו וישכב פלגש אביו בוודאי הי' בחי' פגם בדבר בערך קדושתו, והנה שורש החטא זה מיסוד המים, וז\"ש פחז כמים שהוא שורש מדת התאוה, אלא שגבי ראובן לא הי' בפועל ח\"ו רק בחי' פגם בערך רוב קדושתו, לז\"א כמים בכ\"ף הדמיון, וגם את התשובה המשיל למים דכמו\"כ המדות טובות בהפכן נמשכים ג\"כ מד' יסודות הנ\"ל, וידוע שבזוה\"ק החמירו מאוד בעון פגם חטא הידוע, עד שבמקום אחד כתבו דאינו מועיל תשובה אבל כבר פירשו דהכוונה רק על תשובה מיראת העונש, אבל תשובה מאהבה מועיל גם על חטא זה, והאהבה להשי\"ת נמשכה ג\"כ מיסוד המים שנקראת תאוה כמו שאה\"כ נפשי אויתיך בלילה, ואם מתעורר נפש האדם חלק אלקי ממעל להשתוקק להשי\"ת להיות דבוק בו ית' במסנ\"פ באמת, גם זה נמשך מיסוד המים, נמצא שע\"י יסוד המים אפשר לירד למקום נמוך ביותר ע\"י התאוות לדברים האסורים, ולעומת זה אפשר לעלות למדריגות גבוהות ונשגבות, וזה שאמר המדרש מה מים ניתרין ממקום למקום כך הותרה לו, דע\"י יסוד המים אפשר לירד ממקום גבוה למקום נמוך וכן אפשר גם לעלות ממקום נמוך למקום גבוה, וע\"י התשובה שעשה ראובן על חטא זה שהוא מיסוד המים הותרה לו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 74,
      "char_length": 1098,
      "timestamp": "2025-02-06T19:32:16.671273"
    },
    {
      "id": "beshalach2_p75",
      "text": "ובזה נל\"פ הא דאיתא במדרש (פ' עקב פרשה ג' סי' ח') שמע ישראל אתה עובר היום את הירדן בא וראה כל הנסים שעשה הקב\"ה לישראל לא עשאן אלא על המים, כיצד עד שהן במצרים עשה להם נסים ביאור וכו' וכשיצאו ישראל ממצרים וכו', א\"ל משה הוו יודעין כל נסים שעשה לכם הקב\"ה לא עשה אלא על המים, ואף בשעה שתעברו את הירדן לירש את הארץ עתיד הוא לעשות לכם נסים במי הירדן ע\"כ וצ\"ב דהרי נעשו לישראל הרבה נסים אף שלא על המים, ואיך קאמר שכל הנסים לא עשאן אלא על המים, ועוד הרי טיטוס הרשע אמר שאין כחו של אלקי ישראל אלא על המים כדאיתא בגמרא גיטין (דף נ\"ו ע\"ב) ואיך אמרו שכל הנסים לא עשאן אלא על המים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 75,
      "char_length": 566,
      "timestamp": "2025-02-06T19:32:17.192090"
    },
    {
      "id": "beshalach2_p76",
      "text": "ואפ\"ל ענין הרמז עפ\"י דרכינו הנ\"ל, דע\"י תאוות הרעות הבאים מיסוד המים עלול האדם ליפול ר\"ל עד לדיוטא התחתונה, ולהיפך ע\"י מדות הטובות שביסוד המים יזכה לעלות מעלה מעלה, וזה תכלית כל הנסים שנעשו לישראל, להעלות יסוד המים לשרשה, באהבה נפלאה והשתוקקות להשי\"ת ע\"י חביבות הנס והכרה אמיתית בהשפעה אלקית וגדולת הבוית\"ש, וזהו רמזו חז\"ל במתק לשונם, א\"ל משה הוו יודעין שכל הנסים שעשה לכם הקב\"ה, לא עשה אלא על המים, לתקן מה שפגמו ביסוד המים ולהעלותה לשרשה, ואפשר דגם נס קרי\"ס הי' להמשיך פעולה זו, כי הי' צורך להפריש את ישראל מתאות מצרים, ואף שהיו גדורים מעריות ולא נטמעו ביניהם, מ\"מ אם מידי עבירה יצאו מידי הרהור לא יצאו, וע\"י נס קרי\"ס הופרשו מתאות האסורים ובאו לתאוה דקדושה, והעלו יסוד המים לשורשה ולתנאם הראשון שנבראו ע\"ש כך מששת ימי בראשית, ואפשר לרמוז זה באמרם ז\"ל וישב הים לאיתנו לתנאו הראשון והבן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 76,
      "char_length": 786,
      "timestamp": "2025-02-06T19:32:17.516725"
    },
    {
      "id": "beshalach2_p77",
      "text": "וכבר בארנו מה דאיתא במדרש שנעשה נס במטה שבלע כל המטות של החרטומים ולא נתעבה כלל, וראוי להבין מדוע הי' צורך בנס זה (עיין בדברינו לעיל), ועכשיו נ\"ל להסביר באופן אחר דאפשר שאותו המטה לא בלע את מטותם כלל, דאלמלי הי' בולע מכוחות הטומאה לא היו משתמשין לעשות בו נסי הגאולה כי א\"א שבגאולת ישראל יהי' איזה תערובת מכוחות הסט\"א, אך נראה כי לשון בליעה האמור כאן יש לו מובן אחר, דמצינו אצל המלאכים שבאו אל אברהם אבינו ע\"ה כתיב והוא עומד עליהם וגו' ויאכלו ודרשו רז\"ל במד\"ר (פ' וירא פרשה מ\"ח סי' י\"ד) וכי אוכלין היו אלא נראין כאוכלין ראשון ראשון מסתלק, הרי דהבערה מן העולם נקרא ג\"כ בלשון אכילה, וכמו\"כ אפ\"ל כאן ויבלע מטה אהרן את מטותם, דאין הכוונה שבלע אותם ממש אלא שמטה אהרן התגבר על מטותם, וראשון ראשון נסתלק מן העולם עד שנאבדו לגמרי, וכ\"כ בעלי התוספות (פ' מקץ) עה\"פ ותבלענה השבלים אין לפרש לשון בליעה ממש דאין מראין לו לאדם דעייל פילא בקופא דמחטא עיי\"ש, נמצא לפי\"ז דהיינו טעמא שלא נתעבה המטה, לפי שלא נכנסו בו מטות החרטומים כלל רק נעשה נס שמטה אהרן ביער כל מטות החרטומים. אלא שהחרטומים והמכשפים אמרו להיפך שכוחות הטומאה דחו את כח הקדושה, לכן כדי להוציא מלבם של צדוקים צוה הקב\"ה למשה ואתה הרם את מטך, שיסלק את המטה בקרי\"ס כי ישועתן של ישראל צריכה שתבוא רק מצד הקדושה באופן שלא יהי' מקום לטעות, וח\"ו להעלות על הדעת שיבוא ישועה לישראל ע\"י מינים וכופרים, לא תהא כזאת בישראל, ורק לה' הישועה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 77,
      "char_length": 1274,
      "timestamp": "2025-02-06T19:32:17.884893"
    },
    {
      "id": "beshalach2_p78",
      "text": "ואפשר דהיינו טעמא נמי שהי' פגם בדבר אשר הכה מרע\"ה את הסלע במטה, יען שהיו שם דתן ואבירם והע\"ר והי' חשש שיאמרו שהנס נעשה ע\"י המטה מפני שיש בו מכוחות הטומאה של מטות החרטומים, וע\"כ נצטוה להוציא המים מן הסלע בדיבור גרידא ולא במטה כדי להתוודע ולהגלות שלא המטה הוא המוציא מים מחלמיש צור, ולפיכך הי' פגם בדבר שלא נתקדש ש\"ש מטעם שהי' פתחון פה לרשעים לומר כנ\"ל, אמנם בפרשה זו נצטוה משה רבינו ע\"ה והכית בצור וגו', אפשר יען שעדיין היו עומדים לפני מלחמת עמלק, לא הי' חשש שיאמרו כן, לפי שהיו ישראל טהורים ונקיים מכל שמץ מחשבת פיגול, משא\"כ אחר מלחמת עמלק שהכניס בהם פגם וחסרון אמונה, ומלחמה לה' בעמלק מדור דור, ודרשו רז\"ל מדורו של משה עד דורו של משיח שאז ימחה שמו של עמלק, ואיתא במדרש שהמלך המשיח ישתמש במטה שהי' ביד משה, אמנם אז לא יעלה על הדעת שיש במטה ערבוב מכוחות הטומאה, כי אז יכלה כוחו של עמלק מן העולם, ויתכן דגם בנס קרי\"ס לא הי' יכול להשתמש במטה מה\"ט לפי שלא היו ישראל עדיין חזקים באמונה כ\"כ עד אחר שעברו את הים ונתקדשו ונטהרו כמ\"ש ויאמינו בה' ובמשה עבדו, וקודם קרי\"ס התגברו כוחות הטומאה והסט\"א מאוד כדאיתא במדרש שכל שרי האומות באו לעזור למצרים והי' חשש כנ\"ל, לכן אמר לו הקב\"ה למשה ואתה הרם את מטך שיסלק את המטה ורק בדיבור בלבד יקרע את הים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 78,
      "char_length": 1133,
      "timestamp": "2025-02-06T19:32:18.501872"
    },
    {
      "id": "beshalach2_p79",
      "text": "והנה בזמן שכח הקטרוג חזקה צריך הצדיק להסתיר תפילתו שלא יבינו המקטריגים ולא יקטרגו לבטל תפילתו, כמ\"ש בספה\"ק נועם אלימלך (פ' וישלח) עה\"פ כה תאמרון לאדוני לעשו, דהנה דרך הצדיק בדברו עם אנשים, אזי הוא מדקדק בדבריו להשכיל, שיהיו דבריו נשמעים וכו' דברים כפשוטן לאיש המדבר עמו, שנית הוא העיקר תוכן דבר שמכוין באותן הדיבורים, שיהיו תפלה ותחנונים לפני המקום ב\"ה וב\"ש, והכוונה בזה שמסתיר דבריו של התפלה בהדיבורים שמדבר עם האדם, ואינו מתפלל תפלתו הצורך לו בפירוש הוא למען המקטרג שלא יבין כוונתו בדבריו שמכניס בהם תפלה, ולא יקטרג עליו כי אינו יודע שזה מתפלל עכלה\"ק, והנה בקרי\"ס הי' הקטרוג גדול מאוד כמבואר בדרז\"ל, וע\"כ אין העת מוכשר להאריך בתפלה לטעם הנ\"ל, ולזה נתן הקב\"ה עצה למשרע\"ה שלא יאריך בתפלתו, כ\"א ימשיך הנס והישועה בבחי' צדיק גוזר והקב\"ה מקיים, ואף זו יסתיר בדבריו למען לא יבינו המקטריגים, ולז\"א לו דבר אל בני ישראל ויסעו, ועי\"ז ימשיך נס קרי\"ס בבחי' צדיק גוזר, ובזה יתבאר דברי המדרש הנ\"ל אמר הקב\"ה למשה מה תצעק אלי, דבר ואני עושה, כי לא עת להאריך בתפלה שישראל נתונים בצרה מפני סכנת הקטרוג.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 79,
      "char_length": 986,
      "timestamp": "2025-02-06T19:32:19.048234"
    },
    {
      "id": "beshalach2_p80",
      "text": "ומעתה נבוא לבאר דברי המדרש המובא בישמח משה והדקדוקים שבו (לעיל קושיא ב') אמר הקב\"ה למשה הים סוער והשונא רודף וכו' וירמוז לדרכינו דמפני שתגבורת התאוה הבא מיסוד המים סוער וגדל, עי\"ז השונא רודף והקטרוג גדול מאוד, ומה\"ט לא עת להאריך בתפלה כנ\"ל, וז\"ש לו הים סוער והשונא רודף ואתה עומד ומרבה בתפלה לפני, אמר לו משה ומה עלי לעשות, א\"ל ואתה הרם את מטך, ר\"ל שיסלק המטה ובדיבורו בלבד יקרע הים כמ\"ש לו דבר אל בנ\"י ויסעו בבחי' גזור ואני אעשה, ובזמן כזה שכח הקטרוג חזקה צריך זהירות יתירה שלא יטעו ישראל בהנס שיש בו מכוחות הסט\"א, וע\"כ צוהו לסלק המטה ובדיבורו לבד יפעול להמשיך הנס, וע\"כ באותה שעה אמרו ה' ימלוך לעולם ועד, עפימ\"ד במדרש ילקוט (רמז רנ\"ג) ר' יוסי אומר אלו אמרו ישראל על הים ה' מלך לעולם ועד, לא היתה אומה ולשון שולטת בהן לעולם אלא אמרו ה' ימלוך לעולם ועד לעתיד לבא, ולכאורה באמת טעמא בעי מדוע אמרו כן בלשון עתיד, אמנם לדרכינו אפ\"ל שהשיגו ממה שצוה הקב\"ה למשה לסלק המטה מחשש שלא יאמרו שנעשה הנס בסיוע כוחות הטומאה ממטות החרטומים שנבלעו בו, ומזה הבינו כי עדיין לא הגיע זמן התגלות כבוד מלכותו ית', דאז לא יעלה על הדעת עוד מחשבת ב' רשויות, ויכירו וידעו כל יושבי תבל כי אין בלתו ואפס זולתו, ומה\"ט כאשר שמעו ישראל שצוה ה' למשה הרם את מטך, באותה שעה אמרו ה' ימלוך לעולם ועד בלשון עתיד והבן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 80,
      "char_length": 1180,
      "timestamp": "2025-02-06T19:32:19.624030"
    },
    {
      "id": "beshalach2_p81",
      "text": "ויאמר ה' אל משה מה תצעק אלי וגו', במדרש (הובא בישמח משה) אמר הקב\"ה למשה הים סוער והשונא רודף ואתה עומד ומרבה בתפלה, א\"ל ומה עלי לעשות, א\"ל ואתה הרם את מטך, באותה שעה אמרו ה' ימלוך לעולם ועד, וצ\"ב כוונת הקישור, גם כוונת הטענה הים סוער וכו' ואתה מרבה בתפלה ואדרבה הוא הנותנת לצעוק אל ה' בעת צרה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 81,
      "char_length": 293,
      "timestamp": "2025-02-06T19:32:20.211869"
    },
    {
      "id": "beshalach2_p82",
      "text": "ב) במדרש פליאה ה' ילחם לכם ואתם תחרישון מלומר שירה, והוא פלא.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 82,
      "char_length": 61,
      "timestamp": "2025-02-06T19:32:20.396390"
    },
    {
      "id": "beshalach2_p83",
      "text": "ג) מה תצעק אלי, פירש\"י ז\"ל עלי הדבר תלוי וכו' וצ\"ב דאדרבה לטעם זה צריכים דוקא להתפלל אליו ית' שבו הדבר תלוי",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 83,
      "char_length": 107,
      "timestamp": "2025-02-06T19:32:20.470444"
    },
    {
      "id": "beshalach2_p84",
      "text": "וכל אלה באחת יבוארו בהקדם דברי אא\"ז הייטב לב זצוקלה\"ה בשם המפורשים לפרש מאמר המשנה הקורא את המגילה למפרע לא יצא, היינו על מה שהי' כבר בימי מרדכי ואסתר לא יצא דצריך להמשיך השפעת הנס גם על להבא ובכל דור ודור צריכין אנו לישועת ה', ואמרו חכז\"ל (תדב\"א ב') דבכל יום ויום נעשו לישראל נסים כפליים כיוצאי מצרים אלא שאין בעל הנס מכיר בניסו, ולזה צריכין לעורר כח הנסים שעשה הקב\"ה לאבותינו ולהמשיכם גם להבא עכת\"ד ז\"ל, והנה צריך שיהא הנס ע\"י אתערותא דלתתא ובהכנת מצות ומע\"ט, ואז יש לו כח נצחי להמשיכו גם להבא, אבל אם נמשך הנס רק בהתערותא דלעילא לבד ה\"ה הוראת שעה אשר בהכרח הוצרך הקב\"ה להושיען אף בלי זכות, עוד איתא בספה\"ק דע\"י שירה ממשיכים כח הנס גם להבא.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 84,
      "char_length": 642,
      "timestamp": "2025-02-06T19:32:20.558541"
    },
    {
      "id": "beshalach2_p85",
      "text": "והנה משה רבינו הי' מצפה שיהי' עולם התיקון וגאולה נצחי מיד, וא\"כ אין צורך להמשיך בחי' נס זה לדורות, ולז\"א כי כאשר ראיתם את מצרים היום לא תוסיפו לראותם עד עולם וגו', ומהאי טעמא ה' ילחם לכם שיבוא הנס בהתעוררות של מעלה. ואתם תחרישון מלומר שירה כי אין צורך להמשיך בחי' הנס הזה לדורות, ועמד בתפלה להמשיך הנס באתערותא דלעילא, א\"ל הקב\"ה מה תצעק אלי פירש\"י עלי הדבר תלוי, וע\"ד שאמה\"כ (ישעי' מ\"ה) ישראל נושע בה' תשועת עולמים, דכמו שהוא ית' נצחי ואין סוף, כך בבחינה זו שולח ישועתו לישראל שיהא תשועת עולמים ונצחי, וז\"ש עלי הדבר תלוי וצריך שיהא ישועה נצחי גם לדורות, ואין די בהתערותא דלעילא לבד שאתה מרבה בתפלה, דאם יהי' בלי התעוררות דלתתא אין בו כח להמשיך בחי' הנס לדורות, ע\"כ דבר אל בני ישראל ויסעו שיעשו אתערותא דלתתא וכן עשו שנכנסו לתוך הים במסירת נפש ובאו המים עד צווארם ועי\"ז נמשך כח הנס גם על להבא.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 85,
      "char_length": 792,
      "timestamp": "2025-02-06T19:32:20.879658"
    },
    {
      "id": "beshalach2_p86",
      "text": "ועד\"ז יתבאר דברי המדרש א\"ל הקב\"ה למשה הים סוער והשונא רודף וכו', ע\"ד דאיתא בחובת הלבבות שיש חילוק בין שונא דעלמא להשונא הגדול המשטין, שסתם שונא אם מנצחין אותו פעם או שתים לא יתגבר ללחום יותר, אבל היצר לא ינוח ולא ישקוט אף שכבר נצחוהו פעמים הרבה, וז\"ש השונא רודף תמיד בכל עת, ויצטרכו בנ\"י ישועה גם להבא ולא די במה שיושעו כעת לפי שעה, ואתה מרבה בתפלה, ר\"ל שאתה רוצה לפעול בתפלתך שיבא הישועה בהתעוררות דלעילא לבד, הלא א\"כ לא יהי' הישועה רק לפי שעה, א\"ל ומה עלי לעשות ואתה הרם את מטך ע\"ד שמצינו (במסכת ר\"ה דף כ\"ט ע\"א) כאשר ירים משה את ידו היו ישראל משעבדין את לבם לאביהם שבשמים ועי\"ז ימשך בחי' הנס גם להבא, ע\"כ אמרו ה' ימלוך לעולם ועד ר\"ל כבוד מלכותו ית' יתקדש ע\"י הנסים וימשך גם לדורות לעלם ולעלמי עלמיא והבן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 86,
      "char_length": 706,
      "timestamp": "2025-02-06T19:32:21.275743"
    },
    {
      "id": "beshalach2_p87",
      "text": "באופן אחר אפ\"ל דברי המדרשים הנ\"ל דהנה הקשו בספה\"ק מהו ענין גודל הנס של קרי\"ס שכאשר הפליגו חכז\"ל להגזים איזה דבר דימו אותו לנס קריעת ים סוף כאמרם (פסחים דף קי\"ח ע\"א) קשה מזונותיו של אדם כקריעת ים סוף וכדומה, ולגבי הבוי\"ת אין דבר קשה לעשות נסים, רק בעיני האדם שהוא רגיל להטבע הוי הנס חידוש גדול, אבל הקב\"ה כמו שברא את הטבע כך הוא עושה נסים ואין רבותא בדבר מה שמשדד מערכות השמים, והבינה לעתים הסביר הענין שבקריעת ים סוף הי' צריך להיות שני הפכים בנושא אחד, דהנה לישראל הי' צורך בהמשכת מדת הרחמים דבלא זה לא היו יכולין להנצל כי גם הם היו נתונים בדין, וכפרש\"י עה\"פ ויסע מלאך האלקים וגו', בכל מקום הוא אומר מלאך ה' וכאן מלאך האלקים, אין אלקים בכ\"מ אלא דין, מלמד שהיו ישראל נתונים בדין באותה שעה אם להנצל אם להאבד עם מצרים, וכן איתא במדרש (ילקוט ראובני) שטען עוזא שר של מצרים מה בין אלו לאלו הללו עע\"ז והללו וכו', ע\"כ הוצרך הקב\"ה להתנהג עמהם במדת הרחמים, ולעומת זאת להמצריים דן אותם במדה\"ד לאבדם לגמרי, וזה הי' ענין הגדול של נם קריעת ים סוף, מה ששמשו שתי המדות בשעה וברגע אחת ממש, שני הפכים בנושא אחד שאין זה במציאות לשום נברא בעולם לעשות רק הבורא כל העולמים שהוא כל יכול ובזה הי' הנס של קרי\"ס גדול יותר מנס יציאת מצרים, דשם לא הי' צורך להשתמש ברגע אחת בשתי המדות גם יחד, ורק בקרי\"ס הי' צורך במדת הרחמים לישראל ובמדת דין הקשה נגד מצרים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 87,
      "char_length": 1228,
      "timestamp": "2025-02-06T19:32:21.656848"
    },
    {
      "id": "beshalach2_p88",
      "text": "ובספה\"ק עבודת ישראל (להרה\"ק מקאזניץ זלה\"ה) במאמריו לר\"ה כתב וזל\"ק כי ח\"ו אם גם ישראל אינם ראויים במעשיהם, וצריך הקב\"ה לעשות עמהם צדקה במתנת חנם, אז יוכל להיות שיתאחזו החיצונים בהשפעה זו ובוודאי אין נחת רוח מזה להקב\"ה, רק אם ישראל מוציאין המשפט לאורה בדין ומשפט, אז הקב\"ה יכול לעשות עמהם צדקה וחסד ואין שטן ואין פגע רע לקטרג או לקבל ההשפעה, כי לעושי רצונו לבדו באה נחלתן בדין ומשפט עכל\"ק, והנה אז בשעת קי\"ס ודאי שלא זכו ישראל מצד מעשיהם הטובים שיומשך עליהם מדה\"ר, דהרי הי' עליהם קטרוג משרו של מצרים הללו עע\"ז והללו וכו' וא\"כ אם יתעורר להם מדת החסד יש חשש שגם המצריים יהנו מתגבורת הרחמים, והנה איתא בגמרא (יבמות ס\"ד ע\"א) א\"ר יצחק למה נמשלה תפלתן של צדיקים כעתר מה עתר זה מהפך התבואה ממקום למקום כך תפלתן של צדיקים מהפכת מדותיו של הקב\"ה ממדת רגזנות למדת רחמנות.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 88,
      "char_length": 758,
      "timestamp": "2025-02-06T19:32:22.257201"
    },
    {
      "id": "beshalach2_p89",
      "text": "ובזה יובן דברי המדרש אמר הקב\"ה למשה הים סוער, וא\"כ ישראל נתונים בצרה גדולה וצריכים למדת הרחמים, אבל השונא רודף ועליהם צריך לעורר מדת הדין הקשה, ואתה עומד ומרבה בתפלה, ותפלתך יש לה כח סגולה להפך מדה\"ד לרחמים גמורים, וכיון שאין ישראל זוכין מצד מעשיהם יוכלו גם המצריים להנות ממדה\"ר, א\"ל ומה עלי לעשות א\"ל ואתה הרם את מטך אתה מרומם ומפאר ומשבח וכו' למי שהמלוכה שלו, פי' תמסור דבר זה בידו של הקב\"ה שהוא ית' יכול לעשות שני הפכים בנושא אחד, אבל אם אתה תרבה בתפלה יש חשש שתהפוך לגמרי מדה\"ד לרחמים ולא ישאר מדה\"ד כלל בעולם, ועכשיו יש צורך גדול במדת הדין על המצריים וז\"ש רש\"י ז\"ל מה תצעק אלי, עלי הדבר תלוי ולא בך, פי' ענין זה א\"א לשום נברא בעולם לעשותו רק אני בעצמי בידי לעשות שני הפכים בנושא אחד, וע\"כ אין הזמן מוכשר עתה להרבות בתפלה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 89,
      "char_length": 726,
      "timestamp": "2025-02-06T19:32:22.627516"
    },
    {
      "id": "beshalach2_p90",
      "text": "ועד\"ז יתבאר אידך דברי המדרש הנ\"ל, אמר הקב\"ה למשה הים סוער והשונא רודף ואתה עומד ומרבה בתפלה, א\"ל ומה עלי לעשות, א\"ל ואתה הרם את מטך, באותה שעה אמרו ה' ימלוך לעולם ועד, עפ\"י מה שאמרז\"ל (ר\"ה כ\"ט ע\"א) והי' כאשר ירים משה ידו וגבר ישראל וגו' וכי ידיו של משה עושות מלחמה או שוברות מלחמה, אלא לומר לך כל זמן שהיו ישראל מסתכלין כלפי מעלה ומשעבדין את לבם לאביהם שבשמים היו מתגברים וכו', ועד\"ז ירמוז כאן ואתה הרם את מטך לשעבד את לבם לשמים, ועי\"ז אתעורר עליהם במדת הרחמים, ונטה את ידך להמשיך בחי' יד החזקה ולעורר דין על המצריים, משא\"כ אם תרבה בתפלה יתבטל הדין לגמרי דתפלתן של צדיקים מהפכת מדת הדין למדה\"ר כנ\"ל, וע\"כ באותה שעה אמרו ה' ימלוך לעולם ועד, עפימ\"ש רז\"ל (בב\"ר פ' י\"ב סי' ט\"ו) בתחלה עלה במחשבה לברוא את העולם במדת הדין וראה שאין העולם מתקיים, הקדים מדת הרחמים ושתפה למדה\"ד, והקשו המפורשים דכיון שלא נתקיים הבריאה במה\"ד בלבד, מ\"ט כתבה תורה בראשית ברא אלקים שהוא מדה\"ד, ותירצו שיש צורך גם במדה\"ד ונתקיים מידה זו לעכו\"ם, אבל לישראל מתנהג הקב\"ה במדת הרחמים, אמנם לעתיד שיתבערו הרשעים מן העולם לא יהי' צורך במדה\"ד, וע\"כ באותה שעה אמרו ה' ימלוך לעולם ועד, בלשון עתיד, היינו בחי' שם הוי' שהוא רחמים גמורים בו יהי' הנהגת העולם לעתיד.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 90,
      "char_length": 1122,
      "timestamp": "2025-02-06T19:32:22.975814"
    },
    {
      "id": "beshalach2_p91",
      "text": "גם יתבאר דברי המדרש עפי\"ד האוה\"ח הק' עה\"פ ה' ימלוך לעולם ועד כי בא סוס פרעה וגו' (עיי\"ש), היוצא מדבה\"ק כי ממה שנאבדו המצריים השיגו ישראל שעדיין לא הגיע הזמן של עולם התיקון ורק לעתיד יהי' שלימות הגמור, וזהו פי' המדרש שא\"ל הקב\"ה ואתה הרם את מטך ונמשך מזה אבדונם של המצריים, באותה שעה אמרו ה' ימלוך לעולם ועד ולא ה' מלך, השי\"ת יעזור שיתעוררו הנסים ההם בזמן הזה וכימי צאתנו ממצרים יראנו נפלאות ונזכה במהרה לישועת כל ישראל ושמחתן בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו במהרה בימינו אמן. אל",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 91,
      "char_length": 497,
      "timestamp": "2025-02-06T19:32:23.511948"
    },
    {
      "id": "beshalach2_p92",
      "text": "ויאמר ה' אל משה מה תצעק אלי דבר אל בני ישראל ויסעו, פירש\"י ז\"ל מה תצעק אלי וכו' ד\"א עלי הדבר תלוי ולא עליך וכו' וצ\"ב והדקדוקים כבר נפרטו לעיל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 92,
      "char_length": 142,
      "timestamp": "2025-02-06T19:32:23.768106"
    },
    {
      "id": "beshalach2_p93",
      "text": "ב) ויט משה את ידו על הים וישב הים לפנות בוקר לאיתנו וגו', במדרש ילקוט (רמז רל\"ו) א\"ר יונתן התנה הקב\"ה תנאים עם הים שיהא נקרע לפני ישראל, הה\"ד וישב הים לפנות בוקר לאיתנו לתנאו שהתנה הקב\"ה עמו וכו', והקשו המפרשים דרמז זה הול\"ל לעיל עה\"פ ויבקעו המים שהרי התנאי הי' על הבקיעה, ומה שחזר לאיתנו אח\"כ דרך הטבע כן הוא להיות הים הולך כדרכו וא\"צ לתנאי.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 93,
      "char_length": 342,
      "timestamp": "2025-02-06T19:32:23.878460"
    },
    {
      "id": "beshalach2_p94",
      "text": "ג) איתא בגמרא (ערכין ט\"ו ע\"א) א\"ר הונא ישראל שבאותו הדור מקטני אמנה היו וכו' שהיו ישראל ממרים באותה שעה ואומרים כשם שאנו עולים מצד זה כך מצרים עולים מצד אחר, א\"ל הקב\"ה לשר של ים פלוט אותם ליבשה וכו' וכתבו התוס' וז\"ל יש לתמוה איך היו ישראל באותו הדור כ\"כ מקטני אמנה, שסברו שכך עשה הקב\"ה נסים למצרים להעבירם מארצם לארץ ישראל, ותירצו שישראל לא עברו הים לרחבו מצד זה לזה, אלא רצועה אחת עברו בים לאורך הים עד שפנו למדבר מצד אחד וכו' וז\"ש כשם שאנו עולין מצד זה ובאנו למדבר, כך מצרים עולין מצד אחר מן המדבר וירדפו אחרינו וכו', כי סבורים היו שלא יעברו המצריים בים אלא יבואו מצד אחר וכו' עכ\"ד התוס' ולכאורה קושית התוס' עדיין במקומה עומדת דאיך היו ישראל קטני אמנה לחשוב ככה שהקב\"ה עשה להם נס למגנא לקרוע הים לפניהם ואם ירדפו אחריהם המצריים מצד אחר וישיגום א\"כ מה תועלת הנס, גם קשה על המצריים מדוע לא עשו כן, להמתין ביבשה עד שיעלו ישראל מן הים באותו צד עצמו שירדו, כיון שלא עברו את הים מעבר לעבר, ולמה רדפו אחריהם לתוך הים, הן אמת דקושיא זו אפשר לתרץ דבשעה שירדו ישראל לתוך הים לא ידעו המצריים עדיין שיעלו באותו צד עצמו, וחשבו שיעלו בצד השני שמעבר לים ע\"כ רדפו אחריהם לתוך הים. אמנם צריך להבין סברת המצריים איך הכניסו עצמם לסכנה זו לירד לתוך הים הלא ידעו שלא יעמוד הים כך לעולם, ועתיד לחזור למהלכו הראשון, ואיך לא חששו לנפשם לעשות כדבר הזה, וכעי\"ז הקשה האוהחה\"ק (בפ' בא) בפסוק עד מתי יהיה זה לנו למוקש וגו' הטרם תדע כי אבדה מצרים, האם יש שוטה גמור בעולם שיסבול כל הרעות והצרות ההמה ויכניס עצמו לסכנת נפשות, ומן הסתם לא יאומן כי כ\"כ טפש הי', והגם כי הקשה ה' את רוחו עכ\"ז צריך שתהי' לו איזה סברא שבה יתלה טפשותו, ועיי\"ש מה שנדחק ליישב סברתו, וכמו\"כ כאן צריכין אנו ליישב במה הסכימה דעתם להכניס למקום סכנה כזה לירד לתוך הים אחר שידעו בבירור שלא יעמוד הים כך לעולם, ואין לך שוטה גדול מזה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 94,
      "char_length": 1672,
      "timestamp": "2025-02-06T19:32:24.067391"
    },
    {
      "id": "beshalach2_p95",
      "text": "ד) במדרש ילקוט איתא (ישעי' ס\"ג רמז תק\"ז) אני מדבר בצדקה זה שאמר הכתוב בעת ההוא יעמוד מיכאל, לעתיד לבוא באים שרים ומקטרגים על ישראל, ואומרים לפני הקב\"ה רבש\"ע וכי יש לפניך משוא פנים, אם אלו עובדי ע\"ז אף אלו ע\"ז, אם אלו מגלי עריות אף אלו וכו', מפני מה הללו יורדין לגיהנם והללו אין יורדים, באותה שעה מיכאל סניגורן של ישראל משתתק וכו', וכיון שהוא משתתק אומר הקב\"ה מיכאל נשתתקת ואין אתה מלמד סנגוריא על בני, חייך שאני מלמד ומדבר עליהם בצדקה ומושיען, שנאמר אני מדבר בצדקה רב להושיע, ובאיזו צדקה וכו', בצדקה שעשיתם עמי שקבלתם את התורה שאלמלא כן היכן היתה מלכותי וכו' ע\"כ, ובס' תפלה למשה לק\"ז ישמח משה זלה\"ה דקדק דמדוע יאמרו אומה\"ע דבריהם בלשון ספק אם אלו עובדי ע\"ז אף אלו וכו' הלא זה ברור שהאומות עובדי ע\"ז הם ותו קשה אם יודעים שגם ישראל עבדו ע\"ז למה הוצרכו לתלות טענת הקטרוג באוה\"ע לומר אם אלו עובדי ע\"ז אף אלו עובדי ע\"ז, גם בלא זה היו יכולין לקטרג על ישראל שהם עובדי ע\"ז.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 95,
      "char_length": 865,
      "timestamp": "2025-02-06T19:32:24.908088"
    },
    {
      "id": "beshalach2_p96",
      "text": "ונל\"פ עפימ\"ש בספה\"ק בני יששכר בדרושים לשבועות (מאמר ב' סימן ה') בשם ספר לימודי ה' כמה טעמים על מה שאמרו רז\"ל דאין תשובה מועלת רק לישראל ולא לאוה\"ע, וא' מהטעמים דתנאי התנה הקב\"ה במעשה בראשית אם לא יקבלו ישראל את התורה יחזור העולם לתוהו ובוהו. והנה ישראל ע\"י שקבלו את התורה קיימו את העולם והרי הם כביכול כשותפין במלכותו, ע\"כ לא שייך בישראל הדין מלך שמחל על כבודו אין כבודו מחול, משא\"כ אוה\"ע לא מהני בהו תשובה מטעם מלך שמחל על כבודו אין כבודו מחול עכת\"ד ז\"ל, ובזה יובן דברי המדרש הנ\"ל בטוב טעם דמבואר בדרז\"ל (ע\"ז ג' ע\"ב) דגם אוה\"ע יעשו תשובה לעתיד לבוא וכולם יהיו גרים גרורים ויבואו אל מלך המשיח לשמוע תורה מפיו כמ\"ש בב\"ר (פצ\"ח) עה\"פ (ישעי' י\"א) אליו גוים ידרושו עיי\"ש, אלא שלא יתקבל תשובתם מדין מלך שמחל על כבודו אין כבודו מחול, ולזה יבואו שרי האומות בטענה לפני הקב\"ה אם אלו עובדי ע\"ז היינו שנחשבו לעובדי ע\"ז אף שעשו תשובה מטעם מלך שמחל על כבודו אין כבודו מחול א\"כ אף אלו עובדי ע\"ז, וגם לגבי ישראל לא יועיל התשובה להיות נחשבין כעובדי ע\"ז, וישיב להם הקב\"ה אני מדבר בצדקה רב להושיע, בצדקה שעשיתם עמי שקבלתם את התורה וכו', דבאמצעות התורה נעשו ישראל שותפים להקב\"ה במלכותו, ולא שייך לגבייהו הדין דמלך שמחל על כבודו אין כבודו מחול ולכן מהני להו תשובה, משא\"כ אוה\"ע לא מהני להו תשובה מטעם מלך שמחל על כבודו אין כבודו מחול.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 96,
      "char_length": 1212,
      "timestamp": "2025-02-06T19:32:25.339450"
    },
    {
      "id": "beshalach2_p97",
      "text": "והנה גם אצל הים הי' קטרוג כזה על ישראל, שטען שר של מצרים מה בין אלו לאלו הללו עוע\"ז והללו עוע\"ז כמבואר בדברי חכז\"ל, והגם שישראל עשו תשובה לפני יציאתם ממצרים, עדיין הי' מקום למקטרג לטעון דלא יועיל להם תשובה, דתינח אחר מ\"ת שנעשו שותפין במלכותו ית' כנ\"ל, ע\"כ מועיל להם התשובה, אבל בשעת קרי\"ס לפני מ\"ת עדיין שייך אצלם הדין דמלך שמחל על כבודו אין כבודו מחול, א\"כ טען המקטרג לכאורה טענה חזקה מה בין אלו לאלו, אך נראה לבאר דהנה הראשונים ז\"ל הקשו על מה שאמרז\"ל (ב\"ר פרשה ה' סימן ה') תנאי התנה הקב\"ה עם הים במעשה בראשית שיקרע לפני ישראל, מה צורך לתנאי, ואף לולא תנאי יכול הקב\"ה לעשות כרצונו ולשנות חוקי הבריאה, ובש\"ך על התורה תירץ דהוצרך הקב\"ה לתנאי נגד המקטריגים שקטרגו מה בין אלו לאלו, אך כיון שהי' תנאי מתחלת הבריאה שיקרע לישראל נתבטל קטרוגם, דהתנאי לא הי' רק לישראל ולא למצריים, נמצא לפי\"ד דבשעה שנקרע הים לישראל לא הי' צורך עוד לגלות התנאי שהבוי\"ת כל יכול ויכולת בידו לקרוע הים גם בלא תנאי, אך כשחזר הים לכסות את המצריים שאז נעשה קטרוג גדול מה בין אלו לאלו הללו עוע\"ז והללו עוע\"ז אז הי' צורך לגלות התנאי נגד המקטריגים כמ\"ש הש\"ך דבזה נתבטל קטרוגם, ולפי\"ז א\"ש מה שנכתב תיבת לאיתנו אצל וישב הים לפנות בוקר, דרק עכשיו הי' צורך לתנאי זה נגד הקטרוג מה בין אלו לאלו, משא\"כ בשעה שנקרע לישראל לא הי' צורך בתנאי.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 97,
      "char_length": 1198,
      "timestamp": "2025-02-06T19:32:25.906419"
    },
    {
      "id": "beshalach2_p98",
      "text": "והנה תנאי זה שהתנה הקב\"ה עם הים לא נתגלה בעולם בתחלת הבריאה כנ\"ל, ויתכן שגם ישראל לא ידעו מזה בשעה שירדו לתוך הים, רק חז\"ל גילו לנו אח\"כ כמו שגילו הרבה ענינים שלא היו ידועים מקודם, ולולא תנאי זה יש קושיא עצומה מה בין אלו לאלו, דבאמת גם המצריים בשעה שהיו בצרה עשו תשובה קצת ונכנעו לפני השי\"ת, וכמו שאמר פרעה במצרים ה' הצדיק ואני ועמי הרשעים, רק אחר שנעשה הרוחה הקשה את לבו, כדרך הרשעים בשעה שבא להם צרה נכנעים קצת ואח\"כ חוזרים לסורם ובוודאי בשעה שנכנסו המצריים לתוך הים שהוא מקום סכנה גדולה נכנע לבם ועשו תשובה, ואז וודאי הי' טענת המקטרג חזקה מה בין אלו לאלו, דאם מועיל תשובה לישראל יועיל גם להם, ולכן היו ישראל יראין ואומרים כשם שאנו עולים מצד זה כך מצריים עולים מצד אחר, ולא מפאת חסרון אמונה חששו לזה רק מפני שידעו שהמצריים עושים תשובה בשעה שהם נתונים בצרה, וטענת המקטרג חזקה מה בין אלו לאלו, ושמא ינצלו מן הים ע\"י התשובה, ואח\"כ כשיעלו מן הים יחזרו לרשעם כדרכם, וגם המצריים ע\"ד כן ירדו למקום סכנה לתוך הים, כי סמכו על הטענה מה בין אלו לאלו, וכיון שראו שהים נקרע לישראל ונכנסו בשלום, חשבו שגם להם יתרמי ככה דמה בין אלו לאלו, שגם הם עשו תשובה ואם מועיל תשובה לישראל גם להם יועיל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 98,
      "char_length": 1078,
      "timestamp": "2025-02-06T19:32:26.465523"
    },
    {
      "id": "beshalach2_p99",
      "text": "גם אפ\"ל עפ\"י תירוצם של בעלי התוס', שחששו ישראל שמא ירדפו המצריים מצד אחר וישיגום וטעם יראתם הי' שמא יגרום החטא, וכדרך הצדיקים שדואגים תמיד שמא גרם החטא, וכמו שדרשו חז\"ל עה\"פ קטנתי מכל החסדים, אמר יעקב שמא משהבטחתני נתלכלכתי בחטא ויגרום לי להמסר ביד עשו, אך יעקב אבינו לגודל מעלת צדקתו נתחזק בבטחונו על הקב\"ה, ואף שלבו נשבר בקרבו מיראת החטא עם כל זה הי' לבו שלם בבטחון חזק ואמיץ בהבוכ\"ע שיחלצהו ממיצר, וזה הוא מעלה נשגבה במדריגת הצדיקים. שני הפכים בנושא אחד להיות יראים שמא יגרום החטא ואינם ראוין לישועה, ובו בזמן אמיץ לבם בבטחון אמיתי בהקב\"ה, אבל בני ישראל שבאותו הדור לא היו שלמים במדה זו כ\"כ, ולצד שהיו יראים שמא גרם חטאם להמסר בידי המצריים, לא היו יכולים לחזק עצמם בשלימות מדת הבטחון, ולכן אמרו חז\"ל ישראל שבאותו הדור מקטני אמנה היו, לא אמרו חסרי אמנה אלא קטני אמנה דייקא, כלומר היראה הזאת לא באה להם מחמת חסרון אמונה ח\"ו, אלא מחמת גודל מדת ענותנותם חשבו את עצמם שאינם מוכשרים וראויים לישועה ושמא גרם חטאם להמסר ביד המצריים, אך לעומת מעלת האבות הק' הי' מדריגתם במדת הבטחון והאמונה קטנה כנ\"ל, כי האבות הק' היו תמיד שלמים וחזקים במדת הבטחון אף שלבם נשבר בקרבם מיראת החטא, ולמדריגה זו לא הגיעו ישראל שבאותו הדור, ולכן קראו אותם חז\"ל קטני אמנה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 99,
      "char_length": 1143,
      "timestamp": "2025-02-06T19:32:26.992534"
    },
    {
      "id": "beshalach2_p100",
      "text": "והנה על טענת שר של מצרים מה בין אלו לאלו הללו עוע\"ז והללו וכו' יש עוד תשובה ניצחת עפי\"מ שכתב הרמב\"ן ז\"ל (פרשת האזינו) עה\"פ אמרתי אפאיהם וגו' לולי כעס אויב אגור וגו' פן יאמרו ידינו רמה ולא ה' פעל כל זאת וזלה\"ק: והטעם בטענה הזאת איננו כרוצה להראות כוחו בין שונאיו, כי כל הגוים כאין נגדו מאפס ותוהו נחשבו לו, אבל השם ברא את האדם בתחתונים שיכיר את בוראו ויודה לשמו וכו', וכאשר חטאו ברצונם וכפרו בו כולם לא נשאר רק העם הזה לשמו ופרסם בהם וכו' כי הוא אלקי האלקים ואדוני האדונים ונודע בזה לכל העמים: והנה אם ישוב ויאבד זכרם ישכחו העמים את אותותיו ואת מעשיו ולא יסופר עוד בהם וכו', הנה תהי' כוונת הבריאה באדם בטלה לגמרי שלא ישאר בהם יודע את בוראו רק מכעיס לפניו, וע\"כ ראוי מדין הרצון שהי' בבריאת העולם שיהי' רצון מלפניו להקים לו לעם כל הימים, כי הם הקרובים אליו והיודעים אותו מכל העמים עכלה\"ק, נמצא מזה שיש הכרח בקיום עם ישראל בשביל כבודו ית\"ש: ואין מקום לקטרג שגם ישראל יאבדו ח\"ו עם המצריים, כי אז יהי' תכלית הבריאה בטלה לגמרי ולא יוכר לבאי עולם כבודו ית\"ש וע\"כ יש הכרח בקיומם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 100,
      "char_length": 970,
      "timestamp": "2025-02-06T19:32:27.541574"
    },
    {
      "id": "beshalach2_p101",
      "text": "ובזה פירשתי מאמרם ז\"ל (סוף מס' סוטה) אחר שתיארו חז\"ל שפלות הדור בעיקבתא דמשיחא, סיימו דבריהם על מה יש לנו להשען על אבינו שבשמים, והקושיא מפורסמת מה גריעותא בזה הלא גם בדורות הקודמים שמו ישראל ציפויים ותקותם אך ורק על אבינו שבשמים ואדרבה זאת היתה מעלתם הגדולה שהי' בטחונם חזק באבינו שבשמים, אך אפ\"ל הכוונה דבדורות הקודמים שהיו צדיקים הרבה בכל דור ודור, היו יכולים לצפות לישועת הקב\"ה בזכות הצדיקים, אבל בעיקבתא דמשיחא שהדור הוא בתכלית השפלות ובדיוטא התחתונה, אין לנו זכות אחר, רק שיושיענו הבוית\"ש למען כבודו ית\"ש שלא יתחלל, וכמו שדרשו רז\"ל (סנהדרין צ\"ח ע\"א) אין בן דוד בא אלא בדור שכולו זכאי או כולו חייב וכו' כולו חייב דכתיב וירא כי אין איש וישתומם כי אין מפגיע וכתיב למעני למעני אעשה, וזה שרמזו חז\"ל בלשונם הק' על מה יש לנו להשען על אבינו שבשמים, שאין לנו בדור הזה לבקש על הגאולה רק בשביל כבוד אבינו שבשמים ולא שום זכותים אחרים. וזהו כבוד שמים שיהיו ישראל ברום המעלה וכמ\"ש הרמב\"ן הק' הנ\"ל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 101,
      "char_length": 889,
      "timestamp": "2025-02-06T19:32:27.998835"
    },
    {
      "id": "beshalach2_p102",
      "text": "וידוע מש\"כ בספה\"ק קדושת לוי טעם שלא נקבע יו\"ט על הרבה נסים שנעשו לישראל, כגון מלחמת יהושע עם ל\"א מלכים, ומפלת סיסרא וסנחרב וכדומה מפני שלא קבעו אנשי כנה\"ג לעשות זכר לדורות כ\"א על הנסים שראו ברוח קדשם שנמשך השפעתם בכל הדורות ובכל שנה ושנה, כגון נס חנוכה ופורים וכדומה, אבל אותם הנסים שלא היו רק לשעה לא קבעו יו\"ט עכ\"ד, ולכאורה לפי\"ז ראוי להבין מ\"ט נקבע יום שביעי של פסח ע\"ש הנס של קרי\"ס ואיך נמשך לנו השפעת הישועה הזאת בכל דור ובכל שנה ושנה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 102,
      "char_length": 440,
      "timestamp": "2025-02-06T19:32:28.424334"
    },
    {
      "id": "beshalach2_p103",
      "text": "אך הענין הוא, דהנה בשעת קי\"ס הי' קטרוג גדול על ישראל מה בין אלו לאלו כנ\"ל, ולא הי' לישראל זכותים שינצלו והוצרך הקב\"ה להציל אותם בשביל כבודו ית\"ש, שתכלית התגלות כבודו הוא רק ע\"י ישראל וכנ\"ל ברמב\"ן הק', והישועה הזאת נמשכת ונשפעת בכל דור ודור, ובכל זמן שאין לישראל ח\"ו די זכותים, הקב\"ה מצמיח להם ישועה בשביל כבוד שמים כמו שהי' בקרי\"ס, ולכן בשעה שעמד מרע\"ה להתפלל ולהמליץ זכות על ישראל שיזכו לישועה, אמר לו הקב\"ה מה תצעק אלי אין לך לבקש זכותים של ישראל, כי בי הדבר תלוי ר\"ל אני אושיע את ישראל בשביל כבודי, אף אם אין זכותים לישראל שיהיו ראויין לישועה, אבל למעני ולמען כבודי אעשה שיתגלה כבוד מלכותי ע\"י ישראל: והישועה הזאת מתעוררת בכל שנה ושנה, כן יעזור הבוי\"ת בדור הזה בעניינו ובשפלותינו שאין זכותים בישראל לזכות לישועה ואין לנו על מי להשען אלא על אבינו שבשמים, יעזרינו בשביל כבודו ית\"ש כמו שהי' אז בשעת קרי\"ס, וכאשר זכינו לישועה גדולה אז כן נזכה לראות בישועת כל ישראל ושמחתן בקדושה ובטהרה בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו במהרה בימינו אמן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 103,
      "char_length": 954,
      "timestamp": "2025-02-06T19:32:28.651424"
    },
    {
      "id": "beshalach2_p104",
      "text": "ויאמר ה' אל משה מה תצעק אלי דבר אל בני ישראל ויסעו, במדרש (הובא בישמח משה) אמר הקב\"ה למשה הים סוער והשונא רודף ואתה עומד ומרבה בתפלה, א\"ל ומה עלי לעשות, א\"ל ואתה הרם את מטך, באותה שעה אמרו ה' ימלוך לעולם ועד עכ\"ד המדרש וצ\"ב.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 104,
      "char_length": 224,
      "timestamp": "2025-02-06T19:32:29.102429"
    },
    {
      "id": "beshalach2_p105",
      "text": "ב) במדרש ילקוט (רמז רל\"ג) ר' יהודה בן בתירה אומר כבר עשיתי ההבטחה שהבטחתי את אבותיהם שנאמר וישם את הים לחרבה, והוא פלא דהרי עדיין הי' לפני קריעת ים סוף, ומה זה שאמר כבר עשיתי וכו', ובזית רענן מבעל מג\"א פי' עד שלא התפללת כבר בקעתי את הים ועדיין צ\"ב איך נרמז זה בפסוק וישם את הים לחרבה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 105,
      "char_length": 284,
      "timestamp": "2025-02-06T19:32:29.251689"
    },
    {
      "id": "beshalach2_p106",
      "text": "ג) במדרש ילקוט (שה\"ש רמז תתקפ\"ח) כמגדל דוד צוארך כמו שהגדיל אתכם דוד בספרו ואמר לגוזר ים סוף לגזרים, וצ\"ב במה הגדיל דוד את ישראל יותר וכבר מפורש בתורה כל ענין קריעת ים סוף.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 106,
      "char_length": 172,
      "timestamp": "2025-02-06T19:32:29.431127"
    },
    {
      "id": "beshalach2_p107",
      "text": "ד) וישב הים לפנות בוקר לאיתנו וגו', פירש\"י ז\"ל לתקפו הראשון ובמדרש ילקוט (רמז רל\"ו) לאיתנו א\"ר יונתן התנה הקב\"ה תנאים עם הים שיהא נקרע לפני ישראל הה\"ד וישב הים לפנות בוקר לאיתנו לתנאו שהתנה הקב\"ה עמו, והקושיא מפורסמת דלפי דרשת המדרש הי' ראוי לכתוב תיבת לאיתנו בפסוק ויבקעו המים דאז נתקיים התנאי, אבל מה שחזר על המצריים לא הי' צורך לתנאי שהרי חזר לטבעו ומהלכו הרגיל, והרבה קולמוסין נשתברו לתרץ קושיא זו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 107,
      "char_length": 402,
      "timestamp": "2025-02-06T19:32:29.553638"
    },
    {
      "id": "beshalach2_p108",
      "text": "ה) אז ישיר משה ובני ישראל את השירה הזאת לה' וגו', במד\"ר (פרשה כ\"ג סימן ד') הה\"ד (משלי ל\"א) פיה פתחה בחכמה ותורת חסד על לשונה, מיום שברא הקב\"ה את העולם ועד שעמדו ישראל על הים לא מצינו אדם שאמר שירה להקב\"ה אלא ישראל, ברא אדם הראשון ולא אמר שירה, הציל אברהם מכבשן האש ולא אמר שירה וכו', כיון שבאו ישראל לים ונקרע להם מיד אמרו שירה לפני הקב\"ה שנאמר אז ישיר וגו' הוי פיה פתחה בחכמה, אמר הקב\"ה לאלו הייתי מצפה, ראוי להבין מדוע באמת לא אמרו הראשונים שירה על הנסים שנעשו להם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 108,
      "char_length": 467,
      "timestamp": "2025-02-06T19:32:29.810241"
    },
    {
      "id": "beshalach2_p109",
      "text": "ונראה לפרש בהקדם דברי הרמב\"ם ז\"ל בפי' המשניות (אבות פ\"ה מ\"ו) עשרה דברים נבראו בערב שבת בין השמשות וכו' שהקב\"ה התנה בשעת הבריאה עם כל מעשה בראשית שישתנו לפעמים בעת הצורך, ומה שייחד התנא דוקא אלו עשרה דברים אין הכוונה שרק אלו נבראו בששת ימי המעשה, אבל אמר שרק אלו נבראו בע\"ש בין השמשות ושאר הנפלאות והמופתים הושמו בטבעי הדברים אשר נעשו בם בעת העשותם תחלה, על דרך משל ביום השני בהחלק המים הושם בטבע שיחלק ים סוף למשה והירדן ליהושע וכן שאר הנפלאות מלבד אלו העשרה שהושמו בטבעי הדברים ההם בין השמשות, וכן כתב רבינו יונה שם, וכתבו הטעם מפני שאין רצונו של הקב\"ה לעשות שידוד המערכות ולשנות טבע העולם על כן התנה על כולם מששת ימי בראשית, דהקב\"ה מגיד מראשית אחרית וראה אז כל הנסים שעתידין להעשות והתנה על כולם משעת הבריאה, וכן מבואר במד\"ר פרשה בראשית (פרשה ה' סימן ה') שהקב\"ה התנה מתחלת הבריאה על כל הנסים שיהיו בעולם, והיפ\"ת כתב בזה שני טעמים מדוע הוצרך הקב\"ה להתנות מתחלה הרי הבוכ\"ע הוא כל יכול ובידו לשנות טבעי העולם כרצונו גם מבלי שיתנה תנאי משעת הבריאה ומי יאמר לו מה יעשה, טעם א' שהוא כבוד יותר למי שנעשה הנס בשבילו, כשכבר התנה הקב\"ה משעת הבריאה שישתנה עבורו בעת שיצטרך לנס, והב' דכיון שכבר יש תנאי על הדבר נעשה הענין במהירות יותר מאם היו צריכין לשנות מחדש מה שלא הותנה עדיין, ובנזה\"ק כתב טעם דכל דבר שנשתנה מכמו שהי' אף אם חוזר לקדמותו מ\"מ שולט בו חולשא קצת ואינו באותו התוקף שהי' מקודם שנשתנה, ע\"כ התנה הקב\"ה על כל הנסים והנפלאות כדי שלא יחול חולשא בהם ע\"י השתנותם מכמו שהיו בתחלת הבריאה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 109,
      "char_length": 1384,
      "timestamp": "2025-02-06T19:32:30.139902"
    },
    {
      "id": "beshalach2_p110",
      "text": "ועפי\"ז יובן דרשתם ז\"ל לאיתנו לתנאו הראשון, דלכאורה הרי כללא אית לן דאין מקרא יוצא מידי פשוטו לעולם, ומשמעות מלת לאיתנו היינו לתקפו, ואיך הוציאו חז\"ל מפשוטו לדרוש בו לתנאי הראשון, ולדרכינו הדרש בא להשלים מה דקשה על משמעות הפשוטו דאיך אמר הכתוב וישב הים לפנות בוקר לאיתנו לתוקפו הראשון, לפי מה שידענו שכל דבר שנשתנה ממה שהי' בתחלת הבריאה שולט בו קצת חולשה, וע\"ז בא המדרש לתרץ שחזר לתנאו הראשון דתנאי התנה הקב\"ה עם מעשה בראשית שיקרע הים לישראל וכיון שהי' תנאי מתחלת הבריאה שפיר אמר הפסוק שחזר לתוקפו הראשון דלא נעשה בו השתנות שהי' תחלת הבריאה ע\"ד כן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 110,
      "char_length": 547,
      "timestamp": "2025-02-06T19:32:30.768359"
    },
    {
      "id": "beshalach2_p111",
      "text": "באופן אחר יתבאר עפי\"מ דאיתא במכילתא עה\"פ ומצרים נסים לקראתו, לקראתם לא נאמר אלא לקראתו של כל מצרי ומצרי, שהי' המים רץ אחר כל מצרי ומורידו אל הים. והקשה במרכבת המשנה ממה דאיתא בגמרא (סוטה י\"א ע\"א) הבה נתחכמה לו בואו ונתחכם למושיען של ישראל לדונו במים, שכבר נשבע הקב\"ה שאינו מביא מבול מים לעולם, והן אינן יודעין שהוא אינו מביא אבל הן באין ונופלין בתוכו, וכן הוא אומר ומצרים נסים לקראתו, והתינח מה שבאו עליהם המים אחר שירדו לתוך הים אינו בכלל שבועת המבול שהרי הם באו בגבול הים, אבל ריצת הים מחוץ לגבולו לסחוף אותם אל תוך הים זה הוא לכאורה נגד השבועה, ולי נראה דלא קשה מידי דבילקוט שמעוני הובא ג\"כ דרש זה של המכילתא בתוספת דברים וזה לשונו: שהיו המצריים עושין כשפים ועולין מן הים אמר הים פקדון שהפקיד לי הקב\"ה האיך אניחנו, מיד היו המים רצין אחר כל מצרי ומצרי ומורידן לים, הרי שכבר באו לגבולו של הים וזכה בהם הים ואח\"כ רדף אחריהם, וא\"ש אמרם ז\"ל דגם זה נתמעט מהוא אינו מביא וכו'. ואמרז\"ל במדרש (תנחומא סי' י' ובילקו\"ש רמז רל\"ג) עשרה נסים נעשו לישראל על הים וא' מהם שנעשה הים גזרים שנאמר לגוזר ים סוף לגזרים, ולכאורה לאיזה צורך עשה הקב\"ה נס זה וקוב\"ה לא עביד ניסא למגנא ומה הי' חסר אם לא הי' נקרע רק במקום אחד, ואפ\"ל עפ\"י אמרם ז\"ל שהי' המים רץ אחר כל מצרי וכו' נמצאו נחלקו המים לגזרים הרבה, וזה הכוונה באמרם שנקרע לגזרים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 111,
      "char_length": 1213,
      "timestamp": "2025-02-06T19:32:31.032556"
    },
    {
      "id": "beshalach2_p112",
      "text": "ואיתא במדרש ילקוט (רמז רל\"ד) שבא משה ועמד על הים ואמר בשם הקב\"ה שיקרע ולא קבל עליו, הראהו את המעה ולא קבל עליו, עד שנגלה אליו הקב\"ה בכבודו, כיון שנגלה עליו הקב\"ה בכבודו התחיל הים בורח שנאמר הים ראה וינוס, א\"ל כל היום הייתי אומר לך בשם הקב\"ה ולא קבלת עליך, ועכשיו מה לך הים כי תנוס, א\"ל לא מפניך בן עמרם אלא מלפני אדון חולי ארץ עכ\"ד המדרש, והטעם שלא רצה מתחלה להקרע לפניהם, כתבו המפורשים שחשב שאין ישראל ראויים לעשות להם נס, או שלא הגיע עדיין זמנם לצאת ישראל ממצרים כי לא נשלמו הארבע מאות שנה, ואחר שנגלה עליו הקב\"ה בכבודו ובעצמו מיד נקרע ע\"י מאמר ה', ועוד הוסיף בקיעות הרבה לרוץ אחר כל מצרי והורידו לים אף שע\"ז לא נצטוה מהקב\"ה, אלא מפני שראה שכבר הגיע עת קיום התנאי עשה מעצמו כל הצורך להשלמת התנאי, נמצא לפי\"ז שבקיעה הראשונה שנקרע לישראל לא הי' מפאת התנאי רק מפני שנגלה עליו הקב\"ה ואף לולא תנאי הי' מוכרח להקרע מפחד הדר כבודו ית' רק מה שנבקע אחר ששב הים לאיתנו לנוס אחר כל מצרי זה הי' מכח התנאי שהתנה הקב\"ה עמו בשעת הבריאה, וא\"ש למה נכתב לאיתנו אצל וישב הים,",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 112,
      "char_length": 958,
      "timestamp": "2025-02-06T19:32:31.624992"
    },
    {
      "id": "beshalach2_p113",
      "text": "ויתבאר בזה דברי המדרש כמגדל דוד צוארך שהגדיל אתכם דוד בספרו ואמר לגוזר ים סוף לגזרים, ע\"ד שכתב היפ\"ת הנ\"ל שע\"כ התנה הקב\"ה במעשה בראשית על כל הנסים העתידים להיות, מפני שהוא כבוד יותר למי שנעשה הנס בשבילו, א\"כ מה שמפורש בתורה ענין קריעת ים סוף לא נתרבה כ\"כ כבודן של ישראל, שהרי לא היתה בכח התנאי רק בציווי השי\"ת, אמנם דוד המלך מפרש לגוזר ים סוף לגזרים ובקיעה זו היתה מפאת התנאי שהתנה ית' בשביל ישראל ובזה הגדיל את ישראל יותר. ובזה יובן דברי המדרש שאמר ר\"י בן בתירה כבר עשיתי ההבטחה שהבטחתי את אבותיהם, היינו מתחלת הבריאה התנתי עם הים שיקרע לישראל ואין צורך בתפלתך, שנאמר וישם את הים לחרבה, ר\"ל בשעה שעשה הקב\"ה את הים התנה עמו שתהי' חרבה לישראל כשיהיו צריכים לכך.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 113,
      "char_length": 660,
      "timestamp": "2025-02-06T19:32:32.104072"
    },
    {
      "id": "beshalach2_p114",
      "text": "ונבוא לביאור המדרש הנ\"ל הה\"ד פיה פתחה בחכמה וכו' עפי\"מ דאיתא במדרש (ילקוט רמז רנ\"ד) עה\"פ ויסע משה את ישראל, א\"ר סימון לא כל הרוצה לומר שירה אומר שירה, אלא כל מי שנעשה לו נס ואומר שירה בידוע שמוחלין לו על כל עונותיו, ולפי\"ז ל\"ק מדוע לא אמרו הראשונים שירה כשנעשה להם נס, דלא כל הרוצה לומר שירה אומר כ\"א המוכן לכך מן השמים, וכעין שפי' הנועם אלימלך (ריש פ' ויחי) במאמר ר' חנינא בן דוסא ברכות דף ל\"ד ע\"ב) אם שגורה תפלתי בפי יודע אני שהוא מקובל ואם לאו יודע אני שהוא מטורף, דאם תפלתו שגורה ה\"ה סימן שכבר הוכן תפלה זו בכח האין סוף ב\"ה שיתפללו על חולה זה ובידוע שהיא מקובלת, ואם אין תפילתי שגורה נמצא לא הי' בכח הא\"ס ב\"ה שיתפלל רק הוא תפלה חדשה וכו', ועד\"ז אפ\"ל דהראשונים לא אמרו שירה שלא הי' מוכן להם השירה מן השמים, רק לישראל הי' מוכן השירה הזאת מששת ימי בראשית, וז\"ש פיה פתחה בחכמה שזה השירה הי' בבחינת חכמה ע\"ד איזהו חכם הרואה את הנולד (תמיד ל\"ב ע\"א) שהי' מוכן מתחלת הבריאה שיאמרו ישראל שירה וכמ\"ש בראשית ברא אלקים את השמים וגו' ותרגם אונקלס בחוכמתא וגם השירה הזאת הוכנה להם בבחינת חכמה בשעת בריאת העולם ע\"כ אמר הקב\"ה לאלו הייתי מצפה שישראל היו מוכנים לכך מתחלת הבריאה שיאמרו שירה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 114,
      "char_length": 1077,
      "timestamp": "2025-02-06T19:32:32.443163"
    },
    {
      "id": "beshalach2_p115",
      "text": "ויאמר ה' אל משה מה תצעק אלי וגו', במד\"ר (פ' כ\"א סימן ג') הה\"ד (ישעי' ס\"ה) והיה טרם יקראו ואני אענה עוד הם מדברים ואני אשמע עכ\"ד המדרש, וצ\"ב דאדרבה הקב\"ה מתאווה לתפלתן של ישראל ולתפלתן של צדיקים, ומ\"ט לא הניחו הקב\"ה למשרע\"ה, שיתפלל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 115,
      "char_length": 231,
      "timestamp": "2025-02-06T19:32:32.944813"
    },
    {
      "id": "beshalach2_p116",
      "text": "ויתבאר בהקדם דברי כ\"ק אבא מארי זלה\"ה בקדושת יו\"ט (ר\"פ נשא) עפימ\"ש בספר בני יששכר במאמרי חנוכה לפרש עזרת אבותינו אתה הוא מעולם מגן ומושיע להם ולבניהם אחריהם בכל דור ודור, דהנה החילוק שבין עזרה לישועה, שלשון עזר יצדק על העזרה מבלי בקשה מקודם מהנעזר, ותשועה הוא כשמושיע המושיע אחר בקשת הנושע, כמד\"א צעקה הנערה המאורשה ואין מושיע לה, והנה אבותינו שהיו צדיקים גדולים הנה היית עזרתם גם בטרם התפללו אליך, אבל בניהם אחריהם עכ\"פ אחר התפלה יש לנו ישועה, וזהו עזר\"ת אבותינו אתה הוא מעולם טרם יקראו, מגן ומושיע להם ולבניהם, שלבניהם לא הייתי אלא בבחי' מושיע עוד הם מדברים ואני אשמע עכ\"ד הבני יששכר, והנה אנן יתמי דיתמי תש כחינו וחלש שכלינו בעבודת השי\"ת, עד שאין בנו התגברות אפי' כדי להתפלל ולהתחנן ולשפוך שיח לבקש ממנו הישועה, ומכ\"ש שאין אנו יכולים לעלות להגיע למדריגת אבותינו הקדושים שהשי\"ת יעזר לנו בבחי' עזרה בלא בקשה, וא\"כ מה יעשו איזובי קיר באיזה אופן נוכל להושע מאתו ית', כי באמת לא תמנו ולא כלו רחמיו וחסדיו המרובים גם עלינו, ומההכרח היא שהשי\"ת יפן ברחמיו עלינו ויושיענו בבחינת אבותינו טרם שנקראו יעננו, אף בלא בקשה ישלח עזרו מקודש ומציון יסעדנו אף גם שאין אנו ראוים לכך, ולפי\"ז ע\"י שאנו במדרגה התחתונה כ\"כ עד שאין אנו יכולין אפילו להתפלל ולשפוך תחנונים, ע\"כ היא הנותנת שנושע בבחי' עזר כמו אבותינו הקדושים, וזה נ\"ל פי' הפסוק כי שחה לעפר נפשינו ואין בנו יכולת להתפלל, כי דבקה לארץ בטננו היינו לארציות וגשמיות, ועי\"ז שאנו נשפלים כ\"כ ע\"כ מההכרח קומה עזרתה לנו וגו' היינו שע\"כ תושיענו בבחי' עזר אף בלא בקשות ותחנונים עכל\"ק.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 116,
      "char_length": 1413,
      "timestamp": "2025-02-06T19:32:33.095607"
    },
    {
      "id": "beshalach2_p117",
      "text": "ומבואר מספה\"ק שמישועתן של צדיקים נמשך צנור ומעיין ישועה לכל דורות ישראל, שיוושעו מעין ישועה זו כשיצטרכו אלי' עיי\"ש, ואפשר דמזה הטעם הי' רצונו ית\"ש שלא יתפלל משרע\"ה בשעת קריעת ים סוף, אף שהקב\"ה מתאווה לתפלתן של צדיקים, אבל בשביל תקנת דורות הבאים שיחסר להם כח התפלה, ויצטרכו לבחי' עזרה מבלי בקשה, ע\"כ מנעו הקב\"ה למשרע\"ה מלהתפלל, כדי להמשיך בחי' זו לדורות שיזכו לטרם יקראו ואני אענה, וז\"פ דברי המדרש ויאמר ה' אל משה מה תצעק אלי, ולכאורה קשה הרי הקב\"ה מתאוה לתפלתן של צדיקים, לזה מתרץ המדרש הה\"ד טרם יקראו ואני אענה עוד הם מדברים ואני אשמע, דלפעמים טרם יקראו וגו' ולפעמים עוד הם מדברים, ותליא במדריגתן של ישראל כנ\"ל, וכדי להמשיך ישועה לדורות ישראל שיצטרכו אלי', ע\"כ מנע הקב\"ה רצון צדיק בענין זה ולא הניחו להתפלל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 117,
      "char_length": 708,
      "timestamp": "2025-02-06T19:32:33.726937"
    },
    {
      "id": "beshalach2_p118",
      "text": "במדרש ילקוט (רמז רל\"ג) דבר אל בני ישראל ויסעו אמור להם שיסיעו דברים מלבן, אמש היו אומרים המבלי אין קברים במצרים ועכשיו אתה מרבה בתפלה, וצ\"ב.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 118,
      "char_length": 140,
      "timestamp": "2025-02-06T19:32:34.072692"
    },
    {
      "id": "beshalach2_p119",
      "text": "ונראה לפרש בהקדם מה דאיתא במדרש ילקוט (רמז רל\"ד) עה\"פ והמים להם חומה, שירד ס\"ם ואמר לפניו רבש\"ע לא עבדו ישראל ע\"ז במצרים ואתה עושה להם נסים וכו', השיב לו הקב\"ה שועה שבעולם וכי לדעתם עבדוה והלא לא עבדוה אלא מתוך שעבוד ומתוך טירוף דעת, ואתה דן שוגג כמזיד ואונס כרצון, והקשו המפורשים דאין זה התנצלות באיסור עבודה זרה שהוא ביהרג ואל יעבור ואינו מועיל טענת אונס, אמנם אפ\"ל דהנה ישראל עשו תשובה על כל חטאתם כדרז\"ל בזוה\"ק ובמד\"ת, אלא שהי' קטרוג על תשובתם שלא תתקבל, דע\"ז הוא מינות וכתיב בי' (משלי ב' י\"ט) כל באיה לא ישובון, וזה שטען הס\"ם שגם ישראל עבדו ע\"ז במצרים ואף אם עשו תשובה א\"א שתהי' תשובה שלימה וראי' להתקבל, דמה שעבדו ע\"ז הי' בשביל שלא האמינו בהקב\"ה א\"כ תשובתם לא חשובה תשובה, וע\"ז השיב לו הקב\"ה שוטה שבעולם אתה דן שוגג כמזיד ואונס כרצון דמה שעבדו ע\"ז הי' מחמת אונס ולא הי' מעורב בה שמץ מינות ומיעוט אמנה בהקב\"ה, והגם שלא הותר באונס לעבוד עבודה זרה שהוא ביהרג ואל יעבור, אבל מ\"מ מועיל תשובתם שכל מה שעבדו ע\"ז הי' רק בשביל אונס ולא הי' בזה אף מחשבת מינות, ואנן קיי\"ל דאם עובדין ע\"ז מחמת פחד הריגה אין מלקין אותו וק\"ו שאין ממיתין אותו כיון דהוי אונס כמ\"ש ברמב\"ם (פ\"ה מה' יסוה\"ת ה\"ד), אלא שמחויב למסור עצמו להריגה בשביל מצות קידוש השם. וכן מבואר בדבריו בספר המצות (מצוה ט') בעשה דונקדשתי עיי\"ש, א\"כ מה שעבדו ישראל ע\"ז במצרים כיון דהי' ע\"י אונס לא נחשב לע\"ז אלא שעברו אמצות עשה דונקדשתי ועל זה מועיל תשובה",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 119,
      "char_length": 1303,
      "timestamp": "2025-02-06T19:32:34.174408"
    },
    {
      "id": "beshalach2_p120",
      "text": "מבואר דזכו ישראל לנס של קריעת ים סוף ע\"י התשובה ולולא זאת הי' הס\"ם ושרו של מצרים נוצח בטענת מה בין אלו לאלו הללו עוע\"ז והללו עוע\"ז, והנה התשובה תולה בנקודה שבלב אשר אין שום נברא יכול להבחין אמיתתה כ\"א הבוית\"ש, וכמ\"ש הרמב\"ם ז\"ל בה' תשובה (פ\"ב ה\"ב) ומה היא התשובה וכו' ויעיד עליו יודע תעלומות שלא ישוב לזה החטא לעולם, והגם שהתוס' (שבת י\"ב ע\"ב ד\"ה שאין) כתבו שהמלאכים יודעים מחשבות שבלב אדם, אבל וודאי שעומק המחשבה והנקודה שבלב אין יודע רק הקב\"ה לבדו, וגם על עצם התשובה שתתקבל לא הסכים כ\"א הבוית\"ש, כדאיתא במדרש ילקוט (תהלים כ\"ה רמז תש\"ב) שאלו לחכמה חוטא מה עונשו א\"ל חטאים תרדוף רעה, שאלו לנבואה חוטא מה עונשו א\"ל הנפש החוטאת היא תמות, שאלו לתורה וכו' א\"ל יביא אשם ויתכפר לו, שאלו להקב\"ה חוטא מה עונשו א\"ל יעשה תשובה ויתכפר לו וכו', וכמו\"כ לעניננו הודיעו הקב\"ה למשה שאין הדבר תלוי' אלא בתשובה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 120,
      "char_length": 791,
      "timestamp": "2025-02-06T19:32:34.780228"
    },
    {
      "id": "beshalach2_p121",
      "text": "ובזה יתבאר דברי המדרש דבר אל בנ\"י ויסעו שיסיעו דברים מלבן ויעשו תשובה על החטאים, וז\"ש רש\"י ז\"ל עלי הדבר תלוי שענין התשובה הוא דבר התלוי רק בהקב\"ה כי הוא לבדו ית\"ש מכיר הנקודה שבלב ומסכים על התשובה כנ\"ל ובזכות התשובה זכו לקריעת ים סוף, וז\"ש במדרש א\"ל משה ומה עלי לעשות, א\"ל הקב\"ה ואתה הרם את מטך ונטה את ידך וגו' עפימ\"ד במשנה (ר\"ה כ\"ט ע\"א) והי' כאשר ירים משה ידו וגבר ישראל וגו', וכי ידיו של משה עושות או שוברות מלחמה, אלא לומר לך כל זמן שהיו ישראל מסתכלין כלפי מעלה ומשעבדין את לבם לאביהם שבשמים היו מתגברין ואם לאו וכו', ולזה אמר הקב\"ה למשה בקרי\"ס ואתה הרם את מטך שישליך את המטה מידו להראות שאין ישראל צריכים לשום פעולה בענין הישועה רק שירים משה את ידיו ויסתכלו ישראל כלפי מעלה לשעבד את לבם לאביהם שבשמים ואז מתגברין על כל המצירין להם ואין הדבר תלוי אלא בתשובה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 121,
      "char_length": 762,
      "timestamp": "2025-02-06T19:32:35.198672"
    },
    {
      "id": "beshalach2_p122",
      "text": "ואיתא במדרש שמואל (אבות סו\"פ ששי משנה י\"א) כל מה שברא הקב\"ה בעולמו לא ברא אלא לכבודו שנאמר כל הנקרא בשמי ולכבודי בראתיו יצרתיו אף עשיתיו, ואומר ה' ימלוך לעולם ועד, ופי' המדרש שמואל אמר עוד ואומר ה' ימלוך לעולם ועד, הנראה שאין לו קשר כלל עם האמור, ואפשר שהכוונה וכו' דתינח בשאר העולמות שלא בראם אלא לכבודו לפי שכולם מעריצין ומקדישין את שם הא' המלך הגדול הגבור והנורא, אמנם עולם העשי' אשר ראה ראינו כי גברה יד סט\"א ויצר לב האדם רע מנעוריו להכעיס את בוראו, א\"כ אין בריאת עוה\"ז לכבודו ית' וטוב לו שלא נברא, לזה תירץ כי אף אם עתה רבו כמו רבו עבדים המתפרצים למרות עיני כבודו, עכ\"ז לעתיד לבוא יהיה ה' אחד ושמו אחד, ולז\"א ה' ימלוך לעולם ועד ואז יהי' כל העולם לאחד לקרוא בשם ה' וכו', נמצא שאף עולם העשיה לא בראו אלא לכבודו עכ\"ל, וידוע שגאולה העתידה תלוי בתשובה, וכמ\"ש הרמב\"ם ז\"ל (ה' תשובה פ\"ז ה\"ה) אין ישראל נגאלין אלא בתשובה וכבר הבטיחה תורה שסוף ישראל לעשות תשובה בסוף גלותן ומיד הן נגאלין, ובזה יובן סיום דברי המדרש כששאל משה מהקב\"ה ומה עלי לעשות והשיב לו הבורא יתברך שמו ואתה הרם את מטך ונטה את ידך ורמז לו שאין הדבר תלוי אלא בתשובה כנ\"ל, באותה שעה אמרו ישראל ה' ימלוך לעולם ועד כי השיגו ישראל שגם גאולה העתידה תליא בתשובה ובזכות התשובה נזכה לבחי' ה' ימלוך לעולם ועד שיהי' מלא כל הארץ כבודו ואף עולם העשי' כנ\"ל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 122,
      "char_length": 1206,
      "timestamp": "2025-02-06T19:32:35.566197"
    },
    {
      "id": "beshalach2_p123",
      "text": "ויבואו בני ישראל בתוך הים ביבשה, במד\"ר (פרשה כ\"א סי' י') אם בים למה ביבשה ואם ביבשה למה בתוך הים אלא מכאן אתה למד שלא נקרע להם הים עד שבאו לתוכו עד חוטמן ואח\"כ נעשה להם יבשה, ובמקו\"א איתא בדרז\"ל שלא נקרע הים עד שקפץ נחשון בן עמינדב לתוך הים, ואפ\"ל דאין בזה סתירה, דנחשון הי' הראשון שהראה להם הדרך אולם לא נתייבשו המים עד שכל ישראל קפצו לתוך הים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 123,
      "char_length": 345,
      "timestamp": "2025-02-06T19:32:36.131853"
    },
    {
      "id": "beshalach2_p124",
      "text": "ולבאר הענין מדוע לא נקרע הים עד שקפצו לתוכו ובאו במים עד חוטמן, אפ\"ל עפימ\"ש בספה\"ק דברי חיים (פ' נח) עה\"כ קץ כל בשר בא לפני, דאיתא בזוה\"ק דעל כל החטאים מהני תשובה, לבר מההוא חטא הידוע פגם הברית מדת היסוד דלא מהני כ\"א בתיובתא סגי, וטעם הדבר מבואר בספרים דהחטא פוגם האדם במדותיו, ובמדה שחוטא מסיר עצמו משרשי הקדושה וכו' ובעשותו תשובה מביא חיות חדש משורשו אל האבר והצנור שנחלש וכו', אך בחטא החמור הנ\"ל ר\"ל הוא כמסיר שרשו לגמרי כמבואר בספה\"ק, ולכן כמעט אין לו תרופה, ואך בקושי תשובה מעורר אדם הנהגה רצונית למעלה מהטבע יחון ונעתר לה' גם בשובו מחטא זה. ולעיל מזה כתב עיקר הדבר למסור נפשו להקב\"ה בהשתוקקות רב עד דכדוכה של נפש, ומתוקן בזה מה שחרבו העולמות ובא עד הקץ יעייש\"ד.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 124,
      "char_length": 667,
      "timestamp": "2025-02-06T19:32:36.331455"
    },
    {
      "id": "beshalach2_p125",
      "text": "והנה אמרז\"ל במדרש (ילקוט ראובני) שהי' קטרוג גדול על ישראל בעמדם על הים והשר של מצרים והס\"מ קטרגו הללו עובדי ע\"ז והללו עובדי ע\"ז הללו מג\"ע והללו מג\"ע, ובאמת היו ישראל גדורים מעריות במצרים כאמרז\"ל במד\"ר (ויק\"ר פ' ל\"ב סי' ה') אחת היתה ופירסמה הכתוב, ואיתא בזוה\"ק שאף מאיסור נדה הוזהרו ואף שלא היו מצווין עדיין ומכ\"ש מעריות בפועל, אמנם אם מידי עבירה נשמרו מידי הרהור לא ניצולו. וטומאת המקום גרם, שהיו במצרים ערות הארץ במ\"ט שערי טומאה ובלי תורה לא היו יכולין להטהר ממחשבות והרהורים רעים, והרבינו יונה כתב דבעבר ושנה גם מחשבה רעה הקב\"ה מצרפה למעשה, וכמו\"כ נכשלו בע\"ז לצד גודל טומאת הארץ, לכן על מה שנכשלו בע\"ז הי' התיקון מ\"ש בהוציאך את העם ממצרים תעבדון את האלקים על ההר הזה שקבלו אח\"כ את התוה\"ק וע\"ש זכות העתיד נתלה להם, ועל הקטרוג הללו מג\"ע הי' תיקונם ע\"י מסירת נפש, לכן הוצרכו למסור נפשם ולקפוץ בתוך הים, ובזה עזרם הבוכ\"ע וניצולו מהקטרוג ועברו הים בחרבה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 125,
      "char_length": 851,
      "timestamp": "2025-02-06T19:32:36.665430"
    },
    {
      "id": "beshalach2_p126",
      "text": "ובמד\"ר (פרשה כ\"א סי' ה') וישאו בני ישראל את עיניהם והנה מצרים נוסע אחריהם ראו שרן של מצרים פורח באויר, כיון שראו אותו נתייראו הרבה שנא' ויראו מאוד, לכאורה מדוע נתייראו כ\"כ הלא בכל מלחמה כן הוא שהשרים של מעלה באים לעזרת אומתם, ואפ\"ל בכוונת הענין דהנה שורש החטאים ומדות רעות שנכשלים בה בנ\"א בא מכח שר של האומה שדרים בה, דכ\"א י\"ל מדה רעה אחרת וכמו שכתב בספה\"ק מאור ושמש (הו\"ד לעיל פ' וארא), וכשיצאו בנ\"י ממצרים השיגו עד היכן משוקעים בטומאת מצרים, ולצד זה הי' יראתם משר של מצרים נוסע אחריהם, דמפני שראו וימרו על ים בים סוף. שמקצתם לא אבו שמוע בקול ה', הבינו שזהו מהשפעה רע של שר מצרים ועדיין לא יצאו ממנו לגמרי, וז\"ש שרן של מצרים נוסע אחריהם שהשפעתו הרע עדיין נדבק בהם ונוסע אחריהם וע\"כ נתייראו הרבה מאוד, ובזה פי' הכתוב הושיעני אלקים כי באו מים עד נפש, דהנה מים ירמוז על אומה\"ע, וכמ\"ש המפורשים הפסוק מקולות מים רבים אדירים משברי ים, דהכוונה על האומה\"ע, והשפעתם הרעה הגיע עד הנפש של כ\"א מישראל וגם להגדולים שהם נפש העם, השי\"ת ירחם עלינו ויצילנו מהם כי כבר באו מים עד נפש. וכתב במסילת ישרים ע\"ד הגמרא (ב\"ב דף ע\"ח ע\"ב) על כן יאמרו המושלים, אלו המושלים ביצרם, באו חשבון בואו ונחשוב חשבונו של עולם הפסד מצוה כנגד שכרה ושכר עבירה כנגד עבירה, דלכאורה כל אחד צריך לחשוב חשבון הזה ומדוע אמר המושלים ביצרם דייקא, ופירש הוא ז\"ל דהמקושר ודבוק בהבלי עוה\"ז אין במציאות שיעשה חשבון אמיתי וצודק מפני שמשוחד אל תאוותיו ורצוניותיו, וז\"ש ע\"כ יאמרו המושלים ביצרם דייקא, שהם יכולים לחשוב חשבונו של עולם, ומי שאינו בגדר זה אינו יכול לעשות חשבון אמיתי עכ\"ד, ובעוה\"ר בזמנינו אלה מי יאמר זכיתי לבי טהרתי מחטאי, ומי יוכל להתפאר שהוא מהמושלים ביצרם, ואין בידינו לחדש עצות ודרכים חדשים בשמירת התוה\"ק ובעבדות הבוב\"ה וכדומה, דחשבונו של עולם יכולים לחשוב רק המושלים ביצרם דייקא, ואנו אין לנו אלא דרכי אבותינו ורבותינו הקדושים שהנחילו לנו דרך האמת ומפיהם אנו חיים שהם היו המושלים ביצרם באמת ובעוה\"ר המה הלכו למנוחות ואותנו עזבו לאנחות, ואין לנו רק לילך בעקבי הצאן שהפסיעות והעקביים ניכרים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 126,
      "char_length": 1854,
      "timestamp": "2025-02-06T19:32:37.065129"
    },
    {
      "id": "beshalach2_p127",
      "text": "ויסר את אופן מרכבותיו וינהגהו בכבדות, במדרש ילקוט (הובא ברש\"י ז\"ל) מחמת האש שלמעלן נשרפו גלגלין שלמטן והיו מוטות, ומרכבות רצות ונכנסות על כרחן וכו', דרך ארץ המרכבות נמשכות אחר הפרדים, עכשיו מרכבות מושכות את הפרדים עכ\"ד המדרש, ראוי להבין למה עשה ה' נס זה לשנות מדרך הרגיל שהמרכבות נמשכות אחר הפרדים ועכשיו מרכבות מושכות את הפרדים ומה צורך בנס הזה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 127,
      "char_length": 346,
      "timestamp": "2025-02-06T19:32:37.979820"
    },
    {
      "id": "beshalach2_p128",
      "text": "ב) במדרש ילקוט (רמז רמ\"א) בשעה שבקש הקב\"ה להטביע את מצרים, עמד עוזא שר של מצרים לפני הקב\"ה ואמר לפניו רבש\"ע נקראת צדיק וישר וכו' למה אתה רוצה להטביע מצרים כלום הטביעו בני מבניך או הרגו מהם וכו' עכ\"ד המדרש, והיא פליאה נשגבה איך יתכן לטעון שיקרא קמי שמיא הלא גזרו בגלוי כל הבן הילוד היאורה תשליכוהו ואמרו רז\"ל (ב\"ר פ' צ\"ז ס\"ה) ששים רבוא ילדי ישראל הושלכו ליאור גם הרגו הרבה ורמסו בטיט כמבואר בדברי חז\"ל, ואיך יטעון שקר לפני הקב\"ה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 128,
      "char_length": 428,
      "timestamp": "2025-02-06T19:32:38.193551"
    },
    {
      "id": "beshalach2_p129",
      "text": "ג) עוד במדרש ילקוט (רמז רל\"ד) והמים להם חומה מלמד שירד ס\"מ, ואמר רבש\"ע לא עבדו ישראל ע\"ז במצרים ואתה עושה להם נסים, מה הללו עובדי ע\"ז אף הללו עובדי ע\"ז, אמר לו הקב\"ה שוטה שבעולם והלא לא עבדו אלא מתוך שעבוד ומתוך טירוף דעת ואתה דן שוגג כמזיד ואונס כרצון, וקשה מדוע תלה זה בזה דכמו שהם עוע\"ז גם ישראל כן, ואם יש בטענה זו ממש יספיק אם יאמר הללו עוע\"ז ומ\"ט הוצרך לתלותו במה שהמצריים עוע\"ז, גם יש להבין התירוץ שישראל לא עבדו אלא מתוך שעבוד והיו אנוסים הלא ע\"ז ביהרג ואל יעבור וליתא לטענת אונס.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 129,
      "char_length": 488,
      "timestamp": "2025-02-06T19:32:38.414294"
    },
    {
      "id": "beshalach2_p130",
      "text": "ונראה ליישב בהקדם דברי רש\"י ז\"ל עה\"כ ויקח שש מאות רכב בחור וגו', ומהיכן היו הבהמות הללו, אם תאמר משל מצרי הרי נאמר וימת כל מקנה מצרים, וא\"ת משל ישראל והלא נאמר וגם מקנינו ילך עמנו, משל מי היו, מהירא את דבר ה' ע\"כ, רואים מזה כמה גדולה התקלה לישראל אם היראים את דבר ה' הם עבדי פרעה, שאילולא הם לא הי' לו לפרעה במה להלחם עם ישראל, ועל כרחן צריכין למימר שהיו יראים את דבר ה' עכ\"פ מיראת העונש שהרי הכתוב מעיד עליהם ככה, ואפשר שהם לא הטביעו ילדי ישראל וגם לא עבדו ע\"ז, ועפי\"ז שפיר טען עוזא שר של מצרים כלום הטביעו בני מבניך או הרגו מהם ורצה עכ\"פ להציל היראי ה' כי אלו היראים את דבר ה' באמת לא היו מהטובעים וגם לא הרגו ילדי ישראל, אמנם מפני שהיו מעבדי פרעה ונכנעים אליו נחשבו גם הם כמוהו וכמאמר הכתוב מושל מקשיב על דבר שקר כל משרתיו רשעים, ואפשר שעד\"ז הי' הס\"מ מקטרג על ישראל, דבאמת בעת שעמדו ישראל על הים כבר נפרשו מע\"ז, אמנם טענתו הו' עד\"ז, דכמו הירא את דבר ה' מעבדי פרעה, נדונים אף על הרע שלא עשו בעצמם, אלא מפני שהם עבדי פרעה נחשבים כמוהו מטעם דמושל מקשיב על דבר שקר כל משרתיו רשעים, ולפי\"ז הרי גם ישראל היו עבדים לפרעה ומה הללו עובדי ע\"ז אף הללו עובדי ע\"ז שצ\"ל נחשבים כמוהו כמוהם, והשיב לו הקב\"ה שוטה שבעולם והלא לא עבדו אלא מתוך שעבוד ומתוך טירוף הדעת ואתה דן שוגג כמזיד ואונס כרצון. דהרי מה שעבדו את פרעה לא מרצונם עשו זאת אלא שהיו אנוסים, אבל אלו היראים את דבר ה' מעצמם נעשו עבדים לפרעה ומרצונם הטוב השתתפו אליו לכך נחשבים כמוהו להיות נענשים על כל רעתו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 130,
      "char_length": 1354,
      "timestamp": "2025-02-06T19:32:38.679946"
    },
    {
      "id": "beshalach2_p131",
      "text": "ונקדים לפרש הכתוב (בשה\"ש) לסוסתי ברכבי פרעה דמיתיך רעיתי, וראוי להבין ענין המשל גם הקישור אל הפסוק שלמעלה צאי לך בעקבי הצאן וגו', ובספה\"ק נועם אלימלך בליקוטים פי' הכתוב לסוסתי ברכבי פרעה דמיתיך רעיתי, היות גבי פרעה שינה ב\"ה את הסדר, דרך הסוסים מושכין וכו' וכאן הקרון מושך וכו' וזהו לסוסתי כמו הסוסים ברכבי פרעה היו בהיפך הטבע, כן דמיתיך רעיתי, זאת אומרת כנ\"י להשי\"ת כן דמיתיך כי הצדיקים עושין כן, שהקב\"ה גוזר גזירה והצדיק מבטל, והצדיק גוזר והשי\"ת מקיים נמצא העולם מתנהג לפי רצון הצדיק עכל\"ק, והנה ידוע מש\"כ בסה\"ק דגל מחנה אפרים פרשת וארא דפשט הפסוק משתנה לפי בחי' הדור עיי\"ש (כוונתו בדבר שאינו נוגע להלכה כמובן), ובדורינו השפל אפ\"ל כוונת הכתוב עפ\"י מה שאמרו רז\"ל בגמרא (ביצה דף ל\"ז ע\"א) בהמה וכלים כרגלי הבעלים, והנה הסוסים היו של יראי ה' והרכב של פרעה ולפי דרך הטבע מהראוי שהסוסים יוליכו את הרכב, אבל לא כן עשה ה' כי אם הרכב משך הסוסים ואף בעליהם נמשכו עמהם [ולקושטא דמילתא תמיד כן הוא שאם יראי ה' מתחברים עם רשעים אז מתהפך הגלגל והרשעים הם מנהיגים את היראי ה', אבל דא עקא שלא תמיד אפשר לראות זאת באתגליא] אולם אז בקרי\"ס הי' התגלות גדול וראו במו עיניהם הנס הזה ועי\"ז ידעו ישראל להתרחק גם מחבורתם ויש בו גם הוראה לדורות.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 131,
      "char_length": 1120,
      "timestamp": "2025-02-06T19:32:39.340426"
    },
    {
      "id": "beshalach2_p132",
      "text": "ועד\"ז יתבאר קישור הכתוב, דלעיל מיני' כתיב אם לא תדעי לך היפה בנשים צאי לך בעקבי הצאן, פרש\"י אם לא תדעי לך להיכן תלכי וכו' שחדל הרועה מלהנהיג אותך וכו' צאי לך בעקבי הצאן, הסתכלי בפסיעות דרך שהלכו הצאן וכו' התבונני בדרכי אבותיך הראשונים וכו', נראה שרש\"י ז\"ל דייק בלשונו הקדוש שחדל הרועה מלהנהיג אותך, משמע שלא יחסר להם מנהיג, אלא שחדל מלהנהיג, כי אם מתחברים עם רשעים אז הרשעים מנהיגים את המנהיג ולכן הסמיכו אח\"כ הפסוק לסוסתי ברכבי פרעה שנמשלו ברכבי פרעה שהרכב נעשה המושך וכמו\"כ הרשעים נעשו המנהיגים ע\"י שמתחברים אליהם והבן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 132,
      "char_length": 521,
      "timestamp": "2025-02-06T19:32:39.864378"
    },
    {
      "id": "beshalach2_p133",
      "text": "ויאמר ה' אל משה נטה את ידך על הים וישובו המים וגו' וישב הים לפנות בוקר לאיתנו וגו', וישובו המים ויכסו את הרכב וגו' יל\"ד על שינוי הלשון, דתחלה אמר וישב הים ואח\"כ וישובו המים בלשון רבים, משמע שהוא ענין נפרד וב' שיבות היו שם וצ\"ב.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 133,
      "char_length": 227,
      "timestamp": "2025-02-06T19:32:40.216691"
    },
    {
      "id": "beshalach2_p134",
      "text": "ב) במדרש ילקוט (רמז רל\"ו) וישב הים לפנות בוקר לאיתנו, א\"ר יונתן התנה הקב\"ה תנאים עם הים שיהא נקרע לפני ישראל, הה\"ד וישב הים לפנות בוקר לאיתנו, לתנאו שהתנה הקב\"ה עמו עכ\"ד המדרש, והקשו המפורשים דרמז התנאי היל\"ל לעיל אצל ויבקעו המים, דהרי התנאי הי' על הבקיעה, ומדוע רמז עלי' הכתוב במאמר וישב הים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 134,
      "char_length": 293,
      "timestamp": "2025-02-06T19:32:40.386268"
    },
    {
      "id": "beshalach2_p135",
      "text": "ואפשר לתרץ קושית המפרשים הנ\"ל, בהקדם דברי המד\"ר (פ' כ\"ב סי' ב') וישובו המים אמר ר' יוחנן כיון שעלה אחרון שבישראל מן הים ירד לתוכו אחרון של מצרים, ורשב\"ל אומר על אלו ועל אלו ננעל הים מד' רוחותיו, אמר משה לפני הקב\"ה מה יעשו ישראל, אמר לו אי אתה זקוק, למה שאני עושה להם נס, באותה שעה שלח הקב\"ה את ידו והעלן מן הים שנאמר (תהלים י\"ח) ישלח ממרום יקחני ימשני ממים רבים עכ\"ד המדרש, נמצא לדברי רשב\"ל הי' נס הבקיעה כפול, שמתחלה נבקעו המים וישם הקב\"ה את הים לחרבה ויבואו בנ\"י בתוך הים ביבשה, ואחר ששב הים לאיתנו, עמדו כנד נוזלים ולא נגעו בישראל, עד ששלח הקב\"ה את ידו והעלה את ישראל מן הים, ואח\"כ שבו גם אלו המים ויכסו את הרכב וכל חיל פרעה, וא\"ש שינוי וכפל הלשון וישב הים וגו' וישובו המים ויכסו את הרכב וגו', דב' שיבות היו כנ\"ל, וע\"כ רמז הכתוב על התנאי שהותנה הקב\"ה עם הים במאמר וישב הים לפנות בוקר לאיתנו, כי אחר ששבו המים הי' עוד צורך לתנאי שיעמדו מלפני ישראל, והנס השני הי' גדול מן הראשון, כי הבוי\"ת קצב גבול לים כדכתיב חול גבול שמת האומר לים עד פה תבוא, וזהו תנאי בריאתו מששת ימי בראשית, ועד\"ז בנס הבקיעה גזר על הים עד פה תבוא ועמדו במקומם, אבל גדול הי' הנס השני שאחר ששבו המים וננעלו ישראל בתוכו אעפ\"כ עמדו מפניהם ולא נגעו בהם, ולזה רמז הכתוב על התנאי במאמר וישב הים וגו', וכ\"ז לשיטת רשב\"ל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 135,
      "char_length": 1183,
      "timestamp": "2025-02-06T19:32:40.554615"
    },
    {
      "id": "beshalach2_p136",
      "text": "ואפ\"ל גם אליבא דר' יוחנן, עפימ\"ד במכילתא ומצרים נסים לקראתו ללמדך שכל מקום ומקום שהיו מצרים נסים, הי' הים רץ כנגדו, ופי' במרכבת המשנה דלזה הוצרך השי\"ת תנאי על השבת הים חוץ לגבולו, דחול גבולו שמת, אמנם קשה ממה דאיתא בש\"ס (סוטה דף י\"א ע\"א) דהיתר שבועת המבול, שע\"ז לא נשבע הקב\"ה שהם באים ונופלים בתוך הים, ולפי\"ז לא יצדק, להיות הים רץ לקראתם חוץ לגבולו והציף אותם ע\"כ קושיתו, ואפשר לתרץ קושיתו עפ\"י גירסת המד\"ר שגררן הקב\"ה לחרבו של ים, ולפי\"ז לא הציף אותם הים חוץ לגבולו, ויתכן שכאשר נסו המים אחריהם, המה בעצמם הטעו וחזרו לחרבו של ים שינצלו בחרבה, ואז צפו מים על ראשם ונטבעו, ואין זה בכלל השבועה כמ\"ש במדרש אמר הקב\"ה כבר נשבעתי שאיני מביא מבול לעולם. אבל מה אעשה לכם, אני מביא אתכם למבול, וא\"ש אף לשיטת ר' יוחנן מה שרמז הקב\"ה על התנאי במאמר וישב הים לאיתנו, כי אחר ששבו המים על מצרים היו המצרים נסים מן הים, והוצרך הים לנוס אחריהם מחוץ גבולו ולהחזירם לתוך הים ולזה הי' צורך לתנאי דחול גבולו שמת, ולזה רמז הכתוב על התנאי במאמר וישב הים וגו'.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 136,
      "char_length": 937,
      "timestamp": "2025-02-06T19:32:41.140935"
    },
    {
      "id": "beshalach2_p137",
      "text": "אז ישיר משה ובני ישראל את השירה הזאת לה' ויאמרו לאמר אשירה לה' כי גאה גאה וגו', זה קלי ואנוהו אלקי אבי וארוממנהו, פירש\"י ז\"ל זה קלי, בכבודו נגלה עליהן והיו מראין אותו באצבע ראתה שפחה על הים מה שלא ראו נביאים וכו' אלקי אבי לא אני תחלת הקדושה אלא מוחזקת ועומדת לי הקדושה, ואלקותו עלי מימי אבותי, ובמד\"ר (פרשה כ\"ג סי' ט\"ו) כמה גדולים יורדי הים, כמה נתחבט והתחנן מרע\"ה הראיני נא את כבודך, ולבסוף לא ראה הדמות בעצם רק בסימן, ועולי הים כ\"א מראה בהדמות זה קלי, א\"ל הקב\"ה לישראל, בעוה\"ז אמרתם לפני פעם אחת זה קלי, אבל לע\"ל אתם אומרים אותו דבר ב\"פ, שנאמר (ישעי' כ\"ה) ואמר ביום ההוא הנה אלקינו זה קוינו לו ויושיענו זה ה' קוינו לו וגו' עכ\"ד המדרש, ראוי להבין מהו היתרון שיאמרו אותו ישראל לע\"ל שתי פעמים, העיקר ה\"ה שיזכו להתגלות אלקית בבחי' גדולה כזו ומאי נפק\"מ כמה פעמים יאמרו מלת \"זה\" פעם אחת או ב' פעמים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 137,
      "char_length": 795,
      "timestamp": "2025-02-06T19:32:41.611778"
    },
    {
      "id": "beshalach2_p138",
      "text": "ב) במדרש (רות רבתי פ' ז' סי' י\"א) איתא דרש פלא עה\"כ וזאת לפנים בישראל על הגאולה ועל התמורה, ר' חנינא פתר קרא בגו אפי' דישראל, לשעבר היו מקלסין על הגאולה שנאמר זה קלי ואנוהו, ועכשיו על התמורה שנאמר (תהלים ק\"ו) וימירו את כבודם בתבנית שור אוכל עשב, אין לך מנוול ומשוקץ ומשונה כשור בשעה שאוכל עשב וכו' עכ\"ד המדרש, ופי' במתנת כהונה בגו אפייא וכו', במנהגם ועניינם של ישראל כדאמר אופיי' של אלהיה, והיפה ענף מביא גירסא שנו אפייא, פי' ששינו פניהם ממה שהיו בתחלה, שלפנים פנו לה' ועתה לעבודת כוכבים, וגם י\"ל דדריש וזאת לפנים בישראל, שנשתנו פנים בישראל יעיי\"ש, והרד\"ל פי' בגו אפייא דישראל וי\"ל ביני אפייא דישראל, בין החשובים ופני עדת ישראל הי' מנהג זה, וכמ\"ש בזוה\"ק פ' חקת דף ק\"פ עיי\"ש, אמנם יש להבין מ\"ש ועכשיו על התמורה שנא' וימירו את כבודם בתבנית שור אוכל עשב, הרי זה כבר הי' ומדוע אמר ועכשיו, גם אינו מובן קישור דרשתם ז\"ל לפשטות הכתובים, דמיירי בקנין חליפין שלף איש נעלו ונתן לרעהו, ומה ענין לזה דלשעבר היו ישראל מקלסין על הגאולה ועכשיו על התמורה, שפגמו בחטא העגל ועשו תמורה בתבנית שור אוכל עשב, גם מ\"ש בגו אפייא דישראל לכל הפירושים צ\"ב הקישור למעשה בועז ורות דעסיק בי' קרא, גם צ\"ב מ\"ש לשעבר היו מקלסין על הגאולה שנאמר זה קלי ואנוהו, לכאורה לא מצינו שאמרו קילוס זה על הגאולה, ומבואר בדברי רז\"ל שאמרו כן על התגלות אלקית שזכו כ\"א להראות באצבע כנ\"ל, ועל הגאולה אמרו לשונות אחרים של קילוס אשירה לה' כי גאה גאה וגו', ועוד הרבה פסוקים, ומדוע נקטו רז\"ל הך קרא דייקא שלא אמרו על הגאולה בעצם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 138,
      "char_length": 1375,
      "timestamp": "2025-02-06T19:32:42.012962"
    },
    {
      "id": "beshalach2_p139",
      "text": "ג) להלן בפרשה ויבוא עמלק וילחם עם ישראל ברפידים, דקדק המהר\"ל מפראג ז\"ל בגור ארי' דהול\"ל ויצא עמלק וילחם עם ישראל, דבמלחמה שייך לשון יציאה וכמ\"ש ויצא סיחון לקראתינו, ובאמת ויבוא עמלק מיותר דהי' מספיק שיאמר וילחם עמלק עם ישראל ברפידים, ואם לחם עמם ידוע נדע שבא אליהם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 139,
      "char_length": 265,
      "timestamp": "2025-02-06T19:32:42.674725"
    },
    {
      "id": "beshalach2_p140",
      "text": "ד) ברפידים פירש\"י ז\"ל מאי רפידים, שרפו ידיהן מן התורה, לכאורה תורה לא נרמז בכתוב ובמלת רפידים יש רמז שרפו ידיהן, ועדיין לא ידענא ממה רפו ידיהן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 140,
      "char_length": 143,
      "timestamp": "2025-02-06T19:32:42.830210"
    },
    {
      "id": "beshalach2_p141",
      "text": "ה) במד\"ר (פ' כ\"ו סי' א') ויבוא עמלק הה\"ד (איוב ג') לא שלותי ולא שקטתי ולא נחתי ויבוא רוגז וכו', לא שלותי מגזירה ראשונה שגזר פרעה עלי שנאמר (שמות א') וימררו את חייהם, והעמיד לו הקב\"ה גואל זה מרים ע\"ש המירור, ולא שקטתי מגזירה שני' (שם) אם בן הוא והמתן אותו, והעמיד הקב\"ה גואל זה אהרן ע\"ש ההריון, ולא נחתי מגזירה שלישית שגזר ואמר (שם) כל הבן הילוד תשליכוהו. והעמיד הקב\"ה גואל ע\"ש המים זה משה שנאמר (שם ב') כי מן המים משיתוהו, ויבוא רוגז זה עמלק עכ\"ד המדרש, ראוי להבין דדריש לא שלותי ולא שקטתי ולא נחתי וכו' והעמיד להן גואל וכו'. והרי ע\"י שהעמיד להן גואל, הרי נחו מהגזירה ומהו לא נחתי, גם היכן מצינו באהרן ומרים שהיו גואלים, גם צ\"ב מ\"ש ויבוא רוגז זה עמלק איך נרמז עמלק בלשון רוגז, וכי הצרות והגזירות של פרעה לא היו רוגז, ולמה דוקא הצרות של עמלק נרמז בלשון רוגז, גם הלשון ויבוא רוגז צ\"ב דבאחריני לא אמר לשון ויבא כ\"א בזה דייקא וטעמא בעי.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 141,
      "char_length": 832,
      "timestamp": "2025-02-06T19:32:42.935339"
    },
    {
      "id": "beshalach2_p142",
      "text": "ו) במכילתא ר' יהושע אומר כשבא עמלק להזיק את ישראל מתחת כנפי אביהם שבשמים אמר משה לפני הקב\"ה, רבש\"ע רשע זה בא לאבד בניך מתחת כנפיך, ס\"ת שנתת להם בהר סיני מי יקרא בו, ר\"א המודעי אומר כשבא עמלק להזיק את ישראל וכו' אמר משה לפני הקב\"ה רבש\"ע בניך שאתה עתיד לפזרן תחת ארבע רוחות השמים וכו', רשע זה בא לכלם מתחת כנפיך ס\"ת שנתת להם מי יקרא בו עכ\"ד המכילתא, וצ\"ב מה שאמר תורה שנתת להם מי יקרא בו, הרי הי' עדיין לפני מתן תורה ואם יכלה ח\"ו זרע ישראל, א\"כ לא יהי' מי שיקבל התורה, והול\"ל מי יקבל את התורה, גם בדברי ר\"א המודעי צ\"ב ענין הטענה מ\"ש בניך שאתה עתיד לפזרן וכו', וכי זכות הוא להם, הרי מפני חטאינו גלינו מארצנו, ומה ענינו להמליץ זכות בזה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 142,
      "char_length": 632,
      "timestamp": "2025-02-06T19:32:43.387225"
    },
    {
      "id": "beshalach2_p143",
      "text": "ז) עוד דרשו במכילתא ויבא עמלק שבא בגילוי פנים לפי שכל הביאות שבא לא בא אלא במטמוניות שנאמר אשר קרך בדרך וגו', אבל ביאה זו לא בא אלא בגילוי פנים לכך נאמר ויבוא עמלק עכ\"ד המכילתא, וצ\"ב דלא מצינו בשום מקום שבא במטמוניות, גם איך נשמע מאשר קרך בדרך שבא במטמוניות, ובמדרש יש הרבה דרשות במאמה\"כ אשר קרך בדרך ולכולהו קאי על מלחמה זו ואיך נשמע מכאן על מלחמות הקודמים שהיו במטמוניות, גם איך הי' יכול ללחום במטמוניות וישראל היו מוקפים בעננים ולא הי' בידו לגשת אליהן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 143,
      "char_length": 455,
      "timestamp": "2025-02-06T19:32:43.740340"
    },
    {
      "id": "beshalach2_p144",
      "text": "ח) והי' כאשר ירים משה ידו וגבר ישראל וכאשר יניח ידו וגבר עמלק במתני' (ר\"ה דף כ\"ט ע\"א) הקשו וכי ידיו של משה עושות מלחמה או שוברות מלחמה, אלא לומר לך כל זמן שישראל מסתכלין כלפי מעלה ומשעבדין את לבם לאביהם שבשמים היו מתגברים וכו', וצ\"ב מהו הקושיא וכי ידיו של משה עושות מלחמה, דבוודאי כן הוא שהי' בכח ידיו של משרע\"ה להכריע נצחון המלחמה לטובה, גם התירוץ צ\"ב דמ\"ט הניח משרע\"ה את ידו, אם בזה הי' תליא נצחונם והצלתם של ישראל, גם על ישראל קשה מ\"ט כשהניח משרע\"ה את ידו לא היו מסתכלים כלפי מעלה ומשעבדין את לבם לאביהם שבשמים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 144,
      "char_length": 514,
      "timestamp": "2025-02-06T19:32:43.969280"
    },
    {
      "id": "beshalach2_p145",
      "text": "ט) גם יל\"ד בלשון הכתוב והי' כאשר ירים משה וגו', הרי מלחמה זו כבר הי', ומדוע הזכירו בלשון עתיד והי' הול\"ל וכאשר ירים וגו'",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 145,
      "char_length": 120,
      "timestamp": "2025-02-06T19:32:44.232995"
    },
    {
      "id": "beshalach2_p146",
      "text": "י) ויאמר ה' אל משה כתוב זאת זכרון בספר ושים באזני יהושע כי מחה אמחה את זכר עמלק מתחת השמים, נחלקו המפורשים בפי' הכתוב, הראב\"ע ז\"ל פי' כתוב זאת זכרון בספר, כי הוא ספר מלחמות ה', ואיננו אתנו שנאבד כאשר אין לנו דברי הימים למלכי ישראל וכו' עיי\"ש, והרמב\"ן ז\"ל דחה פירושו עיי\"ש וכתב הנכון בעיני כי בספר ירמוז לספר התורה שיזכרו בנ\"י מה שעשה עמלק, וכ\"כ הספורנו כתוב זאת זכרון בספר פרשת זכור, והפי' הוא שהבוכ\"ע צווהו לכתוב בס\"ת המצוה זאת של זכור את אשר עשה לך עמלק וכו', אמנם גם זה צ\"ב דלא נזכר כן בשאר המצות שהקב\"ה צוה לו עליהן לכותבם בספר התורה, וכל המצות כתבם משרע\"ה בס\"ת עפ\"י ציווי השי\"ת, ומי שאומר אפי' על אות א' שבתורה שמשה מפי עצמו כתבה, ה\"ה בכלל האומר תורה לא מן השמים הוא וכופר בתורה, ועל כולם נצטוה מפי הקב\"ה לכתוב, ואעפי\"כ לא מצינו בפרטיות כל מצוה ומצוה שיאמר לו הקב\"ה במיוחד כתוב זאת זכרון בספר, ומדוע במצוה זו דייקא הזכיר הכתוב שהקב\"ה צווהו לכתבה זכרון בספר, גם דאין כאן מקומו דפ' זכור נאמרה במשנה תורה בפ' תצא, ומדוע הקדימו הכתוב לצוותו על ככה עכשיו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 146,
      "char_length": 955,
      "timestamp": "2025-02-06T19:32:44.330314"
    },
    {
      "id": "beshalach2_p147",
      "text": "יא) ושים באזני יהושע, צ\"ב מהו באזני יהושע, והרי נצטווה לכתבו בתוה\"ק ונתפרסם לכ\"א מישראל ולא רק ליהושע, ואמרז\"ל (סנהדרין דף כ' ע\"ב) שלש מצות נצטוו ישראל בכניסתן לארץ וא' מהם מחיית עמלק, הרי לא נמסרה ליהושע בלחישה ומהו באזני יהושע.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 147,
      "char_length": 229,
      "timestamp": "2025-02-06T19:32:44.783567"
    },
    {
      "id": "beshalach2_p148",
      "text": "יב) ורש\"י ז\"ל פירש דע\"כ נצטו' למסרו ליהושע מפני שהוא עתיד להכניס את ישראל לארץ וכן הוא במד\"ר (פ' כ\"ו סי' ג') אמנם לכאורה לא מצינו שיהושע נלחם בעמלק אחר כניסת הארץ חוץ מפעם הזה עכשיו, ולא הגיע זמנה עד מלוך שאול והוא לחם עם עמלק, ולמה נאמר ושים באזני יהושע, גם צ\"ב הלשון \"ושים\" דהול\"ל אמר אל יהושע, ולא מצינו כזאת במקום אחר כמ\"ש אמור אל אהרן ולא כתיב ושים באזניו ומה נשתנה כאן דכתיב לשון שימה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 148,
      "char_length": 391,
      "timestamp": "2025-02-06T19:32:44.923771"
    },
    {
      "id": "beshalach2_p149",
      "text": "והנה בגמרא מגילה (דף ז' ע\"א) דרשו רז\"ל הכתוב כתוב זאת זכרון בספר על כתיבת המגילה, כתוב זאת מ\"ש כאן ובמשנה תורה, זכרון מה שכתוב בנביאים, בספר מה שכתוב במגילה, ואיתא בירושלמי מגילה פ\"א ה\"ה) דקריאת המגילה ניתנה למשרע\"ה בהר סיני, ופי' היפה מראה דע\"כ נאמר ושים באזני יהושע דמורה שילחוש לו באזניו דרך סוד נסתר מהמון, דבימי מרדכי ואסתר היו צריכים ישראל לתשובה גדולה כמבואר בדרז\"ל, ואלמלי הי' נגלה ונתפרסם מקודם נפילת המן וכו' ותשועתם של ישראל, בוודאי מורא לא הי' עולה על ראשם מגזירת המן, וממילא לא הי' סיבה המביאם לעשות תשובה, לזה נסתר מהמון מצות קריאת המגילה בשעת מ\"ת, ולא נמסר רק למשה לבדו והוא מסרה ליהושע, וכן כל ראש הדור מסר זה בדרך סוד לראש הדור שלאחריו עד מרדכי, והיינו שים באזני יהושע דייקא עכת\"ד ז\"ל, ועפי\"ד יתיישב הלשון שימה שאמר הכתוב ושים באזני יהושע, עפימ\"ד בירושלמי (ע\"ז) ואלה המשפטים אשר תשים לפניהם, דד\"ת הם כאוצר שהוא מכוסה, ודריש תשים לשון סימא שהוא מכוסה כאוצר, ואין לגלותם לבנ\"א שאינם מהוגנים. וכ\"ש מצות קריאת המגילה שהיתה צריכה להיות נסתר מהמון כנ\"ל, לז\"א \"ושים'' \"באזני\" יהושע שיהי' מכוסה כאוצר ורק לאזני יהושע נאמרה בלחישה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 149,
      "char_length": 1039,
      "timestamp": "2025-02-06T19:32:45.163777"
    },
    {
      "id": "beshalach2_p150",
      "text": "אמנם כל זה ניחא לפי הדרש שדרשוהו רז\"ל על קריאת המגילה, אבל לפי פירוש הפשוט עדיין צ\"ב פי' הקרא, והנה דרש זה דקאי על המגילה לא נתגלה לחכמים כ\"א בימי מרדכי ואסתר, וחכז\"ל מקודם לא ידעו מזה ולא רצו להכניס מגילת אסתר בין הכתובים עד שנתגלה להם דרש זה וסמכוהו אקרא כמבואר בגמרא שם, והכתוב הרי צריך שיהי' לו פירוש גם בדורות הקודמים ומה הי' פירוש הפסוק עד אז, וכמ\"ש בגמ' עד דאתי יחזקאל מאן אמרינהו, גם כי זה דרך דרש, וכללא אית לן דאין מקרא יוצא מידי פשוטו לעולם, ואפשר דמה\"ט נקטו המפורשים דכתוב זאת זכרון בספר קאי על מצות התורה הכתובה בפ' תצא, ועכ\"פ עפ\"י פשוטו צ\"ב מה נשתנה מצוה זו שנתייחד עלי' הציווי לכתבו זכרון בספר משא\"כ שאר המצות.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 150,
      "char_length": 625,
      "timestamp": "2025-02-06T19:32:45.686864"
    },
    {
      "id": "beshalach2_p151",
      "text": "יג) כי מחה אמחה את זכר עמלק וגו' במכילתא ר\"א המודעי אומר מחה לו ולכל תולדותיו, אמחה לו ולכל הדור ההוא ע\"כ, וצ\"ב דכבר נתרבו כל תולדותיו למחות, א\"כ כל הדורות בכלל וכ\"ש אותו הדור, ולמה צריך עוד קרא לדרוש אמחה לו ולכל הדור ההוא, גם קשה כי אותו הדור קדום והו\"ל להקדים הלימוד על אותו הדור ואח\"כ על תולדותיו של כל הדורות.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 151,
      "char_length": 314,
      "timestamp": "2025-02-06T19:32:45.995976"
    },
    {
      "id": "beshalach2_p152",
      "text": "יד) ויאמר כי יד על כס יה מלחמה לה' בעמלק מדר דר, דרשו ז\"ל במדרש הובא ברשיז\"ל מהו כס ולא נאמר כסא ואף השם נחלק לחציו, נשבע הקב\"ה שאין שמו שלם ואין כסאו שלם עד שימחה שמו של עמלק כולו וכשימחה שמו יהי' השם שלם והכסא שלם, וכתב הרמב\"ן ז\"ל טעם העונש שנענש עמלק יותר מכל העמים, בעבור כי כל העמים נמוגו מפני פחד ה' ומהדר גאונו, ועמלק בא ממרחק כמתגבר על השם יעיי\"ש, והנה ניחא מה שהבוכ\"ע נתן עונש קשה כ\"כ לעמלק, אולם מה כוחו ליגע בהשם הקודש ב\"ה שעל ידי טמא זה יהי' השם הוי' ב\"ה נחלק לחציו ומכסאו ית\"ש חסר א', ומה כוחו שעל ידו יהי' פגם בשמו ית' ובכסאו, הלא כל הנהגות העולמות והשפעת רוחנית וגשמיות תליא באיכות המעשים של בנ\"י, ואיך בא עמלק ליגע בשמו ובכסאו, ויש סיפק בידו כביכול ליתן לו עונש בשבועה או גם זולתה מבלי שיחסר משמו ית', והבו\"ע הוא כל יכול ובידו לאבד זכרו אף מבלי זאת.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 152,
      "char_length": 765,
      "timestamp": "2025-02-06T19:32:46.171368"
    },
    {
      "id": "beshalach2_p153",
      "text": "ולבאר הענין נקדים דהנה ידוע דפרשיות אלו המה ימי השובבי\"ם מסוגלים לתקן חטא הידוע, כי באלו הימים נתייגעו בנ\"י בתיקון מדה זאת, שהיו במצרים ערות הארץ בדיוטא התחתונה, והי' להם נסיונות גדולות ועבודה קשה, והבוכ\"ע עזרם וזכותו של יוסף הצדיק הגין עליהם ועמדו בנסיון והיו גדורים בעריות, אולם אם מידי עבירה יצאו מידי הרהור לא יצאו, ומיציאת מצרים עד קבלת התורה הי' גמר התיקון שביררו הניציה\"ק, לכן בזמנים אלו יש התעוררות ע\"ז התיקון, דהקריאה מעורר הזמן, וכל הענינים הכתובים בפרשיות אלו מרמזים ומורים על תקון חטא הידוע, וזהו ג\"כ הענין מלחמה לה' בעמלק מדר דר, והכוונה על שרו של עמלק, וע\"ד שכתוב והנה מצרים נוסע אחריהם ולא כתיב מצרים נוסעים, רק נוסע בלשון יחיד, דקאי על השר שראו השר של מצרים, וכמו\"כ כאן ויבא עמלק לא כתיב ויבואו העמלקים לשון רבים, אף שבא ללחום עם חיל גדול כדאיתא בדברי רז\"ל, כי עיקר המלחמה עם השר, וכמ\"ש האלשיך הקדוש דלכאורה קשה קושיא גדולה אם עמלק כ\"כ שנוא בעיני ה' עד שמלחמה לה' בעמלק מדור דור, והלא הקב\"ה יכול לבטלו ברגע אחד ולאבד שמו וזכרו, אמנם ידוע כי כשרצונו ית' להפיל אומה, מפיל השר שלהם תחלה, כמו שדרשו ז\"ל יפקוד ה' על צבא מרום במרום ואח\"כ על מלכי האדמה באדמה, והשר של עמלק הוא הס\"ם והיצה\"ר, וישראל בעונותיהן מוסיפין לו כח, ובמה שהולכין אחר עצת היצה\"ר מאשרים ומחזקים כוחו, לכן א\"א שיושלם מחיית עמלק מן העולם עד שיעשו ישראל תשובה מעולה בתיקון הראוי, ובזה מתרץ האלשיך הק' למה לא הי' רק ויחלוש יהושע את עמלק ואת עמו ולא עלה בידו לכלותו לגמרי, לפי שהדור לא היו ראויין כי עדיין היו בהם עונות ורפו ידיהם מן התורה, לזה לא יכלו להפיל שרו לגמרי יעייש\"ד באריכות.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 153,
      "char_length": 1460,
      "timestamp": "2025-02-06T19:32:46.579693"
    },
    {
      "id": "beshalach2_p154",
      "text": "ובזה יתבאר הכתוב כי מחה אמחה את זכר עמלק, דהנה מ\"ש תמחה את זכר עמלק הכוונה על השר כמ\"ש באלשיך, שהבוכ\"ע הזהיר לבנ\"י שיתגברו על יצרם הרע, וממילא יתקיים אח\"כ כי מחה אמחה שיהי' מחיית עמלק בפועל ע\"י הבוכ\"ע, ועיקר הפעולה של בנ\"י הוא ללחום מלחמת היצר דזהו מלחמת עמלק, ואח\"כ ה' יגמור בעדם, וע\"כ לעתיד לבא כשיהי' התיקון בשלימות, ממילא יהי' גם מחיית עמלק בשלימות כי הא בהא תליא. ובזה יובן מ\"ש כתוב זאת זכרון בספר, דהרי כתיב כאן כי מחה אמחה שהבוכ\"ע הבטיח לבנ\"י למחות עמלק ולאבד זכרו, ועכשיו הי' רק ויחלוש יהושע, ולכאורה יתחמץ לבבו למה לא הי' בכוחו רק להחלישו וכנ\"ל באלשיך, לזה נחמו הקב\"ה שיתקיים כי מחה אמחה לעתיד ועדיין לא הי' הדור ראוי לכך, ואימתי יתקיים זה כשיהי' תמחה, שבנ\"י יעשו את שלהם למחות כוחות היצה\"ר מתוכם, ולז\"א כתוב זאת זכרון בספר, שלא יחשבו ישראל דהרי כתיב כי מחה אמחה והרי הבוכ\"ע יעשהו לגמרי בעצמו, ובאמת עבודה זו מוטלת על ישראל שיעשו את שלהם להתגבר על יצרם ולהכניע כוחו של עמלק הס\"מ דזהו תכלית בריאת העולם, לזה כשהבטיח הבוי\"ת לישראל כי מחה אמחה את זכר עמלק, הקדים לצוות למשה כתוב זאת זכרון בספר שתכתוב פרטי מצוה זו בספר התורה בפ' תצא, שצ\"ל מקודם תמחה את זכר עמלק שבנ\"י יעשו את שלהם ועי\"ז יהי' כי מחה אמחה, דהא בהא תליא מחה אמחה האמור כאן עם תמחה דהתם, ולכן הוצרך להזכיר כאן כתוב זאת זכרון בספר, (ומתורץ קושיא י' הנ\"ל).",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 154,
      "char_length": 1223,
      "timestamp": "2025-02-06T19:32:47.279156"
    },
    {
      "id": "beshalach2_p155",
      "text": "ואפ\"ל עוד עפי\"ד האוהחה\"ק (בפ' פנחס) עה\"פ צרור את המדינים והכיתם וגו', וז\"ל למה צוה ה' מצוה זו שלא בזמנה, כי מצינו שאח\"כ (בפ' מטות) הוצרך ה' לצוות לומר נקום נקמת בנ\"י מאת המדינים, הא למדת שמאמר זה לא הי' בזמן הנקמה, ותוכן תירוצו כי מחשבת עבירה שהכניסו בהם המדינים קשה להפרידו, וכל עוד שלא נפרד מהחוטא תשוקת העבירה, הרי הוא מושלל מהכפרה, לזאת יעץ ה' ואמר צרור את המדינים וגו', הכוונה בזה להקדים לשנוא המחטיאים וכו', ובאמצעות מחשבה זו תהי' מתרחקת תאות עבירה מהם וכו', ויולד בהם טבע אלקיי יעייש\"ד, וכמו\"כ לענינינו כי המצוה הזאת של מחיית עמלק עדיין לא נצטוו בה ישראל מיד במלחמת עמלק, כי הי' לפני מ\"ת ולא ניתנו להם כ\"א מצות פרטיות, גם כי חיוב המצוה הוא רק לאחר ירושה וישיבה, אמנם בפנימית הענין הכוונה על שרו של עמלק והוא היצה\"ר הלוחם עם ישראל תמיד וצריך ללחום עמו תמיד, ופרט זה מחוייבת גם קודם מתן תורה, ע\"כ הודיענו השי\"ת מיד כתוב זאת זכרון בספר, שעתיד להנתן לנו מצוה זו אחר מ\"ת, ולהקדים לשנוא המחטיאים וזה יוליד נפש מטוהרה ויהי' ראויים לקבלת התורה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 155,
      "char_length": 943,
      "timestamp": "2025-02-06T19:32:47.883681"
    },
    {
      "id": "beshalach2_p156",
      "text": "ובזה מובן מ\"ד במכילתא שעד עכשיו הי' עמלק לוחם במטמוניות ויליף לי' ממה שנאמר אשר קרך בדרך, עפימ\"ד במדרש ילקוט אשר קרך בדרך טמאך כמה דאת אמר מקרה לילה שטימאן בטומאת קרי, ואיך עשה עמלק זאת והרי לא יכול לגשת אל ישראל שהיו מסובבים בעננים, אולם הכוונה על שרו של עמלק הס\"מ, והתחלת המלחמה הי' לטמאן בחטא הידוע הנרמז באשר קרך בדרך בחי' מקרה לילה, ועי\"ז ניתוסף לו כח להתגבר על שונאיהן של ישראל, ויכול לבוא אח\"כ בגלוי מאחר שהחליש כוחות הקדושה וכח הניצוח לנצח בהן שונאי ישראל, שזהו הכח מה שבנ\"י שומרין עצמן בקדושה, וזהו שורש מצות מחיית עמלק ללחום עם כוחות היצר, והנה שורש חטא זה מההרהור כאמרז\"ל שלא יהרהר אדם ביום ויבוא לידי טומאה בלילה, והתחלת החטא הוא ממחשבה שאין שומרין המחשבות והרעיונות, וזהו עדיין במטמוניות, שאין זולתו יודע דאין אדם יודע מה שבלב חבירו, אלא הבורא עולם בוחן כליות ולב וכל מחשבות חוקר וכדאי' בגמ' שבועות עה\"כ חטאת לה' זה חטא המחשבה שאין מכיר בו אלא ה', ולכן המשילו רז\"ל במדרש את עמלק לזבוב, דאי' בגמ' ברכות דף ס\"א ע\"א) למה נמשל יצה\"ר לזבוב לפי שיושב על מפתחי הלב, דהמלחמה עם הס\"ם וכוחות היצר מתחלת במחשבה שבלב ושם עיקר המלחמה כאמרז\"ל ונשמרת מכל דבר רע שלא יהרהר אדם ביום, נמצא דמלחמת עמלק מתחלת במחשבות וזהו במטמוניות, וחלילה אם אין משגיחין על המחשבות נכשלין ח\"ו בחטא הידוע ובאים לידי עבירות במעשה, ואז לוחם כבר בגלוי לא רק במחשבה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 156,
      "char_length": 1239,
      "timestamp": "2025-02-06T19:32:48.351341"
    },
    {
      "id": "beshalach2_p157",
      "text": "ובזה מובן המכילתא ויבא עמלק שבא בגלוי פנים ועד אז לחם בסתר ובמטמוניות, ומביא ראי' ממה שנאמר אשר קרך בדרך דפירושו שטימאן בטומאת קרי, וזה הרי מקורו במחשבות שהם במטמוניות, ולבסוף ויבא עמלק שבא בגלוי פנים ובאתגליא, ובזה יתיישב מ\"ש ויבא עמלק ולא כתיב וילחם (עי' קושיא ג') כי כבר עד עכשיו ג\"כ לחם רק בסתר, שלא הרגישו שזה מלחמת עמלק, ועכשיו ויבא עמלק שראוי בגלוי שבא עמלק להלחם, וסמיך לי' כתיב היש ה' בקרבנו אם אין, וגם זה מלחמת עמלק הס\"מ שהכניס בהם ספיקות באמונה, וחז\"ל דרשו סמוכין היש ה' בקרבינו אם אין וסמיך לי' ויבוא עמלק, דמפני שבנ\"י הי\"ל ספיקות בהאמונה לכן הי\"ל שליטה להשפיע בכוחות הטומאה שלו ועי\"כ ויבא עמלק שבא אח\"כ באתגליא.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 157,
      "char_length": 625,
      "timestamp": "2025-02-06T19:32:48.990162"
    },
    {
      "id": "beshalach2_p158",
      "text": "והנה מצוה זו חיובה תמידית כמ\"ש הפוסקים, ומשמעות הפסוק מורה כן זכור את אשר עשה לך עמלק, וזכור לשון הוה ותמיד, ומלחמה זו תמידית שהס\"ם שרו של עמלק לוחם עם ישראל והוא ראש כל שרי אומה\"ע וכולם לוחמים עמו נגד ישראל, ע\"כ בעת צרה גלוי' ח\"ו הן בגשמיות שלוחמין חלילה על ישראל, והן ברוחניות שקמים חלילה להעביר מהאמונה ומיהדות, צריך לידע כי לא בפעם א' ובפתע פתאום נולד כ\"ז, כ\"א ההתחלה הי' ע\"י שגרמו בעצמן שלא נשמרו ממחשבות, כמו מלחמת עמלק שהתחיל באשר קרך בדרך להכשיל את ישראל בחטא הידוע, ועי\"כ בא אח\"כ בגלוי שזה הי' ההכנה אליו, ומכ\"ז ניתוסף להם כח בעוה\"ר, וע\"כ אמרה התוה\"ק זכור שיזכרו השורש מה שמביא למלחמת עמלק, דבאמת מלחמת עמלק יש כסדר בכל עת ובכל רגע, וכל יהודי בחדרי חדרים יש לו נסיונות משרו של עמלק שרו של עשו הוא הס\"מ וכשהולכין לחוץ מלאים נסיונות, ובפרט במקומות הטמאין כמעשה ארץ מצרים ומעשה ארץ כנען שבנ\"י בגלות עכשיו בדור האחרון כמה גדלו הנסיונות, ואף באלו שרוצין לשמור עצמן כמה גדולה וקשה ומרה המלחמה, הן בעניני קדושה וטהרה ופרישות שיהיו המחשבות טהורות, והן בעניני האמונה כמה יהודים נמצאים היום שעומדין בנסיון בהאמונה שלימה אמונה פשוטה בכל הי\"ג עקרים כדבעי, כמה גדולים הם הנסיונות ובפרט כשנרדפים מכל הצדדים בכוחו של הס\"ם בכל עת ובכל רגע, וזהו המלחמה בסתר המבואר במכילתא שעמלק לא בא בראשונה בגלוי, דבפעם הראשון אינו בא בפנים מגולות, רק במסוה ובצביעות ונתפסין מבלי ידיעה שהנסיונות הם רק במחשבה, ובכל תנועה ופסיעה שיהודי פונה ישנם נסיונות גדולות של מלחמת עמלק בכל עת ובכל רגע, ואח\"כ ויבא עמלק שבא בגלוי פנים והרי יודע כ\"א בנפשו עד כמה פגם וכובד המשא של עונות שנושא על כתיפו, והאיך אפשר ליתן מרגוע לנפשו, וצריכין לרחמי שמים, חסדי ה' כי לא תמנו כי לא כלו רחמיו לקרב בנ\"י לאביהן שבשמים שיזכו לתקן מה שפגמו, והבוכ\"ע יעזור שנזכה עוד לתקן חטא זה, שרואין עד היכן הדברים מגיעין ועד כמה הוא ההתגברות, ועד כמה צריך לשמור על כל מחשבה קלה ולשמור העינים והלב ושלא לילך בהתחברות עם כל אלו המכשילים את הרבים בתערובות וכדומה שכל אלו שלוחי הס\"ם ועמלק, ולז\"א ויבוא עמלק וגו' כתוב זאת זכרון בספר שלא יסיחו דעתם מן התורה, ורק בכח התורה אפשר להתגבר במלחמה זו, וכמ\"ש הרמב\"ם ז\"ל דאין ההרהור מצוי אלא בלב פנוי מן החכמה, דהעצה על הרהורים רעים הוא להיות דבוקים בעמקות התוה\"ק, ולז\"א גבי ויבא עמלק כתוב זאת זכרון בספר דקאי על התוה\"ק כנ\"ל, ולזה דרשו רז\"ל ברפידים שרפו ידיהן מן התורה דזה הי' סיבה לביאתו של עמלק.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 158,
      "char_length": 2174,
      "timestamp": "2025-02-06T19:32:49.300056"
    },
    {
      "id": "beshalach2_p159",
      "text": "והנה הבוכ\"ע לית מחשבה תפיסא בי' כלל ומה דמות תערכו לו, אבל כפי המעשים של בנ\"י שעובדין להשי\"ת בתורה ועבודה ממשיכין מדותיו ית\"ש, ושמותיו ית\"ש מורים על השפעת המדות לא תוארי העצם, דכביכול הבוית\"ש א\"א לכנות לו שם, דאינו תופס שום הישג והיקף, וכל השמות הקדושים הם רק לפי ההשפעה ולפי המדות שהקב\"ה מאיר אל העולם ובפרטיות לבנ\"י, וזה תלוי בהעבודה של בני ישראל, ממילא כשהדור אינו מתוקן כראוי וישראל יש להם מחשבות לא טהורות, וק\"ו כשההרהורים מביאין לידי מעשה, וכמ\"ש ז\"ל עין רואה ולב חומד וכלי המעשה גומרין, הרי זה ממעט ומקלקל ירידת ההשפעה הן בגשמיות והן ברוחניות, וכמ\"ש ק\"ז הישמח משה זלה\"ה עה\"כ ירד ירדנו בתחלה לשבור אוכל, שחטא הידוע ממעט השפעה גשמיות, וברוחניות עוד יותר, נמצא דע\"י פגם החטא הרי הוא מגרע השפע, וזה נוגע בהשם הק' של הקב\"ה, דה\"ה לפי הארת ההשפעה שמאיר לעולם, ובזה יובן דכ\"ז שעמלק בעולם הרי יש לבנ\"י תמיד מלחמות בזה החטא הידוע ע\"כ אין השם שלם, וכשהבוכ\"ע יעזור שיהי' מחיית עמלק בשלימות ויחדל השפעת טומאתו מעל בנ\"י, ממילא יעבדו בנ\"י להשי\"ת ויקיימו כל התורה כולה באמת ובתמים ויהי' העבודה בשלימות, אזי תהי' ההשפעה כדבעי למהוי וממילא יהי' השם בשלימות.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 159,
      "char_length": 1045,
      "timestamp": "2025-02-06T19:32:50.408762"
    },
    {
      "id": "beshalach2_p160",
      "text": "ובזה יבואר הכתוב מלחמה לה' בעמלק מדר דר דכל זמן שעמלק בעולם נכשלין ישראל בחטאים ר\"ל והמחשבות אינם טהורים וזעירין אינון המשימין על הלב עד כמה צריך להיות השמירה בשבתו ובקומו ובלכתו בדרך, דבכ\"מ ישנם נסיונות גדולות ע\"י שרו של עמלק דהוא הס\"ם שמפתה את ישראל בעוה\"ר, ובעוה\"ר בדור הזה רובא דרובא נמשכין אחר פיתויו בחטא הנורא הידוע, ומזה נמשכין גם שארי חטאים, וכל אלו הכנופיות של מינות ואפיקורסות מתחילין בתערובות ואביזרייהו דעריות ובזה מחזיקין כח הס\"ם, וכל עוד שמחזיקים ומאשרים כחו, א\"א להמחות זכר עמלק כנ\"ל באלשיך, ולכן עוד טרם שנופלין לפח מוקש של היצה\"ר, צריכין ללבוש עוז בנפשו להשגיח שלא לפגום, ולבקש מהבוכ\"ע בתפלות ותחנונים ודמעות של אמת, שנזכה לשמור המחשבות והעינים והמעשים והדיבורים, ובזה מוסיף אומץ להשם הוי' ב\"ה, כי ע\"י מחיית עמלק יהי' שמו שלם וכסאו שלם, ומעשינו נוגעין \"עד ה' אלקיך\" בשמו של הבוכ\"ע, לכן כל אלו ששומרים עצמן מכל חטא וגודרין גדר לעצמן ולזולתן למנוע מחטוא, ה\"ה מוסיפין כח לשמו יתברך ויתעלה, ומסייעין שיהי' שמו שלם וכסאו שלם, וחלילה אם פוגמין מחסרין שמו ית', דהכל תלוי במעשיהם של ישראל כנ\"ל, ומה\"ט מתגבר הס\"ם לתפוס בנ\"י ברשתו דעליהן העולם עומד, וכמ\"ש אין פורעניות בא לעולם אלא בשביל ישראל, הן בגשמיות ומכ\"ש ברוחניות, וכעת ההסתר גדול מאוד אבל לעתיד יתגלה הכל וישיגו ישראל, איך שנתקלקל ההשפעה וגרמו צער השכינה כביכול ב\"ה ופגם בעולמות העליונים ותחתונים ע\"י החטאים, וכמה טוב ונעים אם זוכין לתקן ולעבוד השי\"ת כראוי, כמה תיקון גדול מביאין לכל העולם וכמה נחת רוח עושין להשי\"ת ולכל ברואי מעלה ומטה, ובאמת עומדין אנחנו כבר אצל גמר התיקון שקרבה ישועתינו לבוא ולא כימים הראשונים שהיו צריכין עבודה קשה והיום יספיק אם רק יתקנו קצת שלא יתחברו עם התועים ומתעים, דהגאולה כבר עומדת אחורי תרעא דכלו כל הקיצין ואין הדבר תלוי אלא בתשובה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 160,
      "char_length": 1630,
      "timestamp": "2025-02-06T19:32:50.974719"
    },
    {
      "id": "beshalach2_p161",
      "text": "וז\"פ מלחמה לה' בעמלק מדור דור, דכל הדורות הראה הקב\"ה למרע\"ה כמ\"ש רז\"ל (במדבר רבה כ\"ג ה') הראה לו דור ודור ודורשיו דור ודור ושופטיו, עד שיעזור הבוכ\"ע ובנ\"י יוושעו, וזה הפי' מ\"ש במכילתא ס\"ת שנתת מי יקרא בו, עפי\"מ שפירשתי דברי המדרש אילו לא מת משה שפיר, עכשיו שמת משה לכן ויתלו את המן על העץ, עפימ\"ד בגמ' (חגיגה דף ה' ע\"ב) כי קא ניחא נפשי' דר' יהושע בן חנני' אמרו לי' רבנן מה תיהוי עלן מאפיקורסין, אמר להם (ירמי' מ\"ט) אבדה עצה מבנים נסרחה חכמתם, כי זה לעומת זה עשה אלקים וכשנחלש כח הקדושה ואין בנו כח להתגבר נגדם אזי גם חכמתם אבדה, וע\"כ כ\"ז שמרע\"ה קיים בעולם אין לירא מסטרא דעמלק, משא\"כ כשנסתלק משה ואבדה עצה מבנים לכן ויתלו את המן על העץ.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 161,
      "char_length": 636,
      "timestamp": "2025-02-06T19:32:51.733512"
    },
    {
      "id": "beshalach2_p162",
      "text": "והנה אמרז\"ל התפשטותא דמשה בכל דרא, וכל ת\"ח ההולך בדרך האמת ולומד תורה לשמה יש בו ניצוץ ממרע\"ה, ובעוה\"ר בדור עיקבא דמשיחא מת משה, אבל המן היינו כוחות של עמלק קיים, וכדאי' בזוה\"ק פ' בראשית ה' מינים בערב רב וא' מהם עמלקים, והכוונה על הנשמות שנתגלגלו ושורשם מזרע עמלק ונתערבו בין ישראל, והמה עושים מעשה עמלק ומחטיאים את ישראל כמו שעשה עמלק שנאמר אשר קרך בדרך, לזה התפלל מרע\"ה ס\"ת שנתת להם בהר סיני מי יקרא בו ולא אמר מי יקבל את התורה, כי ידע דכ\"ז שיהי' בעולם לא יוכל עמלק לשלוט בישראל ובנ\"י יקבלו התוה\"ק, אמנם ראה מלחמת עמלק \"מדור דור\", ומה יהי' בדורות האחרונים שאבדה עצה מבנים ויחסרו צדיקים אמיתיים שיצילו ויגינו על הדור: ואין מי שישפיע על הדור לא ברוחניות ולא בגשמיות, ואנו הגענו לזה הדור של עיקבא דמשיחא שאמרו בגמ' (סוטה דף מ\"ט ע\"ב) על מי לנו להשען על אבינו שבשמים, לזה התפלל מרע\"ה על תקנתן של דורות האחרונים להחליש כחו של עמלק, דאם ח\"ו יתגבר בכח גדול, א\"כ ס\"ת שנתת על הר סיני מי יקרא בו, מי ילך בדרך התורה על דרך האמת ומי ישיג השגות אמיתיות בתוה\"ק.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 162,
      "char_length": 948,
      "timestamp": "2025-02-06T19:32:52.074145"
    },
    {
      "id": "beshalach2_p163",
      "text": "ועד\"ז יל\"פ בדברי ר\"א המודעי אמר משה לפני הקב\"ה רבש\"ע בניך שאתה עתיד לפזרן רשע זה בא לכלם מתחת כנפיך, ס\"ת שנתת להם מי יקרא בו, עפ\"י המבואר בדברי רז\"ל דתכלית הגלות לברר הנציה\"ק ומה' מצעדי גבר כוננו, שכ\"א מישראל גולה למקום שנמצאים בו ניצה\"ק משרשי נשמתו, ובזה תליא גאולתן של ישראל, וכתב הרמב\"ם ז\"ל שאין ישראל נגאלין אלא בתשובה כמבואר בקרא ושבת עד ה' אלקיך ומה כתיב אחריו ושב ה' אלקיך את שבותך, דרק עי\"ז יזכו ישראל לקיבוץ גליות יעיי\"ש, וכן בגאולת מצרים כתיב וינצלו את מצרים, שבררו משם ניצה\"ק ועי\"ז נגאלו כמבואר בדברי האריז\"ל וכ\"כ בשער המצוות (פ' ראה) דקודם ביאת המשיח צריכין בנ\"י להיות בד' כנפות הארץ בכל העולם, והתכלית הוא להוציא הנציה\"ק, ואיך מוציאין אותן, ע\"י העסק בתורה ועבודה ובתפלה ומצות מעשיות, אבל אם עמלק מתגבר ח\"ו להחטיא את ישראל בחטא הנורא אשר קרך בדרך מקרה לילה, או בעבירות גרועים יותר חלילה, מאבדין חלילה להנציה\"ק ומשליכין אותן למקום הקליפות ר\"ל, ואיך יהי' אפשר להגיע להגאולה, לזה התפלל מרע\"ה בניך שאתה עתיד לפזרן בארבע רוחות השמים לתכלית בירור הנציה\"ק, אבל אם יתגבר עמלק עליהם הרי לא יפעלו כלום וח\"ו יטמעו בגלות א\"כ ס\"ת שנתת להם מי יקרא בו, מי ילמוד דרך אמת מהתוה\"ק.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 163,
      "char_length": 1075,
      "timestamp": "2025-02-06T19:32:52.542990"
    },
    {
      "id": "beshalach2_p164",
      "text": "ואפ\"ל עוד רמז בזה עפימ\"ש הרמב\"ן ז\"ל (בפ' תבא) סו\"פ התוכחה וזל\"ק, כי ישיבתנו בגלות הוא ההבטחה שאמר לנו ואף גם זאת בהיותם בארץ אויביהם לא מאסתים ולא געלתים לכלותם וגו', יעיי\"ש שהאריך דע\"י גזירת הגלות ניצולים ישראל מכלי' ח\"ו, והאוה\"ח הק' (בפ' בחקתי) הסביר בטעם הכתוב, כי ע\"י הגלות נתמעט הקטרוג ויסובב רחמיו ית' על ישראל לכבש מדת הדין, בראות בני עליון בני מלכים שפלים ביד אויביהם, וזה יסובב שלא תכלה אותם מדת הדין, והוא אומרו ואף גם זאת סיבה להבאתם בארץ אויביהם שבהיותם בארץ אויביהם לא מאסתים לכלותם, ולצד זה בחרתי בעונש כזה עכלה\"ק, (עיין בספרי ויואל משה מאמר א' סי' י\"ד שהארכנו בזה).",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 164,
      "char_length": 580,
      "timestamp": "2025-02-06T19:32:53.038382"
    },
    {
      "id": "beshalach2_p165",
      "text": "ובזה יתבאר דברי הגמ' (פסחים דף פ\"ז ע\"ב) מאי דכתיב (שופטים ה') צדקות פזרונו בישראל, צדקה עשה הקב\"ה בישראל שפזרן לבין האומות, (פרש\"י צדקה עשה שפיזרן, שאינן יכולין לכלותם יחד), ובגמ' שם דההוא מינא (משרי אומה\"ע) הודה לר' חנינא שעוסקים במחשבה זו לכלות את ישראל, אלא שאין ביכולתם להשלים רצונם, לטעם שאין כולם ברשותם עיי\"ש, ולכאורה לטעם זה בלבד לא הי' הכרח שיפזר הקב\"ה את ישראל לבין האומות, דהרבה דרכים למקום להצילם, ויובן עפי\"ד האוהחה\"ק הנ\"ל כי הגליות יסובב רחמיו ית' על ישראל לכבוש מדת הדין ונשתתק הקטרוג, ולטעם זה נמנעים האומה\"ע מלכלותם, וה\"ז הצלה רוחניות לא טבעית.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 165,
      "char_length": 561,
      "timestamp": "2025-02-06T19:32:53.339700"
    },
    {
      "id": "beshalach2_p166",
      "text": "והנה משרע\"ה ראה כל הדורות וגלגוליהם כאמרז\"ל שהראה לו הקב\"ה דור דור ודורשיו, והשיג משרע\"ה שבעיקבא דמשיחא יתגבר שרו של עמלק, וע\"י שלוחיו הע\"ר ששורשם מעמלק יסית את ישראל למרוד בגזירת הגלות ולמרוד באומות, כמו שקמו בימינו כת מינים שכופרים בדברי חכז\"ל דגזירת הגלות הכרח ולטובתן של ישראל, ורוצים לעשות קבוץ גליות ע\"י פעולה טבעית ואנושית, ובזה מעוררים ומגדילים הקטרוג ח\"ו, ולזה התפלל משרע\"ה ואמר בניך שאתה עתיד לפזרן בארבע רוחות השמים לטובת הצלתם מן הקטרוג, רשע זה בא לכלם מתחת כנפיך, ס\"ת שנתת להם מי יקרא בו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 166,
      "char_length": 501,
      "timestamp": "2025-02-06T19:32:53.625624"
    },
    {
      "id": "beshalach2_p167",
      "text": "ובזה יובן דברי המדרש ויאמר משה אל יהושע וגו', למה ליהושע לפי שהוא עתיד להכניס את ישראל לארץ, וכן פירש\"י ז\"ל בפירושו עה\"ת, אמנם לא מצינו שלחם יהושע בעמלק אחר כניסת הארץ, ורק שאול המלך נצטוה על ככה. א\"כ הדרא קושית המדרש לדוכתי' למה ליהושע (עיין קושיא י\"ב), ולדרכינו נצטוינו בעיקר על המלחמה הפנימיות עם שרו של עמלק הס\"ם, וזהו עבודת בנ\"י, ואח\"כ ישלים הקב\"ה את שלו למחות זכר עמלק, והכל תליא במעשינו כמ\"ש האלשיך הק', והנה בארץ ישראל ובמקום הקודש מתגבר הס\"ם ביותר, דכל הגדול מחבירו יש עליו התגברות היצר יותר, והבאנו כ\"פ דברי הרמ\"ע מפאנו מ\"ש בספרו עשרה מאמרות לפרש הפסוק יגער ה' בך השטן ויגער ה' בך הבוחר בירושלים, דמאמר הבוחר בירושלים קאי על השטן, שבוחר במקום המקודש יותר להתגבר ולהחטיא שם ר\"ל עיי\"ש, ובזה יתבאר דברי המדרש למה ליהושע לפי שהוא עתיד להכניס את ישראל לארץ, ועל כי שם יתגבר עליהם שרו של עמלק יותר, ע\"כ נצטוה יהושע על מלחמה זו להכניע כוחות היצר וסטרא דעמלק.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 167,
      "char_length": 861,
      "timestamp": "2025-02-06T19:32:53.890608"
    },
    {
      "id": "beshalach2_p168",
      "text": "ונבוא לבאר דברי המכילתא הנ\"ל (בקושיא י\"ג) כי מחה אמחה את זכר עמלק, ר\"א המודעי אומר מחה לו ולכל תולדותיו, אמחה לו ולכל הדור ההוא עכ\"ד המכילתא, והדקדוקים כבר נפרטו לעיל, ונקדים מ\"ש הרמב\"ן ז\"ל בפרשה זו כי המלחמה מן המשפחה הזאת היא הראשונה והאחרונה לישראל וכו' עיי\"ש, ובמכילתא דרשו רז\"ל מלחמה לה' בעמלק מדר דר מדורו של משה עד דורו של משיח, ולכאורה אומה זו של עמלק כבר נכרתו בימי שאול המלך ובימי המן ובימי דוד, ולא נשארו מהם כ\"א יחידים שנתערבו ונתבלבלו בין האומות, ואין יחוס לעכו\"ם והם עצמם לא נודע להם יחוסם, ואיך נערוך מלחמה לנגדם אם לא נודע מציאותם ומקומם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 168,
      "char_length": 554,
      "timestamp": "2025-02-06T19:32:54.322612"
    },
    {
      "id": "beshalach2_p169",
      "text": "אמנם יתבאר עפי\"ד הזוה\"ק פ' בראשית (דף כ\"ה ע\"א) מלחמה לה' בעמלק מדר דר, מאי מדר דר דא משה דאתמר בי' דור הולך ודור בא, והא אוקמוה דלית דור פחות מס' רבוא ודא משה וכו', וחמש מינין אנון בערב רב ואינון נפילים גבורים ענקים רפאים עמלקים וכו', בלעם ובלק מסטרא דעמלק הוו וכו', ומאלין דישתארו מנהון בגלותא רביעאה, אינון רישין בקיומא סגי ואנון קיימין על ישראל כלי חמס וכו' אלין אנון עמלקים עכ\"ל הזוה\"ק, ובילקוט ראובני פ' תצא הביא דברי הזוה\"ק עה\"פ תמחה את זכר עמלק אלין ערב רב מעורבים בישראל, עלייהו אתמר תמחה את זכר עמלק דלא ישתאר מנהון שריד ופליט עכ\"ל, ובספה\"ק אור החמה בפירושו על דברי הזוה\"ק (פ' בראשית הנ\"ל) ביאר דאף באלו הנולדים מזרע ישראל, יתרמי ששורש נשמותיהם מסטרא דעמלק ע\"י גלגול עיי\"ש, ובזוה\"ק שם (פ' בראשית) אחר שחושב חמשה מינים שבערב רב ופרטי מעשיהם, סיים אבל פורקנא לאו איהי תליא אלא בעמלק עד דיתמחי, דבי' אומאה והא אוקמוה עכ\"ל, מבואר שהמלחמה האחרונה בעיקבא דמשיחא יהי' עם הע\"ר מזרע עמלקים, ובזה תליא פורקנא דישראל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 169,
      "char_length": 915,
      "timestamp": "2025-02-06T19:32:54.641231"
    },
    {
      "id": "beshalach2_p170",
      "text": "ובעוה\"ר בדור הזה חזרו ובאו בגלגול העמלקים של דור הראשון שלחמו עם ישראל בימי משה, והם המצירים ומכאיבים את ישראל בגוף ונפש, ועל אלו הדורות התפלל משרע\"ה כמבואר במדרש הנ\"ל, ועד\"ז יתבארו רמז הכתובים על לעתיד ויאמר משה אל יהושע בחר לנו אנשים וצא הלחם בעמלק מחר, יש מחר לאחר זמן, רמז לו כי לא יושלם תכלית מלחמה זו עכשיו, אף שיעלה בידו להחליש את עמלק ואת עמו במלחמה זו, אבל עוד יתגבר עמלק ללחום עם ישראל לדורות, עד דורו של משיח שאז יהי' התגברות עמלק גדולה וחזקה מאוד וילחמו עם מלך המשיח, והם המה הערב רב שבימינו ששורשם מעמלק ועושים כמעשה עמלק אשר קרך בדרך להחטיא באביזרייהו דעריות בהרהורי עבירה ומחשבות מינות ר\"ל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 170,
      "char_length": 605,
      "timestamp": "2025-02-06T19:32:55.082373"
    },
    {
      "id": "beshalach2_p171",
      "text": "ולז\"א והי' כאשר ירים משה ידו וגו', והי' לשון עתיד, שאז במלחמה הראשונה בוודאי לא גבר עמלק, כי גדול כחו של משרע\"ה ויהושע להחלישו אמנם ירמוז הכתוב על מלחמת עמלק בדורות העתידים, ואתפשטותא דמשה בכל דרא ודרא, ות\"ח גדול הדור יש בו ניצוץ משרע\"ה כמ\"ש רז\"ל בכ\"מ משה שפיר קאמרת והוא הלוחם בכוחות עמלק להחלישם, וכמבואר בדברי הזוה\"ק לעיל מלחמה לה' בעמלק מדר דר דא משה, דלית דור פחות מס' רבוא ודא משה, וזה אומרו והי' כאשר ירים משה את ידו וגבר ישראל וכאשר יניח ידו וגבר עמלק, וירמוז על דור העתיד שיהי' ההסתרה גדולה מאוד וכאשר יניח משה ידו מלשעבד לבן של ישראל לאביהם שבשמים אז ח\"ו וגבר עמלק, והקשו בגמ' וכי ידיו של משה עושות מלחמה או שוברות מלחמה, וכוונת הקושיא לפי בחינת הדור, שיהי' ההסתרה גדולה כ\"כ שלא יראו שידיו של משה עושים מלחמה או שוברים מלחמה, ותירצו אלא לומר לך כל זמן שישראל מסתכלים כלפי מעלה ומשעבדים את לבם לאביהם שבשמים היו מתגברים וכו' ואז בוודאי ידיו של משה עושות מלחמה, ואם לאו ח\"ו אין כח בידיו של משה לסייע בידינו וללחום בעדינו, וכמ\"ש במדרש (אסתר רבתי פ\"ז סי\"ח) כשנגזרה גזירת כלי' ר\"ל על ישראל רץ אליהו זל\"ט אצל משה רבינו שיבקש רחמים לבטל הגזירה, אמר לו משה כלום יש אדם כשר באותו הדור א\"ל יש ושמו מרדכי, אמר לו לך והודיעו כדי שיעמיד הוא משם בתפלה, ואני מכאן ונבקש רחמים עליהם לפני הקב\"ה, וע\"י שכנס מרדכי כל היהודים לעוררם אל התשובה היו מתגברים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 171,
      "char_length": 1245,
      "timestamp": "2025-02-06T19:32:55.393936"
    },
    {
      "id": "beshalach2_p172",
      "text": "ובזה יבואר דברי המכילתא הנ\"ל (בקושיא י\"ג) כי מחה אמחה את זכר עמלק, ר\"א המודעי אומר מחה לו ולכל תולדותיו, אמחה לו ולכל הדור ההוא, וירמוז על ימות המשיח שיעמדו בגלגול הדור ההוא עמלקים הראשונים שלחמו עם ישראל בצאתם ממצרים, ועמהם ילחום המלך המשיח ויגאל אותנו מהם, השי\"ת יעזור שיהי' ע\"י מלך המשיח ולא ע\"י מלחמות האומה\"ע שהוא צרה גדולה לכלל ישראל ר\"ל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 172,
      "char_length": 344,
      "timestamp": "2025-02-06T19:32:56.010795"
    },
    {
      "id": "beshalach2_p173",
      "text": "והנה בוודאי יעשו ישראל תשובה לפני גאולה השלימה, כמ\"ש הרמב\"ם ז\"ל (ה' תשובה פ\"ז ה\"ה) אין ישראל נגאלים אלא בתשובה, וכבר הבטיחה תורה שסוף ישראל לעשות תשובה בסוף גלותן ומיד הן נגאלים שנאמר והי' כי יבאו עליך כל הדברים וגו' ושבת עד ה' אלקיך ושב ה' אלקיך וגו' עכ\"ל, א\"כ מי שיזכה אל הגאולה בוודאי יעשה תשובה, אבל מי יודע אם יזכה לזה, ומבואר במדרשי חכז\"ל שלפני הגאולה יהיו ג' ימי אפילה כמו שהי' במצרים ורשעי הדור ימותו ויכרתו, וע\"כ טוב יותר להקדים איזה בחי' של תשובה שיהי' לנו זכותים ולא נדחה ח\"ו באותן ימי האפילה, ובעוה\"ר שפלות הדור גדול מאוד, ולא הי' עוד כמוהו ועל הדור הזה אמר ר' יוחנן יתי ולא אחמיני', שבוודאי לא מצער הגוף הי' מפחד, אבל השיג שפלות המצב ברוחניות של הדור הזה, ולז\"א ולא אחמיני', שלא יוכל לסבול צער השפלות ולטעם זה לא רצה לראותו, ובעוה\"ר אנו הגענו לדור הזה שר' יוחנן לא רצה לראותו, ואין לנו להשען אלא על אבינו שבשמים, ולבקש רחמים מלפניו ית' שיוציאנו מאפילה לאורה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 173,
      "char_length": 871,
      "timestamp": "2025-02-06T19:32:56.202511"
    },
    {
      "id": "beshalach2_p174",
      "text": "ולדרכינו יל\"פ בדברי המדרש הנ\"ל (קושיא ה') ויבא עמלק הה\"ד לא שלותי ולא שקטתי ולא נחתי ויבא רוגז, לא שלותי מגזירה ראשונה שגזר פרעה עלי שנא' וימררו את חייהם, והעמיד לו הקב\"ה גואל זה מרים, ולכאורה איזה גאולה הי' ע\"י מרים, וכשנולדה התחילה השעבוד וקראו לה מרים ע\"ש המרירות, אמנם מרים בישרה בנבואה ואמרה עתידה אמי שתלד בן שיגאל את ישראל, ובכובד הגלות וקושי השעבוד הי' ג\"ז נחמה לבנ\"י שידעו שכבר נולד הגואל וקרבה עת גאולתם, ועכשיו ההסתרה גדולה ומרה כ\"כ שג\"ז לא נודע, וכמ\"ש הנביא פתאום יבוא אל היכלו האדון אשר אתם מבקשים, והגאולה תהי' בהיסח הדעת, ועכ\"פ ע\"י נבואתה של מרים הרגישו ישראל בחי' הגאולה קצת, ולז\"א והעמיד להן גואל זה מרים, ואעפי\"כ לא הי' להם מנוחה כי עדיין לא תיקנו ולא עשו תשובה שיהיו ראויים להיגאל, ולז\"א ולא שקטתי מגזירה שני' אם בן הוא והמתן אותו, והעמיד הקב\"ה גואל זה אהרן ע\"ש ההריון, ויל\"פ ע\"ד הכתוב ויהי כי יראו המילדות את האלקים ויעש להם בתים, ודרשו רז\"ל בתי כהונה ולוי' מיוכבד ובתי מלכות ממרים, והנה ידוע דהבוית\"ש ברוב רחמיו וחסדיו מקדים לחשב זכות העתיד לטובתן של ישראל, ומסגולת העבודה של כהן גדול לשכך כעס וחמה ולהמתיק את הדינים, כמ\"ש בפייט ליוכ\"פ ובקרבנותיו הפרת את כעסך, והקדים הבוי\"ת לישראל זכותו של אהרן לבטל גזירת אם בן הוא והמתן אותו, ולז\"א והעמיד הקב\"ה גואל זה אהרן ע\"ש ההריון, דגזירה זו הי' לבטל ההריון, שיפרשו ישראל מד\"א, ובזכותו של אהרן נתבטלה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 174,
      "char_length": 1263,
      "timestamp": "2025-02-06T19:32:56.623156"
    },
    {
      "id": "beshalach2_p175",
      "text": "ובכל זאת לא נחתי מגזירה שלישית שגזר ואמר כל הבן הילוד היאורה תשליכוהו, והעמיד הקב\"ה גואל ע\"ש המים זה משה שנא' כי מן המים משיתוהו, שבזכותו של משה נצולו ישראל מגזירת המים כאמרז\"ל במד\"ר ובגמ' סוטה (דף י\"ב ע\"ב) והיינו דקאמר שש מאות אלף רגלי העם אשר בקרבו בשבילי נצלתם כולכם, אבל עדיין לא הי' להם הצלה גמורה וגאולה שלימה, ולמה לא שלותי ולא שקטתי ולא נחתי, והרי העמיד הקב\"ה לישראל גואלים צדיקים משה אהרן ומרים, ולזה סיים ויבא רוגז זה עמלק, היינו שרו של עמלק הס\"ם כדברי האלשיך הק', ולכן קראו בלשון רוגז ע\"ד מ\"ש רז\"ל (ברכות דף ה' ע\"א) לעולם ירגיז אדם יצ\"ט על יצה\"ר, ופירשתי בכוונת הלשון לעולם ירגיז, דהול\"ל לעולם יתגבר יצ'\"ט על יצה\"ר, אמנם בכל דין ומריבה מצוה לבצוע ולתווך השלום ע\"י פשרה, כאמרז\"ל (סנהדרין דף ו' ע\"ב) איזהו משפט שיש בו צדקה הוי אומר זה ביצוע, אולם במלחמת היצר אינו כן. שאם יעשה האדם פשרה עמו לסוף נופל ברשתו לגמרי ח\"ו, כאמרז\"ל היום אומר לו עשה כך, ולמחר אומר לו עשה כך וכו' עד שאומר לו לך ועבוד ע\"ז והולך ועובד, וז\"ש לעולם ירגיז אדם יצ\"ט על יצה\"ר שיהי' בבחי' רוגז ומלחמת תמידית ולא יבקש דרך הפשרה והשלו', וכמו\"כ כאן ויבא רוגז זה עמלק היינו שרו של עמלק הס\"ם והוא היצה\"ר ונקרא רוגז שהמלחמה עמו תמידית ומחוייבת.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 175,
      "char_length": 1116,
      "timestamp": "2025-02-06T19:32:57.217076"
    },
    {
      "id": "beshalach2_p176",
      "text": "ולז\"א ויבא רוגז, וכן ויבא עמלק דהוא\"ו של ויבא פירושו שבא וחוזר ובא, וכמו שדרשו רז\"ל (ב\"ר פ' ס\"ו סי' ג') ויתן ויחזור ויתן. שהוא\"ו להוסיף בא, וכן היצה\"ר אף אם יתגבר עליו האדם פ\"א, הוא חוזר ובא להלחם בתחבולות חדשים ובלבוש חדש אשר לא שערום אבותינו, ויתורץ קושית הגו\"א מדוע לא אמר הכתוב ויצא עמלק וכמ\"ש ויצא סיחון לקראת ישראל, ובמלחמה יצדק יותר לשון יציאה, ולדרכינו מלחמה זו שונה משאר מלחמות שבעולם, דהנה סיחון הוכרח לצאת ממקומו לקראת ישראל כדי שיפגשם בקירוב מקום עד שיוכל לערוך מלחמה אתם, משא\"כ עמלק היינו הס\"ם אינו צריך לצאת למלחמה כי יכול לערוך מלחמה ממקום שהוא, גם יש לו שלוחים הרבה מסיתים ומדיחים ומלאכים רעים הנבראים מעבירות והמה מסיתים לחטוא עוד, ונמצאים בכל מקום וע\"כ לא כתיב ויצא, כי נשאר גם במקומו לפעול פעולתו ומגיע בכל מקום מבלי שיצא למלחמה, וז\"ש רז\"ל במדרש לא שלותי ולא שקטתי ולא נחתי, ולמה הרי העמיד הקב\"ה גואלים לישראל, ולז\"א ויבא רוגז שהי' מתמיד ובא רוגז של עמלק והתגבר להחטיא את ישראל, וע\"כ לא הי' לישראל מרגוע מהצרות, ולא אמר בזו והעמיד להם גואל כבגזירה ראשונה ושני' וכו', שזה יהי' רק לעתיד כשרות הטומאה תעביר מן הארץ בב\"א.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 176,
      "char_length": 1036,
      "timestamp": "2025-02-06T19:32:57.756677"
    },
    {
      "id": "beshalach2_p177",
      "text": "ונבוא לבאר דברי המדרש רות רבתי וזאת לפנים בישראל וגו' לשעבר היו מקלסין על הגאולה וכו' ועכשיו על התמורה שנא' וימירו את כבודם וגו' (הדקדוקים כבר נפרטו לעיל קושיא ב'), ואפ\"ל דמ\"ש ועכשיו על התמורה, רמזו חז\"ל בדרשותיהם על הזמן של עכשיו בעיקבא דמשיחא, לא על חטא העגל שכבר הי' מלפנים, ומפני דקנין זה של בועז הי' שורש השתלשלות מלכות בית דוד ושורש משיח, ע\"כ תיארו חז\"ל ע\"ד רמז הכתובים מה שיארע לישראל בימי הגואל, וז\"ש וזאת לפנים בישראל ר' חנינא פתר קרא בגו אפיא דישראל, וגירסת היפה ענף שינוי אפיא, פי' ששינו פניהם ממה שהיו בתחילה, וי\"מ על פני העדה והחשובים, ובעוה\"ר כולהו איתנייהו שכללות הדור שינו פניהם, וגם פני העדה והחשובים נסוגו אחור, לשעבר היו מקלסין על הגאולה שנא' זה קלי ואנוהו, שהי' התגלות גדול וכ\"א מראה באצבע ואומר זה קלי, ועכשיו על התמורה שנא' וימירו את כבודם וגו', שמחליפין כבוד שמים בחילול ש\"ש, ובעוה\"ר מקלסין להקב\"ה על התמורה זו, ונתהפכו הפנים והדעות מקצה אל הקצה ממה שהי' בדורות הראשונים. וכשיעזור השי\"ת ויזריח עלינו אור חדש ורוח טהרה לפני ביאת המשיח, אז נודה לה' ויהיו ישראל מקלסין על התמורה האמיתית שיתחלף הכל לטובה, ונזכה להתגלות גדולה יותר מבקרי\"ס, וג\"ז נרמז בדרז\"ל ועכשיו על התמורה, שבימי הגואל נזכה לקלס להקב\"ה על התמורה לטובה, שבערך שפלות מצבינו של עכשיו, יהי' ההתחלפות והתמורה גדולה ונסיי, וזה רמזו חז\"ל במד\"ר בעוה\"ז אמרתם לפני פעם אחת זה קלי, דזה מורה על בחי' ההתגלות, דכ\"א מראה באצבע כאמרז\"ל ראתה שפחה על הים וכו', אבל לע\"ל אתם אומרים דבר זה ב' פעמים, שתהי' ההתגלות בישראל גדולה פי כמה ותתרבה הדעת והשגת אלקית עד אין חקר, והביאו ראי' ממ\"ש ואמר ביום ההוא הנה אלקינו זה קוינו לו ויושיענו, זה ה' קוינו לו נגילה ונשמחה בישועתו, כי מלת ההוא לשון נסתר, והזה מורה על התגלות, ולעתיד ישיגו ישראל כי גם בתוך ההסתרה הי' ה' עמנו ויהיו מקלסים להשי\"ת גם על העבר ובקרי\"ס היו ישראל מקלסין זה קלי וגו' אלקי אבי וארוממנהו, מורה על ידיעת אלקית מקבלת האבות ולע\"ל יאמרו ישראל הנה אלקינו זה, שתהי' התגלות כבודו ית' מורגש לכל ישראל ויזכו לידיעה עצמית, והשי\"ת יעזור שנזכה לראות הישועה האמיתית בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו במהרה בימינו אמן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 177,
      "char_length": 1954,
      "timestamp": "2025-02-06T19:32:58.245023"
    },
    {
      "id": "beshalach2_p178",
      "text": "אז ישיר משה ובני ישראל את השירה הזאת וגו', יל\"ד מה שפרט הכתוב משה ובנ\"י, ומשרע\"ה נמי בכלל ישראל, ובשירת הבאר נאמר אז ישיר ישראל, ולא אמר משה וישראל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 178,
      "char_length": 148,
      "timestamp": "2025-02-06T19:32:59.170010"
    },
    {
      "id": "beshalach2_p179",
      "text": "ב) במדרש רבה (פ' כ\"ג סי' ו') אז ישיר משה הה\"ד (תהלים נ\"ט) ואני אשיר עוזך זו עוזו של ים, וארנן לבקר חסדך זו בוקרו של מתן תורה עכ\"ד המדרש וצ\"ב הקישור.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 179,
      "char_length": 148,
      "timestamp": "2025-02-06T19:32:59.288753"
    },
    {
      "id": "beshalach2_p180",
      "text": "ג) במד\"ר (פ' כ\"ג סי' ד') אז ישיר משה וגו', הה\"ד (משלי ל\"א) פיה פתחה בחכמה ותורת חסד על לשונה, מיום שברא הקב\"ה את העולם ועד שעמדו ישראל על הים לא מצינו אדם שאמר שירה להקב\"ה אלא ישראל, ברא אדה\"ר וכו' הציל אברהם מכבשן האש ומן המלכים ולא אמר שירה, וכן יצחק וכו' וכן יעקב מן המלאך וכו' כיון שבאו ישראל לים ונקרע להם מיד אמרו שירה לפני הקב\"ה שנא' אז ישיר משה ובני ישראל, הוי פיה פתחה בחכמה עכ\"ד המדרש, וראוי להבין טעמא מאי מדוע אבות הראשונים לא אמרו שירה על הנס שנעשה להם, וישראל על הים אמרו שירה, גם צ\"ב סיום דברי המדרש הוי פיה פתחה בחכמה, מדוע יחס זה אל מעלת החכמה דייקא.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 180,
      "char_length": 567,
      "timestamp": "2025-02-06T19:32:59.417899"
    },
    {
      "id": "beshalach2_p181",
      "text": "ויתבאר בהקדם דברי הגמ' סוטה (י\"ג ע\"א) בא וראה כמה חביבות מצות על משרע\"ה, שכל ישראל כולן נתעסקו בביזה והוא נתעסק במצות, שנא' חכם לב יקח מצות עכ\"ד הגמ', והמהרש\"א ז\"ל דקדק אמאי תיארו אותו בתואר חכם דייקא על עשי' זו, הול\"ל צדיק או חסיד, גם יל\"ד בלישנא דגמ' שכל ישראל כולן נתעסקו בביזה, ותרי ריבויי כל כולן למאי אתי, וסגי שיאמר כל ישראל, והטו\"ז בה' ר\"ה פי' מ\"ש בנוסח התפלה מלוך על כל העולם כולו. דטעם הכפל, שלא נטעה לפרש דרובו ככולו, לז\"א כל העולם כולו, ר\"ל כולו ממש עיי\"ש, וכמו\"כ הכא צ\"ב כוונת הכפל, ונקדים עוד דברי המדרש בפ' ואתחנן עה\"פ אעברה נא ואראה, אמר לו הקב\"ה למשה כתבתי עליך שחכם אתה שנא' חכם לב יקח מצות ואתה רוצה לכנס לארץ עכ\"ד המדרש וצ\"ב.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 181,
      "char_length": 645,
      "timestamp": "2025-02-06T19:32:59.739912"
    },
    {
      "id": "beshalach2_p182",
      "text": "ונל\"פ דהנה לכאורה ראוי להבין מ\"ט שביק משרע\"ה העסק בביזה שהי' ג\"כ מצוה ונאמרה להם מפי הגבורה כדי שלא יאמר אותו צדיק וכו', אך ידוע שא\"א במציאות שיקיים כל אדם התרי\"ג מצות כולן דישנם מצות שנוהגים בכהנים לבד, ומי שאין לו בית איך יקיים מצות מעקה וכדומה, אלא שכל ישראל מתקשרים ומתאחדים כחדא ע\"י התוה\"ק, וע\"כ יש לכל או\"א חלק גם במעשה המצות של חבירו, ולטעם זה כתב האריז\"ל לומר בכל מעשה המצות ביחודא שלים בשם כל ישראל, ופי' בספה\"ק כל ישראל ערבים זל\"ז, שהם כמעורבים ומקושרים כגוף א' ויש לכל או\"א חלק במעשה המצות של חבירו ואולי שכח זה קבלו ישראל רק במתן תורה, שע\"י התוה\"ק נתקשרו כולן כחדא, דאילולא זה א\"א במציאות שיקיים כל אחד התרי\"ג מצות כולם, ועכ\"ח שבנתינת התורה ניתן להם כח הערבות וההתקשרות, אבל לפני מ\"ת לא הי' להם כח הערבות כי לא הי' הכרח אליו, אמנם כבר גילה הקב\"ה למשרע\"ה וא\"ל בהוציאך את העם ממצרים תעבדון את האלקים על ההר הזה, שבזכות שעתידים לקבל את התורה יהיו נגאלים, והפר\"ד הוכיח מכאן דלטובה הקב\"ה דן ע\"ש העתיד עיי\"ש, וק\"ז הייטב לב זלה\"ה כתב דלא צריכנא לטעמא דע\"ש העתיד נגאלו, אלא מפני שקיבלו על עצמם בעודם במצרים, שלכשיצאו יקבלו עול התורה והמצות נחשב להם הקבלה כמעשה מיד עייש\"ד.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 182,
      "char_length": 1076,
      "timestamp": "2025-02-06T19:33:00.086293"
    },
    {
      "id": "beshalach2_p183",
      "text": "ובזה יתבאר לעניננו כי משרע\"ה עסק בעצמות יוסף לטעם שאמרז\"ל כבודו בגדולים יותר, ושביק העסק בביזה אף שהי' ג\"כ מצו' גדולה מ\"מ סמך על ההתכללות והתקשרות עם כלל ישראל, שהם קיימו מצו' זו ונחשב גם הוא עמהם, ולזה תיארו אותו חז\"ל במעשה זו בתואר חכם, ודרשו הכתוב חכם לב יקח מצות על משרע\"ה שעסק בעצמות יוסף, דאיזה חכם הרואה את הנולד, וע\"ש העתיד שעתידים ישראל לקבל את התורה, נחשב להם משעת הקבלה כאילו כבר עשו, נמצא כל ישראל מקושרים ומתאחדים כאחד ע\"י התוה\"ק ויש לו חלק במעשה המצוה של כל א' מישראל, ולז\"א חכם לב יקח מצות, שע\"י בחי' החכמה זכה למצות הרבה, העסק בעצמות יוסף גם הי\"ל חלק במצות של כל ישראל, כי משרע\"ה הי' כלולים בו כל נשמות ישראל כידוע, וכל ישראל כלולים כחדא ע\"י התוה\"ק, ולדרכנו יובן כפילת הלשון שכל ישראל כולן נתעסקו בביזה, ואולי ירמוז על ההתכללות, שכל ישראל כולם כלולים כחדא ונתעסקו בביזה, ועי\"ז הי\"ל חלק עמהם, ועי\"ז חכם לב יקח מצות כנ\"ל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 183,
      "char_length": 835,
      "timestamp": "2025-02-06T19:33:00.653878"
    },
    {
      "id": "beshalach2_p184",
      "text": "ועד\"ז יתבאר אידך דברי המדרש א\"ל הקב\"ה למשה כתבתי עליך שחכם אתה שנא' חכם לב יקח מצות, ואתה רוצה ליכנס לארץ, דהנה אמרז\"ל בטעם שהשתוקק משרע\"ה ליכנס לארץ, וכי לאכול מפרי' הוא צריך, אלא כדי לקיים מצות התלויות בארץ אמנם ע\"י ההתכללות בכלל כל ישראל הרי יש לו חלק עמהם, ולז\"א לו הקב\"ה כתבתי עליך שחכם אתה שנא' חכם לב יקח מצות, וע\"י בחי' החכמה זכה להיות חלק במעשה המצות של כל ישראל, כי משרע\"ה בחי' הדעת של כל ישראל וכולם כלולים בו, ומעתה אין מוכרח כניסתך לארץ בשביל לקיים מצות התלויות בארץ שבלא\"ה יהי' לך חלק במעשיהם, כי הכל מכוחך וכלולים בך בשורש.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 184,
      "char_length": 538,
      "timestamp": "2025-02-06T19:33:01.141147"
    },
    {
      "id": "beshalach2_p185",
      "text": "נחזור לעניננו לבאר דברי המדרשים (בפ' שירה) אז ישיר משה וגו' הה\"ד פיה פתחה בחכמה וגו', מיום שברא הקב\"ה את העולם וכו' לא מצינו אדם שאמר שירה להקב\"ה אלא ישראל וכו' הוי פיה פתחה בחכמה, ולדרכנו אפ\"ל עפימ\"ש רז\"ל לא כל הרוצה לומר שירה אומר והנה האבוה\"ק לגודל ענותנותם ושפלותם בעיני עצמם חשבו שאינם ראויים לומר שירה להקב\"ה, אמנם משרע\"ה אף שלא חשב א\"ע כדאי, מ\"מ חשב שלצד התכללותו עם כל ישראל ובצירוף זכותם של כל ישראל יוכל לומר שירה להקב\"ה משא\"כ אבות הראשונים אדה\"ר ואברהם יצחק ויעקב לא יכלו לסמוך על כח ההצטרפות, ולזה נמנעו מלומר שירה מחמת היראה כנ\"ל, ולז\"א הכתוב אז ישיר משה ובני ישראל את השירה הזאת, שמה שעלה בלבו לומר שירה, הי' בשביל שנצטרפו אליו כל ישראל, וגם בני ישראל סמכו על זה שיצטרף זכותם של כל או\"א ע\"י התכללותם במשרע\"ה וכח התוה\"ק שקבלו עליהם, ולזה סיימו במדרש הוי פיה פתחה בחכמה, שע\"י בחי' החכמה איזהו חכם הרואה הנולד השיגו כח ההתכללות משה רבינו וכל ישראל כאחד ולזה פתחו פיהם לומר שירה, ובזה יתבאר דברי המדרש ואני אשיר עוזך זו עוזו של ים וארנן לבקר חסדך זו בוקרו של מתן תורה, שסמכו על כח הערבות של מ\"ת ופתחו פיהם לומר שירה והבן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 185,
      "char_length": 1031,
      "timestamp": "2025-02-06T19:33:01.421855"
    },
    {
      "id": "beshalach2_p186",
      "text": "אז ישיר משה ובני ישראל את השירה הזאת לה' וגו', במד\"ר (פ' כ\"ג סי' ד') הה\"ד (משלי ל\"א) פיה פתחה בחכמה ותורת חסד על לשונה, מיום שברא הקב\"ה את העולם, ועד שעמדו ישראל על הים, לא מצינו אדם שאמר שירה להקב\"ה אלא ישראל, ברא אדה\"ר ולא אמר שירה, הציל אברהם מכבשן האש ומן המלכים ולא אמר שירה, וכן יצחק וכו' וכן יעקב וכו', כיון שבאו ישראל לים ונקרע להם, מיד אמרו שירה לפני הקב\"ה שנאמר אז ישיר משה ובני ישראל, אמר הקב\"ה לאלו הייתי מצפה, ואין אז אלא שמחה שנאמר (תהלים קכ\"ו) אז ימלא שחוק פינו עכ\"ד המדרש, וצ\"ב מדוע באמת לא אמרו האבוה\"ק שירה, ולהלן במדרש (סי' ה') תשורי מראש אמנה וכו', א\"ר שמעון בר אבא בשביל האמנה שהאמין אברהם להקב\"ה שנאמר והאמין בה', ממנה זכו ישראל לומר שירה על הים שנאמר אז ישיר משה, הוי תשורי מראש אמנה עכ\"ד המדרש, הרי שאמרו ישראל שירה בזכות אברהם, ואיך הוא בעצמו לא אמר והוא פלא.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 186,
      "char_length": 784,
      "timestamp": "2025-02-06T19:33:01.920488"
    },
    {
      "id": "beshalach2_p187",
      "text": "ב) עוד איתא במדרש (פ' כ\"ג סי' ז') הה\"ד (תהלים ס\"ח) קדמו שרים אחר נוגנים א\"ר יוחנן בקשו המלאכים לומר שירה לפני הקב\"ה באותו הלילה שעברו ישראל את הים ולא הניחן הקב\"ה א\"ל לגיונותי נתונין בצרה ואתם אומרים לפני שירה, הה\"ד ולא קרב זה אל זה כל הלילה, כמה דתימא (ישעי' ו') וקרא זה אל זה ואמר, וכיון שיצאו ישראל מן הים באו המלאכים להקדים שירה לפני הקב\"ה א\"ל הקב\"ה יקדמו בני תחלה הה\"ד אז ישיר משה, אז שר לא נאמר אלא אז ישיר שהקב\"ה אמר ישיר משה ובני ישראל תחלה, וכן דוד הוא אומר קדמו שרים אלו ישראל שעמדו על הים דכתיב אז ישיר משה, אחר נוגנים אלו המלאכים ולמה כך, אמר הקב\"ה למלאכים לא מפני שאני משפיל אתכם אני אומר שיקדמו תחלה, אלא מפני שב\"ו יאמרו תחלה עד שלא ימות אחד מהם, אבל אתם כל זמן שאתם מבקשים אתם חיים וקיימים, משל למלך שנשבה בנו והלך והצילו והלכו בני הפלטין מבקשין לקלס למלך ובנו מבקש לקלסו אמרו לו אדונינו מי יקלסך תחלה א\"ל בני, מכאן ואילך מי שרוצה לקלסני יקלסני, כך כשיצאו ישראל ממצרים וכו' עכ\"ד המדרש, לכאורה רישא לאו סיפא דבתחלה מבאר הטעם שישראל יקדמו תחלה לא מפני שאני משפיל אתכם אלא עד שלא ימות אחד מהם, ובדמיון המשל שהביא אח\"כ לא שייך טעם זה, שיקלס בנו קודם שמא ימות, דגם באחרים איכא חשש מיתה וע\"כ הטעם משום חשיבות לא כמו שאמר ברישא.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 187,
      "char_length": 1136,
      "timestamp": "2025-02-06T19:33:02.329101"
    },
    {
      "id": "beshalach2_p188",
      "text": "ג) במדרש ילקוט (שה\"ש רמז תתקפ\"ח) שעלו מן הרחצה, שהטיף להם הקב\"ה טל ונרחצו מעונותיהם, שכלם מתאימות, שהיו מותאמים בין שכינה למלאכים, ושכולה אין בהם שלא ניזוק אחד מהם ולא היו בהם בעלי מומים, עכ\"ד המדרש וצ\"ב הקישור.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 188,
      "char_length": 211,
      "timestamp": "2025-02-06T19:33:02.900703"
    },
    {
      "id": "beshalach2_p189",
      "text": "ד) עוד במדרש (פ' כ\"א סי' ג') ויאמר ה' אל משה מה תצעק אלי, הה\"ד (ישעי' ס\"ה) והי' טרם יקראו ואני אענה שהקב\"ה וכו', אבל הקב\"ה אינו כן עד שלא ידבר אדם הוא יודע מה בלבו וכו', לכך כתיב והי' טרם יקראו ואני אענה, לכך נאמר מה תצעק אלי עכ\"ד המדרש, והקשה היפ\"ת דא\"כ אין צורך לעולם להתפלל בפה דהקב\"ה יודע בקשתו ותסגי במחשבה בלב, והלכה פסוקה שצריך להתפלל בדיבור פה דייקא.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 189,
      "char_length": 358,
      "timestamp": "2025-02-06T19:33:03.043973"
    },
    {
      "id": "beshalach2_p190",
      "text": "ה) עוד במדרש (פ' כ\"א סי' ד') הה\"ד (תהלים ס\"ה) שומע תפלה עדיך כל בשר יבואו, מהו שומע תפלה, א\"ר פנחס בשם ר\"מ ור' ירמי' בשם ר' חייא בר אבא בשעה שישראל מתפללין אין אתה מוצא שכולן מתפללין כאחד אלא כל כנסי' וכנסי' מתפללת בפני עצמה וכו', ומאחר שכל הכנסיות גומרת כל התפלות, המלאך הממונה על התפלות נוטל כל התפלות שהתפללו בכל הכנסיות כולן, ועושה אותן עטרות ונותנן בראשו של הקב\"ה שנאמר עדיך כל בשר יבואו ואין עדיך אלא עטרה שנאמר וכו', התחיל משה אף הוא מתפלל לפני המקום, א\"ל הקב\"ה למשה מה אתה עומד ומתפלל כבר התפללו בני ושמעתי תפלתן שנאמר מה תצעק אלי עכ\"ד המדרש, לכאורה הוא סתירה מני' ובי' דברישא אמר שהמלאך ממתין על כל תפלות ישראל ועושה אותן עטרה, וא\"כ מ\"ט לא המתין הקב\"ה על תפלת משרע\"ה ואמר לו כבר התפללו בני, והרי ממתינין להצטרף תפלתן של כל ישראל, ומכ\"ש תפלת הצדיקים שהקב\"ה מתאוה לתפלתן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 190,
      "char_length": 778,
      "timestamp": "2025-02-06T19:33:03.257784"
    },
    {
      "id": "beshalach2_p191",
      "text": "ונתחיל בביאור דברי המדרש הנ\"ל (קושיא ב') שהקדים הקב\"ה שירת ישראל לפני המלאכים לטעם חשש המיתה הנוהגת בבשר ודם ואינו במלאכים, ובהמשל שהסמיך אליו מבואר דטעם הקדמתן משום יתרון מעלתם וחיבתן, ויתבאר בהקדם דברי רש\"י ז\"ל (ר\"פ תשא) שהקשה איך אפשר שבב' המנינים שנמנו ישראל בשנה ראשונה בתשרי, ובאייר שנה שני', הי' מספרם שוה בצמצום ת\"ר אלף וג' אלפים ותק\"נ, וא\"א שלא היו בשעת מנין הראשון בני י\"ט שנה שלא נמנו ובשני' נעשו בני כ', תשובה לדבר אצל שנות האנשים בשנה א' נמנו, אבל למנין יציאת מצרים היו ב' שנים וכו' עיי\"ש, והרמב\"ן ז\"ל תמה על דבריו דאיך יתכן שיהי' קהל גדול כמותו, ולא ימותו בו בחצי שנה למאות ולאלפים, והנה לפי דברי הרב עמדו בשבעה חדשים ולא מת א', וכתיב ויהי אנשים אשר היו טמאים לנפש אדם וכו' עיי\"ש תירוצו, ובספה\"ק פנים יפות מביא מדברי המדרש דלא הי' מיתה נוהגת בישראל כלל בזמן ההוא, זולת באותן המפורשין בכתוב נדב ואביהו, ואחר חטא המרגלים נגזרה גזירת המיתה על דור המדבר, במדבר הזה יתמו ושם ימותו, אבל באותו הזמן שבין מנין ראשון לשני לא מת א' מישראל, וא\"כ הקושיא מעיקרא ליתא.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 191,
      "char_length": 968,
      "timestamp": "2025-02-06T19:33:03.632332"
    },
    {
      "id": "beshalach2_p192",
      "text": "ויתכן דמעלה זו שנעדר מהם המיתה, לא הי' רק לישראל אבל הערב רב לא זכו לזה, וכמ\"ש בגמרא (פסחים דף ס\"ח ע\"א) עולא רמי כתיב (ישעי' כ\"ה) בלע המות לנצח וכתיב (שם ס\"ה) כי הנער בן מאה שנה ימות, לא קשיא כאן בישראל כאן באומות העולם עכ\"ד הגמרא, ואף שהאומה\"ע יהיו כולם גרים גרורים לע\"ל, אבל מעלה זו שיעדר המיתה מהם לא ישיגו, וכמו\"כ הע\"ר שנתגיירו לא זכו למעלה זו, והנה וודאי שכל ישראל אמרו שירה ביחד והקדימו למלאכים ואף הע\"ר, דראתה שפחה על הים מה שלא ראה יחזקאל בנבואה (מכילתא), ואף עוברין שבמעי אמן אמרו שירה, ומעתה א\"ש דברי המדרש הנ\"ל אמר הקב\"ה למלאכים לא מפני שאני משפיל אתכם וכו' יקדמו בני תחלה, אלא מפני שבשר ודם יאמרו תחלה עד שלא ימות אחד מהם, וזהו טעם על הקדמת הע\"ר שהי' המיתה נוהגת בהם, אבל בישראל ליתא לטעם זה, וטעם הקדמתן מפני מעלתן וחיבתן, דגדולים צדיקים יותר ממה\"ש, וזה הטעם מבואר בהמשל שאמר המלך בני יקלס תחלה וכו', ובזה יבואר כוונת דברי המדרש שה\"ש, שעלו מן הרחצה וכו' ונרחצו מעונותיהם, שכולם מתאימות שהיו מותאמים בין שכינה למלאך, ונתעלו יותר ממה\"ש, וע\"כ הקדימו לומר שירה. ושכולה אין בהם שלא ניזוק א' מהם, וליתא לחששא שמא ימות א' מהם, וע\"כ טעם הקדמתן לגודל מעלתם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 192,
      "char_length": 1061,
      "timestamp": "2025-02-06T19:33:04.098931"
    },
    {
      "id": "beshalach2_p193",
      "text": "ונקדים מ\"ש. החיד\"א זלה\"ה (וק\"ז הישמח משה זלה\"ה בתפלה למשה קמ\"ו פי' כן מד\"ע) לפרש הפסוק תהלת ה' ידבר פי ויברך כל בשר שם קדשו לעולם ועד דהנה הקב\"ה הוא בוחן כליות ולב ויודע במחשבת אדם, א\"כ למה צריכין להתפלל בפה, ופירשו דבאמת לגבי הקב\"ה כביכול אין צורך לזה רק כדי שיתעוררו גם אחרים מקולו ויודו וישבחו להשי\"ת, כמ\"ש כבוד מלכותך יאמרו וגו' להודיע לבני האדם גבורותיו וז\"פ הפסוק תהלת ה' ידבר פי, ויברך כל בשר שם קדשו, כדי שגם אחרים יברכו את השי\"ת על ידו, וזה הוא התכלית הבריאה שיהיו משפיעין גם על אחרים, וכמו שפי' בספה\"ק בינה לעיתים אם למדת תורה הרבה אל תחזיק טובה לעצמך כי לכך נוצרת, היינו שלא תחזיק לעצמך את התורה שלמדת, אלא תשפיע גם לאחרים, כי לכך נוצרת שזהו תכלית הבריאה, עכ\"פ זה הוא הטעם שצריך להתפלל בפה כדי שיתעוררו אחרים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 193,
      "char_length": 720,
      "timestamp": "2025-02-06T19:33:04.649252"
    },
    {
      "id": "beshalach2_p194",
      "text": "והנה אצל הים לא היו צריכין לזה לעורר כל ישראל לתפלה, שהרי היו בעת צרה, כמו שדרשו רז\"ל (במד\"ר פ' כ\"א סי' ה') שהקריב את לבן של ישראל לאביהם שבשמים, ומעצמן ג\"כ מתפללין ולא הי' צורך לעוררן, ולגבי הקב\"ה סגי בתפלה בלב שהוא יודע מחשבות אדם, וא\"ש דברי המדרש מה תצעק אלי הה\"ד טרם יקראו ואני אענה וכו' דאין צורך עכשיו להתפלל בפה דייקא כדי לעורר את ישראל, ול\"ק קושית היפ\"ת דאין ראי' מכאן על מקום אחר, ששם לא הי' צורך לתפלה בפה רק טרם יקראו ואני אענה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 194,
      "char_length": 439,
      "timestamp": "2025-02-06T19:33:05.017139"
    },
    {
      "id": "beshalach2_p195",
      "text": "והנה הך כללא הוא רק לגבי תפלה שכ\"א יכול לזכות להתפלל להבוי\"ת, אבל לגבי שירה אינו כן, דלאו כל אדם זוכה לומר שירה לבורא כל העולמים וצריך זכות גדול שיזכו לומר שירה, וגם שם הי' כן שהכלל ישראל השפיע על הע\"ר שגם הם יזכו לומר שירה, ומקור ההשפעה הי' ע\"י משה רבינו שהשפיע על ישראל שיוכלו להשפיע על הע\"ר, וזה הוא פירוש הפסוק אז ישיר משה ובנ\"י וכו' ויאמרו לאמר, שבאמירתם השפיעו על הע\"ר כדי שיוכלו גם הם לומר שירה, וזהו ויאמרו לאמר שע\"י אמירתם יאמרו גם אחרים, אמנם האבות הקדושים לא היו צריכין לומר שירה בפה דייקא כדי להשפיע על זולתם כי הנפשות שגיירו לא היו בכלל הנס, גם לא היו ראויים לומר שירה, ע\"כ לא אמרו שירה רק במחשבה, משא\"כ בים הי' צורך לומר שירה בפה להשפיע לזולתם משה רבינו לכלל ישראל ובנ\"י להע\"ר.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 195,
      "char_length": 691,
      "timestamp": "2025-02-06T19:33:05.275942"
    },
    {
      "id": "beshalach2_p196",
      "text": "ואיתא בגמרא (סוטה דף מ\"ט ע\"ב) ותורת חסד על לשונה, וכי יש תורה שאינה של חסד, אלא זה תורה שמלמדה לאחרים נקרא תורת חסד, וז\"פ דברי המדרש פיה פתחה בחכמה שאמרו שירה בפה, ולכאורה למה היו צריכין לזה דסגי גם במחשבה, רק ותורת חסד על לשונה שהיו צריכין להשפיע לאחרים ע\"כ הוצרכו לומר בפה, וז\"ש מיום שברא הקב\"ה וכו' לא מצינו אדם \"שאמר\" שירה להקב\"ה ר\"ל בפה עד שבאו אלו ואמרו שירה בפה, אמר הקב\"ה לאלו הייתי מצפה ואין אז אלא שמחה שנאמר אז ימלא שחוק פינו, ובאותו זכות אנו אומרים גם עכשיו שירה בכל יום ונמחלו עונותינו ע\"י השירה כמו דאיתא במדרש, ונזכה שיתעוררו הנסים כמ\"ש כימי צאתך ממצרים אראנו נפלאות ונזכה לראות בישועת כל ישראל ושמחתן בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו במהרה בימינו אמן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 196,
      "char_length": 686,
      "timestamp": "2025-02-06T19:33:05.654494"
    },
    {
      "id": "beshalach2_p197",
      "text": "עוד אפ\"ל בביאור דברי המדרש הנ\"ל בהקדם דברי ק\"ז הישמח משה זלה\"ה (פ' וישב) על מה דאיתא בירושלמי (פרק ערבי פסחים) כתיב בפרוע פרעות בישראל בהתנדב עם ברכו את ה', התנדבו ראשי עם כשהקב\"ה עושה לכם ניסים תהי' אמרין שירה, עפימ\"ש בספר כבוד חכמים כי ראשי עם היינו הצדיקים, שהנס נעשה להם בדין אינם מחוייבין לומר שירה רק שאומרים דרך נדבה, אבל שאר ישראל שעושה להם בחסדו מחוייבין לומר שירה, והיינו בפרוע פרעות בישראל שהם הצדיקים ראשי עם בהתנדב, אבל עם שהם הפחותים ברכו את ה' דהיינו בציווי עכ\"ד, וק\"ז פי' בתוס' נופך בפרוע פרעות בישראל, דבישראל הוי רק פרעון על פירות מעשיהם לכך השירה רק בהתנדב והבן עכל\"ק.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 197,
      "char_length": 587,
      "timestamp": "2025-02-06T19:33:06.019161"
    },
    {
      "id": "beshalach2_p198",
      "text": "והנה מי שאינו מחוייב לומר שירה ורק רוצה לומר בתורת נדבה אזי צריכה השירה להיות יותר נאה ומפוארת שיתרצה לפניו ית' מאלו הי' אומרה בדרך חובה כמו שהסביר החוזה מלובלין זצלה\"ה הא דפסקינן אם טעה בקריאת שמע אינו חוזר ואם טעה בשמונה עשרה חוזר, למה\"ד למלך בשר ודם שאם אחד רוצה להביא לפניו דורן, צריך להשתדל ולהביא מן המובחר שבמובחרים ונאה ומהודרת ביותר כדי שיתרצה לפניו, ובאם לאו יקצוף עליו המלך באמרו מי חייבך להביא לי דורן, ובאם נדבה לבך לעשות יקר למלך, עליך להשתדל שיהא המנחה מהודרת כיאות לכבוד המלך, לא כן הוא באם המלך נתן צו ופקודה לכל אנשי מדינתו שכל אחד יבוא דורן לפניו דאזי אין מדקדקין כל כך על איכות הדורן, ואף אם לא ישוה בערך גדולת וכבוד המלך, עכ\"ז יש מענה בפיו להצטדק לפני המלך כי הוא בעצמו מרגיש חסרונו שאינו ראוי להביא דורן כראוי לכבוד המלך, אבל מה אעשה כי המלך גזר עלי, ומוכרח אני לקיים פקודתו כפי השגת ידי, וכמו\"כ לענין ק\"ש שהוא חיוב מדאורייתא בגזירת המלך מלכו של עולם לאמרה בכל יום, ע\"כ אף אם לא אמרה כהוגן לא חייבוהו חז\"ל לחזור כי מוכרח הוא לקיים גזירת המלך כפי השגתו ויכולתו, וע\"כ אין מקפידין עליו כ\"כ ואפילו טעה מקבלין ממנו, משא\"כ תפילת שמו\"ע שאינו מחוייבת מדאורייתא ע\"כ כשטעה צריך לחזור כי אם הוא מתנדב להביא דורן למלך צריך להיות נאה ביותר ומדקדקים אחריו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 198,
      "char_length": 1164,
      "timestamp": "2025-02-06T19:33:06.312362"
    },
    {
      "id": "beshalach2_p199",
      "text": "וכמו\"כ לענינינו דהנה דורות הראשונים נעשו להם נסים בזכותם כי הי' להם מע\"ט, וע\"כ לא היו אומרים שירה, כי בתורת נדבה לא רצו לומר, דלמא לא יאמרו כיאות לכבוד המלך ונמצא שאינו מודה רק ח\"ו להיפך, אבל בקריעת ים סוף שקיטרג עליהם שר של ים הללו עוע\"ז והללו עוע\"ז, א\"כ מה שנעשה להם נס ונבקע הים לא הי' בזכותם, כ\"א שהקב\"ה ברוב רחמיו ריחם עליהם ועשה להם נס ע\"כ היו מחוייבים לומר שירה מצד הדין ואין למנוע מחשש דילמא לא יאמרו כהוגן דהרי הוא מחוייב לומר כפי השגתו, וא\"ש דברי המדרש שמעולם לא אמר אדם שירה להקב\"ה, ר\"ל מחמת היראה כי מי יאמר זכיתי לבי כיאות לפני מלך הכבוד, עד שבאו אלו ואמרו שירה על שהיו מחוייבים מן הדין והבן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 199,
      "char_length": 605,
      "timestamp": "2025-02-06T19:33:06.887746"
    },
    {
      "id": "beshalach2_p200",
      "text": "באופן אחר אפ\"ל דברי המדרש הנ\"ל, בהקדם דברי הגמ' (מגילה י\"ד ע\"א) אין אומרים הלל על נס שבחו\"ל, והקשו בגמ' יציאת מצרים דנס שבחו\"ל היכי אמרינן שירה, כדתניא עד שלא נכנסו ישראל הוכשרו כל ארצות לומר שירה, משנכנסו ישראל לארץ לא הוכשרו כל הארצות לומר שירה עכ\"ד הגמ', וק\"ז הישמח משה זלה\"ה (בפ' בשלח) הביא בשם ס' ברית שלו' בתוס' נופך מדילי', דע\"כ לא אמרו ישראל שירה על נס דיציאת מצרים גופא, כי על נס שבחו\"ל אין אומרים שירה, אבל על נס שנעשה במים דהוא כארץ ישראל אומרים, והיינו הלכו ביבשה בתוך הים, וא\"כ נעשה נס בים דהוא כא\"י לכך אז ישיר עכ\"ל עוד כתב שם נ\"ל ליתן טעם להא דכל הארצות לא הוכשרו לומר שירה רק א\"י, עפימ\"ד במד\"ר (בראשית פ' ל\"ב סי' ג') ואף שבחו של הקב\"ה אומרים כן מקצתו בפניו וכו', וידוע מה שכתבו דבפניו שרי לשבוחי דלא שייך לומר סיימתינהו וכו' משא\"כ שלא בפניו, והנה ארץ ישראל עיני ד' אלקיך בה וכו', והיינו טעמא דברייתא דעד שלא נכנסו ישראל הוכשרו כל הארצות וכו', דהי' יכול להיות התגלות השראת שכינה בכל מקום לכך הוכשרו, משא\"כ אחר כך וכו', וז\"ש אשירה לד' כי גאה גאה. כפרש\"י גאה גאה על כל השירות וא\"כ כל מה שאקלס יש בו תוספת, וא\"כ אין לשיר רק בא\"י דהוי בפניו ולא שייך לומר סיימתינהו וכו', מ\"מ אשירה דהרי סוס ורוכבו רמה בים והוי כארץ ישראל ע\"כ מקצת לה\"ק.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 200,
      "char_length": 1146,
      "timestamp": "2025-02-06T19:33:07.199211"
    },
    {
      "id": "beshalach2_p201",
      "text": "ולכאורה דבה\"ק צ\"ב דהרי מפורש בגמ' דעד שלא נכנסו ישראל לארץ הוכשרו כל הארצות לומר שירה, וא\"כ מ\"ט צריכנא לטעמא דנס שנעשה במים הוי כא\"י, ובלא\"ה הוכשרו כל הארצות אז, ואפ\"ל עפימ\"ש ק\"ז בייט\"פ (מאמר שפת הים סי' י') לפרש דברי המדרש (פ' כ\"ג סי' ו') אז ישיר משה ובנ\"י וגו' הה\"ד (תהלים נ\"ט) ואני אשיר עזיך אימתי בשעה שעמדו על הים ואמרו שירה, ומה אמרו עזי וזמרת י\"ה, וארנן לבקר חסדך זה בוקר של מתן תורה, כי ידוע שכל הנביאים בעת שתבוא אליו הנבואה אע\"פ שהוא במראה וע\"י מלאך יחלשו כחותיו ויתקלקל בנינו כמעט שתצא רוחו ממנו, כמ\"ש בדניאל כשדיבר עמו גבריאל במראה, אמר לא נשאר בי כח והודי נהפך עלי וגו', ואני הייתי נרדם ע\"פ ארצה וגו', מלבד משרע\"ה לא הי' כן, וז\"ש ודבר ד' אל משה פא\"פ כאשר ידבר איש אל רעהו וכו' וא\"כ לכאורה יקשה להבין לפי משאמרז\"ל (מכילתא) ראתה שפחה על הים מה שלא ראה יחזקאל, שנא' זה אל\"י שכל או\"א מראה באצבעו וכו', והי' מהראוי לישראל ליפול ע\"פ ארצה, נבהל ונרדם עד כמעט שתצא רוחם, ואיך קמו על רגלם ופתחו פיהם ואמרו שירה, אע\"כ אין זה מכוחם כ\"א ברוך הנותן ליעף כח ולאין אונים עצמה ירבה, להעצים כוחן של ישראל לקום ולומר שירה וכו', וז\"ש אשירה לד' וגו', לא מכחי כ\"א עזי וזמרת י\"ה ויהי לו לישועה, שיד ה' הושיעה לי להתחזק בכח ולזמר לשמו ית' וכו' ולא נתבטלו במציאות וכן הי' במ\"ת, וכן לעתיד שנא' כי עין בעין יראו וגו' עיי\"ש ביאור הענין.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 201,
      "char_length": 1222,
      "timestamp": "2025-02-06T19:33:07.773781"
    },
    {
      "id": "beshalach2_p202",
      "text": "ומעתה אפ\"ל דאה\"נ דעד שלא נכנסו ישראל לארץ הוכשרו כל הארצות לומר שירה, אמנם לבחי' זו שיהיו למעלה ממדריגת הנביאים א\"א לזכות בחו\"ל, אלא לפי שהי' הנס במים שהוא מקום טהרה, גם שכבר השפיל הקב\"ה הסט\"א ושר של מצרים הוסר ממשלתו, כמ\"ש (רז\"ל במד\"ר דברים פי\"א י\"ט) סוס ורוכבו רמה בים סוסיהם ורוכביהם אין כתיב כאן, אלא סוס ורוכבו זה השר שלהן, ע\"כ מאז נתעלו ישראל לבחי' א\"י שהוא תחת יד הקב\"ה לבדו ויכלו לומר שירה בבחי' גבוה כזו שלא זכו אלי' כל הנביאים, ואפשר דלבחי' כזו לא זכו אף האבוה\"ק מטעם דאין אומרים שירה בחו\"ל, ואף דעד שלא נכנסו ישראל לארץ הוכשרו כל הארצות, מ\"מ לצד היותן תחת ממשלת שרים החיצונים לא זכו לזה, וישראל על הים זכו לזה מטעם הנ\"ל וכן יהי' לע\"ל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 202,
      "char_length": 645,
      "timestamp": "2025-02-06T19:33:08.397726"
    },
    {
      "id": "beshalach2_p203",
      "text": "וז\"ש במדרש אז ישיר משה וגו' הה\"ד פיה פתחה בחכמה ותורת חסד על לשונה, שהי' מחסדו ית' להעצים כחן של ישראל שיכלו לפתוח פיהן ולסדר דבריהם בחכמה, ולא נבהלו ולא נרדמו, ולז\"א מיום שברא הקב\"ה את העולם ועד שעמדו ישראל על הים, לא מצינו אדם שאמר שירה ר\"ל בבחי' זו, ואף הנביאים לא זכו אלי', ואין אז אלא שמחה שנא' אז ימלא שחוק פינו, דלע\"ל יזכו ישראל ג\"כ אל הבחי' ההוא.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 203,
      "char_length": 354,
      "timestamp": "2025-02-06T19:33:08.728073"
    },
    {
      "id": "beshalach2_p204",
      "text": "אז ישיר משה ובנ\"י וגו', פרש\"י ז\"ל עלה בלבו שישיר וכו', ראוי להבין מה צורך להשמיעינו זה, ובודאי שעלה בלבו לפני העשי', דסוף מעשה מחשבה בתחלה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 204,
      "char_length": 139,
      "timestamp": "2025-02-06T19:33:08.940838"
    },
    {
      "id": "beshalach2_p205",
      "text": "ב) במד\"ר (פ' כ\"ג סי' ד') אז ישיר משה וגו' הה\"ד (משלי ל\"א) פיה פתחה בחכמה ותורת חסד על לשונה, מיום שברא הקב\"ה את העולם וכו', לא מצינו אדם שאמר שירה להקב\"ה אלא ישראל וכו' ראוי להבין מ\"ט לא אמרו אבות העולם שירה על הנסים שנעשו להם, ומדוע דייקא ישראל אמרו שירה, גם צ\"ב הקישור אל הפסוק פיה פתחה בחכמה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 205,
      "char_length": 295,
      "timestamp": "2025-02-06T19:33:09.050758"
    },
    {
      "id": "beshalach2_p206",
      "text": "ונל\"פ בהקדם מ\"ד בספה\"ק ייטב לב בשם א\"ז הגה\"ק מו\"ה אלעזר ניסן זלה\"ה עה\"פ וירא פנחס ויקח רומח בידו, עפ\"י מאמחז\"ל (קידושין דף מ' ע\"א) מחשבה טובה הקב\"ה מצרפה למעשה, הענין כי אמרת אלקי צרופה היינו צירופי אותיות, ותיכף כשעלה במחשבת אדם לטוב, נעשה מזה צירוף אותיות ונכתב בפועל לפניו ית' וכו', ע\"כ תיכף כשראה פנחס ועלה בלבו שיקח רומח בידו, ויגל ד' את עיני פנחס וראה אלו האותיות וכו', וכיון שראה מעשה זו בצירופי אותיות נזכר הלכה עיי\"ש, ופי' בזה ק\"ז הייטב זלה\"ה דכמו\"כ באברהם הי' מסופק אם הוא מחוייב להטריח עצמו באורחים מחמת שהי' חולה מאוד, אך השי\"ת הוא חוקר לב וכו' ומחשבה טובה הקב\"ה מצרפה למעשה, ונעשה מזה צירוף אותיות וירץ לקראתם פתח האוהל, וכשראה אברהם צירוף האותיות וירץ לקראתם, הבין שזאת הוא רצון הבוי\"ת וכו' עיי\"ש.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 206,
      "char_length": 711,
      "timestamp": "2025-02-06T19:33:09.228711"
    },
    {
      "id": "beshalach2_p207",
      "text": "ועד\"ז אפ\"ל לענינינו כי משה ובנ\"י היו מסופקים אם יאמרו שירה או לאו כי ראו שכל הדורות שלפניהם לא אמרו שירה, אולם מיד שעלה בלבם לומר שירה, מחשבה טובה הקב\"ה מצרפה למעשה, ונעשה מזה צירופי אותיות אלו אז ישיר משה ובנ\"י את השירה הזאת, ובראותם צירופי אותיות אלו, מיד אמרו שירה, ולזה פרש\"י ז\"ל עלה בלבם לומר שירה, ר\"ל כי מחשבה הטובה הביאם לידי מעשה, וע\"י צירופי האותיות שנעשה ממחשבתם הכריעו לומר שירה, והנה ידוע דכוונת הלב הוא העיקר, והבוית\"ש יודע מחשבתו של אדם והי' מספיק זה בלבד, אלא שאעפ\"כ יש יתרון במוצא שפתים, שלפעמים המחשבה בלבד אינה זכה וברורה לש\"ש, וסגולת הקול מעורר הכוונה כאמרז\"ל, ומה\"ט האבוה\"ק לא הוצרכו לומר שירה בפה, כי הי' סגי במחשבה בלב, כי היו דבוקים ואדוקים במחשבתם בו ית\"ש תמיד בלי הפסק בכוונה לש\"ש בכל תנועה והרהור, וישראל אצל קרי\"ס הגם שהיו ג\"כ במדריגה מאוד נעלה כאמרז\"ל ראתה שפחה על הים מה שלא ראה יחזקאל וכו', מ\"מ מורא עלה על ראשם, פן לא יעמדו במדריגה זו ולא יהיו כל מחשבותם זכה לש\"ש, ע\"כ פתחו לומר שירה כדי להגיע ע\"י התעוררות הקול לכוונה אמיתית לש\"ש.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 207,
      "char_length": 963,
      "timestamp": "2025-02-06T19:33:09.565804"
    },
    {
      "id": "beshalach2_p208",
      "text": "ובזה יבואר קישור דרשת המדרש לסמיכת הפסוק פיה פתחה בחכמה וכו', עפימ\"ש רז\"ל (סוכה מ\"ט ע\"ב) מ\"ד פיה פתחה בחכמה ותורת חסד על לשונה, וכי יש תורה של חסד ויש תורה שאינה של חסד, אלא תורה לשמה זו היא תורה של חסד, תורה שלא לשמה זו הוא תורה שאינה של חסד, עכ\"ד הגמ', והרי\"ף בעין יעקב שם פי' בזה מאמה\"כ פיה פתחה בחכמה, שכך היא דרכה של תורה ללמוד בתחלה שלא לשמה כדי שיקראוהו חכם, ואח\"כ מביאתו ללמוד לשמה ותורתו תורת חסד עייש\"ד, וי\"ל עוד דתכלית ההתחלה שלא לשמה, כדי שאח\"כ יביאהו ללימוד לשמה, וז\"פ פיה פתחה בחכמה, ע\"ד שאמרז\"ל (תמיד ל\"ב ע\"א) איזהו חכם הרואה את הנולד, וע\"כ התחלה זו שלא לשמה, בחי' חכמה יקרא, כדי שיזכה אח\"כ לתורת חסד על לשונה, ועד\"ז בישראל בשעת קרי\"ס שעלה בלבם לומר שירה, אלא שחששו פן לא יהי' מחשבתם זכה וברורה לש\"ש, וע\"כ אמרו שירה בפה כנ\"ל, וז\"פ קישור דברי המדרש הה\"ד פיה פתחה בחכמה ע\"ד איזהו חכם הרואה את הנולד, ועי\"ז ותורת חסד על לשונה, שזכו להגיע למדריגת לשמה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 208,
      "char_length": 863,
      "timestamp": "2025-02-06T19:33:10.030810"
    },
    {
      "id": "beshalach2_p209",
      "text": "במדרש (הובא בישמח משה) הים ראה וינס מה ראה, ראה ישראל באים ורכוש מצרים בידם עכ\"ד המדרש וצ\"ב.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 209,
      "char_length": 92,
      "timestamp": "2025-02-06T19:33:10.466666"
    },
    {
      "id": "beshalach2_p210",
      "text": "ונל\"פ בהקדם דברי הראב\"ע ז\"ל עה\"פ התיצבו וראו את ישועת ד' וגו', יש לתמוה איך יירא מחנה גדולה של שש מאות אלף איש מהרודפים אחריהם, ולמה לא ילחמו על נפשם ועל בניהם, התשובה כי המצרים היו אדונים לישראל וזה הדור היוצא ממצרים למד מנעוריו לסבול עול מצרים ונפשו שפלה וכו' ואינם מלומדים למלחמה עכ\"ד, אמנם סותר ד\"ע שפי' לעיל עה\"פ וחמשים עלו בנ\"י, וחמשים מזויינים חגורי חומש למלחמה וכו', כי ביד רמה יצאו בכלי מלחמה, ולא כמו עבדים בורחים עכ\"ל, ומה שהקשה למה לא ילחמו על נפשם אין זה קושיא, דמפני שא\"ל משרע\"ה מפי הגבורה התייצבו וראו את ישועת ד' וגו' ד' ילחם לכם ואתם תחרישון, ע\"כ אף שהיו בסכנה גדולה, עמדו בנסיון ולא נלחמו עם המצריים, אף שהיו מזויינים וגבורי חיל, אבל כן הי' רצון הבוי\"ת שלא ילחמו והשלימו רצון הבוי\"ת, וראי' לדבר שנמנעו רק לטעם זה, שהרי בג' ימי אפילה היו המצרים כולם ככפותים, העומד אינו יכול לישב וכו', וישראל נכנסו לבתיהם והיו מחפשים במטמוניותם, והי' בידם להרגם כולם וליקח כל כלי חמדתם ולצאת מארצם באין מפריע, ומדוע לא קשיא להראב\"ע שם איך לא לחמו על נפשם ונפש בניהם, ולא הי' צורך לגבורה ולא לכלי זיין, אע\"כ שנמנעו רק להשלים רצון הבוי\"ת, ונצטוו על ככה שלא לצאת בזרוע ולא יקחו הרכוש בזרוע כ\"א בדרך שאלה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 210,
      "char_length": 1102,
      "timestamp": "2025-02-06T19:33:10.574127"
    },
    {
      "id": "beshalach2_p211",
      "text": "ועד\"ז אפ\"ל דברי המדרש הנ\"ל הים ראה וינס מה ראה רכוש מצרים בידם, דאמרו רז\"ל (במד\"ר פ' י\"ד סי' ג') כששאלו ישראל מהמצריים להשאיל להם כלי כסף וכלי זהב וכו', היו אומרים אין בידינו כלום אומר לו ישראל אני ראיתיו בביתך ובמקום פלוני הוא, נמצא מהרכוש הי' ראי' שעמדו ישראל בנסיונם וציפו לישועת ד', ולא בטחו בזרוע בשר ובדרך מלחמה, וע\"כ היו ראויים לנס שלא כדרך הטבע בקרי\"ס, ולא הוצרכו לפעולה טבעיות בדרך מלחמה, וז\"ש מה ראה רכוש מצרים בידם וע\"כ וינוס.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 211,
      "char_length": 437,
      "timestamp": "2025-02-06T19:33:11.256631"
    },
    {
      "id": "beshalach2_p212",
      "text": "והנה איתא במדרש ילקוט (רמז רנ\"ד) ויסע משה את ישראל מים סוף הסיען בעל כרחם, שעטרו מצרים סוסיהם בתכשיטי זהב וכסף ואבנים טובות וכו' לפיכך הוצרך להסיען בעל כרחם, ולכאורה צ\"ב דהרי בהשאלת כליהם כתיב דבר נא באזני העם וגו' ודרשו רז\"ל (ברכות דף ט' ע\"א) אין נא אלא לשון בקשה, א\"ל הקב\"ה למשה לך אמור לישראל בבקשה מכם שאלו מן המצרים וכו', הרי דלא הי' רצונם להרבות מרכוש מצרים, והי' צורך לבקשם על ככה, ומדוע נשתנה דעתם אח\"כ והוצרך להסיעם בע\"כ, ואפ\"ל בפשטות דמפני שבמצרים היתה ציווי הבוי\"ת על כך שישאלו, ולזה הי' התגברות ונסיון בדבר, ולזה הי' צורך להזהירם ולבקשם על כך, משא\"כ אחר ביזת הים שכבר נצטוו ליסע משם הי' ההתגברות והנסיון על ההיפך וע\"כ הי' צורך להסיעם בע\"כ ולסייע בידם והבן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 212,
      "char_length": 668,
      "timestamp": "2025-02-06T19:33:11.492782"
    },
    {
      "id": "beshalach2_p213",
      "text": "במדרש הים ראה וינס מה ראה, ראה ישראל באים ורכוש מצרים בידם, וצ\"ב, ונל\"פ בהקדם לבאר הכתוב ויהפך לבב פרעה ועבדיו אל העם ויאמרו מה זאת עשינו כי שלחנו את ישראל מעבדנו, פרש\"י ז\"ל ויהפך בשביל ממונם שהשאילום, וצ\"ב דאין זה טעם המפורש בכתוב כי שלחנו את ישראל וגו', הרי שהתחרטו על עצם השליחות ולא על חסרון הממון.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 213,
      "char_length": 302,
      "timestamp": "2025-02-06T19:33:11.836477"
    },
    {
      "id": "beshalach2_p214",
      "text": "ואפ\"ל בהקדם דברי הפר\"ד שכתב דישראל זכו בהרכוש מדין הענקה, עפימ\"ד במדרש שפרעה שיחרר את ישראל וא\"ל הרי אתם ברשותכם הרי אתם בני חורין ועבד עברי יש לו הענקה עכ\"ד ז\"ל, וק\"ז הישמח משה זלה\"ה כתב דהטעם שהי' צורך לשיחרורו, מפני שעדיין לא נשלם זמנם של ישראל לצאת, אלא שדילג הקב\"ה על הקץ ויצאו לסוף רד\"ו כי לא יכלו להתמהמה עוד, אמנם קשה ע\"ז דהרי פרעה הי' מוכרח לשחררם מחמת שנלאה לסבול כובד המכות, א\"כ השחרור לאו כלום הוא, דאונסא כמאן דלא עביד, ותירץ דקיי\"ל (במס' ב\"ב מ\"ח) תלוהו וזבין זביני' זבינא, דאגב אונסא וזוזי גמר ומקנה, אבל תלוהו ויהיב במתנה לא מהני, וכאן הוי תלוהו וזבין, דאם בזמן ההוא שיצאו כתיב וינצלו את מצרים בשכר העבודה, א\"כ אלמלי נשארו שם עד השלים הזמן גם ארצם לא הי' מספיק, והרכוש שנטלו הוי כמו פשרה דדינו כמכר עכ\"ד ק\"ז זלה\"ה, נמצא דמרכוש מצרים יש הוכחה שיצאו ברשות ופרעה שיחררם כדין, ולפי\"ד הפר\"ד שזכו ברכוש מדין הענקה, בעכ\"ח שהי' שחרור גמור וכדין, דבורח אין לו הענקה, וז\"ש רש\"י ז\"ל בשביל ממונם שהשאילום דעי\"ז נעשו משוחררים ואין לומר אונסא כמאן דלא עביד, והיינו טעם הכתוב כי שלחנו את ישראל מעבדנו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 214,
      "char_length": 1001,
      "timestamp": "2025-02-06T19:33:12.015824"
    },
    {
      "id": "beshalach2_p215",
      "text": "והנה איתא במדרש (ילקוט ראובני) שקטרג שר של ים ואמר מה נשתנו אלו מאלו הללו עובדי ע\"ז והללו עוע\"ז וכו', ולכאורה מה טענה הוא זו הלא המצריים היו רודפים אחר ישראל להורגם, וקיי\"ל דרוצח ניתן להצילו בנפשו אף אם הנרדף אינו צדיק יותר ממנו, אלא צ\"ל שהשר של ים סבור ששחרורם של ישראל הי' שלא כדין וה\"ה בורחים ואין דינם של מצריים כרודפים, אולם מרכוש מצרים ראה והשיג דשחרורם הי' כדין, ולז\"א הים ראה וינס ראה רכוש מצרים בידם והבן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 215,
      "char_length": 414,
      "timestamp": "2025-02-06T19:33:12.512466"
    },
    {
      "id": "beshalach2_p216",
      "text": "ה' איש מלחמה ה' שמו, פירש\"י ז\"ל אף בשעה שהוא נלחם ונוקם מאויביו אוחז הוא במדתו לרחם על ברואיו וכו' עיי\"ש, ונל\"פ עוד מאמר הכתוב בסוף הפרשה ויאמר כי יד על כס י\"ה מלחמה לה' בעמלק מדור דור, פירש\"י ידו של הקב\"ה הורמה לישבע בכסאו להיות לו מלחמה ואיבה בעמלק עולמית, ומהו כס ולא נאמר כסא ואף השם נחלק לחציו, נשבע הקב\"ה שאין שמו שלם ואין כסאו שלם עד שימחה שמו של עמלק כולו, וכשימחה שמו יהי' השם שלם והכסא שלם וכו', ובספה\"ק פי' הפסוק (תהלים כ') ימלא ה' כל משאלותיך, שזה יהי' כל משאלותיך שיתמלא השם ויהי' שמו שלם, והאלשיך הק' האריך לבאר שעיקר מלחמת עמלק היינו מלחמת היצה\"ר כי עונותינו מוסיפים כח בשרו של עמלק הוא ס\"מ הוא השטן וכ\"א מישראל צריך ללחום מלחמה זו עכת\"ד, והנה זה א\"א רק בעזר השי\"ת, דאלמלא הקב\"ה עוזרו אינו יכול לו כמו שאמרו חכז\"ל, נמצא הקב\"ה הוא הלוחם מלחמת עמלק בכל דור ודור, והתכלית מזה שיהי' שמו שלם כשימחה שמו של עמלק כולו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 216,
      "char_length": 826,
      "timestamp": "2025-02-06T19:33:12.742821"
    },
    {
      "id": "beshalach2_p217",
      "text": "וז\"פ הכתוב ה' איש מלחמה שהקב\"ה הוא בעל מלחמה כמ\"ש מלחמה לה' בעמלק מדור דור, ותכלית מלחמה זו ה' שמו, שיהי' השם שלם. שאין השם שלם עד שימחה שמו של עמלק כולו, ולזה הקב\"ה מסייע לכל איש מישראל ללחום עם שרו של עמלק הוא הס\"מ הוא היצה\"ר כדי שנזכה לבחי' ה' שמו, והשי\"ת יעזור שבימינו נזכה לזה להיות שמו וכסאו ית' שלם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 217,
      "char_length": 306,
      "timestamp": "2025-02-06T19:33:13.171176"
    },
    {
      "id": "beshalach2_p218",
      "text": "ויאמר ה' אל משה הנני ממטיר לכם לחם מן השמים ויצא העם ולקטו דבר יום ביומו, לכאורה תיבת לכם כמיותר, גם מה שאמר ולקטו דבר יום ביומו תיבת דבר מיותר וצ\"ב, ובמדרש (הובא בישמח משה) הים ראה וינוס מה ראה ישראל באים ורכוש מצרים בידם וצ\"ב.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 218,
      "char_length": 228,
      "timestamp": "2025-02-06T19:33:13.348178"
    },
    {
      "id": "beshalach2_p219",
      "text": "ונקדים לבאר מאמה\"כ (בפ' בא) דבר נא באזני העם וישאלו וגו' פי' רשיז\"ל אין נא אלא לשון בקשה, בבקשה ממך הזהירם על כך. שלא יאמר אותו צדיק אברהם ועבדום ועינו אותם קיים בהם, ואחרי כן יצאו ברכוש גדול לא קיים בהם ודקדקו המפורשים דתיבת בהם שהוכפל שני פעמים מיותרים, עוד הקשו בקשה זו למה כיון דכל אדם להוט אחר ממון ונפשו של אדם מחמדתן, גם מה צורך לטעם זה כדי שלא יאמר אותו צדיק, וגם בלא זה יקיים השי\"ת הבטחתו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 219,
      "char_length": 398,
      "timestamp": "2025-02-06T19:33:13.499433"
    },
    {
      "id": "beshalach2_p220",
      "text": "וכל אלה באחת יתבארו בהקדם מה שהקשה התבו\"ש על מ\"ש הרמ\"א ז\"ל (סי' תרפ\"ב ס\"א) דאם שכח לומר על הנסים בבהמ\"ז, כשמגיע להרחמן יאמר הרחמן הוא יעשה לנו נסים וכו', והתבו\"ש דחה דין זה וטעמו דאין להתפלל שיעשה לו נס, והביא ראי' מהא דאמרינן בגמרא (ברכות ס' ע\"א) היתה אשתו מעוברת ואמר יה\"ר שתלד אשתי זכר הרי זה תפילת שוא, ופריך מהא דכתיב ואחר ילדה בת שדנה לאה דין בעצמה וכו' מיד נהפכה לבת, ומשני אין מזכירין מעשה נסים, ואי נימא דמותר להתפלל שיעשה לו נס, עדיין תקשה דאמאי הוי תפלת שוא הרי יכול להתפלל שתלד זכר בדרך נס, אלא וודאי שאין להתפלל על נס.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 220,
      "char_length": 531,
      "timestamp": "2025-02-06T19:33:13.720704"
    },
    {
      "id": "beshalach2_p221",
      "text": "והישועות יעקב מתרץ שיטת הרמ\"א ז\"ל עפי\"ד המדרש בפסוק אל תירא אברם אנכי מגן לך שכרך הרבה מאוד, הכל יודעין שאנכי מגן לך, והכוונה בזה דהנה אמרו רז\"ל (שבת דף ל\"ב ע\"א) שאם עושין לאדם נס מנכין לו מזכיותיו. אמנם כשהנס מפורסם ועי\"ז נתקדש ש\"ש הנה ניתוסף לו זכות חדש בשביל קידוש השם, וז\"ש אל תירא אברם מכח נכיון הזכות ע\"י הנסים, כי אנכי מגן לך והכל יודעין שאנכי מגן לך, וע\"כ שכרך הרבה מאוד וכו' וע\"כ על נס מפורסם לרבים ראוי להתפלל כדי שיתקדש שמו ית' עכ\"ד, והנה במסכת תענית (דף כ\"ד ע\"א) מבואר דאסור להנות ממעשה נסים גבי מעשה דאלעזר איש בירתא שנתמלא אוצרו חטים בדרך נס ואמר לבתו הרי הן הקדש עליך ואין לך בהן אלא כאחד מעניי ישראל, וכתב רש\"י ז\"ל משום דמעשה נסים הוא ואסור לאדם להנות ממעשה נסים כדאמר לעיל (דף כ' ע\"ב) ואם עושין לו נס מנכין לו מזכיותיו",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 221,
      "char_length": 735,
      "timestamp": "2025-02-06T19:33:14.001534"
    },
    {
      "id": "beshalach2_p222",
      "text": "אמנם עפ\"י המבואר בדברי הישועות יעקב דאם הוא נס מפורסם ונתקדש ש\"ש על ידו אין מנכין לו מזכיותיו, אפשר דבכה\"ג מותר להנות ממעשה נסים והנה בענין הרכוש שהוציאו ממצרים הי' ג\"כ מעשה נסים, כפי' רש\"י וישאלום אף מה שלא שאלו מהם היו נותנים להם, ואמרז\"ל במס' בכורות (דף ה' ע\"ב) אין לך כל אחד ואחד מישראל שלא היו עמו תשעים חמורים טעונים מכספם וזהבם של מצרים, וא\"כ א\"א להנות ממנה ומחויבים להקדישו ומה ירויחו עם הרכוש, אמנם באם לקחו הרכוש רק להשלים רצון הבוי\"ת א\"כ אדרבה יתוסף זכותם ושפיר הותר להם להנות ממנה, וע\"כ אמר השי\"ת שענין השאלת כליהם לא יהי' לכוונת תועלתם כי אז יאסר להנות מהם. רק כוונת השאילה יהי' למען יקוים מאמר השי\"ת אל אברהם, וע\"ז בוודאי צריך אזהרה רבא שלא יכוונו להנאת עצמם וישליכו תאות נפשם מנגד, רק יכוונו למלאות רצון השי\"ת שיקוים הבטחתו אל אברהם, וז\"ש דבר נא באזני העם אין נא אלא לשון בקשה, בבקשה ממך הזהירם על כך. היינו שלכוונה זו יהי' השאלה כדי שלא יאמר אותו צדיק וכו', וממילא יהי' מותר ליהנות מהם אף כי הוא מעשה נסים ולא יהיו מחויבים להקדישו, וזהו אמרו כדי שלא יאמר אותו צדיק, ועבדום ועינו אותם קיים בהם דייקא, ואח\"כ יצאו ברכוש גדול לא קיים בהם, כי אינו שלהם ומחויבים להקדישו, ולזה יבקש מהם שיהי' כוונת השאלה רק לעשות רצונו ית' ולהרבות כבוד שמים ולא בשביל תאות וחמדת הממון. ועפי\"ז יתבאר המדרש דהנה ידוע דעל הים הי' קטרוג גדול מה נשתנו אלו מאלו, אולם כאשר ראה שר של ים ישראל באים ורכוש מצרים בידם דייקא, דהיינו שהוא שלהם ואינם מחוייבים להקדישו, ומזה מוכח אשר כל כוונתם הי' למען יתקדש ש\"ש, ע\"כ וינוס כי עי\"ז נסתמו פיות המקטריגים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 222,
      "char_length": 1432,
      "timestamp": "2025-02-06T19:33:14.359456"
    },
    {
      "id": "beshalach2_p223",
      "text": "והנה אמרו חכז\"ל (יומא דף ל\"ח ע\"א) כל מה שברא הקב\"ה לא ברא אלא לכבודו, כי מכל הנבראים שבעולם יש ללמוד מציאות השי\"ת וגדולתו, כי חכמת הפעולה תעיד על פועלה כמבואר בחובת הלבבות שער הבחינה, וכמ\"ש השמים מספרים כבוד א\"ל ומעשה ידיו מגיד הרקיע יום ליום יביע אומר וכו', כי בהתבונן האדם מעשה השי\"ת וברואיו הנפלאות חדשים לבקרים, יגיע אליו היראה וההכנעה, וכמו שמצינו באברהם אבינו ע\"ה שמזה הפליא עצה והגדיל תושי' להאמין במציאות השי\"ת ואחדותו והשגחתו, אמנם כ\"ז יועיל לבני עלי' אשר המה מועטים, כי לאשר הוטבע כן בטבע לא יתפעל האדם מחמתם, ולזה צריך התבוננות גדול ועמקות נפלא, לאשר הוא רגיל בתמידות אינו מתפעל ממנו כאשר ביאר זאת בחובת הלבבות בטוב טעם באריכות, אולם כאשר יקרה איזה דבר ניסיי חדש מה שחוץ לטבע, הנה זאת תפעול התעוררות גדול בלב הרואים לידע כי לה' הארץ והטבע וכל אשר בה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 223,
      "char_length": 761,
      "timestamp": "2025-02-06T19:33:15.026270"
    },
    {
      "id": "beshalach2_p224",
      "text": "והנה המן שהמטיר השי\"ת לישראל מן השמים הי' דבר ניסיי היפך הטבע, כי הטבע מחייב להצמיח לחם מן הארץ ולא מן השמים, ולפי\"מ דקיי\"ל אסור להנות ממעשה נסים איך אכלו ישראל את המן, אמנם לפי האמור דכאשר יצמח קידוש השם ע\"י הנס אז מותר להנות ממנה א\"ש, כי באמת אין לך קידוש השם גדול מזה שהוא לגמרי היפך הטבע עד קצה האחרון ועי\"ז יכירו וידעו כל באי עולם כי ה' הוא אלקים משדד הטבע, וזהו אומרו הנני ממטיר לכם שיהי' לעצמכם ותוכלו להנות ממנו, הגם כי הוא לחם מן השמים והוא דבר ניסיי ואסור להנות ממעשה נסים, ע\"ז אמר ויצא העם ולקטו דבר יום ביומו דייקא, כי מן המן ידעו לספר כבוד השי\"ת, ודברי נפלאותיו ישיחו בכל יום ויום, כענין אמרו יום ליום יביע אומר, אשר מזה יהי' קידוש השם גדול מאוד, ועי\"ז מותר להנות ממנו כדברי הישועות יעקב והבן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 224,
      "char_length": 706,
      "timestamp": "2025-02-06T19:33:15.395169"
    },
    {
      "id": "beshalach2_p225",
      "text": "ויאמר ה' אל משה הנני ממטיר לכם לחם מן השמים וגו' למען אנסנו הילך בתורתי אם לא, פירש\"י ז\"ל הילך בתורתי, אם ישמרו מצות התליות בו שלא יותירו ממנו ולא יצאו בשבת ללקוט עכ\"ל והרמב\"ן ז\"ל העתיק דברי רש\"י ז\"ל וכתב עליו ואיננו נכון אבל הוא כמו שאמר המאכילך מן במדבר וגו' ולמען נסותך להיטיבך באחריתך כי נסיון הוא להם, שלא יהי' לאדם מזון ולא יראו להם עצה במדבר, רק המן שלא ידעו מתחלה ולא שמעו מאבותם, ויורד להם דבר יום ביומו וירעיבו אליו, ועם כל זה שמעו ללכת אחרי השם לא מקום לחם, וככה אמר להם עוד וזכרת את כל הדרך וגו' ולמען נסותך לדעת וגו' התשמור מצותיו אם לא וכו', והוליכם במדבר וכו' ושלא יהי' להם לחם רק מן השמים דבר יום ביומו לנסותם ולהטיב להם באחרונה שיאמינו בו לעולם עכ\"ל הרמב\"ן ז\"ל, ולשני הפירושים צ\"ב בלשון הפסוק הילך בתורתי, דלפירש\"י הי' לו לומר הישמרו מצותי, גם לדעת הרמב\"ן שהנסיון בענין האמונה קשה ג\"כ הלשון הילך והול\"ל למען אנסנו אם יאמינו לדברי, עוד יל\"ד למה הוצרך הכתוב להזכיר דבר והפיכו הילך בתורתי אם לא, ומובן מאליו שהמציאות הוא דבר והפיכו דאל\"כ אינו בגדר נסיון כלל, ומלות אם לא המה מיותרים.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 225,
      "char_length": 997,
      "timestamp": "2025-02-06T19:33:15.754621"
    },
    {
      "id": "beshalach2_p226",
      "text": "ב) ויהי ביום הששי לקטו לחם משנה וגו' ויבאו כל נשיאי העדה ויגידו למשה ויאמר אליהם הוא אשר דבר ה' שבתון שבת קודש וגו' פירש\"י מכאן יש ללמוד שעדיין לא הגיד להם משה פרשת שבת שנצטווה לומר להם והי' ביום הששי והכינו וגו', עד ששאלו את זאת, אמר להם הוא אשר דבר ה' שנצטויתי לומר לכם, ולכן ענשו הכתוב שאמר לו עד אנא מאנתם ולא הוציאו מן הכלל, ובמד\"ר (פר' כ\"ה סימן י') ויותירו אנשים ממנו וכו' מיד ויקצוף עליהם משה, כיון שכעס שכח לומר להם שילקטו ביום הששי שני עומרים לאחד, כיון שהלכו ולקטו ביום הששי ומצאו כפלים, באו הנשיאים ואמרו למשה וכו', וע\"ז נאמר עד אנה מאנתם שהוא מכניס משה בכללם עכ\"ד המדרש, והקשו המפורשים מדוע לא אמר להם מצות השבת מיד ביום הראשון, שהרי ירד להם המן בראשון בשבת תחלה כדאי' בגמ', ואז היה עדיין לפני הקצף שהותירו ביום הב'.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 226,
      "char_length": 728,
      "timestamp": "2025-02-06T19:33:16.299485"
    },
    {
      "id": "beshalach2_p227",
      "text": "ונל\"פ בהקדם קושית המפורשים ז\"ל מדוע לא ירד המן בשבת, כמו שהקב\"ה מוריד גשמים וטללים בשבת, ואמרז\"ל במד\"ר (בראשית פי\"א ס\"ה) טורנוסרופוס הרשע שאל את ר\"ע אם כדבריך שהקב\"ה מכבד את השבת אל ישב בה רוחות, אל יוריד בה גשמים, א\"ל אמשול לך משל לשנים שהיו דרין בחצר א', אם אין זה נותן עירוב וזה נותן עירוב שמא מותרין לטלטל בחצר, אבל אם הי' אחד דר בחצר הרי הוא מותר בכל החצר, אף הקב\"ה לפי שאין רשות אחרת עמו, וכל העולם כולו שלו מותר בכל העולם כולו, וה\"ה כרה\"י עיי\"ש במד\"ר, וכמו\"כ מה\"ט הי' יכול הקב\"ה להוריד המן בשבת, וי\"ל שנשבת המן בשביל ישראל, דנאסר להם לקיטתו משום תחומין והוצאה, כדרשתם ז\"ל (עירובין י\"ז ע\"ב) אל יצא איש ממקומו, אל יצא עם הכלי ללקוט המן, ועיין בתוס' שם דתרווייהו משתמעי מיני' הוצאה ותחומין.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 227,
      "char_length": 694,
      "timestamp": "2025-02-06T19:33:16.676255"
    },
    {
      "id": "beshalach2_p228",
      "text": "והנה אמרז\"ל יומא (ע\"ה ע\"א) כתיב ירד המן עליו, וכתיב ויצא העם ולקטו וכתיב שטו העם ולקטו, (פירש\"י ירד המן עליו אלמא בתוך המחנה הי' יורד, וכתיב ויצא העם ולקטו יציאה מחוץ למחנה משמע, וכתיב שטו משמע למקום רחוק) הא כיצד צדיקים יורד על פתח בתיהם, בינונים יצאו ולקטו, רשעים שטו ולקטו עכ\"ד הגמ', ולפי\"ז הי' אפשר שירד המן לצדיקים, דליכא לגבייהו איסור תחומין והוצאה, שירד על פתח בתיהם, ואפשר דמפני שלא הי' רוב הדור במדריגה זו, ע\"כ לא ירד אף לצדיקים משום לא פלוג, אמנם אלמלי הי' כל ישראל במדריגה זו שירד להם המן על פתח אהליהם, הי' יורד המן גם בשבת.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 228,
      "char_length": 536,
      "timestamp": "2025-02-06T19:33:17.037075"
    },
    {
      "id": "beshalach2_p229",
      "text": "ובזה יתורץ קושית המפרשים ז\"ל (קושיא ב') דע\"כ לא אמר להם משרע\"ה מצות השבת ביום הראשון שהי' עדיין לפני הקצף, כי הי' משרע\"ה מצפה שכל ישראל יזכו למדריגת הצדיקים וירד להם המן גם בשבת, והגם שהקב\"ה אמר לו והי' ביום הששי והכינו בשעת הציווי, אפשר שנאמרה על תנאי, ע\"ד שאמרז\"ל (ע\"ז ה' ע\"ב) למימרא דאי לא חטאו, והכתיב פרשת יבמות ופרשת נחלות, ותירצו בגמ' שנכתבו על תנאי עיי\"ש, וכמו\"כ הכא אפשר שהציווי והי' ביום הששי על תנאי נאמרה, אבל משרע\"ה הי' מצפה שלא יצטרך לצוות את ישראל בכך, כי עדיין תליא בבחירתם ואולי יזכו במעשיהם וירד להם המן גם בשבת, וע\"ד שפירשתי מאמרם ז\"ל (סנהדרין קי\"א ע\"א) א\"ל ר' יוחנן לר\"ל לא ניחא לי' למרייהו דאמרת עלייכו הכי וכו', דמלתא דתליא בבחירה, לא ניחא להקב\"ה שיתאמר העונש בבחי' דיבור, כי אולי יזכו ישראל ויתבטל הגזירה עיי\"ש, ואפשר דמה\"ט המתין משרע\"ה מלאמרה להם ביום הראשון, אמנם ביום השני דכתיב ולא שמעו אל משה ויותירו וגו' השיג משרע\"ה כי לא זכו כולם למדריגת הצדיקים, ע\"כ אז הי' זמני' למסור להם מצות השבת, שיכינו מיום הששי לשבת כי לא ירד המן בשבת, אלא מתוך שכעס שכח וא\"ש דברי המדרש.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 229,
      "char_length": 992,
      "timestamp": "2025-02-06T19:33:17.321838"
    },
    {
      "id": "beshalach2_p230",
      "text": "ולדרכינו יתבאר הכתוב למען אנסנו הילך בתורתי אם לא ופירש\"י ז\"ל אם ישמרו מצות התליות בו שלא יותירו ממנו ולא יצאו בשבת ללקוט, (עיין קושיא א' לעיל) דהנה ב' בחינת נסיונות יש, אחד נסיון הצדיקים שהוא ע\"צ הטובה, כענין והאלקים נסה את אברהם ופי' הראב\"ע ז\"ל בשם הגאון שענינו להראות צדקתו לבנ\"א, והרמב\"ן ז\"ל פי' להוציא הדבר מן הכח אל הפועל להיות לו שכר מעשה טוב, לא שכר לב טוב בלבד עיי\"ש, ובחי' הב' נסיון הבא ע\"י גרמת החטא. כגון נסיון הזה אם ישמרו מצות התליות בו שלא יצאו בשבת ללקוט, דאלמלי זכו ישראל הי' המן יורד להם בשבת, ולא הי' במציאות נסיון הזה כלל וכעין שפי' הראב\"ע ז\"ל (בפ' ראה) עה\"פ לא תשמע אל דברי הנביא ההוא וגו', כי מנסה ה' אלקיכם אתכם וגומר, בעבור שעזבו ולא המיתו וכו' עיי\"ש, דענין הנסיון הזה ע\"י גרמת החטא, והוא ע\"ד העונש וההתגברות בזה קשה מאוד, וככה אנו רואים בדורות האחרונים שישנם הרבה נסיונות, שלא הי' בגדר נסיון כלל בדורות הראשונים, ובפרט בזמן שהי' הביהמ\"ק קיים שראו כל בשר כבוד ה', וכ\"א מישראל הי' לו אימה ופחד מהדר גאונו ית', ע\"ד שאמרו ז\"ל (ירושלמי דמאי מ\"ד ה\"א) שאף ע\"ה לא הי' משקר בשבת מאימת שבת עליו, ובאותן הדורות לא הי' נסיון כ\"כ בשמירת התורה ומצות, משא\"כ בדורות האחרונים שע\"י גרמת העונות נענשנו בהסתרת פנים ר\"ל, ואין שום פחד ואימה לעשות ככל העולה על רוחו, גדלו הנסיונות מאוד ה' ישמרינו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 230,
      "char_length": 1199,
      "timestamp": "2025-02-06T19:33:17.792821"
    },
    {
      "id": "beshalach2_p231",
      "text": "ועד\"ז יתפרש הכתוב למען אנסנו הילך בתורתי אם לא, ולדרכינו נאמרה הכתוב על תנאי, ותליא בבחירתם של ישראל, שאם יזכו יהי' הנסיון ע\"צ הטובה כבחי' נסיון הצדיקים, שהוא להראות צדקת המנוסה, וכפי' הרמב\"ן ז\"ל שיתברר אמונתם החזקה ולהטיב להם באחרונה וכו', ואם לא יזכו להשתלם בשמירת התורה אז יהי' הנסיון באופן הב' אם ישמרו מצות התליות בו ולא יצאו בשבת ללקוט, שגרמת הנסיון ע\"י שעברו והותירו, וזשה\"כ למען אנסנו הילך בתורתי אם לא, שבחי' הנסיון ישתנה כפי בחירתם, אם ילכו בתורתי יהי' הנסיון ע\"צ הטובה כנסיון הצדיקים להטיב להם באחרונה כדברי הרמב\"ן ז\"ל, ואם לא אז יהי' הנסיון באופן הב' אם ישמרו מצות התליות בו כדברי רש\"י ז\"ל ושניהם נרמזו בקרא.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 231,
      "char_length": 620,
      "timestamp": "2025-02-06T19:33:18.376705"
    },
    {
      "id": "beshalach2_p232",
      "text": "עוד יל\"פ הילך בתורתי אם לא, שהכוונה על כלליות התורה והעסק בה, ועפימ\"ש רש\"י ז\"ל עה\"פ למען יראו את הלחם אשר האכלתי אתכם וגו' בימי ירמי' כשהיה ירמי' מוכיחם למה אין אתם עוסקים בתורה, והם אומרים נניח מלאכתינו ונעסוק בתורה מהיכן נתפרנס, הוציא להם צנצנת המן, אמר להם ראו דבר ה' וכו' בזה נתפרנסו אבותיכם, הרבה שלוחים יש לו למקום להכין מזון ליראיו עכ\"ל, ואפ\"ל הכוונה בזה דוודאי לא הי' כוונת הנביא שלא יעסקו בפרנסתם כלל וירד להם לחם מן השמים, כי לא זכו לזה כ\"א דור המדבר, ולימות המשיח ג\"כ ירד המן לישראל כמבואר בדברי רז\"ל, אמנם איתא בספה\"ק דבפ' המן יש סגולת השפעת פרנסה לכל דורות ישראל, ומהמן שירד לישראל במדבר, נמשך צינור השפעה לכל העוסקים בתורה, וזה נרמז במאמה\"כ למשמרת לדורותיכם, ובזה הוכיח ירמי' הנביא לאנשי דורו שבאו בטענת הצטדקות מהיכן נתפרנס ואיך נניח מלאכתינו ונעסוק בתורה, הוציא להם צנצנת המן ואמר להם ראו דבר ה' וכו' בזה נתפרנסו אבותיכם, ומשם נמשך השפעת פרנסה לכל עוסקי תורה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 232,
      "char_length": 875,
      "timestamp": "2025-02-06T19:33:18.673102"
    },
    {
      "id": "beshalach2_p233",
      "text": "וע\"כ החיוב על כ\"א מישראל אף אם עוסק במו\"מ או במלאכה, צריך לקבוע עיתים לתורה, ותחלת דינו של אדם ליום הדין שואלין לו קבעת עיתים לתורה כאמרז\"ל במסכת שבת (דף ל\"א ע\"א) ואל ידמה בעיניו שבזה מחסר פרנסתו, אבל צריך להאמין שנמשך השפעת פרנסה לעוסקי תורה מפ' המן, וז\"פ הפסוק הנני ממטיר לכם לחם מן השמים וגו' למען אנסנו הילך בתורתי אם לא, והכוונה על הנסיון בעסק התורה, דאלמלי הי' טענת מהיכן נתפרנס צודקת, לא הי' נקרא בשם נסיון כלל, דאין הקב\"ה בא בטרוניא עם בריותיו, אבל לפי שנמשך מירידת המן השפעת פרנסה לכל עוסקי תורה, נדחה טענת מהיכן נתפרנס, וקיים ועומד הנסיון הזה לכל הדורות הילך בתורתי לקבוע עיתים לתורה, ואפשר דמה שכפל הכתוב לפרש דבר והפיכו הילך בתורתי אם לא, ירמוז דאף בדור חלוש שכח התורה בשפלות מאוד, מ\"מ אם הולכין בדרך התורה וקובעים עיתים לתורה כ\"א כפי יכולתו, נמשך לו השפעת פרנסה מהמן, ולז\"א למען אנסנו הילך בתורתי אם לא, ר\"ל בין אם ילכו בתורתי אם לא, עומד וקיים הנסיון הזה ע\"י השפעת פרנסה מירידת המן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 233,
      "char_length": 896,
      "timestamp": "2025-02-06T19:33:19.098270"
    },
    {
      "id": "beshalach2_p234",
      "text": "ובוקר וראיתם את כבוד ה' בשמעו את תלנתיכם על ה' ונחנו מה כי תלונו עלינו, פירש\"י ז\"ל שתרעימו עלינו את הכל את בניכם ונשיכם ובנותיכם וערב רב, ועל כרחי אני זקוק לפרש תלינו בלשון תפעילו, מפני דגשותו וקרייתו, שאלו הי' רפה הייתי מפרשו בלשון תפעלו, כמו וילן העם על משה, או אם הי' דגוש ואין בו יו\"ד ונקרא תלונו, הייתי מפרשו לשון תתלוננו, עכשיו הוא משמע תלינו את אחרים כמו במרגלים וילינו עליו את כל העדה ע\"כ, והנה הגם שפירוש רשיז\"ל מוכרח מלשון הכתוב, שהרי דיבר משה אל הכלל ישראל ולא אל הערב רב, שהם לא ראו את כבוד ה' שהיו חוץ לעננים, וגם המן לא ירד להם ולא אכלו רק מתמצית המן כמבואר בדבריהם ז\"ל, א\"כ בהכרח צ\"ל שמשה רבינו אמר זאת להכלל ישראל שהם המלינים את אחרים, עכ\"ז הענין פליאה נשגבה, דבכ\"מ מצינו להיפוך שהע\"ר הי' תמיד אבן נגף לישראל כמ\"ש בחטא העגל שחת עמך, ופירש\"י הערב רב שקבלת מעצמך הם שחתו והשחיתו, וכן בשאר החטאים הם היו הגורמים ואיך נעשה כאן התהפכות כ\"כ שהכלל ישראל הרעימו את הע\"ר על משה ואהרן וכי היו הע\"ר צריכין לזה, וגם בלא\"ה היו מושחתין ממקורם הרע.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 234,
      "char_length": 949,
      "timestamp": "2025-02-06T19:33:19.532773"
    },
    {
      "id": "beshalach2_p235",
      "text": "ב) גם צ\"ב לשון רש\"י ז\"ל ועל כרחי אני זקוק לפרש וכו', דלמה לו לומר ועל כרחי, ובכל המקומות מזכיר פירוש הפסוק בלבד ולא אמר על כרחי וכו'.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 235,
      "char_length": 133,
      "timestamp": "2025-02-06T19:33:20.029533"
    },
    {
      "id": "beshalach2_p236",
      "text": "ויתבאר בהקדם לפרש מאמה\"כ (בפ' יתרו) וישמע יתרו כהן מדין וגו' את כל אשר עשה אלקים למשה ולישראל עמו כי הוציא ה' את ישראל ממצרים פירש\"י מה שמועה שמע ובא קריעת ים סוף ומלחמת עמלק, ויל\"ד מדוע נקטו רז\"ל הני תרתי דייקא, והרבה נסים נעשו לישראל זולתם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 236,
      "char_length": 242,
      "timestamp": "2025-02-06T19:33:20.137588"
    },
    {
      "id": "beshalach2_p237",
      "text": "ונקדים דברי הגמרא (סוטה דף י\"א ע\"ב) ג' היו באותה עצה (של הבה נתחכמה לו) בלעם ואיוב ויתרו, בלעם שיעץ נהרג, איוב ששתק נידון ביסורין יתרו שברח זכו מבני בניו שישבו בלשכת הגזית, וראוי להתבונן א) מדוע באמת ברח יתרו ויתכן דאלמלא נשאר שם הי' יכול להצטרף עם איוב שהי' צדיק ולהתגבר על עצת בלעם הרשע, ב) קשה על איוב למה שתק על עוולה הנוראה של הבה נתחכמה, דמצינו בפסוקי איוב שנלחם נגד כל עושי עוולה במסנ\"פ, (עיי\"ש סי' כ\"ט) שמונה הכתוב צדקותיו כי אמלט עני משוע ויתום ולא עוזר לו, ואשברה מתלעות עול ומשניו אשליך טרף, ואיך כאן שתק ולא מיחה כלל. ג) צריך להבין סברת פרעה ויועצו מצרים שהיו רשעים בהחלט ורצו לעשות לישראל רעה בכל יכולתם, איך לקחו להם ליועצים יתרו ואיוב שהיו שניהם צדיקים, הגם שאפשר שלא הכירו את יתרו לצדיק אבל איוב הי' מפורסם לאיש תם וישר ירא אלקים שאינו סובל עולה, ולכל היותר יעלה בידם לרצותו שישתוק ולא ימחה נגדם, מה להם לצרה הזאת ליקח יועצים שיהיו צריכים לפעול אצלם שישתקו, הי' יכולים ליקח יועצים שיהיו מדברים כרצונם, ד) קשה למה נענש איוב על ששתק, הלא בלא\"ה לא הי' מועיל מחאתו כיון שנשאר יחידי נגד בלעם ומה הי' יכול לעשות.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 237,
      "char_length": 1022,
      "timestamp": "2025-02-06T19:33:20.293213"
    },
    {
      "id": "beshalach2_p238",
      "text": "אמנם יתבאר הענין בהקדם דברי הרמב\"ן ז\"ל בפסוק הבה נתחכמה לו וזל\"ק: לא ראה פרעה וחכמי יועציו להכותם בחרב, כי תהי' בגידה גדולה להכות חנם העם אשר באו בעצת המלך הראשון וכו', אבל מר שיעשו דרך חכמה, שלא ירגישו ישראל כי באיבה יעשו בהם וכו', והענין שלא רצה לצוות לשרי הטבחים אשר לו להרגם בחרב המלך, או שישליכו אותם ליאור, אבל אמר לעם כאשר ימצא כל איש ילד יהודי ישליך אותו ביאור, ואם יצעק אבי הילד אל המלך או אל שר העיר, יאמרו שיביא עדים ויעשה בו נקמה, וכאשר הותרה רצועת המלך, היו המצריים מחפשים בבתים ומוציאים הילדים משם וכו' עכ\"ל, מבואר כי התחלת הגזירה הי' בדרך התחכמות לחפות על מעשיהם שלא ירגישו ישראל כי באיבה יעשו בהם, גם נמנעו מלהרגם במצות המלך כי יחשב לבגידה גדולה וכו'.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 238,
      "char_length": 667,
      "timestamp": "2025-02-06T19:33:20.793596"
    },
    {
      "id": "beshalach2_p239",
      "text": "ובזה יובן מה שלקחו להם יועצים צדיקים, כי עי\"ז יכלו לחפות על כל מעשיהם הרעים ולתרץ כל רשעתם ולומר הרי צדיקים יושבים במועצת המלכות והסכימו על עצתינו, ומזה שיעכבו על ידם מלגזור גזירות אכזריות לא היו יראים, כי היו בטוחים בכח המלכות שיעלה בידם לגזור ככל העולה על רוחם, וידעו בבירור שלא ימחו היועצים בתוקף כ\"כ ולכל היותר ישתקו ולא ידברו כלל, ועכ\"פ כלפי חוץ יוכלו לתרץ את מעשיהם במה שצדיקים יושבים בעצתם, וע\"כ יתרו שהשיג כוונתם לא רצה לישב במעצתם וברח מהם, שלא רצה לחפות על מעשיהם הרעים, אבל איוב לא השיג את זאת ואולי הי' לו חשבון שמוטב יותר לישב במועצתם ולהציל מה דאפשר, אמנם אעפ\"כ נחשב לו כל הרשעות שעשו המצריים כאילו הוא הי' עושה, ע\"י שישב ביניהם ונתחבר להם וחיפה על מעשיהם, וכמו שכתב רבינו יונה ז\"ל (אבות פ\"א מ\"ז) במשנה אל תתחבר לרשע וז\"ל: שהוא עונש גדול שאין כמותו, כי החטא החמור פשע בו עשה עבירה אחת, אבל זה בכל העבירות שעושה הרשע יש לו חלק בהם, ונמצא עושה חטאים רבים גדולים ועצומים, ואם ידיו אסורים ולא נהנה בהם אוי לרשע ואוי לשכינו וכו' ע\"כ.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 239,
      "char_length": 942,
      "timestamp": "2025-02-06T19:33:21.166865"
    },
    {
      "id": "beshalach2_p240",
      "text": "ואפשר שבאמת הי' איוב לפעמים מוחה על מעשיהם הרעים, ועיקר עונש שלו הי' מפני ישיבתו ביניהם, ומה שאמרו איוב ששתק, הכוונה כי אע\"פ שהי' מוחה לפעמים קצת, במה נחשב הוא. כי רוב פעמים הי' מוכרח לשתוק מיראת המלכות, ואף אם עיתים רחוקות השמיע קולו במחאה חלושה, אין זה נחשב לכלום דבלא\"ה לא היו דבריו נשמעים כלל ונידון כשתיקה, ועיקר החטא הוא מה שישב ביניהם ועל זה הגיע לו עונש הגדול שנדון ביסורים, כי בישיבתו שם נתן חיזוק ואומץ לרשעים לעשות רשעתם מה שלולא זאת לא הי' להם חוצפה גדולה כ\"כ כמבואר בדברי הרמב\"ן ז\"ל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 240,
      "char_length": 496,
      "timestamp": "2025-02-06T19:33:21.713342"
    },
    {
      "id": "beshalach2_p241",
      "text": "ועד\"ז יובן גם ענין התלונה שהיו ישראל מלינים את הערב רב, דבאמת היו תמיד הע\"ר אבן נגף לישראל כנ\"ל, אולם הם בלבדם לא היו בהם כח לפתות את בנ\"י, כי מי מהכשרים ישמע לעצת הערב רב, ורק ע\"י שנמצאו גם מישראל כאלו שהתחברו עמהם עי\"ז קבלו חיזוק ואומץ ופנים של חוצפה להסית את ישראל, נמצא אותם שנתחברו אל הע\"ר הם היו הגורמים אל התלונה, שעל ידם קבלו הע\"ר חיזוק ואומץ, וזולתם לא היו ביכולתם כלל להסית את ישראל, ובפועל היו הערב רב המלינים את ישראל, אבל הכח הי' מבני ישראל מאותם שנתחברו אל הע\"ר, והם היו עיקר המלינים שע\"י התחברותם אל הע\"ר היו מחפים על כל מעשיהם, וז\"ש רשיז\"ל ועל כרחי אני זקוק לפרש כן, דייק בלשני' שלא ניחא לי' לפרש הפסוק כן שהיו ישראל מלינים את הע\"ר, אבל בע\"כ צריך לפרש כן כי האמת כך הי' שאותם בנ\"י שהתחברו אל הע\"ר הם היו עיקר הגורמים אל התלונה, אע\"פ שלמעשה בפועל היו הע\"ר המלינים את ישראל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 241,
      "char_length": 788,
      "timestamp": "2025-02-06T19:33:21.970598"
    },
    {
      "id": "beshalach2_p242",
      "text": "ואפשר שמטעם זה לא זכה יתרו להיות במ\"ת וכמו שהובא בבעה\"ת בפסוק ויהי ממחרת בשם המדרש תנחומא שיתרו לאחר מ\"ת בא, ודורש עליו מקרא זה (משלי י\"ד י') לב יודע מרת נפשו ובשמחתו לא יתערב זר, אמר הקב\"ה בני היו בשעבוד מצרים ויתרו הי' יושב שוקט ובוטח, אינו דין שישמח בשמחת התורה עכ\"ד המדרש, ולדרכינו י\"ל מפני שהי' גם הוא באותו עצה מתחלה כאמרז\"ל, וטרם שברח הי' להמצריים חיזוק על ידי ישיבתו ביניהם, נמצא הי\"ל חלק קצת בשעבוד ישראל, ואף שברח אח\"כ ועשה תשובה מ\"מ לא הי' ראוי לשמוח בשמחתם.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 242,
      "char_length": 469,
      "timestamp": "2025-02-06T19:33:22.394084"
    },
    {
      "id": "beshalach2_p243",
      "text": "ולדרכינו יתבאר דברי רשיז\"ל מה שמועה שמע ובא קריעת ים סוף ומלחמת עמלק עפימ\"ד במד\"ר (ר\"פ יתרו) וישמע יתרו הה\"ד (משלי י\"ט כ\"ה) לץ תכה ופתי נערים וכו' עמלק ויתרו היו בעצה עם פרעה, כשראה יתרו שאבד הקב\"ה את עמלק מן העוה\"ז ומן העוה\"ב, תוהא ועשה תשובה שכן כתיב למעלה כי מחה אמחה את זכר עמלק ואח\"כ וישמע יתרו, אמר אין לי לילך אלא אצל אלקי ישראל עכ\"ד המדרש, הגם שבגמרא הנ\"ל לא נזכר עמלק שהי' בעצת פרעה רק בלעם ואיוב ויתרו, י\"ל שעמלק הי' ממונה על גבייהו ואין לעשות פלוגתא, עכ\"פ מבואר בדברי המדרש שע\"י שראה גודל ענשו של עמלק שנאבד מן העוה\"ז והעוה\"ב, זה הניע את לבו לחזור בתשובה על שישב באותו עצה תחלה והי' להם להמצריים חיזוק מישיבתו ביניהם, ובזה יובן שיטת המדרש בפסוק וישמע יתרו שמלחמת עמלק שמע, והוא הי' הגורם לתשובתו ולבוא להתקרב אל ישראל, וגם מקריעת ים סוף ראה העונש שקבל איוב על ישיבתו במועצת פרעה דאי' במדרש (שמו\"ר פ' כ\"א ס\"ז) משל לרועה שהי' מעביר צאנו בנהר כו' כך בשעה שיצאו ישראל ממצרים עמד ס\"ם לקטרג אותן כו', מה עשה הקב\"ה מסר לו איוב שהי' מיועצי פרעה וכו' עכ\"ד המדרש, ולזה נקט רשיז\"ל שני ענינים אלו שהם היו הגורמים על ביאתו ולעשות תשובה על ישיבתו באותה עצה ומקריעת ים סוף ראה עונשו של איוב וממלחמת עמלק ראה עונשו של עמלק.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 243,
      "char_length": 1118,
      "timestamp": "2025-02-06T19:33:22.637007"
    },
    {
      "id": "beshalach2_p244",
      "text": "באופן אחר יל\"פ בהקדם מה דאיתא בגמרא (ערכין ט\"ו ע\"א) ישראל שבאותו הדור מקטני אמנה היו וכו' מ\"ד וימרו על ים בים סוף, מלמד שהיו ישראל ממרים באותה שעה ואומרים כשם שאנו עולים מצד זה כך מצרים עולים מצד אחר, א\"ל הקב\"ה לשר של ים פלוט אותם ליבשה וכו', וכתבו התוס' יש לתמוה איך היו ישראל באותו הדור כ\"כ מקטני אמנה, שסברו שכך יעשה הקב\"ה נסים למצרים להעבירם מארצם לא\"י, ותירצו שישראל לא עברו הים לרחבו מצד זה לזה, אלא רצועה אחת עברו בים לאורך הים כחצי גורן עגולה וכו' עכ\"ד התוס' ולכאורה אין תירוצם מספיק ועדיין הקושיא במקומה עומדת דהרי עכ\"פ זה עצמו הי' נס גדול, שהמצרים רדפו אחרי ישראל לתוך הים ולא שמו על לבם לחשוב שלא יעמוד כך הים לעולם ואחר שיעברו ישראל יחזור הים לאיתנו, אלא שהקב\"ה חיזק ואימץ את לבבם לרדוף אחריהם לתוך הים נגד השכל, ואיך חשבו ישראל שהקב\"ה יעשה ח\"ו ניסא למגנא, ומה נפ\"מ אם עברו את הים לרחבו ליכנס תיכף לא\"י או לא, בין כך ובין כך נעשו נסים גדולים ואיך יחשבו שהקב\"ה עושה נסים לרשעים ח\"ו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 244,
      "char_length": 893,
      "timestamp": "2025-02-06T19:33:23.180513"
    },
    {
      "id": "beshalach2_p245",
      "text": "ובדרך אגב נתברר לי עפ\"י דברי התוס' הללו ענין קשה, דאיתא במדרש ילקוט (רמז רל\"ג ובתנחומא סי' י') הביאו הרמב\"ם ז\"ל בפי' המשנה (אבות פ\"ה מ\"ד) עשרה נסים נעשו לאבותינו במצרים ועשרה על הים, וא' מהם שנבקע הים לי\"ב גזרים כמנין השבטים, וכל שבט עבר בים בדרך בפ\"ע וזהו שנאמר לגוזר ים סוף לגזרים, ולפי\"ז קשה מה הי' עם הערב רב, ובאיזה מן הדרכים עברו הם את הים, וא\"א לומר שהלכו בא' מן הדרכים של השבטים, דאם הרבה הקב\"ה בנס לעשות י\"ב שבילין שיהי' כל שבט מיוחד בפ\"ע, כש\"כ שלא ניתן להערב רב שיתחבר בדרך אחד עמהם ואיך עברו הם את הים, אמנם לפי דברי התוס' הנ\"ל יתיישב כפשוטו דאה\"נ שהע\"ר לא עברו את הים כלל, שהם לא האמינו בכח הנס שיעמוד הים כך עד שיעברו, והי' להם חשבון שיחזרו למצרים בלית ברירה, רק אחר שעלו ישראל מן הים באותו צד עצמו שירדו נתחברו עוה\"פ הע\"ר לישראל והלכו עמהם במדבר, אבל את הים לא עברו כלל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 245,
      "char_length": 784,
      "timestamp": "2025-02-06T19:33:23.602602"
    },
    {
      "id": "beshalach2_p246",
      "text": "אמנם עדיין צריך ביאור בדברי התוס' להבין החילוק בין אם עברו ישראל את הים לרחבו או שהלכו לאורך הים וכנ\"ל, ונל\"פ עפימ\"ד במדרש ילקוט (רמז רל\"ד) עה\"פ והמים להם חומה, שירד ס\"מ ואמר לפניו רבש\"ע לא עבדו ישראל ע\"ז במצרים ואתה עושה להם נסים וכו', השיב לו הקב\"ה שוטה שבעולם וכי לדעתם עבדוהו והלא לא עבדוהו אלא מתוך שעבוד ומתוך טירוף הדעת ואתה דן שוגג כמזיד ואונס כרצון, וידוע קושית המפורשים הלא אין התנצלות זה מועיל לגבי ע\"ז שהוא ביהרג ואל יעבור ואין טענת אונס מועיל לפטור, ופירשנו בדברנו לעיל דהנה ישראל עשו תשובה שלימה כמבואר במד\"ת (סי' ח') עה\"פ ופרעה הקריב שהקריב את ישראל לתשובה, רק שיש לדון על תשובתם, דעבודה זרה הוא מינות וכל באי' לא ישובין כתיב (משלי ב' י\"ט), וזה שטען הס\"ם מה בין אלו לאלו, דיתכן שגם המצריים עשו אז תשובה, שכך הוא דרכם של רשעים כשנמצאים בעת צרה מהרהרין בתשובה קצת, ולזה טען ממנ\"פ אם מועיל תשובה על עבודה זרה, גם המצריים ינצלו שגם הם עשו תשובה, ואם תשובתם אינה מתקבלת גם לישראל לא תועיל, השיב לו הקב\"ה שוטה שבעולם אתה דן שוגג כמזיד ואונס כרצון, דמה שישראל עבדו ע\"ז הי' מתוך אונס וטירוף הדעת ולא הי' בה צד מינות, אע\"פ שמחוייבים למסור נפשם שלא לעבוד ע\"ז, מ\"מ מועלת תשובתם כיון שלא הי' ע\"י כפירה ומינות, משא\"כ המצריים עבדוהו ברצון נפשם אינו מועיל להם תשובה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 246,
      "char_length": 1166,
      "timestamp": "2025-02-06T19:33:23.988720"
    },
    {
      "id": "beshalach2_p247",
      "text": "ואולי עד\"ז היתה יראתם של ישראל במה שאמרו כשם שאנו עולים מצד זה כך המצריים עולים מצד אחר, דהנה ידעו בעצמם שגם הם עבדו ע\"ז במצרים ואעפ\"כ נעשה להם נסים, ה\"ז מגיד שנתקבלה תשובתם על ע\"ז, והשיגו כמו\"כ שגם המצריים עשו תשובה בעת צרה כזה ודרכו של הקב\"ה לרחם על בריותיו בשעה שעושין תשובה אף דקמי שמיא גליא דאח\"כ יחזרו לסורם כמקדם, מ\"מ הקב\"ה דן את האדם באשר הוא שם וכפי אותה שעה, וכמו שמצינו בננוה שחזרו בתשובה לפי שעה וריחם הקב\"ה עליהם, ע\"כ חששו ישראל שגם המצריים יעלו מן הים ע\"י התשובה שעושין, והי' מקום לחשוב כן, ולא מחמת חסרון אמונה ח\"ו אמרו כן, אלא מצד סברא זו עצמה שהקשה הס\"ם מה בין אלו לאלו, והתירוץ שהשיב לו הקב\"ה לחלק בין אונס כרצון לא השיגו עדיין, ע\"כ חששו גם הם שאין חילוק בין ישראל להמצריים וכמו שהקב\"ה עושה נס לישראל ע\"י שעשו תשובה, כמו\"כ יעשה נס להמצריים ע\"י התשובה שעשו, אלא שבערך דור דיעה דור המדבר נחשב גם מחשבה זו למיעוט אמונה, כי אחר שמרע\"ה צוה להם לילך אין להרהר, וע\"כ קראו אותם חכז\"ל לקטני אמנה.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 247,
      "char_length": 905,
      "timestamp": "2025-02-06T19:33:24.557972"
    },
    {
      "id": "beshalach2_p248",
      "text": "ובזה נבוא לביאור דברי התוס', דהנה מתחלה הי' ס\"ד שעברו ישראל את הים לרחבו מצד זה לצד השני שיבואו תיכף לא\"י, וע\"כ הקשו איך היו ישראל קטני אמנה כ\"כ שסברו שכן יעשה הקב\"ה נסים למצרים להעבירם מארצם \"לא\"י דייקא\", דהגם שמדתו של הקב\"ה שמקבל בתשובה את הרשעים, אף אם תשובתם הוא רק לשעה כל עוד שנמצאים בצרה, מ\"מ נתקבל אצל הקב\"ה מטעמים הכמוסים לפניו ית\"ש, ואולי מטעם ומשלם לשונאיו אל פניו וימצא לפעמים שיקבל הקדוש ברוך הוא תשובת רשעים ולעשות להם נס להצילם, אבל לעשות להם נס כזה להוליכם לא\"י ולהושיבם שם, זה דבר שלא ניתן להעלות על הדעת, ומי שהוא מאמין בהשי\"ת ובתורתו הקדושה אין מציאות שיחשוב כן, שכמה פסוקים מפורשים בתוה\"ק שא\"י אינה סובלת עוברי עבירה ופולטת ומקיאה את הרשעים, ע\"כ א\"א שדור המדבר יחשבו ככה ח\"ו שהקב\"ה יעשה להם למצרים נסים להושיבם בא\"י, וזה שדייק התוס' בלשונם הק' איך היו ישראל באותו הדור קטני אמנה כ\"כ שסברו שכך יעשה הקב\"ה נסים למצרים להעבירם מארצם \"לא\"י דייקא\" שזה הוא עיקר הקושיא, וע\"ז תירצו שלא עברו את הים לרחבו מצד זה אלא הלכו לאורך הים כחצי גורן עגולה וחזרו לאותו מקום עצמו במדבר באותו צד שירדו ולא נכנסו תיכף לא\"י, וע\"כ הי' להם מקום לחשוש שמא יעשה הקב\"ה נסים גם למצרים ע\"י שהרהרו בתשובה באותה שעה שכך הוא מדותיו של הקב\"ה לקבל גם תשובה כזאת וכנ\"ל, אלא שלפי גודל ערכם של דור המדבר נחשב גם זאת לקטנות אמונה וכנ\"ל.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 248,
      "char_length": 1218,
      "timestamp": "2025-02-06T19:33:24.998686"
    },
    {
      "id": "beshalach2_p249",
      "text": "היוצא לנו מזה שגם המצריים עשו תשובה בעת קריעת ים סוף אלא שלא נתקבלה תשובתם כלל ונאבדו, ובאמת תשובה אינה מועלת רק לישראל ולא לאוה\"ע, ואפשר שמטעם זה הי' יתרו מיצר ודואג על איבוד מצרים, כי ידע שגם הם עשו תשובה ומדוע לא נתקבלה תשובתם, שלא הבין עדיין מדוע אינו מועיל גם להם תשובה, אבל מקרי\"ס השיג שאין מועיל תשובה רק לישראל, ולזה נשא לבו לבוא דוקא אל המדבר ולהתגייר, ולא סגי שיעשה תשובה בביתו על מה שישב בין יועצי פרעה, וזה הי' סברת המדרש בפ' וישמע יתרו מה שמועה שמע \"ובא\" דייקא, קריעת ים סוף שמע, שמשם השיג שאין מועיל תשובה רק לישראל והוא שהניע אותו להתקרב לישראל, ושם יעשה תשובה על העבר והבן.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 249,
      "char_length": 589,
      "timestamp": "2025-02-06T19:33:25.560432"
    },
    {
      "id": "beshalach2_p250",
      "text": "ויאמר אליו משה כצאתי את העיר אפרוש את כפי וגו' ואתה ועבדיך ידעתי כי טרם תיראון מפני ד' אלקים, יל\"פ הסמיכות עפימ\"ד במד\"ר (הובא ברשיז\"ל) כצאתי את העיר אבל בתוך העיר לא התפלל לפי שהיתה מלאה גלולים, וכתבו בעה\"ת שגם לשאר תפלות הי' יוצא מן העיר ומזה אנו למדין לכל השאר וכ\"כ הרמב\"ן ז\"ל, אמנם במכה זו הודה והתודה פרעה ואמר חטאתי הפעם ד' הצדיק וגו' העתירו אל ד' ורב מהיות קולות אלקים, ובזה הודה בשם הוי' ב\"ה ובשם אלקים (עיין אבן עזרא) מה שלא הודה עד עכשיו בשניהם (עיין בדברי המפרשים ובדברנו לעיל), ומעתה הי' מקום לחשוב שבהודאה זו ביטל גלולי מצרים והע\"ז שלהם, ששורשה הי' בטעות ב' רשויות שהפועל הרע אינו פועל הטוב, ועכשיו ביטל דיעה זו הנפסדת ולפי\"ז אין צורך לצאת מן העיר לתפלה לטעם הרחקת הע\"ז, ע\"כ א\"ל משרע\"ה ואתה ועבדיך ידעתי כי טרם תיראון מפני ד' אלקים, וכפרש\"י ז\"ל עדיין לא תיראון, והודאה והחרטה אינו אלא מיראת העונש ואחר סור המכה תשובו ותמרו את פי ד', ואין בזה ביטול ע\"ז ובהכרח יצא להתפלל חוץ לעיר מפני הרחקת ע\"ז. השמטה לפרשת בא",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 250,
      "char_length": 921,
      "timestamp": "2025-02-06T19:33:25.873609"
    },
    {
      "id": "beshalach2_p251",
      "text": "ועברתי באמ\"צ וגו' והכיתי כל בכור וגו', דרשו רז\"ל בספרי ובהגדש\"פ ועברתי בארץ מצרים אני ולא מלאך, והכיתי כל בכור וגו' אני ולא שרף, ובכל אלהי מצרים אעשה שפטים אני ולא השליח, יל\"ד מה צורך לכפול כל הני מיעוטי, לשלול מלאך שרף ושליח, ויספיק שיאמר הכתוב בפירוש שכל אלה נעשה ע\"י הבוית\"ש בכבודו ובעצמו כביכול, וא\"צ לפרוט מיעוטין כי כבר נתמעטו כולם, ואפ\"ל עפימ\"ש המפרשים ז\"ל להסביר הטעם דאין מלאך א' עושה שתי שליחות, כדי להראות דהרבה שלוחים למקום ואינו מחוסר עבדים, והנה ביציאת מצרים הי' רצון הבוית\"ש לעשות כל אלו הפעולות בכבודו ובעצמו ית' לא ע\"י שליח, וכדי שלא יהי' נראה כמחוסר עבדים ח\"ו, על כן לקח כביכול ית' עמו חיל גדול של מלאכים שרפים וכו', ואעפ\"כ לא נעשה דבר כ\"א ע\"י הבוית\"ש בכבודו ובעצמו, וז\"פ ולא יתן המשחית לבוא אל בתיכם וגו', כי באמת היו שם משחיתים, אלא שלא ניתן להם רשות לעשות דבר, ולזה דרשו רז\"ל מיתור הכתוב אני ולא מלאך וכו' ולא שרף ולא השליח, להודיע שכל אלה היו שם, שאין חוסר עבדים לפניו ית\"ש, אלא שלחיבתן של ישראל עשה הכל בכבודו ובעצמו.",
      "source_file": "Beshalach2.txt",
      "chumash": "שמות",
      "parsha": "beshalach2",
      "paragraph_index": 251,
      "char_length": 940,
      "timestamp": "2025-02-06T19:33:26.364990"
    }
  ],
  "shape": [
    252,
    768
  ],
  "created_at": "2025-02-06T19:33:26.826559"
}